Процедура УдалитьВсе(Реализация) Экспорт  
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПереоценкаЗапасов_СД.Ссылка
	                      |ИЗ
	                      |	Документ.ПереоценкаЗапасов_СД КАК ПереоценкаЗапасов_СД
	                      |ГДЕ
	                      |	ПереоценкаЗапасов_СД.БП_Основание = &БП_Основание
	                      |	И НЕ ПереоценкаЗапасов_СД.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("БП_Основание",Реализация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Попытка
			ДокПереоценка = Выборка.Ссылка.ПолучитьОбъект();
			//ДокПереоценка.ПометкаУдаления = Истина; 
			//ДокПереоценка.Комментарий = "#Відмінений автоматично! " + ДокПереоценка.Комментарий;
			//ДокПереоценка.Записать(РежимЗаписиДокумента.ОтменаПроведения);    
			
			Если ДокПереоценка.Проведен Тогда
				ДокПереоценка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			
			// потом удалить физически
			ДокПереоценка.Удалить();
		Исключение
			
		КонецПопытки;
	КонецЦикла;

	
КонецПроцедуры
