Перем мВалютаРегламентированногоУчета Экспорт;

Процедура ЗаполнитьОстатками() Экспорт 
	Товары.Очистить();
	ОстаткиПартии.Очистить();
	ЗапросОст = новый запрос;
	ЗапросОст.Текст = "ВЫБРАТЬ
	                  |	ВложенныйЗапрос.Номенклатура,
	                  |	ВложенныйЗапрос.Склад,
	                  |	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	                  |	ВложенныйЗапрос.СерияНоменклатуры,
	                  |	ВложенныйЗапрос.ДокументОприходования,
	                  |	ВложенныйЗапрос.СтатусПартии,
	                  |	ВложенныйЗапрос.Заказ,
	                  |	ВложенныйЗапрос.Качество,
	                  |	ВложенныйЗапрос.КоличествоОстаток КАК Количество,
	                  |	ВложенныйЗапрос.СтоимостьОстаток КАК Стоимость,
	                  |	ЕСТЬNULL(НоменклатураПоставщикаОстатки_СДСрезПоследних.ЦенаЗакупки, 0) КАК ЦенаПартииНовая,
	                  |	ВложенныйЗапрос.КоличествоОстаток * ЕСТЬNULL(НоменклатураПоставщикаОстатки_СДСрезПоследних.ЦенаЗакупки, 0) КАК СтоимостьНовая,
	                  |	ВложенныйЗапрос.КоличествоОстаток * ЕСТЬNULL(НоменклатураПоставщикаОстатки_СДСрезПоследних.ЦенаЗакупки, 0) - ВложенныйЗапрос.СтоимостьОстаток КАК СтоимостьОтличие
	                  |ИЗ
	                  |	(ВЫБРАТЬ
	                  |		ПартииТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
	                  |		ПартииТоваровНаСкладахОстатки.Склад КАК Склад,
	                  |		ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                  |		ПартииТоваровНаСкладахОстатки.СерияНоменклатуры КАК СерияНоменклатуры,
	                  |		ПартииТоваровНаСкладахОстатки.ДокументОприходования КАК ДокументОприходования,
	                  |		ПартииТоваровНаСкладахОстатки.СтатусПартии КАК СтатусПартии,
	                  |		ПартииТоваровНаСкладахОстатки.Заказ КАК Заказ,
	                  |		ПартииТоваровНаСкладахОстатки.Качество КАК Качество,
	                  |		СУММА(ПартииТоваровНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	                  |		СУММА(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток) КАК СтоимостьОстаток
	                  |	ИЗ
	                  |		РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	                  |				&ДатаОст,
	                  |				ДокументОприходования.Контрагент = &Контрагент
	                  |					И ДокументОприходования.ДоговорКонтрагента = &ДоговорКонтрагента) КАК ПартииТоваровНаСкладахОстатки
	                  |	
	                  |	СГРУППИРОВАТЬ ПО
	                  |		ПартииТоваровНаСкладахОстатки.Заказ,
	                  |		ПартииТоваровНаСкладахОстатки.Склад,
	                  |		ПартииТоваровНаСкладахОстатки.Номенклатура,
	                  |		ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры,
	                  |		ПартииТоваровНаСкладахОстатки.Качество,
	                  |		ПартииТоваровНаСкладахОстатки.СерияНоменклатуры,
	                  |		ПартииТоваровНаСкладахОстатки.СтатусПартии,
	                  |		ПартииТоваровНаСкладахОстатки.ДокументОприходования) КАК ВложенныйЗапрос
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПоставщикаОстатки_СД.СрезПоследних(&ДатаОст, НоменклатураПоставщика.Владелец = &Контрагент) КАК НоменклатураПоставщикаОстатки_СДСрезПоследних
	                  |		ПО ВложенныйЗапрос.Номенклатура = НоменклатураПоставщикаОстатки_СДСрезПоследних.НоменклатураПоставщика.Номенклатура
	                  |ГДЕ
	                  |	ВложенныйЗапрос.КоличествоОстаток > 0
	                  |	И ЕСТЬNULL(НоменклатураПоставщикаОстатки_СДСрезПоследних.ЦенаЗакупки, 0) <> 0
	                  |	И ВложенныйЗапрос.КоличествоОстаток * ЕСТЬNULL(НоменклатураПоставщикаОстатки_СДСрезПоследних.ЦенаЗакупки, 0) - ВложенныйЗапрос.СтоимостьОстаток <> 0";
	
	ДатаОст = Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая);
	ЗапросОст.УстановитьПараметр("ДатаОст", ДатаОст);
	ЗапросОст.УстановитьПараметр("Контрагент", Контрагент);
	ЗапросОст.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	РезОст = ЗапросОст.Выполнить().Выгрузить();
	
	ТабСвернуто = РезОст.Скопировать();
	ТабСвернуто.Свернуть("Номенклатура,ЦенаПартииНовая");
	для Каждого СтрСв из ТабСвернуто Цикл 
		 НовСтрТ = Товары.Добавить();
		 ЗаполнитьЗначенияСвойств(НовСтрТ, СтрСв);
	КонецЦикла;	
	для Каждого СтрРез из РезОст Цикл 
		 НовСтр = ОстаткиПартии.Добавить();
		 ЗаполнитьЗначенияСвойств(НовСтр, СтрРез);
	КонецЦикла;	
	
КонецПроцедуры	

Процедура АлгоритРаспределенияКэхэна(МассивЗначений, СуммаЗаказа, СуммаКомиссии)
	ОбработаноЗаписейНакопительно = 0;
	РаспределеноЗаписейНакопительно = 0;
	КоэфРаспределения = СуммаКомиссии/СуммаЗаказа;
	Для каждого ЭлементМассива ИЗ  МассивЗначений Цикл
		СуммаРаспределения = ОКР((ЭлементМассива+ОбработаноЗаписейНакопительно)*КоэфРаспределения-РаспределеноЗаписейНакопительно,2);	
		ОбработаноЗаписейНакопительно = ОбработаноЗаписейНакопительно+ЭлементМассива;
		РаспределеноЗаписейНакопительно = РаспределеноЗаписейНакопительно+ СуммаРаспределения;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьОстаткамиПоТекущейНоменклатуре(СтрокаТабличнойЧасти, Очищать  = Истина) Экспорт 
	
	
	//Товары.Очистить();
	//с.д. Рижий 2023-08-22 (
	Если Очищать = Истина тогда
		ОстаткиПартии.Очистить();
	Конецесли;	
    //с.д. Рижий 2023-08-22 )
	ЗапросОст = новый запрос;
	ЗапросОст.Текст = "ВЫБРАТЬ
	                  |	ВложенныйЗапрос.Номенклатура,
	                  |	ВложенныйЗапрос.Склад,
	                  |	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	                  |	ВложенныйЗапрос.СерияНоменклатуры,
	                  |	ВложенныйЗапрос.ДокументОприходования,
	                  |	ВложенныйЗапрос.СтатусПартии,
	                  |	ВложенныйЗапрос.Заказ,
	                  |	ВложенныйЗапрос.Качество,
	                  |	ВложенныйЗапрос.КоличествоОстаток КАК Количество,
	                  |	ВложенныйЗапрос.СтоимостьОстаток КАК Стоимость,
	                  |	&ЦенаПартииНовая КАК ЦенаПартииНовая,
	                  |	ВложенныйЗапрос.КоличествоОстаток * &ЦенаПартииНовая КАК СтоимостьНовая,
	                  |	ВложенныйЗапрос.КоличествоОстаток * &ЦенаПартииНовая - ВложенныйЗапрос.СтоимостьОстаток КАК СтоимостьОтличие
	                  |ИЗ
	                  |	(ВЫБРАТЬ
	                  |		ПартииТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
	                  |		ПартииТоваровНаСкладахОстатки.Склад КАК Склад,
	                  |		ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                  |		ПартииТоваровНаСкладахОстатки.СерияНоменклатуры КАК СерияНоменклатуры,
	                  |		ПартииТоваровНаСкладахОстатки.ДокументОприходования КАК ДокументОприходования,
	                  |		ПартииТоваровНаСкладахОстатки.СтатусПартии КАК СтатусПартии,
	                  |		ПартииТоваровНаСкладахОстатки.Заказ КАК Заказ,
	                  |		ПартииТоваровНаСкладахОстатки.Качество КАК Качество,
	                  |		СУММА(ПартииТоваровНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	                  |		СУММА(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток) КАК СтоимостьОстаток
	                  |	ИЗ
	                  |		РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	                  |				&ДатаОст,
	                  |				ДокументОприходования.Контрагент = &Контрагент
	                  |					И ДокументОприходования.ДоговорКонтрагента = &ДоговорКонтрагента
	                  |					И Номенклатура = &Номенклатура) КАК ПартииТоваровНаСкладахОстатки
	                  |	
	                  |	СГРУППИРОВАТЬ ПО
	                  |		ПартииТоваровНаСкладахОстатки.Заказ,
	                  |		ПартииТоваровНаСкладахОстатки.Склад,
	                  |		ПартииТоваровНаСкладахОстатки.Номенклатура,
	                  |		ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры,
	                  |		ПартииТоваровНаСкладахОстатки.Качество,
	                  |		ПартииТоваровНаСкладахОстатки.СерияНоменклатуры,
	                  |		ПартииТоваровНаСкладахОстатки.СтатусПартии,
	                  |		ПартииТоваровНаСкладахОстатки.ДокументОприходования) КАК ВложенныйЗапрос
	                  |ГДЕ
	                  |	ВложенныйЗапрос.КоличествоОстаток > 0
	                  |	И &ЦенаПартииНовая <> 0
	                  |	И ВложенныйЗапрос.КоличествоОстаток * &ЦенаПартииНовая - ВложенныйЗапрос.СтоимостьОстаток <> 0";
	
	
	//с.д. Рижий 2023-08-22 (   
	//	ДатаОст = Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая);
	Если ЗначениеЗаполнено(Ссылка) тогда
		ДатаОст = Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая);
	Иначе
		ДатаОст  = ТекущаяДата();
	КонецЕсли;	
		//с.д. Рижий 2023-08-22 )
	ЗапросОст.УстановитьПараметр("ДатаОст", ДатаОст);
	ЗапросОст.УстановитьПараметр("Контрагент", Контрагент);
	ЗапросОст.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	ЗапросОст.УстановитьПараметр("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	ЗапросОст.УстановитьПараметр("ЦенаПартииНовая", СтрокаТабличнойЧасти.ЦенаПартииНовая);
	РезОст = ЗапросОст.Выполнить().Выгрузить();
	
	//ТабСвернуто = РезОст.Скопировать();
	//ТабСвернуто.Свернуть("Номенклатура,ЦенаПартииНовая");
	//для Каждого СтрСв из ТабСвернуто Цикл 
	//	 НовСтрТ = Товары.Добавить();
	//	 ЗаполнитьЗначенияСвойств(НовСтрТ, СтрСв);
	//КонецЦикла;	
	для Каждого СтрРез из РезОст Цикл 
		 НовСтр = ОстаткиПартии.Добавить();
		 ЗаполнитьЗначенияСвойств(НовСтр, СтрРез);
	 КонецЦикла;	
	 
КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не Отказ Тогда
		// ТОВАРЫ ПО РЕГИСТРУ ПартииТоваровНаСкладах.
		
		НаборДвижений = Движения.ПартииТоваровНаСкладах;
		// Заполним таблицу движений.
		НаборДвижений.Записывать = Истина;
		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ОстаткиПартии, ТаблицаДвижений);
		ТаблицаДвижений.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
		
		ОстаткиПартии_Новые = ОстаткиПартии.Выгрузить();
		ОстаткиПартии_Новые.Колонки.Удалить("Стоимость");
		ОстаткиПартии_Новые.Колонки.СтоимостьНовая.Имя = "Стоимость";
		
		//Проводки с новой Стоимостью
		ТаблицаДвижений_приход = НаборДвижений.ВыгрузитьКолонки();
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ОстаткиПартии_Новые, ТаблицаДвижений_приход);
		ТаблицаДвижений_приход.ЗаполнитьЗначения(ВидДвиженияНакопления.Приход, "ВидДвижения");
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаДвижений_приход, ТаблицаДвижений);
		ТаблицаДвижений.ЗаполнитьЗначения(Дата, "Период");
		ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
		//НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		Если Не Отказ Тогда
			Движения.ПартииТоваровНаСкладах.ВыполнитьДвижения();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры



















мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
