Функция ПолучитьРеализации(ЗаказПокупателя, Номенклатура) Экспорт 
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура); 
	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);

	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.ЗаказПокупателя = &ЗаказПокупателя
	               |	И РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура
	               |	И РеализацияТоваровУслугТовары.Ссылка.Проведен";  
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
КонецФункции	

Функция ПолучитьНомерСтрокиТовара(Номенклатура, Номер, Количество) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура); 
	Запрос.УстановитьПараметр("Номер",Номер);
	Запрос.УстановитьПараметр("Количество",Количество);
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.НомерСтроки
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура
	               |	И РеализацияТоваровУслугТовары.Количество = &Количество
	               |	И РеализацияТоваровУслугТовары.Ссылка.Сделка.Номер = &Номер";
	Выборка  = Запрос.Выполнить().Выбрать(); 
	
	
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.НомерСтроки;	
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции