Процедура Создать(Наименование, Описание, Основание = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗадачиПользователя.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	|ГДЕ
	|	НЕ ЗадачиПользователя.Выполнена
	|	И ЗадачиПользователя.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Основание);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Задача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
	Задача.Наименование = Наименование;
	
	Если ЗначениеЗаполнено(Основание.Ответственный) Тогда
		Задача.Исполнитель = Основание.Ответственный;
	КонецЕсли;
	
	Задача.Дата = НачалоДня(ТекущаяДата()) + 32400;
	Задача.Оповещение = Истина;
	Задача.Описание = Описание;
	Задача.СрокОповещения = Задача.Дата;
	Задача.СрокИсполнения = Задача.Дата;
	Задача.Объект = Основание; 
	Задача.Записать();
	
КонецПроцедуры