
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемТовараНаХранение") Тогда
		Комментарий = ДанныеЗаполнения.Комментарий;
		//СкладХранения = ДанныеЗаполнения.СкладХранения;
		СкладОтправитель = ДанныеЗаполнения.СкладХранения;
		ДокументХранения = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЗалоговаяСтоимость = ТекСтрокаТовары.ЗалоговаяСтоимость;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Комментарий = ТекСтрокаТовары.Комментарий;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ОстатокПротэктора = ТекСтрокаТовары.ОстатокПротэктора;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЗначениеЗаполнено(ДокументХранения) Тогда
		   Если ДокументХранения.ДатаПеремещения < Дата Тогда
		   	Д = ДокументХранения.ПолучитьОбъект();
			Д.СкладХранения = СкладХранения;
			Д.ДатаПеремещения = Дата;
			Д.Записать();
		   КонецЕсли; 
	   КонецЕслИ;
	   
	   
	Движения.ХранениеТовара.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ХранениеТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = СкладОтправитель;
		Движение.Контрагент = ДокументХранения.Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ДокументХранения = ДокументХранения;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
		Движение = Движения.ХранениеТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = СкладХранения;
		Движение.Контрагент = ДокументХранения.Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ДокументХранения = ДокументХранения;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
	КонецЦикла;
	   
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Заказ = ДокументХранения.Сделка;
КонецПроцедуры
