
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для Каждого Строка Из Платежи Цикл
		Если Строка.Оплата = 0 Тогда
			Продолжить;
		КонецЕсли;
		если Строка.Оплата > 0 Тогда
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ДоговорКонтрагента = Строка.Документ.ДоговорКонтрагента;
		Движение.Контрагент = Строка.Контрагент;
		Движение.Организация = Строка.Документ.Организация;
		Движение.Период = Дата;
		Движение.Сделка = Строка.Документ.Сделка;
		Движение.СуммаВзаиморасчетов = Строка.Оплата;
		Движение.СуммаУпр = Строка.Оплата;
		

		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.БанковскийСчетКасса = Касса;
		Движение.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Наличные;
		Движение.ДоговорКонтрагента = Строка.Документ.ДоговорКонтрагента;
		Движение.ДокументДвижения = Ссылка;
		Движение.ДокументРасчетовСКонтрагентом = Строка.Документ;
		Движение.Контрагент = Строка.Контрагент;
		Движение.Организация = Строка.Документ.Организация;
		Движение.Период = Дата;
		Движение.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Приход;
		ДВижение.Сделка = Строка.Документ.Сделка;
		Движение.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя;
		Движение.Сумма = Строка.Оплата;
		Движение.СуммаУпр = строка.Оплата;
		
		Движение = Движения.ДенежныеСредства.Добавить();
		Движение.БанковскийСчетКасса = Касса;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВидДенежныхСредств =Перечисления.ВидыДенежныхСредств.Наличные;
		Движение.Организация = Строка.Документ.Организация;
		Движение.Период = Дата;
		Движение.Сумма = Строка.Оплата;
		Движение.СуммаУпр = Строка.Оплата;
	Иначе
			Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.приход;
		Движение.ДоговорКонтрагента = Строка.Документ.ДоговорКонтрагента;
		Движение.Контрагент = Строка.Контрагент;
		Движение.Организация = Строка.Документ.Организация;
		Движение.Период = Дата;
		Движение.Сделка = Строка.Документ.Сделка;
		Движение.СуммаВзаиморасчетов = -1*Строка.Оплата;
		Движение.СуммаУпр = -1*Строка.Оплата;
		

		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.БанковскийСчетКасса = Касса;
		Движение.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Наличные;
		Движение.ДоговорКонтрагента = Строка.Документ.ДоговорКонтрагента;
		Движение.ДокументДвижения = Ссылка;
		Движение.ДокументРасчетовСКонтрагентом = Строка.Документ;
		Движение.Контрагент = Строка.Контрагент;
		Движение.Организация = Строка.Документ.Организация;
		Движение.Период = Дата;
		Движение.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Расход;
		ДВижение.Сделка = Строка.Документ.Сделка;
		Движение.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя;
		Движение.Сумма = -1*Строка.Оплата;
		Движение.СуммаУпр = -1*строка.Оплата;
		
		Движение = Движения.ДенежныеСредства.Добавить();
		Движение.БанковскийСчетКасса = Касса;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.ВидДенежныхСредств =Перечисления.ВидыДенежныхСредств.Наличные;
		Движение.Организация = Строка.Документ.Организация;
		Движение.Период = Дата;
		Движение.Сумма = -1*Строка.Оплата;
		Движение.СуммаУпр = -1*Строка.Оплата;
	
		КонецЕслИ;
	КонецЦикла;
	
	Движения.ВзаиморасчетыСКонтрагентами.Записать();
	Движения.ДвиженияДенежныхСредств.Записать();
	Движения.ДенежныеСредства.Записать();
КонецПроцедуры


Процедура ПередУстановкойПометкиУдаления(Отказ)
	Сообщить("1");
КонецПроцедуры