
Процедура ПриКопировании(ОбъектКопирования)
	
	Если ТипЗнч(ОбъектКопирования) <> ТипЗнч(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого Набор Из ОбъектКопирования.Движения Цикл
		
		Набор.Прочитать();
		Если Набор.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НаборТекущегоОбъекта = Движения[Набор.Метаданные().Имя];
		
		Для каждого ЗаписьНабора Из Набор Цикл
			НоваяЗапись = НаборТекущегоОбъекта.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьНабора);
			Если не Метаданные.РегистрыСведений.Содержит( Набор.Метаданные() )
			или (Метаданные.РегистрыСведений.Содержит( Набор.Метаданные() )
				и Набор.Метаданные().ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический
			) Тогда
				НоваяЗапись.Период = ТекущаяДата();
			КонецЕсли;	
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры

