#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.ИмяРегистра = "";
	УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Э_Лиды.Ссылка КАК Лид,
		               |	Э_Лиды.Родитель КАК ГруппаЛида,
		               |	Э_Лиды.ОтветсвенныйМенеджер КАК Пользователь,
		               |	Э_Лиды.Э_ДатаРегистрации КАК ДатаРегистрации,
		               |	Э_Лиды.Контрагент,
		               |	Э_Лиды.КонтактноеЛицо,
		               |	Э_Лиды.НомерТелефона,
		               |	Э_Лиды.Адрес,
		               |	Э_Лиды.EMAIL,
		               |	ВЫРАЗИТЬ(Э_Лиды.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
		               |	Э_Лиды.Закрыт,
		               |	0 КАК КоличествоЛидов,
		               |	ВЫБОР
		               |		КОГДА Э_Лиды.Э_ДатаРегистрации > &ДатаНачала
		               |				И Э_Лиды.Э_ДатаРегистрации < &ДатаКонца
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Новые,
		               |	ВЫБОР
		               |		КОГДА Э_Лиды.Э_ДатаПереходаВКлиента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК ПерешлиВКлиентов,
		               |	СобытияПоЛиду.КоличествоСобытий КАК КоличествоСобытий
		               |{ВЫБРАТЬ
		               |	Лид.*,
		               |	ГруппаЛида.*,
		               |	Пользователь.*,
		               |	ДатаРегистрации,
		               |	Контрагент.*,
		               |	КонтактноеЛицо.*,
		               |	НомерТелефона,
		               |	Адрес,
		               |	EMAIL,
		               |	Комментарий,
		               |	Закрыт,
		               |	КоличествоЛидов КАК КоличествоЛидов,
		               |	(ВЫБОР
		               |			КОГДА Э_Лиды.Э_ДатаРегистрации > &ДатаНачала
		               |					И Э_Лиды.Э_ДатаРегистрации < &ДатаКонца
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Новые,
		               |	(ВЫБОР
		               |			КОГДА Э_Лиды.Э_ДатаПереходаВКлиента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ПерешлиВКлиентов,
		               |	СобытияПоЛиду.КоличествоСобытий КАК КоличествоСобытий}
		               |ИЗ
		               |	Справочник.Э_Лиды КАК Э_Лиды
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			Событие.Э_Лид КАК Э_Лид,
		               |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Событие.Ссылка) КАК КоличествоСобытий
		               |		ИЗ
		               |			Документ.Событие КАК Событие
		               |		ГДЕ
		               |			НЕ Событие.ПометкаУдаления
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			Событие.Э_Лид) КАК СобытияПоЛиду
		               |		ПО (СобытияПоЛиду.Э_Лид = Э_Лиды.Ссылка)
		               |ГДЕ
		               |	Э_Лиды.ЭтоГруппа = ЛОЖЬ
		               |	И Э_Лиды.Э_ДатаРегистрации МЕЖДУ &ДатаНачала И &ДатаКонца
		               |{ГДЕ
		               |	СобытияПоЛиду.КоличествоСобытий,
		               |	Э_Лиды.Родитель.* КАК ГруппаЛида,
		               |	Э_Лиды.ОтветсвенныйМенеджер.* КАК Пользователь,
		               |	Э_Лиды.Контрагент.*,
		               |	Э_Лиды.КонтактноеЛицо.*,
		               |	Э_Лиды.Закрыт,
		               |	Э_Лиды.Ссылка.* КАК Лид,
		               |	Э_Лиды.НомерТелефона,
		               |	Э_Лиды.Адрес,
		               |	Э_Лиды.EMAIL,
		               |	(ВЫРАЗИТЬ(Э_Лиды.Комментарий КАК СТРОКА(1000))) КАК Комментарий}
		               |{УПОРЯДОЧИТЬ ПО
		               |	Пользователь.*,
		               |	ГруппаЛида.*,
		               |	Лид.*}
		               |ИТОГИ
		               |	КОЛИЧЕСТВО(КоличествоЛидов),
		               |	СУММА(Новые),
		               |	СУММА(ПерешлиВКлиентов)
		               |ПО
		               |	ОБЩИЕ
		               |{ИТОГИ ПО
		               |	Пользователь.*,
		               |	ГруппаЛида.*,
		               |	Лид.*,
		               |	ДатаРегистрации,
		               |	Контрагент.*,
		               |	КонтактноеЛицо.*}
		               |АВТОУПОРЯДОЧИВАНИЕ";
	
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Лид",         		"Лид");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ГруппаЛида",         "Группа лидов");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Пользователь",   	"Пользователь");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаРегистрации",    "Дата регистрации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Контрагент",    		"Контрагент");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "КонтактноеЛицо",    	"Контактное лицо");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "НомерТелефона",      "Номер телефона");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Адрес",      		"Адрес");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "EMAIL",      		"E-MAIL");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Комментарий",      	"Комментарий");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Закрыт",      		"Закрыт");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "КоличествоЛидов",	"Количество лидов");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Новые",				"Новые");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПерешлиВКлиентов",	"Перешли в клиентов");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "КоличествоСобытий",	"Количество событий по лиду");
		
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЛидов", "Количество лидов", Истина, "ЧЦ=15; ЧДЦ=; ЧН=' '");

	УниверсальныйОтчет.ДобавитьПоказатель("Новые", "Новые", Истина, "ЧЦ=15; ЧДЦ=; ЧН=' '");
	УниверсальныйОтчет.ДобавитьПоказатель("ПерешлиВКлиентов", "Перешли в клиентов", Истина, "ЧЦ=15; ЧДЦ=; ЧН=' '");
	
	
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Пользователь");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ГруппаЛида");
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("Лид", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("НомерТелефона", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("Контрагент", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("КонтактноеЛицо", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("Адрес", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("EMAIL", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("Комментарий", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
 		
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("КоличествоСобытий",	ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	
	УниверсальныйОтчет.ДобавитьПорядок("Пользователь");
		
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ДатаНачала", УниверсальныйОтчет.ДатаНач);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ДатаКонца", УниверсальныйОтчет.ДатаКон);
		
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);
	ТабличныйДокумент.ФиксацияСлева = 2;
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры 

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры 

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции 

УниверсальныйОтчет.мРежимВводаПериода = 0;


#КонецЕсли
