//FOFA Внимательно
Перем мУдалятьДвижения;

Перем мВалютаРегламентированногоУчета Экспорт;
Перем мВалютаУправленческогоУчета Экспорт;
Перем мИспользоватьХарактеристики Экспорт;
Перем мКнопкиЗаполненияТЧ,Сумма1,Наценка,Сумма2,ТЦ,ЦенаПрайса,Маржа,РезНаценки1,СкладНаличия;
Перем РезОстатки1;
Перем РезЦена;
Перем Есть;
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ 

#Если Клиент Тогда

// Функция печатает ценники.
//
Функция ПечатьЦенников()

	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА КАК Печать,
	|	Док.Номенклатура КАК Номенклатура,
	|	Док.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Док.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	0 КАК Цена,
	|	1 КАК Количество
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Товары КАК Док
	|ГДЕ
	|	Док.Ссылка = &Док
	|");

	Запрос.УстановитьПараметр("Док", Ссылка);

	ОбработкаПечатьЦенников = Обработки.ПечатьЦенников.Создать();
	ОбработкаПечатьЦенников.Товары.Загрузить(Запрос.Выполнить().Выгрузить());

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗаполнитьЦены", Истина);

	ФормаПечатьЦенников = ОбработкаПечатьЦенников.ПолучитьФорму("Форма");
	ФормаПечатьЦенников.Параметр = СтруктураПараметров;
	ФормаПечатьЦенников.Открыть();

КонецФункции // ПечатьЦенников()

// Функция формирует табличный документ с печатной формой.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма документа.
//
Функция ПечатьДокумента()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст ="
	|ВЫБРАТЬ
	|	Номер,
	|	Ответственный.ФизЛицо.Наименование КАК ОтветственныйПредставление,
	|	Дата
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	|ГДЕ
	|	УстановкаЦенНоменклатуры.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	(УстановкаЦенНоменклатуры.ИндексСтрокиТаблицыЦен + 1)    КАК НомерСтроки,
	|	УстановкаЦенНоменклатуры.Номенклатура,
	|	УстановкаЦенНоменклатуры.Номенклатура.НаименованиеПолное КАК Товар,
	|	УстановкаЦенНоменклатуры.ХарактеристикаНоменклатуры      КАК Характеристика,
	|	NULL                                                     КАК Серия,
	|	УстановкаЦенНоменклатуры.ТипЦен                          КАК ТипЦен,
	|	УстановкаЦенНоменклатуры.Цена,
	|	УстановкаЦенНоменклатуры.ЕдиницаИзмерения.Представление  КАК ЕдиницаИзмеренияПредставление,
	|	УстановкаЦенНоменклатуры.Валюта,
	|	УстановкаЦенНоменклатуры.Валюта.Представление            КАК ВалютаПредставление,
	|	УстановкаЦенНоменклатуры.ПроцентСкидкиНаценки
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатуры
	|ГДЕ
	|	УстановкаЦенНоменклатуры.Ссылка = &ТекущийДокумент
	|УПОРЯДОЧИТЬ ПО
	|	УстановкаЦенНоменклатуры.ИндексСтрокиТаблицыЦен,
	|	УстановкаЦенНоменклатуры.ТипЦен
	|ИТОГИ
	|ПО УстановкаЦенНоменклатуры.ИндексСтрокиТаблицыЦен
	|";

	ЗапросПоТоварам = Запрос.Выполнить();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УстановкаЦенНоменклатуры_ИзменениеЦен";

	Макет = ПолучитьМакет("ИзменениеЦен");

	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, НСтр("ru='Изменение цен номенклатуры';uk='Зміна цін номенклатури'",КодЯзыкаПечать),КодЯзыкаПечать);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьШапкаНоменклатура   = Макет.ПолучитьОбласть("ШапкаТаблицы|Номенклатура");
	ОбластьШапкаТипЦен         = Макет.ПолучитьОбласть("ШапкаТаблицы|Цена");
	ОбластьСтрокаНоменклатура  = Макет.ПолучитьОбласть("Строка|Номенклатура");
	ОбластьСтрокаТипЦен        = Макет.ПолучитьОбласть("Строка|Цена");
	ОбластьПодвалНоменклатура  = Макет.ПолучитьОбласть("Подписи|Номенклатура");
	ОбластьПодвалТипЦен        = Макет.ПолучитьОбласть("Подписи|Цена");

	// Выведем шапку.
	ТабДокумент.Вывести(ОбластьШапкаНоменклатура);
	ВыборкаПоСтрокам = ЗапросПоТоварам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаПоСтрокам.Следующий() Тогда
		Выборка = ВыборкаПоСтрокам.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбластьШапкаТипЦен.Параметры.Заполнить(Выборка);
			ТабДокумент.Присоединить(ОбластьШапкаТипЦен);
		КонецЦикла;
	КонецЕсли;

	// Выведем таблицу.
	ВыборкаПоСтрокам = ЗапросПоТоварам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСтрокам.Следующий() Цикл
		НоменклатураВыведена = Ложь;
		Выборка = ВыборкаПоСтрокам.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не НоменклатураВыведена Тогда
				ОбластьСтрокаНоменклатура.Параметры.Заполнить(Выборка);
				ОбластьСтрокаНоменклатура.Параметры.Товар = СокрЛП(Выборка.Товар) + ФормированиеПечатныхФорм.ПредставлениеСерий(Выборка);
				ТабДокумент.Вывести(ОбластьСтрокаНоменклатура);
				НоменклатураВыведена = Истина;
			КонецЕсли;
			ОбластьСтрокаТипЦен.Параметры.Заполнить(Выборка);
			ТабДокумент.Присоединить(ОбластьСтрокаТипЦен);
		КонецЦикла;
	КонецЦикла;

	// Выведем подвал.
	ОбластьПодвалНоменклатура.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьПодвалНоменклатура);
	ВыборкаПоСтрокам = ЗапросПоТоварам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаПоСтрокам.Следующий() Тогда
		Выборка = ВыборкаПоСтрокам.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТабДокумент.Присоединить(ОбластьПодвалТипЦен);
		КонецЦикла;
	КонецЕсли;

	ТекОбласть = ТабДокумент.Области.ОтветственныйПредставление;

	ОбластьОтветственного = ТабДокумент.Область(ТекОбласть.Низ, 14, ТекОбласть.Низ, Мин(ТабДокумент.ШиринаТаблицы, 29));
	ОбластьОтветственного.Объединить();
	ОбластьОтветственного.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
	ОбластьОтветственного.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;

	Возврат ТабДокумент;

КонецФункции // ПечатьДокумента()

// Процедура осуществляет печать документа. Можно направить печать на
// экран или принтер, а также распечатать необходмое количество копий.
// Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ИмяМакета = "ПереченьЦен" Тогда
		ТабДокумент = ПечатьДокумента();
	ИначеЕсли ИмяМакета = "Ценники" Тогда
		ТабДокумент = ПечатьЦенников();
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли;
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);

КонецПроцедуры // Печать()

// Возвращает доступные варианты печати документа.
//
// Вовращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	СтруктураМакетов = Новый Структура("ПереченьЦен","Перечень цен");
	СтруктураМакетов.Вставить("Ценники", "Ценники на товары");

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьТаблицуПечатныхФорм()

// Возвращает доступные табличные части для заполнения
//
// Возвращаемое значение:
//   Список значений с именами табличных частей
//
Функция ПолучитьТабличныеЧастиДляЗаполнения() Экспорт

	ТабличныеЧасти = Новый СписокЗначений;
	ТабличныеЧасти.Добавить("ТаблицаЦен", "Таблица цен");
	
	Возврат ТабличныеЧасти;

КонецФункции // ПолучитьТабличныеЧастиДляЗаполнения()

#КонецЕсли


Процедура РасчитатьЦены() Экспорт
		//ТаблицаЦен.Очистить();
	Товары.Очистить();
	
	Если ЗначениеЗаполнено(НоменклатураФильтр) или Не ЗначениеЗаполнено(УстановкаЦенПоставщика) Тогда
		НоменклатураФильтр1 = НоменклатураФильтр;
	Иначе
		СписНом = Новый СписокЗначений;
		ЗапросТоварыПоставщика = Новый Запрос;
		ЗапросТоварыПоставщика.Текст = "ВЫБРАТЬ ПЕРВЫЕ 4
		                               |	УстановкаЦенНоменклатурыКонтрагентов.Ссылка
		                               |ИЗ
		                               |	Документ.УстановкаЦенНоменклатурыКонтрагентов КАК УстановкаЦенНоменклатурыКонтрагентов
		                               |ГДЕ
		                               |	УстановкаЦенНоменклатурыКонтрагентов.Проведен = ИСТИНА
		                               |	И УстановкаЦенНоменклатурыКонтрагентов.Контрагент = &Контрагент
		                               |	И УстановкаЦенНоменклатурыКонтрагентов.ВидНоменклутары = &Вид
		                               |
		                               |СГРУППИРОВАТЬ ПО
		                               |	УстановкаЦенНоменклатурыКонтрагентов.Ссылка
		                               |
		                               |УПОРЯДОЧИТЬ ПО
		                               |	УстановкаЦенНоменклатурыКонтрагентов.Дата УБЫВ";
		ЗапросТоварыПоставщика.УстановитьПараметр("Контрагент",УстановкаЦенПоставщика.Контрагент);
		ЗапросТоварыПоставщика.УстановитьПараметр("Вид",ВидНоменклатуры);
		Рез = ЗапросТоварыПоставщика.Выполнить().Выбрать();
		Пока РЕз.Следующий() Цикл
			Док = Рез.Ссылка;
			Для Каждого Стр из Док.Товары Цикл
			Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			СписНом.Добавить(Стр.Номенклатура);
			КонецЕслИ;
			КонецЦикла;
		КонецЦикла;
		НоменклатураФильтр1 = СписНом;
	КонецЕслИ;
	
	
	//ЗапросТовары = Новый Запрос;
	//ЗапросТовары.Текст = "ВЫБРАТЬ
	//                     |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура КАК Ссылка,
	//                     |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Производитель КАК Производитель,
	//                     |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,
	//                     |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Сезонность Как Сезонность,
	//                     |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ДиаметрДиска Как ДиаметрДиска
	//                     |ИЗ
	//                     |	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	//                     |			,
	//                     |			Регистратор.Дата > &ДатаСтарта
	//                     |				И Номенклатура В ИЕРАРХИИ (&Ном)
	//                     |				И Номенклатура.ВидНоменклатуры = &ВидН
	//                     |				И Цена <> 0) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	//                     |
	//                     |СГРУППИРОВАТЬ ПО
	//                     |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
	//                     |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Производитель,
	//                     |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков
	//                     |
	//                     |УПОРЯДОЧИТЬ ПО
	//                     |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Наименование";
	//
	//ЗапросТовары.УстановитьПараметр("ДатаСтарта",Дата-30*24*60*60);
	//ЗапросТовары.УстановитьПараметр("Ном",НоменклатураФильтр1);
	//ЗапросТовары.УстановитьПараметр("ВидН",ВидНоменклатуры);
	//Номенклатура = ЗапросТовары.Выполнить().Выбрать();
	ЗапросОстатки = Новый Запрос;  //FOFA При открытии остатки
	ЗапросОстатки.Текст = "ВЫБРАТЬ
	                      |	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Резерв,
	                      |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	                      |	ТоварыНаСкладахОстатки.Склад
	                      |ИЗ
	                      |	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(, Номенклатура.ВидНоменклатуры = &ВидН) КАК ТоварыНаСкладахОстатки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Номенклатура.ВидНоменклатуры = &ВидН) КАК ТоварыВРезервеНаСкладахОстатки
	                      |		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	                      |			И ТоварыНаСкладахОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад";
	ЗапросОстатки.УстановитьПараметр("ВидН",ВидНоменклатуры);
	РезОстатки1= ЗапросОстатки.Выполнить().Выгрузить();
	ЗапросЦена = Новый Запрос;
	ЗапросЦена.Текст = "ВЫБРАТЬ
	                   |	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	                   |	ЦеныНоменклатурыСрезПоследних.Валюта,
	                   |	ЦеныНоменклатурыСрезПоследних.Цена,
	                   |	ЦеныНоменклатурыСрезПоследних.ТипЦен
	                   |ИЗ
	                   |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                   |			,
	                   |			Поставщик.ВидСклада = &Склад
	                   |				И Номенклатура.ВидНоменклатуры = &ВидН
	                   |				И Цена > 0
	                   |				И Регистратор.Дата > &ДатаСтарта) КАК ЦеныНоменклатурыСрезПоследних";
	
	//ТЦ = "";
	//Для Каждого строка Из ТипыЦен Цикл
	//	ТЦ = строка.ТипЦен;
	//КонецЦикла;
	ЗапросЦена.УстановитьПараметр("Склад",Перечисления.ВидыСкладов.Оптовый);	
	ЗапросЦена.УстановитьПараметр("ДатаСтарта",Дата-20*24*60*60);
	ЗапросЦена.УстановитьПараметр("ВидН",ВидНоменклатуры);
	РезЦена = ЗапросЦена.Выполнить().Выбрать();				   
	
	ЗапросЦен = Новый Запрос;
	ЗапросЦен.Текст = "ВЫБРАТЬ
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура КАК Номенклатура,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена КАК Цена,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.ЦенаБН КАК ЦенаБН,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.РекОпт КАК РекОпт,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.РекОптБН КАК РекОптБН,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.РекРозница КАК РекРозница,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.РекРозницаБН КАК РекРозницаБН,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Остаток КАК Остаток,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Регистратор.Контрагент КАК Контрагент,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Валюта КАК Валюта,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Регистратор КАК Регистратор,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Цена1,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Производитель КАК Производитель,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Сезонность КАК Сезонность,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ДиаметрДиска КАК ДиаметрДиска,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков
	                  |ИЗ
	                  |	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	                  |			,
	                  |			Регистратор.Дата > &ДатаСтарта
	                  |				И Номенклатура В ИЕРАРХИИ (&Ном)
	                  |				И Номенклатура.ВидНоменклатуры = &ВидН) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	                  |		ПО ЦеныНоменклатурыКонтрагентовСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	Номенклатура,
	                  |	Цена1,
	                  |	Остаток УБЫВ
	                  |ИТОГИ
	                  |	МАКСИМУМ(Цена),
	                  |	МАКСИМУМ(ЦенаБН),
	                  |	МАКСИМУМ(РекОпт),
	                  |	МАКСИМУМ(РекОптБН),
	                  |	МАКСИМУМ(РекРозница),
	                  |	МАКСИМУМ(РекРозницаБН),
	                  |	МАКСИМУМ(Контрагент),
	                  |	МАКСИМУМ(Валюта),
	                  |	МАКСИМУМ(Регистратор),
	                  |	МАКСИМУМ(Производитель),
	                  |	МАКСИМУМ(Сезонность),
	                  |	МАКСИМУМ(ДиаметрДиска),
	                  |	МАКСИМУМ(ЕдиницаХраненияОстатков)
	                  |ПО
	                  |	Номенклатура,
	                  |	Цена1,
	                  |	Остаток";
	
	ЗапросЦен.УстановитьПараметр("ДатаСтарта",Дата-35*24*60*60);
		ЗапросЦен.УстановитьПараметр("Ном",НоменклатураФильтр1);
	ЗапросЦен.УстановитьПараметр("ВидН",ВидНоменклатуры);
	РезЦ1 = ЗапросЦен.Выполнить();
	//Реквизиты наценок
	
	ЗапросНаценки = Новый Запрос;
	ЗапросНаценки.Текст = "ВЫБРАТЬ
	|	ПараметрыРасчетаЦенНоменклатуры.Сумма1,
	|	ПараметрыРасчетаЦенНоменклатуры.Наценка,
	|	ПараметрыРасчетаЦенНоменклатуры.ЦенаСПрайса,
	|	ПараметрыРасчетаЦенНоменклатуры.Маржа,
	|	ПараметрыРасчетаЦенНоменклатуры.Сумма2,
	|	ПараметрыРасчетаЦенНоменклатуры.Диаметр,
	|	ПараметрыРасчетаЦенНоменклатуры.Сезон,
	|	ПараметрыРасчетаЦенНоменклатуры.Поставщик,
	|	ПараметрыРасчетаЦенНоменклатуры.Производитель Как Произв,
	|	ПараметрыРасчетаЦенНоменклатуры.ПараметрРасчетаЦеныПоВидуНоменклатуры Как ТЦ,
	|	ПараметрыРасчетаЦенНоменклатуры.ВидНоменклатуры Как Вид
	|ИЗ
	|	РегистрСведений.ПараметрыРасчетаЦенНоменклатуры КАК ПараметрыРасчетаЦенНоменклатуры
	|ГДЕ
	|	ПараметрыРасчетаЦенНоменклатуры.Наличие = ЛОЖЬ";
	ЗапросНаценки.УстановитьПараметр("Вид",ВидНоменклатуры);
	РезНаценки1 = ЗапросНаценки.Выполнить().Выгрузить();
	РезНаценки1.Индексы.Добавить("Диаметр");
	РезНаценки1.Индексы.Добавить("Сезон");
	РезНаценки1.Индексы.Добавить("Поставщик");
	РезНаценки1.Индексы.Добавить("Произв");
	РезНаценки1.Индексы.Добавить("Вид");
	РезНаценки1.Индексы.Добавить("ТЦ");
	
	Доллар = МодульВалютногоУчета.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("840").Ссылка,Дата).Курс/МодульВалютногоУчета.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("840").Ссылка,Дата).кратность;
	Евро = МодульВалютногоУчета.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("978").Ссылка,Дата).Курс/МодульВалютногоУчета.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("978").Ссылка,Дата).Кратность;
	Гривна = МодульВалютногоУчета.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("980").Ссылка,Дата).Курс/МодульВалютногоУчета.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("980").Ссылка,Дата).Кратность;
	
	
	Дол = Справочники.Валюты.НайтиПоКоду("840");
	Ев = Справочники.Валюты.НайтиПоКоду("978");
	Грн = Справочники.Валюты.НайтиПоКоду("980");
	
	Номенклатура = РезЦ1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СоотвПар = Новый Соответствие;
	Для Каждого Стр из ТипыЦен Цикл
		ТЦ = Стр.типЦен;
		ТЦ1 = Справочники.ПараметрыРасчетаЦенНоменклатуры.Выбрать(,ВидНоменклатуры);
		Пока ТЦ1.Следующий() Цикл
			если ТЦ1.ТипЦены = ТЦ или ТЦ1.ТипЦены = ТЦ.ТипЦенНал Тогда
				ТцПар = ТЦ1.Ссылка;
				СоотвПар.Вставить(Строка(ТЦ),ТцПар);
				ПрерватЬ;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	ТцПар = 0;			
ТЦ1 = Справочники.ПараметрыРасчетаЦенНоменклатуры.Выбрать(,ВидНоменклатуры);
	Пока ТЦ1.Следующий() Цикл
		если ТЦ1.ТипЦены = ТЦ или ТЦ1.ТипЦены = ТЦ.ТипЦенНал Тогда
			ТцПар = ТЦ1.Ссылка;
			ПрерватЬ;
		КонецЕсли;
	КонецЦикла;
	
	
	Пока Номенклатура.Следующий() Цикл
		//РезЦ.Сбросить();
		Стр = Новый Структура;
		Стр.Вставить("Номенклатура",Номенклатура.Номенклатура);
		//есть = Ложь;
		//Пока РезЦ.НайтиСледующий(Стр) Цикл
		//	есть = Истина;
		//	прервать;
		//КонецЦикла;
		//если Не есть Тогда
		//	Сообщить("УХЮЮЮ");
		//	продолжить;
		//КонецЕсли;
		
		Кво = 0;
		РезЦ2 = Номенклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Для Каждого строка Из ТипыЦен Цикл
			
			
			ТЦ = строка.ТипЦен;
//			 Тц.ПолучитьОбъект();
			Кво = Кво + 1;
			
//			РезЦ.Сбросить();
			Цена = 0;
			Цена1 = 0;
			Цена2 = 0;
			Цена3 = 0;
			Цена4 = 0;
			
			Контрагент = "";
			Док = "";
			Валюта = "";
			Ц =  ЕстьОстаток(Номенклатура.Номенклатура,ТЦ);
			Если ЗначениеЗаполнено(ТЦ.Подразделение)  и Ц = 0  Тогда 
				СтрукП = Новый Структура;
				СтрукП.Вставить("Производитель",Номенклатура.Производитель);
				СтрокиНашли = ТЦ.Подразделение.Производители.НайтиСтроки(струкП);
				Если СтрокиНашли.Количество() > 0 Тогда
					Продолжить;
				КонецЕслИ;		
				//Для Каждого СтрПар Из ТЦ.Подразделение.Производители Цикл
				//	Если СтрПар.Производитель = Номенклатура.Ссылка.Производитель Тогда
				//		Продолжить;
				//	КонецЕслИ;
				//КонецЦикла;
			КонецЕслИ;
			НашлиЦену = Ложь;
			РезЦ2.Сбросить();
			Пока РезЦ2.Следующий() Цикл			
			РезЦ = РезЦ2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);			
			Пока РезЦ.Следующий() Цикл
				Если ТЦ.Безнал и РезЦ.ЦенаБН = 0 Тогда
					Продолжить;
				Конецесли;
				Если РезЦ.Остаток = 0 или РезЦ.Цена = 0 Тогда
					Продолжить;
				Конецесли;
				
				МинОст = 2;
				Если ЗначениеЗаполнено(ТЦ.Подразделение)  и Ц = 0  Тогда 
					
					Для Каждого СтрПар Из ТЦ.Подразделение.Параметры Цикл
						Если СтрПар.Диаметр = Номенклатура.Ссылка.ДиаметрДиска и СтрПар.Сезон = Номенклатура.Ссылка.Сезонность Тогда
							МинОст = СтрПар.Количество;
							Прервать;
						КонецЕслИ;
					КонецЦикла;
					Для Каждого СтрПар Из ТЦ.Подразделение.ПоставщикиБренд Цикл
						Если СтрПар.Поставщик = РезЦ.Контрагент и СтрПар.Производитель = Номенклатура.Ссылка.Производитель Тогда
							МинОст = 100000;
							
						КонецЕслИ;
					КонецЦикла;
					Для Каждого СтрПар Из ТЦ.Подразделение.Поставщики Цикл
						Если СтрПар.Поставщик = РезЦ.Контрагент Тогда
							МинОст = 100000;
							Продолжить;
						КонецЕслИ;
					КонецЦикла;
					
				КонецЕслИ;
				
				Если РезЦ.Остаток >= МинОСт Тогда
					Если ТЦ.Безнал Тогда
						Цена = РезЦ.ЦенаБН;
					Иначе
						Цена = РезЦ.Цена;
					КонецЕслИ;
					Цена1 = РезЦ.РекОпт;
					Цена2 = РезЦ.РекОптБН;
					Цена3 = РезЦ.РекРозница;
					Цена4 = РезЦ.РекРозницаБН;
					
					Валюта = РезЦ.Валюта;
					Контрагент = РезЦ.Контрагент;
					Док = РезЦ.Регистратор;
					НашлиЦену = Истина;
					Прервать;
				КонецЕслИ;
				Если НашлиЦену = Истина Тогда
				Прервать;
				КонецЕслИ;
			КонецЦикла;
				Если НашлиЦену = Истина Тогда
				Прервать;
				КонецЕслИ;
			КонецЦикла;
			Если Цена <> 0 Тогда
				С = Товары.Добавить();
				С.Валюта = Валюта;
				НашлиЦену = Истина;
				
				
				если Валюта = Дол Тогда
					Курс = Доллар;
				ИначеЕсли Валюта = ев  Тогда
					Курс = Евро;
				Иначе
					Курс = Гривна;
				КонецЕслИ;
				С.ИндексСтрокиТаблицыЦен = 1;
				с.Номенклатура = Номенклатура.Номенклатура;
				С.ЕдиницаИзмерения = Номенклатура.ЕдиницаХраненияОстатков;
				С.ТипЦен = тц;
				Пар1 = "";
				Если ЗначениеЗаполнено(ТЦ.БазовыйТипЦенГараж) и ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000002").Ссылка Тогда
					Пар1= "Цена пост="+Строка(Цена)+", Вторая ";
					ЦенаЦ = ПолучитьЦену( ТЦ.БазовыйТипЦенГараж,Номенклатура.Ссылка);//FOFAОкр(Ценообразование.ПолучитьЦенуНоменклатуры(Номенклатура.Ссылка, , ТЦ.БазовыйТипЦенГараж, ТекущаяДата(), ,, , , ,,),0)
					Если ЦенаЦ.Нашли ТОгда //fofa
						Цена = Окр(ЦенаЦ.Цена,0);
						С.Валюта = ЦенаЦ.Валюта;
						Валюта = ЦенаЦ.Валюта;
					Иначе
						Товары.Удалить(С);
						Продолжить;
					КонецЕслИ;
				ИначеЕсли ЗначениеЗаполнено(ТЦ.БазовыйТипЦенГараж) и ВидНоменклатуры <> Справочники.ВидыНоменклатуры.НайтиПоКоду("000000002").Ссылка Тогда
					Пар1= "Цена пост="+Строка(Цена)+", Вторая ";
					ЦенаЦ = ПолучитьЦену( ТЦ.БазовыйТипЦенГараж,Номенклатура.Ссылка);///Окр(Ценообразование.ПолучитьЦенуНоменклатуры(Номенклатура.Ссылка, , ТЦ.БазовыйТипЦенДиски, ТекущаяДата(), ,, , , ,,),0)
					Если ЦенаЦ.Нашли ТОгда //fofa
						Цена = Окр(ЦенаЦ.Цена,0);
						С.Валюта = ЦенаЦ.Валюта;
						Валюта = ЦенаЦ.Валюта;
					Иначе
						Товары.Удалить(С);
						Продолжить;
					КонецЕслИ;
				КонецЕслИ;
				
				Сумма1 = 0;
				Сумма2 = 0;
				Наценка = 0;
				Если Ц = 1 или ТипЗНЧ(Ц) = Тип("Структура") Тогда
					ПолучитьРеквизитыНаценкиОстаток(Номенклатура.Номенклатура);
					если Сумма1 = 0 и Сумма2 = 0 и Наценка = 0 и ЦенаПрайса=Перечисления.ЦеныПрайса.ПустаяСсылка() Тогда
						С.Цена = 0;
					иначе
						С.Цена = ОКР((Цена +Сумма1/Курс) * (1+Наценка/100)+сумма2/курс,2);
					КонецЕсли;
					С.ПроцентСкидкиНаценки = "Наличие "+Пар1+"Цена="+Строка(Цена)+", Сумма1="+Строка(Сумма1)+", Процент="+Строка(Наценка)+", Сумма2="+Строка(Сумма2);
					С.Поставщик = СкладНаличия;
					//Проверим наличие
					Если Не ЗначениеЗаполнено(ТЦ.БазовыйТипЦенГараж) Тогда
							РезЦена.Сбросить();
							С.Цена = 0;
							Пока РезЦена.НайтиСледующий(Стр) Цикл
								Если Резцена.Цена>0 и Резцена.ТипЦен = тц Тогда
									Если ТЦ.БазовыйТипЦенГараж.Пустая() и  ТЦ.БазовыйТипЦенДиски.Пустая() Тогда
										С.Цена = Резцена.Цена;
										С.Валюта = Резцена.Валюта;
										С.СпособРасчетаЦены = "";
										С.ПроцентСкидкиНаценки = "";
									КонецЕслИ;
									С.Поставщик = СкладНаличия;
								КонецЕслИ;
							КонецЦикла;
					КонецЕсли;
					
				ИначеЕсли Ц = 0 Тогда
					
					ПолучитьРеквизитыНаценки(Номенклатура,Контрагент,СоотвПар.Получить(Строка(ТЦ)));
					С.Цена = ОКР((Цена +Сумма1/курс) * (1+Наценка/100)+сумма2/курс,2);
					С.ПроцентСкидкиНаценки = Пар1+"Цена="+Строка(Цена)+", Сумма1="+Строка(Сумма1)+", Процент="+Строка(Наценка)+", Сумма2="+Строка(Сумма2);
					С.СпособРасчетаЦены = ДоК;
					С.Поставщик = Контрагент;
					ЦенаМаржа = ОКР((Цена +Маржа/Курс),2);
					Если ЦенаМаржа > С.Цена и Маржа>0 Тогда
						С.Цена = ЦенаМаржа;
						С.ПроцентСкидкиНаценки = Пар1+"Цена="+Строка(Цена)+", Маржа="+Строка(Окр(Маржа/Курс,2));
						НашлиЦену = Истина;

					КонецЕслИ;
					
				ИначеЕсли ТЦ.БазовыйТипЦенГараж.Пустая() и ТЦ.БазовыйТипЦенДиски.Пустая() Тогда //В наличии и пустая цена Гараж
					С.Цена = Ц.Цена;
					С.Валюта = Ц.валюта;
					С.Поставщик = СкладНаличия;
					НашлиЦену = Истина;
				Иначе                                                                         //В наличии но есть заполненая цена гараж, считаем по стандарным парамтерам
					ПолучитьРеквизитыНаценкиОстаток(Номенклатура.Номенклатура);
					С.Цена = ОКР((Цена +Сумма1/Курс) * (1+Наценка/100)+сумма2/Курс,2);
					С.ПроцентСкидкиНаценки = Пар1+"Цена="+Строка(Цена)+", Сумма1="+Строка(Сумма1)+", Процент="+Строка(Наценка)+", Сумма2="+Строка(Сумма2);
					С.СпособРасчетаЦены = ДоК;
					НашлиЦену = Истина;
					С.Поставщик = Контрагент;
					ЦенаМаржа = ОКР((Цена +Маржа/курс),2);
					Если ЦенаМаржа > С.Цена и Маржа>0 Тогда
						С.Цена = ЦенаМаржа;
						С.ПроцентСкидкиНаценки = Пар1+"Цена="+Строка(Цена)+", Маржа="+Строка(Маржа);
					КонецЕслИ;
					//Проверим наличие
					Если Не ЗначениеЗаполнено(ТЦ.БазовыйТипЦенГараж) Тогда
							РезЦена.Сбросить();
							С.Цена = 0;
							Пока РезЦена.НайтиСледующий(Стр) Цикл
								Если Резцена.Цена>0 и Резцена.ТипЦен = тц Тогда
									Если ТЦ.БазовыйТипЦенГараж.Пустая() и  ТЦ.БазовыйТипЦенДиски.Пустая() Тогда
										С.Цена = Резцена.Цена;
										С.Валюта = Резцена.Валюта;
										С.СпособРасчетаЦены = "";
										С.ПроцентСкидкиНаценки = "";
									КонецЕслИ;
									С.Поставщик = СкладНаличия;
								КонецЕслИ;
						КонецЦикла;
					КонецЕсли;
				КонецЕслИ;
				Рек = 0;
				Если ЦенаПрайса = Перечисления.ЦеныПрайса.РекОпт и Не ТЦ.Безнал Тогда
					С.Цена = Цена1;
					С.Валюта = Валюта;
					Рек = 1;
				ИначеЕсли ЦенаПрайса = Перечисления.ЦеныПрайса.РекОпт и ТЦ.Безнал Тогда
					С.Цена = Цена2;
					С.Валюта = Валюта;
					Рек = 1;
				ИначеЕсли ЦенаПрайса = Перечисления.ЦеныПрайса.РекРозница и Не ТЦ.Безнал Тогда
					С.Цена = Цена3;
					С.Валюта = Валюта;
					Рек = 1;
				ИначеЕсли ЦенаПрайса = Перечисления.ЦеныПрайса.РекРозница и ТЦ.Безнал Тогда	
					С.Цена = Цена4;
					С.Валюта = Валюта;
					Рек = 1;
				КонецЕслИ;
				
				если Сумма1 = 0 и Сумма2 = 0 и Наценка = 0 и Рек = 0  и С.Цена <> 0 Тогда   //Если нету параметров, то берем прошлую цену
					ЦенН = ПолучитьЦену(ТЦ,Номенклатура.Номенклатура);
					Если ЦенН = 0 Тогда
						ПродолжитЬ;
					КонецЕслИ;
					Попытка
						С.Валюта = ЦенН.Валюта;
						//	С.ЕдиницаИзмерения = РезОстатки.Номенклатура.ЕдиницаХраненияОстатков;
						//	С.ИндексСтрокиТаблицыЦен = 1;
						//	с.Номенклатура = РезОстатки.Номенклатура;
						С.Цена = ЦенН.Цена;
					Исключение
					КонецПопытки;
				Иначеесли С.Цена = 0 Тогда   //Если нету параметров, то берем прошлую цену
					ЦенН = ПолучитьЦенуНаша(ТЦ,Номенклатура.Номенклатура);
					Если ЦенН = 0 Тогда
						ПродолжитЬ;
					КонецЕслИ;
					Попытка
						С.Валюта = ЦенН.Валюта;
						//	С.ЕдиницаИзмерения = РезОстатки.Номенклатура.ЕдиницаХраненияОстатков;
						//	С.ИндексСтрокиТаблицыЦен = 1;
						//	с.Номенклатура = РезОстатки.Номенклатура;
						С.Цена = ЦенН.Цена;
					Исключение
					КонецПопытки;
					
				КонецЕслИ;
				
			КонецЕсли;
			
		КонецЦикла;
		
		//		Состояние(Окр(К_/КвоВсего*100,2)+"%");
	КонецЦикла;
	//	Записать();
	ЗапросОстатки = Новый Запрос;  //FOFA то что есть только у нас
	ЗапросОстатки.Текст = "ВЫБРАТЬ
	                      |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК Остаток,
	                      |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	                      |	ТоварыНаСкладахОстатки.Склад,
	                      |	СУММА(ТоварыНаСкладахОстатки.СтоимостьОстаток) КАК СтоимостьОстаток,
	                      |	МАКСИМУМ(ВложенныйЗапрос.Цена) КАК Цена,
	                      |	МАКСИМУМ(ВложенныйЗапрос.ВалютаДокумента) КАК ВалютаДокумента
	                      |ИЗ
	                      |	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	                      |			,
	                      |			Номенклатура В ИЕРАРХИИ (&Ном)
	                      |				И Номенклатура.ВидНоменклатуры = &ВидН) КАК ТоварыНаСкладахОстатки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	                      |			МАКСИМУМ(ВложенныйЗапрос.Поле1) КАК Цена,
	                      |			МАКСИМУМ(ВложенныйЗапрос.ДокументОприходованияВалютаДокумента) КАК ВалютаДокумента
	                      |		ИЗ
	                      |			(ВЫБРАТЬ
	                      |				ПартииТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
	                      |				ПартииТоваровНаСкладахОстатки.ДокументОприходования КАК ДокументОприходования,
	                      |				ВЫБОР
	                      |					КОГДА ПартииТоваровНаСкладахОстатки.КоличествоОстаток <> 0
	                      |						ТОГДА ПартииТоваровНаСкладахОстатки.СтоимостьОстаток / ПартииТоваровНаСкладахОстатки.КоличествоОстаток / ПартииТоваровНаСкладахОстатки.ДокументОприходования.КурсВзаиморасчетов * ПартииТоваровНаСкладахОстатки.ДокументОприходования.КратностьВзаиморасчетов
	                      |					ИНАЧЕ 0
	                      |				КОНЕЦ КАК Поле1,
	                      |				ПартииТоваровНаСкладахОстатки.ДокументОприходования.ВалютаДокумента КАК ДокументОприходованияВалютаДокумента
	                      |			ИЗ
	                      |				РегистрНакопления.ПартииТоваровНаСкладах.Остатки КАК ПартииТоваровНаСкладахОстатки) КАК ВложенныйЗапрос
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ВложенныйЗапрос.Номенклатура) КАК ВложенныйЗапрос
	                      |		ПО ТоварыНаСкладахОстатки.Номенклатура = ВложенныйЗапрос.Номенклатура
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыНаСкладахОстатки.Склад,
	                      |	ТоварыНаСкладахОстатки.Номенклатура";
	ЗапросОстатки.УстановитьПараметр("Ном",НоменклатураФильтр1);						  
	ЗапросОстатки.УстановитьПараметр("ВидН",ВидНоменклатуры);						  
	
	РезОстатки = ЗапросОстатки.Выполнить().Выбрать();
	пока РезОстатки.Следующий() Цикл
		Если Не ЗначениеЗаполнено(РезОстатки.Остаток) Тогда
			Продолжить;
			КонецЕслИ;
		Стр = Новый Структура;
		Стр.Вставить("Номенклатура",РезОстатки.Номенклатура);
		СтрокиНашли = Товары.НайтиСтроки(стр);
		Если СтрокиНашли.Количество() = 0 Тогда
			Для Каждого СтрЦ из ТипыЦен Цикл
				
				С = Товары.Добавить();
				Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
				Закупка = 0;
				Если ЗначениеЗаполнено(РезОстатки.Остаток) Тогда
					Закупка = РезОстатки.Цена;	
					Валюта = РезОстатки.ВалютаДокумента;
					Если ЗначениеЗаполнено(Валюта) Тогда
					Если Валюта.Код = "840" Тогда
						Закупка = Закупка * Доллар;
					КонецЕсли; 
					Если Валюта.Код = "978" Тогда
						Закупка = Закупка * Евро;
					КонецЕсли; 
											
					КонецЕсли; 

				Иначе
					Закупка = 0;	
				КонецЕсли; 
				ТЦ = СтрЦ.ТипЦен;
				ПолучитьРеквизитыНаценкиОстаток(РезОстатки.Номенклатура);
С.Валюта = РезОстатки.ВалютаДокумента;				
				Если ЗначениеЗаполнено(Закупка) Тогда
				С.Цена = ОКР((Закупка +Сумма1) * (1+Наценка/100)+сумма2,2);
				С.ПроцентСкидкиНаценки = "Товар есть только у нас. Цена="+Строка(Закупка)+", Сумма1="+Строка(Сумма1)+", Процент="+Строка(Наценка)+", Сумма2="+Строка(Сумма2);
				С.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
			Иначе
			#Если Клиент Тогда		
				Сообщить(РезОстатки.Номенклатура.Наименование + " не нашли цену закупки"+Строка(ТЦ),СтатусСообщения.Важное);
			#КонецЕсли
				
				КонецЕсли; 
				
				
				С.ЕдиницаИзмерения = РезОстатки.Номенклатура.ЕдиницаХраненияОстатков;
				С.ИндексСтрокиТаблицыЦен = 1;
				с.Номенклатура = РезОстатки.Номенклатура;
				С.ТипЦен = СтрЦ.ТипЦен;
				С.СпособРасчетаЦены = "Наши";
				С.Поставщик = РезОстатки.Склад;
			#Если Клиент Тогда		
				             Если С.Цена = Закупка Тогда
				Сообщить(РезОстатки.Номенклатура.Наименование + " не нашли наценку для "+Строка(ТЦ),СтатусСообщения.Важное);
							 КонецЕсли; 
			#КонецЕсли

			КонецЦикла;
			#Если Клиент Тогда		
				
				Сообщить(РезОстатки.Номенклатура.Наименование + " нету нив одного поставщика, но есть у нас");
			#КонецЕсли
			
		конецесли;
	КонецЦикла;
	Записать();
	
КонецПроцедуры


Процедура  ПолучитьРеквизитыНаценкиОстаток(Н)
	Маржа = 0;
	Сумма1 = 0;
	Сумма2 = 0;
	Наценка = 0;
	ЦенаПрайса = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПараметрыРасчетаЦенНоменклатуры.Сумма1,
	|	ПараметрыРасчетаЦенНоменклатуры.Наценка,
	|	ПараметрыРасчетаЦенНоменклатуры.ЦенаСПрайса,
	|	ПараметрыРасчетаЦенНоменклатуры.Сумма2
	|ИЗ
	|	РегистрСведений.ПараметрыРасчетаЦенНоменклатуры КАК ПараметрыРасчетаЦенНоменклатуры
	|ГДЕ
	|	ПараметрыРасчетаЦенНоменклатуры.Диаметр = &Диаметр
	|	И ПараметрыРасчетаЦенНоменклатуры.Сезон = &Сезон
	|	И ПараметрыРасчетаЦенНоменклатуры.Наличие = ИСТИНА
	|	И ПараметрыРасчетаЦенНоменклатуры.БУ = &БУ
	|	И ПараметрыРасчетаЦенНоменклатуры.ПараметрРасчетаЦеныПоВидуНоменклатуры = &ТЦ
	|	И ПараметрыРасчетаЦенНоменклатуры.ВидНоменклатуры = &Вид";
	Запрос.УстановитьПараметр("Диаметр",Н.ДиаметрДиска);
	Запрос.УстановитьПараметр("Сезон",Н.Сезонность);
	Запрос.УстановитьПараметр("БУ",Н.БУ);
	Запрос.УстановитьПараметр("Вид",Н.ВидНоменклатуры);
	ТЦ1 = Справочники.ПараметрыРасчетаЦенНоменклатуры.Выбрать(,Н.ВидНоменклатуры);
	Запрос.УстановитьПараметр("ТЦ",0);
	Пока ТЦ1.Следующий() Цикл
		если ТЦ1.ТипЦены = ТЦ или ТЦ1.ТипЦены = ТЦ.ТипЦенНал Тогда
			Запрос.УстановитьПараметр("ТЦ",ТЦ1.Ссылка);
			ПрерватЬ;
		КонецЕсли;
	КонецЦикла;
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Сумма1 = Рез.Сумма1;
		Сумма2 = Рез.Сумма2;		   
		Наценка = Рез.Наценка;		   
		ЦенаПрайса = Рез.ЦенаСПрайса;
	КонецЦикла;
	
	Если Сумма2 = 0 и Сумма1 = 0 и Наценка = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПараметрыРасчетаЦенНоменклатуры.Сумма1,
		|	ПараметрыРасчетаЦенНоменклатуры.Наценка,
		|	ПараметрыРасчетаЦенНоменклатуры.ЦенаСПрайса,
		|	ПараметрыРасчетаЦенНоменклатуры.Сумма2
		|ИЗ
		|	РегистрСведений.ПараметрыРасчетаЦенНоменклатуры КАК ПараметрыРасчетаЦенНоменклатуры
		|ГДЕ
		|	ПараметрыРасчетаЦенНоменклатуры.Диаметр = &Диаметр
		|	И ПараметрыРасчетаЦенНоменклатуры.Сезон = &Сезон
		|	И ПараметрыРасчетаЦенНоменклатуры.Наличие = Истина
		|	И ПараметрыРасчетаЦенНоменклатуры.БУ = &БУ		
		|	И ПараметрыРасчетаЦенНоменклатуры.ВидНоменклатуры = &Вид		
		|	И ПараметрыРасчетаЦенНоменклатуры.ПараметрРасчетаЦеныПоВидуНоменклатуры = &ТЦ";
		Запрос.УстановитьПараметр("Диаметр",Н.ДиаметрДиска);
		Запрос.УстановитьПараметр("Сезон",Перечисления.Сезонность.ПустаяСсылка());
		Запрос.УстановитьПараметр("БУ",Н.БУ);		
		Запрос.УстановитьПараметр("Вид",Н.ВидНоменклатуры);
		Запрос.УстановитьПараметр("ТЦ",0);
		ТЦ1 = Справочники.ПараметрыРасчетаЦенНоменклатуры.Выбрать(,Н.ВидНоменклатуры);
		Пока ТЦ1.Следующий() Цикл
			если ТЦ1.ТипЦены = ТЦ или ТЦ1.ТипЦены = ТЦ.ТипЦенНал Тогда
				Запрос.УстановитьПараметр("ТЦ",ТЦ1.Ссылка);
				ПрерватЬ;
			КонецЕсли;
		КонецЦикла;
		
		Рез = Запрос.Выполнить().Выбрать();
		Пока Рез.Следующий() Цикл
			Сумма1 = Рез.Сумма1;
			Сумма2 = Рез.Сумма2;		   
			Наценка = Рез.Наценка;		
			ЦенаПрайса = Рез.ЦенаСПрайса;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Сумма2 = 0 и Сумма1 = 0 и Наценка = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПараметрыРасчетаЦенНоменклатуры.Сумма1,
		|	ПараметрыРасчетаЦенНоменклатуры.Наценка,
		|	ПараметрыРасчетаЦенНоменклатуры.ЦенаСПрайса,
		|	ПараметрыРасчетаЦенНоменклатуры.Сумма2
		|ИЗ
		|	РегистрСведений.ПараметрыРасчетаЦенНоменклатуры КАК ПараметрыРасчетаЦенНоменклатуры
		|ГДЕ
		|	ПараметрыРасчетаЦенНоменклатуры.Диаметр = &Диаметр
		|	И ПараметрыРасчетаЦенНоменклатуры.Сезон = &Сезон
		|	И ПараметрыРасчетаЦенНоменклатуры.ВидНоменклатуры = &Вид		
		|	И ПараметрыРасчетаЦенНоменклатуры.Наличие = Истина		
		|	И ПараметрыРасчетаЦенНоменклатуры.ПараметрРасчетаЦеныПоВидуНоменклатуры = &ТЦ";
		Запрос.УстановитьПараметр("Диаметр",Справочники.Диаметр.ПустаяСсылка());
		Запрос.УстановитьПараметр("ТЦ",0);
		ТЦ1 = Справочники.ПараметрыРасчетаЦенНоменклатуры.Выбрать(,Н.ВидНоменклатуры);
		Пока ТЦ1.Следующий() Цикл
			если ТЦ1.ТипЦены = ТЦ или ТЦ1.ТипЦены = ТЦ.ТипЦенНал Тогда
				Запрос.УстановитьПараметр("ТЦ",ТЦ1.Ссылка);
				ПрерватЬ;
			КонецЕсли;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("Вид",Н.ВидНоменклатуры);
		Запрос.УстановитьПараметр("Сезон",Перечисления.Сезонность.ПустаяСсылка());
		Рез = Запрос.Выполнить().Выбрать();
		Пока Рез.Следующий() Цикл
			Сумма1 = Рез.Сумма1;
			Сумма2 = Рез.Сумма2;		   
			Наценка = Рез.Наценка;	
			ЦенаПрайса = Рез.ЦенаСПрайса;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры



Процедура  ПолучитьРеквизитыНаценки(Н,К,ТЦПар) Экспорт
	
	Сумма1 = 0;
	Сумма1 = 0;
	Сумма2 = 0;
	Маржа	 = 0;
	Наценка = 0;
	ЦенаПрайса = "";
//	РезНаценки.Сбросить();
	СтрукФ = Новый Структура;
	СтрукФ.Вставить("Диаметр",Н.ДиаметрДиска);
	СтрукФ.Вставить("Сезон",Н.Сезонность);
	Струкф.Вставить("Поставщик",К);
	СтрукФ.Вставить("Произв",Н.Производитель);
	СтрукФ.Вставить("Вид",ВидНоменклатуры);
	Струкф.Вставить("ТЦ",ТЦПар);
	СтрокиРез = РезНаценки1.НайтиСтроки(Струкф);
	Если СтрокиРез <> Неопределено Тогда
	Для Каждого РезНаценки из СтрокиРез Цикл
		Сумма1 = РезНаценки.Сумма1;
		Маржа = РезНаценки.Маржа;
		Сумма2 = РезНаценки.Сумма2;		   
		Наценка = РезНаценки.Наценка;		   
		ЦенаПрайса = РезНаценки.ЦенаСПрайса;
		прервать;
	КонецЦикла;
	КонецЕслИ;
	Если Сумма2 = 0 и Сумма1 = 0 и Наценка = 0 и ЦенаПрайса = "" Тогда
		Сумма1 = 0;
		Сумма2 = 0;
		Наценка = 0;
		Маржа	 = 0;
		//РезНаценки.Сбросить();
		СтрукФ = Новый Структура;
		СтрукФ.Вставить("Диаметр",Н.ДиаметрДиска);
		СтрукФ.Вставить("Сезон",Н.Сезонность);
		Струкф.Вставить("Поставщик",К);
		СтрукФ.Вставить("Произв",Справочники.Производители.ПустаяСсылка());
		СтрукФ.Вставить("Вид",ВидНоменклатуры);
	Струкф.Вставить("ТЦ",ТЦПар);
	СтрокиРез = РезНаценки1.НайтиСтроки(Струкф);
	Если СтрокиРез <> Неопределено Тогда
	Для Каждого РезНаценки из СтрокиРез Цикл
			Сумма1 = РезНаценки.Сумма1;
			Маржа = РезНаценки.Маржа;
			Сумма2 = РезНаценки.Сумма2;		   
			Наценка = РезНаценки.Наценка;		   
			ЦенаПрайса = РезНаценки.ЦенаСПрайса;
			прервать;
			
		КонецЦикла;
		КонецЕслИ;
	КонецЕслИ;
	//Параметр
	Если Сумма2 = 0 и Сумма1 = 0 и Наценка = 0 и ЦенаПрайса = "" Тогда
		Сумма1 = 0;
		Сумма2 = 0;
		Наценка = 0;
		Маржа	 = 0;
		//РезНаценки.Сбросить();
		СтрукФ = Новый Структура;
		СтрукФ.Вставить("Диаметр",Н.ДиаметрДиска);
		СтрукФ.Вставить("Сезон",Н.Сезонность);
		Струкф.Вставить("Поставщик",Справочники.Контрагенты.ПустаяСсылка());
		СтрукФ.Вставить("Произв",Справочники.Производители.ПустаяСсылка());
		СтрукФ.Вставить("Вид",ВидНоменклатуры);
	Струкф.Вставить("ТЦ",ТЦПар);
		
	СтрокиРез = РезНаценки1.НайтиСтроки(Струкф);
	Если СтрокиРез <> Неопределено Тогда
	Для Каждого РезНаценки из СтрокиРез Цикл
			Сумма1 = РезНаценки.Сумма1;
			Маржа = РезНаценки.Маржа;
			Сумма2 = РезНаценки.Сумма2;		   
			Наценка = РезНаценки.Наценка;		   
			ЦенаПрайса = РезНаценки.ЦенаСПрайса;
			прервать;
			
		КонецЦикла;
		КонецЕслИ;
	КонецЕслИ;
	//Новые
	Если Сумма2 = 0 и Сумма1 = 0 и Наценка = 0 и ЦенаПрайса = "" Тогда
		Сумма1 = 0;
		Сумма2 = 0;
		Наценка = 0;
		Маржа	 = 0;
		//РезНаценки.Сбросить();
		СтрукФ = Новый Структура;
		СтрукФ.Вставить("Диаметр",Н.ДиаметрДиска);
		СтрукФ.Вставить("Сезон",Перечисления.Сезонность.ПустаяСсылка());
		Струкф.Вставить("Поставщик",К);
		СтрукФ.Вставить("Произв",Н.Производитель);
		СтрукФ.Вставить("Вид",ВидНоменклатуры);
	Струкф.Вставить("ТЦ",ТЦПар);
		
	СтрокиРез = РезНаценки1.НайтиСтроки(Струкф);
	Если СтрокиРез <> Неопределено Тогда
	Для Каждого РезНаценки из СтрокиРез Цикл
			Сумма1 = РезНаценки.Сумма1;
			Маржа = РезНаценки.Маржа;
			Сумма2 = РезНаценки.Сумма2;		   
			Наценка = РезНаценки.Наценка;		   
			ЦенаПрайса = РезНаценки.ЦенаСПрайса;
		прервать;
			
	КонецЦикла;
	КонецЕслИ;
	КонецЕслИ;
	
	Если Сумма2 = 0 и Сумма1 = 0 и Наценка = 0 и ЦенаПрайса = "" Тогда
		Сумма1 = 0;
		Сумма2 = 0;
		Наценка = 0;
		Маржа	 = 0;
	//	РезНаценки.Сбросить();
		СтрукФ = Новый Структура;
		СтрукФ.Вставить("Диаметр",Справочники.Диаметр.ПустаяСсылка());
		СтрукФ.Вставить("Сезон",Перечисления.Сезонность.ПустаяСсылка());
		Струкф.Вставить("Поставщик",К);
		СтрукФ.Вставить("Произв",Н.Производитель);
		СтрукФ.Вставить("Вид",ВидНоменклатуры);
	Струкф.Вставить("ТЦ",ТЦПар);
		
	СтрокиРез = РезНаценки1.НайтиСтроки(Струкф);
	Если СтрокиРез <> Неопределено Тогда
	Для Каждого РезНаценки из СтрокиРез Цикл
			Сумма1 = РезНаценки.Сумма1;
			Маржа = РезНаценки.Маржа;
			Сумма2 = РезНаценки.Сумма2;		   
			Наценка = РезНаценки.Наценка;		   
			ЦенаПрайса = РезНаценки.ЦенаСПрайса;
		прервать;
			
	КонецЦикла;
	КонецЕслИ;
		
	КонецЕслИ;
	
	Если Сумма2 = 0 и Сумма1 = 0 и Наценка = 0 и ЦенаПрайса = "" Тогда
		Сумма1 = 0;
		Сумма2 = 0;
		Наценка = 0;
		Маржа	 = 0;
		//РезНаценки.Сбросить();
		СтрукФ = Новый Структура;
		СтрукФ.Вставить("Диаметр",Н.ДиаметрДиска);
		СтрукФ.Вставить("Сезон",Перечисления.Сезонность.ПустаяСсылка());
		Струкф.Вставить("Поставщик",Справочники.Контрагенты.ПустаяСсылка());
		СтрукФ.Вставить("Произв",Н.Производитель);
		СтрукФ.Вставить("Вид",ВидНоменклатуры);
	Струкф.Вставить("ТЦ",ТЦПар);
		
	СтрокиРез = РезНаценки1.НайтиСтроки(Струкф);
	Если СтрокиРез <> Неопределено Тогда
	Для Каждого РезНаценки из СтрокиРез Цикл
			Сумма1 = РезНаценки.Сумма1;
			Маржа = РезНаценки.Маржа;
			Сумма2 = РезНаценки.Сумма2;		   
			Наценка = РезНаценки.Наценка;		   
			ЦенаПрайса = РезНаценки.ЦенаСПрайса;
		прервать;
			
	КонецЦикла;
	КонецЕслИ;
	КонецЕслИ;
	
	Если Сумма2 = 0 и Сумма1 = 0 и Наценка = 0 и ЦенаПрайса = "" Тогда
		Сумма1 = 0;
		Сумма2 = 0;
		Наценка = 0;
		Маржа	 = 0;
		//РезНаценки.Сбросить();
		СтрукФ = Новый Структура;
		СтрукФ.Вставить("Диаметр",Н.ДиаметрДиска);
		СтрукФ.Вставить("Сезон",Перечисления.Сезонность.ПустаяСсылка());
		Струкф.Вставить("Поставщик",К);
		СтрукФ.Вставить("Произв",Справочники.Производители.ПустаяСсылка());
		СтрукФ.Вставить("Вид",ВидНоменклатуры);
	Струкф.Вставить("ТЦ",ТЦПар);
		
	СтрокиРез = РезНаценки1.НайтиСтроки(Струкф);
	Если СтрокиРез <> Неопределено Тогда
	Для Каждого РезНаценки из СтрокиРез Цикл
			Сумма1 = РезНаценки.Сумма1;
			Маржа = РезНаценки.Маржа;
			Сумма2 = РезНаценки.Сумма2;		   
			Наценка = РезНаценки.Наценка;		   
			ЦенаПрайса = РезНаценки.ЦенаСПрайса;
		прервать;
			
	КонецЦикла;
	КонецЕслИ;
		
	КонецЕслИ;
	
	
	
	//Новые
	
	
	Если Сумма2 = 0 и Сумма1 = 0 и Наценка = 0 и ЦенаПрайса = "" Тогда
		//РезНаценки.Сбросить();
		СтрукФ = Новый Структура;
		СтрукФ.Вставить("Диаметр",Н.ДиаметрДиска);
		СтрукФ.Вставить("Сезон",Перечисления.Сезонность.ПустаяСсылка());
		Струкф.Вставить("Поставщик",Справочники.Контрагенты.ПустаяСсылка());
		СтрукФ.Вставить("Произв",Справочники.Производители.ПустаяСсылка());
		СтрукФ.Вставить("Вид",ВидНоменклатуры);
	Струкф.Вставить("ТЦ",ТЦПар);
		
	СтрокиРез = РезНаценки1.НайтиСтроки(Струкф);
	Если СтрокиРез <> Неопределено Тогда
	Для Каждого РезНаценки из СтрокиРез Цикл
			Сумма1 = РезНаценки.Сумма1;
			Маржа = РезНаценки.Маржа;
			Сумма2 = РезНаценки.Сумма2;		   
			Наценка = РезНаценки.Наценка;		   
			ЦенаПрайса = РезНаценки.ЦенаСПрайса;
		прервать;
			
	КонецЦикла;
	КонецЕслИ;
	КонецЕсли;
	
	Если Сумма2 = 0 и Сумма1 = 0 и Наценка = 0 и ЦенаПрайса = "" Тогда
		//РезНаценки.Сбросить();
		СтрукФ = Новый Структура;
		СтрукФ.Вставить("Диаметр",Справочники.Диаметр.ПустаяСсылка());
		СтрукФ.Вставить("Сезон",Перечисления.Сезонность.ПустаяСсылка());
		Струкф.Вставить("Поставщик",К);
		СтрукФ.Вставить("Произв",Справочники.Производители.ПустаяСсылка());
		СтрукФ.Вставить("Вид",ВидНоменклатуры);
	Струкф.Вставить("ТЦ",ТЦПар);
		
	СтрокиРез = РезНаценки1.НайтиСтроки(Струкф);
	Если СтрокиРез <> Неопределено Тогда
	Для Каждого РезНаценки из СтрокиРез Цикл
			Сумма1 = РезНаценки.Сумма1;
			Маржа = РезНаценки.Маржа;
			Сумма2 = РезНаценки.Сумма2;		   
			Наценка = РезНаценки.Наценка;		   
			ЦенаПрайса = РезНаценки.ЦенаСПрайса;
		прервать;
			
		КонецЦикла;
	КонецЕслИ;
	КонецЕсли;
	Если Сумма2 = 0 и Сумма1 = 0 и Наценка = 0 и ЦенаПрайса = "" Тогда
		//РезНаценки.Сбросить();
		СтрукФ = Новый Структура;
		СтрукФ.Вставить("Диаметр",Справочники.Диаметр.ПустаяСсылка());
		СтрукФ.Вставить("Сезон",Перечисления.Сезонность.ПустаяСсылка());
		Струкф.Вставить("Поставщик",Справочники.Контрагенты.ПустаяСсылка());
		СтрукФ.Вставить("Произв",Н.Производитель);
		СтрукФ.Вставить("Вид",ВидНоменклатуры);
	Струкф.Вставить("ТЦ",ТЦПар);
		
	СтрокиРез = РезНаценки1.НайтиСтроки(Струкф);
	Если СтрокиРез <> Неопределено Тогда
	Для Каждого РезНаценки из СтрокиРез Цикл
			Сумма1 = РезНаценки.Сумма1;
			Маржа = РезНаценки.Маржа;
			Сумма2 = РезНаценки.Сумма2;		   
			Наценка = РезНаценки.Наценка;		   
			ЦенаПрайса = РезНаценки.ЦенаСПрайса;
		прервать;
			
	КонецЦикла;
	КонецЕслИ;
	КонецЕсли;
	Если Сумма2 = 0 и Сумма1 = 0 и Наценка = 0 и ЦенаПрайса = "" Тогда
		//РезНаценки.Сбросить();
		СтрукФ = Новый Структура;
		СтрукФ.Вставить("Диаметр",Справочники.Диаметр.ПустаяСсылка());
		СтрукФ.Вставить("Сезон",Н.Сезонность);
		Струкф.Вставить("Поставщик",Справочники.Контрагенты.ПустаяСсылка());
		СтрукФ.Вставить("Произв",Справочники.Производители.ПустаяСсылка());
		СтрукФ.Вставить("Вид",ВидНоменклатуры);
	Струкф.Вставить("ТЦ",ТЦПар);
		
	СтрокиРез = РезНаценки1.НайтиСтроки(Струкф);
	Если СтрокиРез <> Неопределено Тогда
	Для Каждого РезНаценки из СтрокиРез Цикл
			Сумма1 = РезНаценки.Сумма1;
			Маржа = РезНаценки.Маржа;
			Сумма2 = РезНаценки.Сумма2;		   
			Наценка = РезНаценки.Наценка;		   
			ЦенаПрайса = РезНаценки.ЦенаСПрайса;
		прервать;
			
		КонецЦикла;
		 КонецЕслИ;
	КонецЕсли;
	
	Если Сумма2 = 0 и Сумма1 = 0 и Наценка = 0 и ЦенаПрайса = "" Тогда
		//РезНаценки.Сбросить();
		СтрукФ = Новый Структура;
		СтрукФ.Вставить("Диаметр",Справочники.Диаметр.ПустаяСсылка());
		СтрукФ.Вставить("Сезон",перечисления.Сезонность.ПустаяСсылка());
		Струкф.Вставить("Поставщик",Справочники.Контрагенты.ПустаяСсылка());
		СтрукФ.Вставить("Произв",Справочники.Производители.ПустаяСсылка());
		СтрукФ.Вставить("Вид",ВидНоменклатуры);
	Струкф.Вставить("ТЦ",ТЦПар);
		
	СтрокиРез = РезНаценки1.НайтиСтроки(Струкф);
	Если СтрокиРез <> Неопределено Тогда
	Для Каждого РезНаценки из СтрокиРез Цикл
			Сумма1 = РезНаценки.Сумма1;
			Маржа = РезНаценки.Маржа;
			Сумма2 = РезНаценки.Сумма2;		   
			Наценка = РезНаценки.Наценка;		   
			ЦенаПрайса = РезНаценки.ЦенаСПрайса;
		прервать;
			
		КонецЦикла;
	КонецЕслИ;
	КонецЕсли;
	
КонецПроцедуры


Функция ЕстьОстаток(Н,Т)
//езОстатки.Сбросить();
	Стр = Новый Структура;
	Стр.Вставить("Номенклатура",Н);
	Есть = 0;
	СтрокиРезОстатки = РезОстатки1.НайтиСтроки(Стр);
	Для Каждого СтрР из СтрокиРезОстатки Цикл
	//Пока РезОстатки.НайтиСледующий(Стр) Цикл
		Если СтрР.Резерв >1 Тогда
			Есть = 1;
			СкладНаличия = СтрР.Склад;
			ПрерватЬ;
		КонецЕслИ;
	КонецЦикла;
	Если Есть >0 Тогда
		РезЦена.Сбросить();
		Пока РезЦена.НайтиСледующий(Стр) Цикл
			Если РезЦена.ТипЦен = ТЦ Тогда
				Ст = Новый Структура;
				Ст.Вставить("Цена",РезЦена.Цена);
				Ст.Вставить("Валюта",РезЦена.Валюта);
				Возврат Ст;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат есть;
КонецФункции


Функция ПолучитьЦену(Цен,Ном)
			Нашли = Ложь;
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура",Ном);
			Отбор.Вставить("ТипЦен",Цен);
			Строки = Товары.НайтиСтроки(Отбор);
				Струк = новый Структура;
				Струк.Вставить("Цена");
				Струк.Вставить("Валюта");
				Струк.Вставить("Нашли");
				Струк.Нашли = Ложь;
				Для Каждого Стр из Строки Цикл
					Струк.Цена = Стр.Цена;
					Струк.Валюта = Стр.Валюта;
					Струк.Нашли = Истина;
					
			КонецЦикла;
	Возврат Струк;
КонецФункции

Функция ПолучитьЦенуНаша(Цен,Ном)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЦен", Дата);
	Запрос.УстановитьПараметр("ТипыЦен", Цен);
	Запрос.УстановитьПараметр("Номенклатура", Ном);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", "");
	Запрос.УстановитьПараметр("Склад",Перечисления.ВидыСкладов.Оптовый);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипыЦенСправочник.Ссылка КАК ТипЦен,
	               |	ВЫБОР
	               |		КОГДА ЦеныНоменклатурыБезХарактеристики.Цена ЕСТЬ NULL 
	               |				И ЦеныНоменклатурыСХарактеристикой.Цена ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСХарактеристикой.Цена, ЦеныНоменклатурыБезХарактеристики.Цена)
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ЦеныНоменклатурыБезХарактеристики.Валюта ЕСТЬ NULL 
	               |				И ЦеныНоменклатурыСХарактеристикой.Валюта ЕСТЬ NULL 
	               |			ТОГДА ТипыЦенСправочник.ВалютаЦены
	               |		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСХарактеристикой.Валюта, ЦеныНоменклатурыБезХарактеристики.Валюта)
	               |	КОНЕЦ КАК Валюта,
	               |	ВЫБОР
	               |		КОГДА ЦеныНоменклатурыБезХарактеристики.ЕдиницаИзмерения ЕСТЬ NULL 
	               |				И ЦеныНоменклатурыСХарактеристикой.ЕдиницаИзмерения ЕСТЬ NULL 
	               |			ТОГДА ВЫРАЗИТЬ(&Номенклатура КАК Справочник.Номенклатура).ЕдиницаХраненияОстатков
	               |		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСХарактеристикой.ЕдиницаИзмерения, ЦеныНоменклатурыБезХарактеристики.ЕдиницаИзмерения)
	               |	КОНЕЦ КАК ЕдиницаИзмерения,
	               |	ВЫБОР
	               |		КОГДА ЦеныНоменклатурыБезХарактеристики.ПроцентСкидкиНаценки ЕСТЬ NULL 
	               |				И ЦеныНоменклатурыСХарактеристикой.ПроцентСкидкиНаценки ЕСТЬ NULL 
	               |			ТОГДА ТипыЦенСправочник.ПроцентСкидкиНаценки
	               |		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСХарактеристикой.ПроцентСкидкиНаценки, ЦеныНоменклатурыБезХарактеристики.ПроцентСкидкиНаценки)
	               |	КОНЕЦ КАК ПроцентСкидкиНаценки,
	               |	ВЫБОР
	               |		КОГДА ЦеныНоменклатурыБезХарактеристики.СпособРасчетаЦены ЕСТЬ NULL 
	               |				И ЦеныНоменклатурыСХарактеристикой.СпособРасчетаЦены ЕСТЬ NULL 
	               |			ТОГДА ТипыЦенСправочник.СпособРасчетаЦены
	               |		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСХарактеристикой.СпособРасчетаЦены, ЦеныНоменклатурыБезХарактеристики.СпособРасчетаЦены)
	               |	КОНЕЦ КАК СпособРасчетаЦены
	               |ИЗ
	               |	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенСправочник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |				&ДатаЦен,
	               |				ТипЦен В (&ТипыЦен)
	               |					И Номенклатура = &Номенклатура
	               |					И ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	               |					И Поставщик.ВидСклада = &Склад) КАК ЦеныНоменклатурыБезХарактеристики
	               |		ПО ТипыЦенСправочник.Ссылка = ЦеныНоменклатурыБезХарактеристики.ТипЦен
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |				&ДатаЦен,
	               |				ТипЦен В (&ТипыЦен)
	               |					И Номенклатура = &Номенклатура
	               |					И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	               |					И Поставщик.ВидСклада = &Склад) КАК ЦеныНоменклатурыСХарактеристикой
	               |		ПО ТипыЦенСправочник.Ссылка = ЦеныНоменклатурыСХарактеристикой.ТипЦен
	               |ГДЕ
	               |	ТипыЦенСправочник.Ссылка В(&ТипыЦен)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//КолонкиТаблицыЦен = ТаблицаЦен.Колонки;
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка;
	КонецЦикла;
	Возврат 0;
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
//
// Параметры:
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа.
//  Отказ - флаг отказа в проведении.
//  Заголовок - заголовок сообщения об ошибках.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить.
	СтруктураОбязательныхПолей = Новый Структура;

	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
//  ТаблицаПоТоварам - таблица значений, содержащая данные для проведения и проверки ТЧ "Товары".
//  СтруктураШапкиДокумента - структура, содержащая реквизиты шапки документа.
//  Отказ - флаг отказа в проведении.
//  Заголовок - заголовок сообщения об ошибках.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)

	// Общую процедуру проверки в этом документе звать нельзя, потому что номер строки в форме документа
	// отличается от системного.
	Для каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл

		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.ИндексСтрокиТаблицыЦен + 1) +
			                    """ табличной части для типа цен """ 
			                   + СокрЛП(СтрокаТаблицы.ТипЦен) + """ ";

		// Номенклатура.
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не заполнена Номенклатура.", Отказ, Заголовок);
		КонецЕсли;

		// Валюта.
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Валюта) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не заполнена Валюта.", Отказ, Заголовок);
		КонецЕсли;

		// Единица для товаров.
		Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура)
		   И Не СтрокаТаблицы.Услуга
		   И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не заполнена единица измерения.", Отказ, Заголовок);
		КонецЕсли;

		// Наборов-пакетов здесь быть не должно.
		Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И СтрокаТаблицы.Набор Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "содержится набор-пакет. " +
				                   "Наборов-пакетов здесь быть не должно!", Отказ, Заголовок);
		КонецЕсли;

		// Проверить заполнение способа расчета для динамических цен, рассчитываемых и хранимых цен.
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СпособРасчетаЦены)
		   И (СтрокаТаблицы.Рассчитывается = Истина
		 Или ЗначениеЗаполнено(СтрокаТаблицы.БазовыйТипЦен)) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не заполнен способ расчета цены.", Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Выполняет движения по регистрам.
//
// Параметры:
//  СтруктураШапкиДокумента - структура реквизитов шапки.
//  ТаблицаПоТоварам- таблица товаров.
//  Отказ - флаг отказа в проведении.
//  Заголовок - заголовок сообщения об ошибках.
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)

	НаборДвижений = Движения.ЦеныНоменклатуры;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();

	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);

	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;

	Если Не Отказ Тогда
		Движения.ЦеныНоменклатуры.ВыполнитьДвижения();
	КонецЕсли;

КонецПроцедуры // ДвиженияПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда

		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, Режим)

	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа.
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, "");

	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура"              , "Номенклатура");
	СтруктураПолей.Вставить("ИндексСтрокиТаблицыЦен"    , "ИндексСтрокиТаблицыЦен");
	СтруктураПолей.Вставить("Набор"                     , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Услуга"                    , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("Цена"                      , "Цена");
	СтруктураПолей.Вставить("Валюта"                    , "Валюта");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"          , "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("ТипЦен"                    , "ТипЦен");
	СтруктураПолей.Вставить("ПроцентСкидкиНаценки"      , "ПроцентСкидкиНаценки");
	СтруктураПолей.Вставить("СпособРасчетаЦены"         , "СпособРасчетаЦены");
	СтруктураПолей.Вставить("Рассчитывается"            , "ТипЦен.Рассчитывается");
	СтруктураПолей.Вставить("БазовыйТипЦен"             , "ТипЦен.БазовыйТипЦен");
	СтруктураПолей.Вставить("Поставщик"         , "Поставщик");

	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей);
	ТаблицаПоТоварам = РезультатЗапросаПоТоварам.Выгрузить();

	Если СтруктураШапкиДокумента.НеПроводитьНулевыеЗначения Тогда
		КоличествоСтрок = ТаблицаПоТоварам.Количество() - 1;
		Для Тмп = 0 По КоличествоСтрок Цикл
			СтрокаТаблицы = ТаблицаПоТоварам.Получить(КоличествоСтрок - Тмп);
			Если СтрокаТаблицы.Рассчитывается <> Истина И СтрокаТаблицы.Цена = 0 Тогда
				ТаблицаПоТоварам.Удалить(СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);

	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	КонецЕсли;
	Если ЭтоПолныйПрайс и не ЗначениеЗаполнено(УстановкаЦенПоставщика) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.ТипЦен,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры,
		|	ЦеныНоменклатурыСрезПоследних.Валюта,
		|	ЦеныНоменклатурыСрезПоследних.Цена,
		|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения,
		|	ЦеныНоменклатурыСрезПоследних.ПроцентСкидкиНаценки,
		|	ЦеныНоменклатурыСрезПоследних.СпособРасчетаЦены,
		|	ЦеныНоменклатурыСрезПоследних.Поставщик
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Момент,
		|			ТипЦен В (&списЦен)
		|				И Номенклатура.ВидНоменклатуры = &ВидН) КАК ЦеныНоменклатурыСрезПоследних";
		Запрос.УстановитьПараметр("Момент",НачалоДня(Дата)-1);
		Запрос.УстановитьПараметр("ВидН",ВидНоменклатуры);
		
		СписЦен = Новый СписокЗначений;
		Для Каждого С Из ТипыЦен Цикл
			СписЦен.Добавить(С.ТипЦен);
		КонецЦикла;
		Запрос.УстановитьПараметр("СписЦен",СписЦен);
		
		Рез = Запрос.Выполнить().Выбрать();
		Пока Рез.Следующий() Цикл
			Нашли = Ложь;
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура",Рез.Номенклатура);
			Отбор.Вставить("ТипЦен",Рез.ТипЦен);
			Строки = Товары.НайтиСтроки(Отбор);
			Для Каждого Стр из Строки Цикл
				если Стр.Цена >0 Тогда
					Нашли = Истина;
					Прервать;
				конецЕслИ;
			КонецЦикла;
			//Если Строки.Количество() > 0 Тогда
			//		Нашли = Истина;
			//КонецЕсли;		
			Если Не Нашли и Рез.Цена >0 Тогда
				Движение = Движения.ЦеныНоменклатуры.Добавить();
				Движение.Активность = Истина;
				ДВижение.Валюта = Рез.Валюта;
				Движение.ЕдиницаИзмерения = Рез.ЕдиницаИзмерения;
				Движение.ХарактеристикаНоменклатуры = Рез.ХарактеристикаНоменклатуры;
				Движение.Номенклатура = Рез.Номенклатура;
				Движение.Период = Дата;
				Движение.ТипЦен = Рез.ТипЦен;
				Движение.Цена = "";
				Движение.Поставщик = "";
				Движение.СпособРасчетаЦены = "";
				Движение.ПроцентСкидкиНаценки = "";
			КонецЕслИ;
		КонецЦикла;
	КонецеслИ;	
	//Если ЭтоПолныйПрайс и Не ЗначениеЗаполнено(УстановкаЦенПоставщика) Тогда
	//	Струк = Новый Структура;
	//	Струк.Вставить("ВидНоменклатуры",ВидНоменклатуры);
	//	Ном = Справочники.Номенклатура.Выбрать(,,Струк);
	//	Пока Ном.Следующий() Цикл
	//		Если Ном.ЭтоГруппа Тогда
	//			ПродолжитЬ;
	//		КонецЕслИ;
	//		Нашли = Ложь;
	//		Отбор = Новый Структура();
	//		Отбор.Вставить("Номенклатура",Ном.Ссылка);
	//		Строки = Товары.НайтиСтроки(Отбор);
	//		Для Каждого Стр из Строки Цикл
	//			если Стр.Цена >0 Тогда
	//				Нашли = Истина;
	//				Прервать;
	//			конецЕслИ;
	//		КонецЦикла;
	//		Если Не Нашли Тогда
	//			Если Ном.ЕстьЦена = Истина Тогда
	//				НомО = Ном.ПолучитьОбъект();
	//				НомО.ЕстьЦена = Ложь;
	//				Попытка
	//					НомО.Записать();
	//				Исключение
	//				КонецПопытки;
	//			КонецЕслИ;
	//		Иначе
	//			Если Ном.ЕстьЦена = Ложь Тогда
	//				НомО = Ном.ПолучитьОбъект();
	//				НомО.ЕстьЦена = Истина;
	//				попытка
	//					НомО.Записать();
	//				Исключение
	//				КонецПопытки;
	//			КонецЕслИ;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
	//Снимем наличие для позиций из докуимента установка цен
	
	Если ЗначениеЗаполнено(УстановкаЦенПоставщика) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВложенныйЗапрос.ТипЦен,
		               |	ВложенныйЗапрос.Номенклатура,
		               |	ВложенныйЗапрос.Поставщик,
		               |	МАКСИМУМ(ВложенныйЗапрос.Цена) КАК Цена,
		               |	ВложенныйЗапрос.ЕстьЦена КАК ЕстьЦена,
		               |	МАКСИМУМ(ВложенныйЗапрос.ЦенаДок) КАК ЦенаДок,
		               |	ВложенныйЗапрос.Валюта,
		               |	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
		               |	ВложенныйЗапрос.ЕдиницаИзмерения
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен,
		               |		ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		               |		ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		               |		ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик,
		               |		ЦеныНоменклатурыСрезПоследних.Номенклатура.ЕстьЦена КАК ЕстьЦена,
		               |		0 КАК ЦенаДок,
		               |		ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
		               |		ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |		ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		               |	ИЗ
		               |		РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		               |				&Момент,
		               |				ТипЦен В (&списЦен)
		               |					И Номенклатура.ВидНоменклатуры = &ВидН
		               |					И Поставщик = &Поставщик) КАК ЦеныНоменклатурыСрезПоследних
		               |	
		               |	СГРУППИРОВАТЬ ПО
		               |		ЦеныНоменклатурыСрезПоследних.ТипЦен,
		               |		ЦеныНоменклатурыСрезПоследних.Номенклатура,
		               |		ЦеныНоменклатурыСрезПоследних.Цена,
		               |		ЦеныНоменклатурыСрезПоследних.Поставщик,
		               |		ЦеныНоменклатурыСрезПоследних.Номенклатура.ЕстьЦена,
		               |		ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры,
		               |		ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения,
		               |		ЦеныНоменклатурыСрезПоследних.Валюта
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		УстановкаЦенНоменклатурыТовары.ТипЦен,
		               |		УстановкаЦенНоменклатурыТовары.Номенклатура,
		               |		0,
		               |		УстановкаЦенНоменклатурыТовары.Поставщик,
		               |		УстановкаЦенНоменклатурыТовары.Номенклатура.ЕстьЦена,
		               |		УстановкаЦенНоменклатурыТовары.Цена,
		               |		УстановкаЦенНоменклатурыТовары.Валюта,
		               |		УстановкаЦенНоменклатурыТовары.ХарактеристикаНоменклатуры,
		               |		УстановкаЦенНоменклатурыТовары.ЕдиницаИзмерения
		               |	ИЗ
		               |		Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
		               |	ГДЕ
		               |		УстановкаЦенНоменклатурыТовары.Ссылка = &Док
		               |	
		               |	СГРУППИРОВАТЬ ПО
		               |		УстановкаЦенНоменклатурыТовары.ТипЦен,
		               |		УстановкаЦенНоменклатурыТовары.Номенклатура,
		               |		УстановкаЦенНоменклатурыТовары.Поставщик,
		               |		УстановкаЦенНоменклатурыТовары.Номенклатура.ЕстьЦена,
		               |		УстановкаЦенНоменклатурыТовары.Цена,
		               |		УстановкаЦенНоменклатурыТовары.Валюта,
		               |		УстановкаЦенНоменклатурыТовары.ХарактеристикаНоменклатуры,
		               |		УстановкаЦенНоменклатурыТовары.ЕдиницаИзмерения) КАК ВложенныйЗапрос
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВложенныйЗапрос.ТипЦен,
		               |	ВложенныйЗапрос.Номенклатура,
		               |	ВложенныйЗапрос.Поставщик,
		               |	ВложенныйЗапрос.ЕстьЦена,
		               |	ВложенныйЗапрос.Валюта,
		               |	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
		               |	ВложенныйЗапрос.ЕдиницаИзмерения";
		Запрос.УстановитьПараметр("Момент",НачалоДня(Дата)-1);
		Запрос.УстановитьПараметр("ВидН",ВидНоменклатуры);
		Запрос.УстановитьПараметр("Док",Ссылка);
		
		Запрос.УстановитьПараметр("Поставщик",УстановкаЦенПоставщика.Контрагент);
//		Запрос.УстановитьПараметр("СписНом",СписНом);
		
		СписЦен = Новый СписокЗначений;
		Для Каждого С Из ТипыЦен Цикл
			СписЦен.Добавить(С.ТипЦен);
		КонецЦикла;
		Запрос.УстановитьПараметр("СписЦен",СписЦен);
		
		Рез = Запрос.Выполнить().Выбрать();
		
		 Роз = Справочники.ТипыНоменклатуры.НайтиПоКоду("000000001");
		Пока Рез.Следующий() Цикл
			если ЗначениеЗаполнено(рЕз.Цена) и Не ЗначениеЗаполнено(Рез.ЦенаДок)  Тогда
				Движение = Движения.ЦеныНоменклатуры.Добавить();
				Движение.Активность = Истина;
				ДВижение.Валюта = Рез.Валюта;
				Движение.ЕдиницаИзмерения = Рез.ЕдиницаИзмерения;
				Движение.ХарактеристикаНоменклатуры = Рез.ХарактеристикаНоменклатуры;
				Движение.Номенклатура = Рез.Номенклатура;
				Движение.Период = Дата-1;
				Движение.ТипЦен = Рез.ТипЦен;
				Движение.Цена = "";
				Движение.Поставщик = "";
				Движение.СпособРасчетаЦены = "";
				Движение.ПроцентСкидкиНаценки = "";
				//Если Рез.ЕстьЦена = Истина и Рез.Типцен = Роз Тогда
				//	НомО = Рез.Номенклатура.ПолучитьОбъект();
				//	НомО.ЕстьЦена = Ложь;
				//	попытка
				//		НомО.Записать();
				//	Исключение
				//	КонецПопытки;
				//КонецЕслИ;
				
			КонецЕслИ;
			//если ЗначениеЗаполнено(Рез.ЦенаДок)  Тогда
			//	Если Рез.ЕстьЦена =Ложь и Рез.Типцен = Роз Тогда
			//		НомО = Рез.Номенклатура.ПолучитьОбъект();
			//		НомО.ЕстьЦена = Истина;
			//		попытка
			//			НомО.Записать();
			//		Исключение
			//		КонецПопытки;
			//		
			//	КонецЕсли;
			//	КонецЕсли;
			
		КонецЦикла;
	КонецеслИ;	
//	Если ЗначениеЗаполнено(УстановкаЦенПоставщика) Тогда
//		НоменклатураФильтр1 = СписНом;
//		Струк = Новый Структура;
//		Струк.Вставить("ВидНоменклатуры",ВидНоменклатуры);
//		//Ном = Справочники.Номенклатура.Выбрать(,,Струк);
//		//Пока Ном.Следующий() Цикл
//рез1.Сбросить();
//Пока Рез1.Следующий() Цикл
//			Ном = Рез1.Номенклатура;
//			Нашли = Ложь;
//			Отбор = Новый Структура();
//			Отбор.Вставить("Номенклатура",Ном.Ссылка);
//			Строки = Товары.НайтиСтроки(Отбор);
//			Для Каждого Стр из Строки Цикл
//				если Стр.Цена >0 Тогда
//					Нашли = Истина;
//					Прервать;
//				конецЕслИ;
//			КонецЦикла;
//			Если Не Нашли Тогда
//				Если Рез1.ЕстьЦена = Истина Тогда
//					НомО = Ном.ПолучитьОбъект();
//					НомО.ЕстьЦена = Ложь;
//					Попытка
//						НомО.Записать();
//					Исключение
//					КонецПопытки;
//				КонецЕслИ;
//			Иначе
//				Если Рез1.ЕстьЦена = Ложь Тогда
//					НомО = Ном.ПолучитьОбъект();
//					НомО.ЕстьЦена = Истина;
//					попытка
//						НомО.Записать();
//					Исключение
//					КонецПопытки;
//				КонецЕслИ;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;   


Если Не Отказ тогда 

	Попытка
		ТипЦен = ТипыЦен.Найти(Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("ionity.tires",,,),"ТипЦен");
		Если ТипЦен = Неопределено тогда
			Возврат;
		КонецЕсли; 
		
		НоменклатураКИскоючению = Новый Массив;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	УстановкаЦенНоменклатурыТовары.Номенклатура,
		                      |	УстановкаЦенНоменклатурыТовары.Цена
		                      |ИЗ
		                      |	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
		                      |ГДЕ
		                      |	УстановкаЦенНоменклатурыТовары.ТипЦен = &ТипЦен
		                      |	И УстановкаЦенНоменклатурыТовары.Ссылка = &Ссылка
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	УстановкаЦенНоменклатурыКонтрагентовТовары.Номенклатура,
		                      |	УстановкаЦенНоменклатурыКонтрагентовТовары.Цена
		                      |ИЗ
		                      |	Документ.УстановкаЦенНоменклатурыКонтрагентов.Товары КАК УстановкаЦенНоменклатурыКонтрагентовТовары
		                      |ГДЕ
		                      |	УстановкаЦенНоменклатурыКонтрагентовТовары.ТипЦен = &ТипЦен
		                      |	И УстановкаЦенНоменклатурыКонтрагентовТовары.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("ТипЦен",Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("ionity.tires",,,));
		Товарыврем = Запрос.Выполнить().Выгрузить();
		Номенклатура = Товарыврем.ВыгрузитьКолонку("Номенклатура"); 
		
		
		// ПреДок ------------------------
		ПреДок = Неопределено;
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	УстановкаЦенНоменклатурыТипыЦен.Ссылка
		                      |ИЗ
		                      |	Документ.УстановкаЦенНоменклатуры.ТипыЦен КАК УстановкаЦенНоменклатурыТипыЦен
		                      |ГДЕ
		                      |	УстановкаЦенНоменклатурыТипыЦен.Ссылка.ВидНоменклатуры = &ВидНоменклатуры
		                      |	И УстановкаЦенНоменклатурыТипыЦен.Ссылка.КонтрагентРасчета = &КонтрагентРасчета
		                      |	И УстановкаЦенНоменклатурыТипыЦен.Ссылка.Дата <= &Дата
		                      |	И УстановкаЦенНоменклатурыТипыЦен.ТипЦен = &ТипЦен
		                      |	И УстановкаЦенНоменклатурыТипыЦен.Ссылка <> &Ссылка
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	УстановкаЦенНоменклатурыТипыЦен.Ссылка
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	УстановкаЦенНоменклатурыТипыЦен.Ссылка.Дата УБЫВ");
		
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("ТипЦен",Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("ionity.tires",,,));
		Запрос.УстановитьПараметр("Дата",Дата);
		Запрос.УстановитьПараметр("КонтрагентРасчета",Ссылка.КонтрагентРасчета);  
		Запрос.УстановитьПараметр("ВидНоменклатуры",Ссылка.ВидНоменклатуры);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() цикл
			ПреДок = Выборка.Ссылка;	
		КонецЦикла;  
		
		Если ПреДок <> Неопределено тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	УстановкаЦенНоменклатурыТовары.Номенклатура
			                      |ИЗ
			                      |	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
			                      |ГДЕ
			                      |	НЕ УстановкаЦенНоменклатурыТовары.Номенклатура В (&Номенклатура)
			                      |	И УстановкаЦенНоменклатурыТовары.Ссылка = &Ссылка
			                      |
			                      |СГРУППИРОВАТЬ ПО
			                      |	УстановкаЦенНоменклатурыТовары.Номенклатура");
			Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
			Запрос.УстановитьПараметр("Ссылка",ПреДок);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() цикл
				НоваяСтр = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр, Выборка);
				Номенклатура.Добавить(Выборка.Номенклатура); 
				НоменклатураКИскоючению.Добавить(Выборка.Номенклатура);
			КонецЦикла; 	
		КонецЕсли;
		// ПреДок
				
		//Сообщить("Документ успішно зареєстрований до вивантаження на сайт. Ви можете продовжувати користуватись програмою, невдовзі оновлені дані з'являться на сайті.");
		
		ЭтоЦеныНомеклатуры = Истина;
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Дата);
		МассивПараметров.Добавить(Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("ionity.tires",,,));
		МассивПараметров.Добавить(Ссылка); 
		МассивПараметров.Добавить(ЭтоЦеныНомеклатуры);
		МассивПараметров.Добавить(Номенклатура);
		МассивПараметров.Добавить(НоменклатураКИскоючению);
		МассивПараметров.Добавить(Строка(Ссылка));
		МассивПараметров.Добавить("MagentoID"); 
		ФоновыеЗадания.Выполнить("БП_ОбменMagentoВФоне.БП_ВыполнитьОтправкуНаСайтЦеныНоменклатуры", МассивПараметров,,"ОтправкаЦенНоменклатурыНаСайт");
		Сообщить("Вивантаження номенклатури на сайт почалось. Ви можете продовжувати користуватись програмою, невдовзі оновлені дані з'являться на сайті.");
	Исключение    
		Сообщить(ОписаниеОшибки());
		Сообщить("Не вдалося запустити вивантаження на сайт. Зверніться до адміністратора!");
	КонецПопытки;
	
	//Garazh
	Попытка
		ТипЦен = ТипыЦен.Найти(Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("GarazhUA",,,),"ТипЦен");
		Если ТипЦен = Неопределено тогда
			Возврат;
		КонецЕсли; 
		
		НоменклатураКИскоючению = Новый Массив;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	УстановкаЦенНоменклатурыТовары.Номенклатура,
		                      |	УстановкаЦенНоменклатурыТовары.Цена
		                      |ИЗ
		                      |	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
		                      |ГДЕ
		                      |	УстановкаЦенНоменклатурыТовары.ТипЦен = &ТипЦен
		                      |	И УстановкаЦенНоменклатурыТовары.Ссылка = &Ссылка
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	УстановкаЦенНоменклатурыКонтрагентовТовары.Номенклатура,
		                      |	УстановкаЦенНоменклатурыКонтрагентовТовары.Цена
		                      |ИЗ
		                      |	Документ.УстановкаЦенНоменклатурыКонтрагентов.Товары КАК УстановкаЦенНоменклатурыКонтрагентовТовары
		                      |ГДЕ
		                      |	УстановкаЦенНоменклатурыКонтрагентовТовары.ТипЦен = &ТипЦен
		                      |	И УстановкаЦенНоменклатурыКонтрагентовТовары.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("ТипЦен",Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("GarazhUA",,,));
		Товарыврем = Запрос.Выполнить().Выгрузить();
		Номенклатура = Товарыврем.ВыгрузитьКолонку("Номенклатура"); 
		
		// ПреДок ------------------------
		ПреДок = Неопределено;
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	УстановкаЦенНоменклатурыТипыЦен.Ссылка
		                      |ИЗ
		                      |	Документ.УстановкаЦенНоменклатуры.ТипыЦен КАК УстановкаЦенНоменклатурыТипыЦен
		                      |ГДЕ
		                      |	УстановкаЦенНоменклатурыТипыЦен.Ссылка.ВидНоменклатуры = &ВидНоменклатуры
		                      |	И УстановкаЦенНоменклатурыТипыЦен.Ссылка.КонтрагентРасчета = &КонтрагентРасчета
		                      |	И УстановкаЦенНоменклатурыТипыЦен.Ссылка.Дата <= &Дата
		                      |	И УстановкаЦенНоменклатурыТипыЦен.ТипЦен = &ТипЦен
		                      |	И УстановкаЦенНоменклатурыТипыЦен.Ссылка <> &Ссылка
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	УстановкаЦенНоменклатурыТипыЦен.Ссылка
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	УстановкаЦенНоменклатурыТипыЦен.Ссылка.Дата УБЫВ");
		
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Запрос.УстановитьПараметр("ТипЦен",Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("GarazhUA",,,));
		Запрос.УстановитьПараметр("Дата",Дата);
		Запрос.УстановитьПараметр("КонтрагентРасчета",Ссылка.КонтрагентРасчета);  
		Запрос.УстановитьПараметр("ВидНоменклатуры",Ссылка.ВидНоменклатуры);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() цикл
			ПреДок = Выборка.Ссылка;	
		КонецЦикла;  
		
		Если ПреДок <> Неопределено тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	УстановкаЦенНоменклатурыТовары.Номенклатура
			                      |ИЗ
			                      |	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
			                      |ГДЕ
			                      |	НЕ УстановкаЦенНоменклатурыТовары.Номенклатура В (&Номенклатура)
			                      |	И УстановкаЦенНоменклатурыТовары.Ссылка = &Ссылка
			                      |
			                      |СГРУППИРОВАТЬ ПО
			                      |	УстановкаЦенНоменклатурыТовары.Номенклатура");
			Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
			Запрос.УстановитьПараметр("Ссылка",ПреДок);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() цикл
				НоваяСтр = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтр, Выборка);
				Номенклатура.Добавить(Выборка.Номенклатура);
				НоменклатураКИскоючению.Добавить(Выборка.Номенклатура);
			КонецЦикла; 	
		КонецЕсли;
		// ПреДок
		//Сообщить("Документ успішно зареєстрований до вивантаження на сайт. Ви можете продовжувати користуватись програмою, невдовзі оновлені дані з'являться на сайті.");
		
		ЭтоЦеныНомеклатуры = Истина;
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Дата);
		МассивПараметров.Добавить(Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("GarazhUA",,,));
		МассивПараметров.Добавить(Ссылка); 
		МассивПараметров.Добавить(ЭтоЦеныНомеклатуры);
		МассивПараметров.Добавить(Номенклатура); 
		МассивПараметров.Добавить(НоменклатураКИскоючению); 
		МассивПараметров.Добавить(Строка(Ссылка));
		МассивПараметров.Добавить("MagentoGarazhID"); 
		
		//БП_ОбменMagentoВФоне.БП_ВыполнитьОтправкуНаСайтЦеныНоменклатуры(Дата, Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("GarazhUA",,,),Ссылка,ЭтоЦеныНомеклатуры,Номенклатура,НоменклатураКИскоючению,Строка(Ссылка), "MagentoGarazhID");
		
		
		ФоновыеЗадания.Выполнить("БП_ОбменMagentoВФоне.БП_ВыполнитьОтправкуНаСайтЦеныНоменклатуры", МассивПараметров,,"ОтправкаЦенНоменклатурыНаСайтGarazhUA");
		Сообщить("Вивантаження номенклатури на сайт GarazhUA почалось. Ви можете продовжувати користуватись програмою, невдовзі оновлені дані з'являться на сайті.");
	Исключение    
		Сообщить(ОписаниеОшибки());
		Сообщить("Не вдалося запустити вивантаження на сайт GarazhUA. Зверніться до адміністратора!");
	КонецПопытки;
	
КонецЕсли;

	
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	мУдалятьДвижения = НЕ ЭтоНовый();

	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	Информация = "";
	Для Каждого ТекущийТип Из ТипыЦен Цикл
		Если Информация <> "" Тогда
			Информация = Информация + ", ";
		КонецЕсли;
		Информация = Информация + СокрЛП(ТекущийТип.ТипЦен);
	КонецЦикла;

КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаУдаленияПроведения(Отказ)

	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры // ОбработкаУдаленияПроведения



мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
мВалютаУправленческогоУчета     = глЗначениеПеременной("ВалютаУправленческогоУчета");
мИспользоватьХарактеристики     = глЗначениеПеременной("ИспользоватьХарактеристикиНоменклатуры");

