Функция ПолучитьТокен_Хорошоп(НастройкиПодключений) Экспорт
	
	Рез = Новый Структура;
	Рез.Вставить("Статус","");
	Рез.Вставить("Сообщение","");
	Рез.Вставить("Токен","");
	
	Соединение = СоздатьHTTPСоединение(НастройкиПодключений);
	АдресСкриптаАутентификация 	= "/" +СокрЛП(НастройкиПодключений.АдресСкриптаАутентификация);
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept-Language","ru");
	Заголовки.Вставить("Accept-Charset","UTF-8");
	Заголовки.Вставить("Content-Language","ru");
	Заголовки.Вставить("Content-Charset","UTF-8");
	Заголовки.Вставить("Content-Type","application/x-www-form-urlencoded; charset=UTF-8");
	
	ПараметрыПОСТ = "login=#login#&password=#pass#";
	ПараметрыПОСТ = СтрЗаменить(ПараметрыПОСТ,"#login#",НастройкиПодключений.ИмяПользователя);
	ПараметрыПОСТ = СтрЗаменить(ПараметрыПОСТ,"#pass#",НастройкиПодключений.Пароль);
	
	HTTPЗапрос = Новый HTTPЗапрос(АдресСкриптаАутентификация,Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыПОСТ,"Windows-1251"); //"UTF-8");
	
	HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
	
	
	
	ЧтениеДЖС = Новый ЧтениеJSON;
	ЧтениеДЖС.УстановитьСтроку(ТекстОтвета);
	
	Строки = ПрочитатьJSON(ЧтениеДЖС);
	Рез.Вставить("Статус", Строки.status);
	
	Если Строки.status = "OK" Тогда
		Рез.Вставить("Токен",Строки.response.token);
	Иначе
		Рез.Вставить("Сообщение", Строки.response.message);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции	

Функция СоздатьHTTPСоединение (НастройкиПодключений) Экспорт
	
	Если НастройкиПодключений.ЗащищенноеСоединение Тогда
		Порт    = 443;
		ЗС 		= Новый ЗащищенноеСоединениеOpenSSL; 
	Иначе
		Порт    = 80;
		ЗС 		= Неопределено; 
	КонецЕсли;
	
	Адрес          = НастройкиПодключений.Адрес;
	Пользователь   = НастройкиПодключений.ИмяПользователя;
	Пароль         = НастройкиПодключений.Пароль;
	ИнтернетПрокси = Неопределено;
	АдресСкриптаАутентификация = СокрЛП(НастройкиПодключений.АдресСкриптаАутентификация);
	
	Соединение = Новый HTTPСоединение(Адрес, Порт, Пользователь, Пароль, ИнтернетПрокси,,ЗС);
	
	Возврат Соединение;
	
КонецФункции

Функция УбратьШлакИзСтроки(Знач а) Экспорт
	Рез = СтрЗаменить(а,Символы.НПП,"");
	Возврат СокрЛП(Рез);
КонецФункции	

Процедура ДобавитьЗаписьДЖС(ЗаписьДЖС,Имя,Значение)
	ЗаписьДЖС.ЗаписатьНачалоОбъекта();
	ЗаписьДЖС.ЗаписатьИмяСвойства(Имя);
	ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(Значение));
	ЗаписьДЖС.ЗаписатьКонецОбъекта();
КонецПроцедуры	

Функция ВыгрузкаЦен_Хорошоп(табл,ТабЧасть,НастройкиПодключений,ОбновитьТовары=Ложь, СхемаОбмена, Успешно = Ложь) Экспорт
	Успешно = Истина;
	Рез = Новый Структура;
	Рез.Вставить("Успешно",Ложь);
	Рез.Вставить("Сообщение","");
	
	ИмяРеквизитаИдентификатора = СокрЛП(СхемаОбмена.РеквизитИдентификацииНоменклатуры);
	
	ТокенРез = ПолучитьТокен_Хорошоп(НастройкиПодключений); 
	Если ТокенРез.Статус = "OK" Тогда
		ТокенСтр = ТокенРез.Токен; 
	Иначе
		Сообщить(ТокенРез.Сообщение);
		Успешно = Ложь;
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
		ИмяИсходящегоФайла = СхемаОбмена.ПапкаФайлаЛога + "hs_price.json";
	Иначе
		ИмяИсходящегоФайла = ПолучитьИмяВременногоФайла("json");
	КонецЕсли;
	
	Соединение = СоздатьHTTPСоединение(НастройкиПодключений);
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept-Language","ru");
	Заголовки.Вставить("Accept-Charset","UTF-8");
	Заголовки.Вставить("Content-Language","ru");
	Заголовки.Вставить("Content-Charset","UTF-8");
	Заголовки.Вставить("Content-Type","application/json");
	
	Лимит = СхемаОбмена.РазмерПакетаПереаваемыхДанных;
	Если Лимит = 0 тогда
		 Лимит = 300;
	КонецЕсли; 
	
	Кво = Табл.Количество();
	КвоВыгружено = 0;
	Пока КвоВыгружено < Кво Цикл
		
		Файл = Новый Файл(ИмяИсходящегоФайла);
		Если Файл.Существует() ТОгда
			УдалитьФайлы(Файл);
		КонецЕсли;	
		
		ЗаписьДЖС = Новый ЗаписьJSON;
		ЗаписьДЖС.ПроверятьСтруктуру = Истина;
		ПараметрыЗаписиДЖС = Новый ПараметрыЗаписиJSON(,Символы.Таб);
		ЗаписьДЖС.ОткрытьФайл(ИмяИсходящегоФайла,КодировкаТекста.UTF8,Ложь,ПараметрыЗаписиДЖС);
		
		ЗаписьДЖС.ЗаписатьНачалоОбъекта();
		ЗаписьДЖС.ЗаписатьИмяСвойства("token");
		ЗаписьДЖС.ЗаписатьЗначение(ТокенСтр);
		ЗаписьДЖС.ЗаписатьИмяСвойства("products");
		ЗаписьДЖС.ЗаписатьНачалоМассива();
		
		КвоВПорции = 0;
		Для хх = КвоВыгружено ПО Кво - 1 Цикл
			//
			Стр = Табл[хх];
			
			КвоВПорции = КвоВПорции + 1;
			
			ЗаписьДЖС.ЗаписатьНачалоОбъекта();
			ЗаписьДЖС.ЗаписатьИмяСвойства("article");
			ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(Стр.КодТовара));
			//
			выгружатьЦену = Истина;
			Если стр.Цена = 0 Тогда
				Если НЕ стр.ВыгружатьНулевыеЦеныПрайс Тогда
					выгружатьЦену = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если выгружатьЦену Тогда
				ЗаписьДЖС.ЗаписатьИмяСвойства("price");
				Ц = СтрЗаменить(Стр.Цена,",",".");
				Ц = СтрЗаменить(Ц,Символы.НПП,"");
				ЗаписьДЖС.ЗаписатьЗначение(Ц);
			КонецЕсли;
			//
			выгружатьЦену = Истина;
			Если стр.ЦенаСтарая = 0 Тогда
				Если НЕ стр.ВыгружатьНулевыеЦеныСтарая Тогда
					выгружатьЦену = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если выгружатьЦену Тогда
				ЗаписьДЖС.ЗаписатьИмяСвойства("price_old");
				Ц = СтрЗаменить(Стр.ЦенаСтарая,",",".");
				Ц = СтрЗаменить(Ц,Символы.НПП,"");
				ЗаписьДЖС.ЗаписатьЗначение(Ц);
			КонецЕсли;
			//
			ЗаписьДЖС.ЗаписатьИмяСвойства("currency");
			Если Стр.ВалютаИД = Неопределено Тогда
				ЗаписьДЖС.ЗаписатьЗначение(Стр.ВалютаСтр);
			Иначе
				ЗаписьДЖС.ЗаписатьНачалоОбъекта();
				ЗаписьДЖС.ЗаписатьИмяСвойства("id");
				ЗаписьДЖС.ЗаписатьЗначение(Стр.ВалютаИД);
				ЗаписьДЖС.ЗаписатьКонецОбъекта();
			КонецЕсли;
			//
			ЗаписьДЖС.ЗаписатьИмяСвойства("discount");
			ЗаписьДЖС.ЗаписатьЗначение("0");
			
			// остатки привязаны к ценам, если 0 - нет в наличии
			КоличествоСПривязкойКЦене = ?(Стр.Цена=0,0,1);
			Наличие = ПолучитьНаличие(КоличествоСПривязкойКЦене,СхемаОбмена);
			ЗаписьДЖС.ЗаписатьИмяСвойства("presence");
			ЗаписьДЖС.ЗаписатьЗначение(наличие);
			
			//
			ЗаписьДЖС.ЗаписатьКонецОбъекта();
			Если КвоВПорции >= Лимит Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;	  
		КвоВыгружено = КвоВыгружено + КвоВПорции;
		
		ЗаписьДЖС.ЗаписатьКонецМассива();
		ЗаписьДЖС.ЗаписатьКонецОбъекта();
		
		ЗаписьДЖС.Закрыть();	
		//
		Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
			ИмяФайлаОтвета = СхемаОбмена.ПапкаФайлаЛога + "hs_price_answ.json";
		Иначе
			ИмяФайлаОтвета = ПолучитьИмяВременногоФайла("json");
		КонецЕсли;
		
		АдресСкриптаЦены       		= СокрЛП(НастройкиПодключений.АдресСкриптаВыгрузкаЦен);
		ОбновлениеКаталога = Ложь;
		Если ОбновитьТовары Тогда
			АдресСкриптаЦены		 	= СокрЛП(НастройкиПодключений.АдресСкриптаВыгрузкаТоваров);
			ОбновлениеКаталога = Истина;
		КонецЕсли;
		
		Соединение.ОтправитьДляОбработки(ИмяИсходящегоФайла, АдресСкриптаЦены, ИмяФайлаОтвета, Заголовки);
		
		ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
		
		Если ФайлОтвета.Существует() Тогда
			
			ТекстОтвета = Новый ТекстовыйДокумент();
			ТекстОтвета.Прочитать(ИмяФайлаОтвета);
			Если ТекстОтвета.КоличествоСтрок()>0 Тогда
				ОтветСервера = ТекстОтвета.ПолучитьТекст();	
			Иначе
				Т = "Получен пустой ответ сервера.";
				Сообщить(Т);
				Успешно = Ложь;
				Возврат Неопределено;
			КонецЕсли;	
			
		Иначе	
			Т = "Ответ сервера не получен.";
			Сообщить(Т);
			Успешно = Ложь;
			Возврат Неопределено;
		КонецЕсли;
		
		ОбработкаОтвета(ИмяФайлаОтвета, НастройкиПодключений, ТабЧасть, ОбновлениеКаталога, "ОтветЦена",Успешно);				
	
	КонецЦикла;
	
	Рез.Вставить("Успешно",Истина);	
	Возврат Рез;
	
КонецФункции

Процедура ОбработкаОтвета(ИмяФайлаОтвета, НастройкиПодключений, ТабЧасть, ОбновлениеКаталога=Ложь, ИмяРеквизитаТабЧасти = "ТекстОтвета", Успешно = Истина)
	
	Если ТабЧасть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеДЖС = Новый ЧтениеJSON;
	ЧтениеДЖС.ОткрытьФайл(ИмяФайлаОтвета);
	Записи = ПрочитатьJSON(ЧтениеДЖС);
	Статус = ""; МассивОтвет = Новый Массив;
	Для Каждого Запись Из Записи Цикл
		Если Запись.Ключ = "status" Тогда
			Статус = Запись.Значение;
		КонецЕсли;
		Если Запись.Ключ = "response" Тогда
			МассивОтвет = Запись.Значение;
		КонецЕсли;
	КонецЦикла;
	
	МассивЗначенийЛога = Новый Массив;
	Для Каждого Эл Из МассивОтвет Цикл
		МассивЗначенийЛога = Эл.Значение;
	КонецЦикла;
	Если (Статус = "ERROR")  ИЛИ (Статус = "HTTP_ERROR") Тогда
		Сообщить(МассивЗначенийЛога);
		Возврат;
	КонецЕсли;
	
	ИдТовара = ""; МассивОтветовПоЭлементу = Новый Массив;
	КодОтвета = ""; ТекстОтвета = "";
	Для Каждого Эл2 Из МассивЗначенийЛога Цикл
		ИдТовара    = УбратьШлакИзСтроки(Эл2.article); //хорошоп возвращает без лидирующих нулей
		Если ОбновлениеКаталога Тогда
			КодОтвета   = Эл2.info[0].Code;
			ТекстОтвета = Эл2.info[0].message;
		Иначе
			КодОтвета   = Эл2.status;
			ТекстОтвета = Эл2.message;	
		КонецЕсли;
		
		//
		стр = ТабЧасть.Найти(ИдТовара,"ИД");
		Если стр <> Неопределено Тогда
			Если ОбновлениеКаталога Тогда
				Если Найти(ТекстОтвета,"Товар обновлен") > 0 Тогда
					Стр.Результат = "Обновлен";
				ИначеЕсли Найти(ТекстОтвета,"Товар добавлен") > 0 Тогда 	
					Стр.Результат = "Добавлен";
				Иначе
					Стр.Результат = ТекстОтвета;
				КонецЕсли;
			Иначе
				Если Найти(ТекстОтвета,"UPDATED") > 0 Тогда
					Стр.Результат = "Обновлен";
				Иначе
					Стр.Результат = "Ошибка";//Перечисления.ВариантыОтветаСервераНоменклатура.Ошибка;
				КонецЕсли;
			КонецЕсли;
			Стр.КодОтвета = КодОтвета;
			Если КодОтвета <> 0 И КодОтвета <> "OK" ТОгда
				Успешно = Ложь;
			КонецЕсли;	
			Стр[ИмяРеквизитаТабЧасти] = ТекстОтвета;
		КонецЕсли;	
		//
	КонецЦикла;

КонецПроцедуры

Функция ВыгрузкаНаличия_Хорошоп(табл,ТабЧасть,НастройкиПодключений, СхемаОбмена, Успешно = Ложь) Экспорт
	
	Успешно = Истина;
	Рез = Новый Структура;
	Рез.Вставить("Успешно",Ложь);
	Рез.Вставить("Сообщение","");
	
	ИмяРеквизитаИдентификатора = СокрЛП(СхемаОбмена.РеквизитИдентификацииНоменклатуры);
	
	ТокенРез = ПолучитьТокен_Хорошоп(НастройкиПодключений); 
	Если ТокенРез.Статус = "OK" Тогда
		ТокенСтр = ТокенРез.Токен; 
	Иначе
		Сообщить(ТокенРез.Сообщение);
		Успешно = Ложь;
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
		ИмяИсходящегоФайла = СхемаОбмена.ПапкаФайлаЛога + "hs_res.json";
	Иначе
		ИмяИсходящегоФайла = ПолучитьИмяВременногоФайла("json");
	КонецЕсли;
	
	Если СхемаОбмена.ВыгружатьОстатокКакСтатус Тогда
		АдресСкриптаОстатки 	= СокрЛП(НастройкиПодключений.АдресСкриптаВыгрузкаТоваров);
		ИдСтатус	 			= "presence";
	Иначе
		АдресСкриптаОстатки     = СокрЛП(НастройкиПодключений.АдресСкриптаВыгрузкаОстатков);
		ИдСтатус	 			= "quantity";
	КонецЕсли;
	
	Кво = Табл.Количество();
	Для хх = 1 По Кво Цикл
		ТекСтр = Табл[Кво - хх];
		выгружатьОстаток = Истина;
		Если ТекСтр.Наличие = 0 Тогда
			Если НЕ ТекСтр.ВыгружатьНулевыеОстатки Тогда
				Табл.Удалить(ТекСтр);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;		
	
	Кво = Табл.Количество();
	КвоВыгружено = 0;
	Лимит = СхемаОбмена.РазмерПакетаПереаваемыхДанных;
	Если Лимит = 0 тогда
		 Лимит = 300;
	КонецЕсли; 
	
	Соединение = СоздатьHTTPСоединение(НастройкиПодключений);
		
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept-Language","ru");
	Заголовки.Вставить("Accept-Charset","UTF-8");
	Заголовки.Вставить("Content-Language","ru");
	Заголовки.Вставить("Content-Charset","UTF-8");
	Заголовки.Вставить("Content-Type","application/json");
	
	Пока КвоВыгружено < Кво Цикл
		Файл = Новый Файл(ИмяИсходящегоФайла);
		Если Файл.Существует() Тогда
			УдалитьФайлы(ИмяИсходящегоФайла);
		КонецЕсли;

		ЗаписьДЖС = Новый ЗаписьJSON;
		ЗаписьДЖС.ПроверятьСтруктуру = Истина;
		ПараметрыЗаписиДЖС = Новый ПараметрыЗаписиJSON(,Символы.Таб);
		ЗаписьДЖС.ОткрытьФайл(ИмяИсходящегоФайла,КодировкаТекста.UTF8,Ложь,ПараметрыЗаписиДЖС);
		
		ЗаписьДЖС.ЗаписатьНачалоОбъекта();
		ЗаписьДЖС.ЗаписатьИмяСвойства("token");
		ЗаписьДЖС.ЗаписатьЗначение(ТокенСтр);
		ЗаписьДЖС.ЗаписатьИмяСвойства("products");
		ЗаписьДЖС.ЗаписатьНачалоМассива();
		КвоВПорции = 0;
		Для хх = КвоВыгружено По Кво - 1 Цикл
			Стр = Табл[хх];
			КвоВПорции = КвоВПорции + 1;
			
			ЗаписьДЖС.ЗаписатьНачалоОбъекта();
			ЗаписьДЖС.ЗаписатьИмяСвойства("article");
			ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(Стр.КодТовара));
			//
			Если НЕ СхемаОбмена.ВыгружатьОстатокКакСтатус Тогда
				ЗаписьДЖС.ЗаписатьИмяСвойства("warehouse");
				ЗаписьДЖС.ЗаписатьЗначение("office");
			КонецЕсли;
			//
			
			наличие = ПолучитьНаличие(Стр.Наличие,СхемаОбмена);
			ЗаписьДЖС.ЗаписатьИмяСвойства(ИдСтатус);
			ЗаписьДЖС.ЗаписатьЗначение(наличие);
			//
			ЗаписьДЖС.ЗаписатьКонецОбъекта();
			Если КвоВПорции >= Лимит Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		КвоВыгружено = КвоВыгружено + КвоВПорции;
		ЗаписьДЖС.ЗаписатьКонецМассива();
		ЗаписьДЖС.ЗаписатьКонецОбъекта();
		
		ЗаписьДЖС.Закрыть();	
		//
		Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
			ИмяФайлаОтвета = СхемаОбмена.ПапкаФайлаЛога + "hs_res_answ.json";
		Иначе
			ИмяФайлаОтвета = ПолучитьИмяВременногоФайла("json");
		КонецЕсли;
		
		ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
		Если ФайлОтвета.Существует() Тогда
			УдалитьФайлы(ИмяФайлаОтвета);
		КонецЕсли;	
			
		Соединение.ОтправитьДляОбработки(ИмяИсходящегоФайла, АдресСкриптаОстатки, ИмяФайлаОтвета, Заголовки);
		
		ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
		
		Если ФайлОтвета.Существует() Тогда
			
			ТекстОтвета = Новый ТекстовыйДокумент();
			ТекстОтвета.Прочитать(ИмяФайлаОтвета);
			Если ТекстОтвета.КоличествоСтрок()>0 Тогда
				ОтветСервера = ТекстОтвета.ПолучитьТекст();	
			Иначе
				Т = "Получен пустой ответ сервера.";
				Успешно = Ложь;
				Сообщить(Т);
				Возврат Неопределено;
			КонецЕсли;	
			
		Иначе	
			Т = "Ответ сервера не получен.";
			Сообщить(Т);
			Успешно = Ложь;
			Возврат Неопределено;
		КонецЕсли;
		
		ОбработкаОтвета(ИмяФайлаОтвета, НастройкиПодключений, ТабЧасть, СхемаОбмена.ВыгружатьОстатокКакСтатус, "ОтветОстаток", Успешно);
	КонецЦикла;		
	Рез.Вставить("Успешно",Истина);	
	Возврат Рез;
	
КонецФункции

Функция ПолучитьНаличие(Остаток,СхемаОбмена)
	
	Если НЕ СхемаОбмена.ВыгружатьОстатокКакСтатус Тогда
		Возврат Остаток;
	КонецЕсли;
	
	//определим статус
	Для каждого текСтр Из СхемаОбмена.СтатусыОстатков Цикл
		Если Остаток <= текСтр.ВерхняяГраница Тогда
			Возврат СокрЛП(текСтр.Статус);
		КонецЕсли;
	КонецЦикла		
 	
	
КонецФункции

Функция СтандартизироватьТелефон(ИсходныйТелефон)
	Телефон = СокрЛП(ИсходныйТелефон);
	Рез = "";
	Длина = СтрДлина(Телефон);
	Для хх = 1 По Длина Цикл
		ТекСимвол = Сред(Телефон, хх, 1);
		Если Найти("0123456789", ТекСимвол) Тогда
			Рез = Рез + ТекСимвол;
		КонецЕсли;	
	КонецЦикла;	
	
	Рез = Прав(Рез, 10);
	Если СтрДлина(Рез) = 10 И Лев(Рез, 1) = "0" Тогда
		Возврат "+38" + Рез;
	КонецЕсли;
КонецФункции	

Функция ВыгрузкаКонтрагентов_Хорошоп(СхемаОбмена, НастройкиПодключений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкидкиНаценкиНоменклатурыСрезПоследних.ПолучательСкидки,
	|	СкидкиНаценкиНоменклатурыСрезПоследних.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	СкидкиНаценкиНоменклатурыСрезПоследних.ДатаОкончания
	|ПОМЕСТИТЬ ВсеСкидки
	|ИЗ
	|	РегистрСведений.СкидкиНаценкиНоменклатуры.СрезПоследних(
	|			,
	|			ПолучательСкидки ССЫЛКА Справочник.Контрагенты
	|				И Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И (ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ ДатаОкончания > &ДатаСреза)
	|				И Условие = ЗНАЧЕНИЕ(Перечисление.УсловияСкидкиНаценки.ПоКоличествуТовара)
	|				И ЗначениеУсловия = 0) КАК СкидкиНаценкиНоменклатурыСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СкидкиНаценкиНоменклатурыСрезПоследних.ЗначениеУсловия.ВладелецКарты,
	|	СкидкиНаценкиНоменклатурыСрезПоследних.ПроцентСкидкиНаценки,
	|	СкидкиНаценкиНоменклатурыСрезПоследних.ДатаОкончания
	|ИЗ
	|	РегистрСведений.СкидкиНаценкиНоменклатуры.СрезПоследних(
	|			,
	|			ПолучательСкидки = ЗНАЧЕНИЕ(Справочник.ДоговорыКОнтрагентов.ПустаяСсылка)
	|				И Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И (ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ ДатаОкончания > &ДатаСреза)
	|				И Условие = ЗНАЧЕНИЕ(Перечисление.УсловияСкидкиНаценки.ПоДисконтнойКарте)
	|				И ЗначениеУсловия ССЫЛКА Справочник.ИнформационныеКарты) КАК СкидкиНаценкиНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеСкидки.ПолучательСкидки,
	|	МАКСИМУМ(ВсеСкидки.ПроцентСкидкиНаценки) КАК ПроцентСкидкиНаценки
	|ПОМЕСТИТЬ МаксимальныйПроцент
	|ИЗ
	|	ВсеСкидки КАК ВсеСкидки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеСкидки.ПолучательСкидки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеСкидки.ПолучательСкидки,
	|	ВсеСкидки.ПроцентСкидкиНаценки,
	|	МИНИМУМ(ВсеСкидки.ДатаОкончания) КАК ДатаОкончания
	|ПОМЕСТИТЬ Скидки
	|ИЗ
	|	ВсеСкидки КАК ВсеСкидки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныйПроцент КАК МаксимальныйПроцент
	|		ПО ВсеСкидки.ПолучательСкидки = МаксимальныйПроцент.ПолучательСкидки
	|			И ВсеСкидки.ПроцентСкидкиНаценки = МаксимальныйПроцент.ПроцентСкидкиНаценки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеСкидки.ПолучательСкидки,
	|	ВсеСкидки.ПроцентСкидкиНаценки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Наименование,
	|	ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(100)) КАК Емейл,
	|	Скидки.ПроцентСкидкиНаценки КАК Скидка,
	|	КонтактнаяИнформацияТелефон.Представление КАК Телефон,
	|	КонтактнаяИнформацияАдрес.Представление КАК Адрес,
	|	КонтактнаяИнформацияАдрес.Поле4 КАК Город,
	|	Скидки.ДатаОкончания КАК СрокДействияСкидки
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Скидки КАК Скидки
	|			ПО Контрагенты.Ссылка = Скидки.ПолучательСкидки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
	|			ПО Контрагенты.Ссылка = КонтактнаяИнформацияТелефон.Объект
	|				И (КонтактнаяИнформацияТелефон.Вид = &ТелефонКонтрагента)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияАдрес
	|			ПО Контрагенты.Ссылка = КонтактнаяИнформацияАдрес.Объект
	|				И (КонтактнаяИнформацияАдрес.Вид = &АдресКонтрагента)
	|		ПО КонтактнаяИнформация.Объект = Контрагенты.Ссылка
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))";
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
	Запрос.УстановитьПараметр("ТелефонКонтрагента", Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	Запрос.УстановитьПараметр("АдресКонтрагента", Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	Выборка = Запрос.Выполнить().Выбрать();

	Рез = Новый Структура;
	Рез.Вставить("Успешно",Ложь);
	Рез.Вставить("Сообщение","");
	
	ТокенРез = ПолучитьТокен_Хорошоп(НастройкиПодключений); 
	
	Если ТокенРез.Статус = "OK" Тогда
		ТокенСтр = ТокенРез.Токен; 
	Иначе
		Рез.Вставить("Сообщение", ТокенРез.Сообщение);
		Успешно = Ложь;
		Возврат Рез;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
		ИмяИсходящегоФайла = СхемаОбмена.ПапкаФайлаЛога + "hs_clients.json";
	Иначе
		ИмяИсходящегоФайла = ПолучитьИмяВременногоФайла("json");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
		ИмяФайлаОтвета = СхемаОбмена.ПапкаФайлаЛога + "hs_clients_answ.json";
	Иначе
		ИмяФайлаОтвета = ПолучитьИмяВременногоФайла("json");
	КонецЕсли;
	
	АдресСкриптаВыгрузка       = НастройкиПодключений.АдресСкриптаВыгрузкаКонтрагентов;
	
	Соединение = СоздатьHTTPСоединение(НастройкиПодключений);
		
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept-Language","ru");
	Заголовки.Вставить("Accept-Charset","UTF-8");
	Заголовки.Вставить("Content-Language","ru");
	Заголовки.Вставить("Content-Charset","UTF-8");
	Заголовки.Вставить("Content-Type","application/json");
	
	Лимит = СхемаОбмена.РазмерПакетаПереаваемыхДанных;
	Если Лимит = 0 тогда
		 Лимит = 300;
	КонецЕсли; 
	Пока Истина ЦИкл
	
		ЗаписьДЖС = Новый ЗаписьJSON;
		ЗаписьДЖС.ПроверятьСтруктуру = Истина;
		ПараметрыЗаписиДЖС = Новый ПараметрыЗаписиJSON(,Символы.Таб);
		ЗаписьДЖС.ОткрытьФайл(ИмяИсходящегоФайла,КодировкаТекста.UTF8,Ложь,ПараметрыЗаписиДЖС);
		//ЗаписьДЖС.УстановитьСтроку();
			
		ЗаписьДЖС.ЗаписатьНачалоОбъекта();
		ЗаписьДЖС.ЗаписатьИмяСвойства("token");
		ЗаписьДЖС.ЗаписатьЗначение(ТокенСтр);
		ЗаписьДЖС.ЗаписатьИмяСвойства("users");
		ЗаписьДЖС.ЗаписатьНачалоМассива();
		
		КвоЗаписейВФайле = 0;
		Пока Выборка.Следующий() Цикл
			Если Не ЗначениеЗаполнено(Выборка.Наименование) Тогда
				Продолжить;
			КонецЕсли;	
			
			КвоЗаписейВФайле = КвоЗаписейВФайле + 1;
			//
			ЗаписьДЖС.ЗаписатьНачалоОбъекта();
			
			ЗаписьДЖС.ЗаписатьИмяСвойства("title");
			ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(Выборка.Наименование));
			
			ЗаписьДЖС.ЗаписатьИмяСвойства("email");
			ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(Выборка.Емейл));
			
			СтандартизированныйТелефон = СтандартизироватьТелефон(Выборка.Телефон);
			Если ЗначениеЗаполнено(СтандартизированныйТелефон) Тогда
				ЗаписьДЖС.ЗаписатьИмяСвойства("phone");
				ЗаписьДЖС.ЗаписатьЗначение(СтандартизированныйТелефон);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СокрЛП(Выборка.Город)) Тогда
				ЗаписьДЖС.ЗаписатьИмяСвойства("city");
				ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(Выборка.Город));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СокрЛП(Выборка.Адрес)) Тогда
				ЗаписьДЖС.ЗаписатьИмяСвойства("address");
				ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(Выборка.Адрес));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.Скидка) Тогда
				ЗаписьДЖС.ЗаписатьИмяСвойства("discount_card");
				ЗаписьДЖС.ЗаписатьНачалоОбъекта();
				ЗаписьДЖС.ЗаписатьИмяСвойства("discount");
				ЗаписьДЖС.ЗаписатьЗначение(Формат(Выборка.Скидка, "ЧГ="));
				
				ЗаписьДЖС.ЗаписатьИмяСвойства("active");
				ЗаписьДЖС.ЗаписатьЗначение(1);
				
				Если ЗначениеЗаполнено(Выборка.СрокДействияСкидки) Тогда
					ЗаписьДЖС.ЗаписатьИмяСвойства("date_limit");
					ЗаписьДЖС.ЗаписатьЗначение(Формат(Выборка.СрокДействияСкидки, "ДФ=yyyy-MM-dd"));
				Иначе	
					ЗаписьДЖС.ЗаписатьИмяСвойства("date_limit");
					ЗаписьДЖС.ЗаписатьЗначение(Формат(ДобавитьМесяц(ТекущаяДата(), 12), "ДФ=yyyy-MM-dd"));
				КонецЕсли;	
				
				ЗаписьДЖС.ЗаписатьИмяСвойства("status");
				ЗаписьДЖС.ЗаписатьЗначение(1);
				
				ЗаписьДЖС.ЗаписатьКонецОбъекта();
			КонецЕсли;	
			
			ЗаписьДЖС.ЗаписатьКонецОбъекта();
			Если КвоЗаписейВФайле >= Лимит Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		Если КвоЗаписейВФайле = 0 Тогда
			Прервать;
		КонецЕсли;	
		ЗаписьДЖС.ЗаписатьКонецМассива();
		ЗаписьДЖС.ЗаписатьКонецОбъекта();
		
		ЗаписьДЖС.Закрыть();	
		//
		
		ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
		Если ФайлОтвета.Существует() Тогда
			УдалитьФайлы(ИмяФайлаОтвета);
		КонецЕсли;
		
		Соединение.ОтправитьДляОбработки(ИмяИсходящегоФайла, АдресСкриптаВыгрузка, ИмяФайлаОтвета, Заголовки);
			
		ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
		
		Если ФайлОтвета.Существует() Тогда
			
			ТекстОтвета = Новый ТекстовыйДокумент();
			ТекстОтвета.Прочитать(ИмяФайлаОтвета, "UTF-8");
			Если ТекстОтвета.КоличествоСтрок()>0 Тогда
				ОтветСервера = ТекстОтвета.ПолучитьТекст();	
				
				Чтение = Новый ЧтениеJSON;
				Чтение.УстановитьСтроку(ОтветСервера);
				СтруктураОтвета = ПрочитатьJSON(Чтение);
				Если СтруктураОтвета.status = "OK" Тогда
					Рез.Вставить("Успешно", Истина);
					Возврат Рез;
				Иначе
					Рез.Вставить("Успешно", Ложь);
					Рез.Вставить("Сообщение", ОтветСервера);
					Возврат Рез;
				КонецЕсли;	
			Иначе
				Т = "Получен пустой ответ сервера.";
				Сообщить(Т);
				Рез.Вставить("Успешно",Ложь);
				Рез.Вставить("Сообщение",Т);
				Возврат Рез;
			КонецЕсли;	
			
		Иначе	
			Т = "Ответ сервера не получен.";
			Сообщить(Т);
			Рез.Вставить("Успешно",Ложь);
			Рез.Вставить("Сообщение",Т);
			Успешно = Ложь;
			Возврат Рез;
		КонецЕсли;
		
		//ОбработкаОтвета(ИмяФайлаОтвета, НастройкиПодключений, ТабЧасть,Истина,, Успешно);
	КонецЦикла;
	//ОчисткаРегистрацииНовых(сп);
			
	Рез.Вставить("Успешно",Истина);	
	Возврат Рез;
	
КонецФункции

Функция ВыгрузкаТоваров_Хорошоп(Сп,ТабЧасть,НастройкиПодключений, СхемаОбмена, Успешно) Экспорт
	Успешно = Истина;
	
	ЗапросСвойств = Новый Запрос;
	ЗапросСвойств.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Свойство.сви_КодВэбСинхронизации КАК КодСвойства,
	|	ЗначенияСвойствОбъектов.Значение,
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство.сви_ВидРеквизитаНаСайте КАК ВидРеквизитаНаСайте
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство.сви_КодВэбСинхронизации <> """"
	|	И ЗначенияСвойствОбъектов.Свойство.сви_СинхронизироватьССайтом";
	ТаблСвойств = ЗапросСвойств.Выполнить().Выгрузить();
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Владелец,
	|	МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод
	|ПОМЕСТИТЬ ШтрихкодыТоваров
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.Характеристикиноменклатуры.пустаяСсылка)
	|	И &ИмяРеквизита = ""Штрихкод""
	|
	|СГРУППИРОВАТЬ ПО
	|	Штрихкоды.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрихкоды.Владелец,
	|	МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод,
	|	Штрихкоды.ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ШтрихкодыХарактеристик
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.ХарактеристикаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.Характеристикиноменклатуры.пустаяСсылка)
	|	И &ИмяРеквизита = ""Штрихкод""
	|
	|СГРУППИРОВАТЬ ПО
	|	Штрихкоды.Владелец,
	|	Штрихкоды.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблНоменклатураХарактеристики.Номенклатура,
	|	ТаблНоменклатураХарактеристики.Характеристика
	|ПОМЕСТИТЬ ТаблНоменклатураХарактеристики
	|ИЗ
	|	&ТаблНоменклатураХарактеристики КАК ТаблНоменклатураХарактеристики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.Код КАК Код,
	|	ЕСТЬNULL(Номенклатура.Родитель.сви_КодВэбСинхронизации, """") КАК РодительКодВэбСинхронизации,
	|	Номенклатура.Наименование КАК НоменклатураНаименование,
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.сви_КодВэбСинхронизации КАК НоменклатураКодВэбСинхронизации,
	|	Номенклатура.Комментарий,
	|	ХарактеристикиНоменклатуры.сви_ГлавныйЭлемент,
	|	ХарактеристикиНоменклатуры.сви_КодВэбСинхронизации,
	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
	|ПОМЕСТИТЬ ДанныеСХарактеристиками
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ПО (ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка)
	|ГДЕ
	|	Номенклатура.Ссылка В(&сп)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСХарактеристиками.Ссылка
	|ПОМЕСТИТЬ ТоварыБезХарактеристик
	|ИЗ
	|	ДанныеСХарактеристиками КАК ДанныеСХарактеристиками
	|ГДЕ
	|	ДанныеСХарактеристиками.Характеристика ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеСХарактеристиками.Характеристика,
	|	ДанныеСХарактеристиками.Ссылка
	|ПОМЕСТИТЬ ТоварыИХарактеристики
	|ИЗ
	|	ДанныеСХарактеристиками КАК ДанныеСХарактеристиками
	|ГДЕ
	|	НЕ ДанныеСХарактеристиками.Характеристика ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыИХарактеристики.Ссылка
	|ПОМЕСТИТЬ ТоварыСХарактеристиками
	|ИЗ
	|	ТоварыИХарактеристики КАК ТоварыИХарактеристики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыИХарактеристики.Ссылка,
	|	МАКСИМУМ(ТоварыИХарактеристики.Характеристика) КАК Характеристика
	|ПОМЕСТИТЬ ТоварыИОсновныеХарактеристики
	|ИЗ
	|	ТоварыСХарактеристиками КАК ТоварыСХарактеристиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыИХарактеристики КАК ТоварыИХарактеристики
	|		ПО ТоварыСХарактеристиками.Ссылка = ТоварыИХарактеристики.Ссылка
	|			И (ТоварыИХарактеристики.Характеристика.сви_ГлавныйЭлемент)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыИХарактеристики.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыИХарактеристики.Ссылка КАК Номенклатура,
	|	МАКСИМУМ(ТоварыИХарактеристики.Характеристика) КАК Характеристика
	|ПОМЕСТИТЬ ОсновныеХарактеристикиТоваров
	|ИЗ
	|	ТоварыИХарактеристики КАК ТоварыИХарактеристики
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИОсновныеХарактеристики КАК ТоварыИОсновныеХарактеристики
	|		ПО ТоварыИХарактеристики.Ссылка = ТоварыИОсновныеХарактеристики.Ссылка
	|ГДЕ
	|	ТоварыИОсновныеХарактеристики.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыИХарактеристики.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыИОсновныеХарактеристики.Ссылка,
	|	ТоварыИОсновныеХарактеристики.Характеристика
	|ИЗ
	|	ТоварыИОсновныеХарактеристики КАК ТоварыИОсновныеХарактеристики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеХарактеристикиТоваров.Номенклатура,
	|	МАКСИМУМ(ОсновныеХарактеристикиТоваров.Характеристика.сви_КодВэбСинхронизации) КАК КодОсновнойХарактеристики
	|ПОМЕСТИТЬ КодыОсновныхХарактеристик
	|ИЗ
	|	ОсновныеХарактеристикиТоваров КАК ОсновныеХарактеристикиТоваров
	|ГДЕ
	|	&ИмяРеквизита <> ""Штрихкод""
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеХарактеристикиТоваров.Номенклатура
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШтрихкодыХарактеристик.Владелец,
	|	МАКСИМУМ(ШтрихкодыХарактеристик.Штрихкод) 
	|ИЗ
	|	ОсновныеХарактеристикиТоваров КАК ОсновныеХарактеристикиТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШтрихкодыХарактеристик КАК ШтрихкодыХарактеристик
	|		ПО ОсновныеХарактеристикиТоваров.Характеристика = ШтрихкодыХарактеристик.ХарактеристикаНоменклатуры
	|ГДЕ
	|	&ИмяРеквизита = ""Штрихкод""
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыХарактеристик.Владелец ; ";
	
	
	Если СхемаОбмена.ХранениеКатегорийСайта = Перечисления.сви_ВидыХраненияКатегорийСайта.ГруппыНоменклатуры Тогда
		
		ЗапросГруппДляВыгрузки = Новый Запрос;
		ЗапросГруппДляВыгрузки.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа
		|	И Номенклатура.сви_ВыгружатьНаСайт";
		ГруппыДляВыгрузки = ЗапросГруппДляВыгрузки.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
		Запрос.Текст = Запрос.Текст +
	 	"ВЫБРАТЬ
	 	|	КодыОсновныхХарактеристик.КодОсновнойХарактеристики,
	 	|	СпрНоменклатура.Ссылка,
	 	|	СпрНоменклатура.Код,
	 	|	СпрНоменклатура.Родитель.сви_КодВэбСинхронизации КАК РодительКодВэбСинхронизации,
	 	|	СпрНоменклатура.Наименование КАК НоменклатураНаименование,
	 	|	СпрНоменклатура.Артикул,
	 	|	ИСТИНА КАК ПоляХарактеристик,
	 	|	ХарактеристикиНоменклатуры.сви_КодВэбСинхронизации,
	 	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	 	|	ВЫБОР
	 	|		КОГДА ХарактеристикиНоменклатуры.сви_КодВэбСинхронизации ЕСТЬ NULL
	 	|			ТОГДА ИСТИНА
	 	|		ИНАЧЕ ВЫБОР КОГДА &ИмяРеквизита = ""Штрихкод"" ТОГДА ШтрихкодыХарактеристик.Штрихкод ИНАЧЕ ХарактеристикиНоменклатуры.сви_КодВэбСинхронизации КОНЕЦ = КодыОсновныхХарактеристик.КодОсновнойХарактеристики
	 	|	КОНЕЦ КАК ОсновнойТовар,
	 	|	СпрНоменклатура.Комментарий,
	 	|	СпрНоменклатура.ДополнительноеОписаниеНоменклатуры,
	 	|	ЕСТЬNULL(ШтрихкодыХарактеристик.Штрихкод, ШтрихкодыТоваров.Штрихкод) КАК Штрихкод
	 	|ИЗ
	 	|	Справочник.Номенклатура КАК СпрНоменклатура
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	 	|			ЛЕВОЕ СОЕДИНЕНИЕ КодыОсновныхХарактеристик КАК КодыОсновныхХарактеристик
	 	|			ПО ХарактеристикиНоменклатуры.Владелец = КодыОсновныхХарактеристик.Номенклатура
	 	|			ЛЕВОЕ СОЕДИНЕНИЕ ШтрихкодыХарактеристик КАК ШтрихкодыХарактеристик
	 	|			ПО ХарактеристикиНоменклатуры.Ссылка = ШтрихкодыХарактеристик.ХарактеристикаНоменклатуры
	 	|				И ХарактеристикиНоменклатуры.Владелец = ШтрихкодыХарактеристик.Владелец
	 	|		ПО СпрНоменклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ ШтрихкодыТоваров КАК ШтрихкодыТоваров
	 	|		ПО СпрНоменклатура.Ссылка = ШтрихкодыТоваров.Владелец
	 	|			И (СпрНоменклатура.ВестиУчетПоХарактеристикам = ЛОЖЬ)
	 	|ГДЕ
	 	|	СпрНоменклатура.Родитель.сви_ВыгружатьНаСайт = ИСТИНА
	 	|	И (СпрНоменклатура.Ссылка, ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) В
	 	|			(ВЫБРАТЬ
	 	|				ТаблНоменклатураХарактеристики.Номенклатура,
	 	|				ТаблНоменклатураХарактеристики.Характеристика
	 	|			ИЗ
	 	|				ТаблНоменклатураХарактеристики КАК ТаблНоменклатураХарактеристики)
	 	|	И СпрНоменклатура.Ссылка В ИЕРАРХИИ(&ГруппыДляВыгрузки)
	 	|
	 	|УПОРЯДОЧИТЬ ПО
	 	|	ОсновнойТовар УБЫВ";
			
		Запрос.УстановитьПараметр("ГруппыДляВыгрузки", ГруппыДляВыгрузки);
	Иначе
		
		Запрос.Текст = Запрос.Текст +
	 	"ВЫБРАТЬ
	 	|	КодыОсновныхХарактеристик.КодОсновнойХарактеристики,
	 	|	СпрНоменклатура.Ссылка,
	 	|	СпрНоменклатура.Код,
	 	|	СпрНоменклатура.Наименование КАК НоменклатураНаименование,
	 	|	СпрНоменклатура.Артикул,
	 	|	ИСТИНА КАК ПоляХарактеристик,
	 	|	ХарактеристикиНоменклатуры.сви_КодВэбСинхронизации,
	 	|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	 	|	ВЫБОР
	 	|		КОГДА ХарактеристикиНоменклатуры.сви_КодВэбСинхронизации ЕСТЬ NULL
	 	|			ТОГДА ИСТИНА
	 	|		ИНАЧЕ ВЫБОР
	 	|				КОГДА &ИмяРеквизита = ""Штрихкод""
	 	|					ТОГДА ШтрихкодыХарактеристик.Штрихкод
	 	|				ИНАЧЕ ХарактеристикиНоменклатуры.сви_КодВэбСинхронизации
	 	|			КОНЕЦ = КодыОсновныхХарактеристик.КодОсновнойХарактеристики
	 	|	КОНЕЦ КАК ОсновнойТовар,
	 	|	СпрНоменклатура.Комментарий,
	 	|	СпрНоменклатура.ДополнительноеОписаниеНоменклатуры,
	 	|	ЕСТЬNULL(мпи_ЗначенияКатегорийНоменклатуры.Значение.КодВэбСинхронизации, """") КАК РодительКодВэбСинхронизации,
	 	|	ЕСТЬNULL(ШтрихкодыХарактеристик.Штрихкод, ШтрихкодыТоваров.Штрихкод) КАК Штрихкод,
	 	|	ВложенныйЗапрос.ДатаПроизводства,
	 	|	ВложенныйЗапрос.Страна
	 	|ИЗ
	 	|	Справочник.Номенклатура КАК СпрНоменклатура
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	 	|			ЛЕВОЕ СОЕДИНЕНИЕ КодыОсновныхХарактеристик КАК КодыОсновныхХарактеристик
	 	|			ПО ХарактеристикиНоменклатуры.Владелец = КодыОсновныхХарактеристик.Номенклатура
	 	|			ЛЕВОЕ СОЕДИНЕНИЕ ШтрихкодыХарактеристик КАК ШтрихкодыХарактеристик
	 	|			ПО ХарактеристикиНоменклатуры.Ссылка = ШтрихкодыХарактеристик.ХарактеристикаНоменклатуры
	 	|				И ХарактеристикиНоменклатуры.Владелец = ШтрихкодыХарактеристик.Владелец
	 	|		ПО СпрНоменклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мпи_ЗначенияКатегорийНоменклатуры КАК мпи_ЗначенияКатегорийНоменклатуры
	 	|		ПО (мпи_ЗначенияКатегорийНоменклатуры.НоменклатураОбъект = СпрНоменклатура.Ссылка)
	 	|			И (мпи_ЗначенияКатегорийНоменклатуры.ВидКатегории = &ВидКатегорий)
	 	|			И (мпи_ЗначенияКатегорийНоменклатуры.Основная)
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ ШтрихкодыТоваров КАК ШтрихкодыТоваров
	 	|		ПО СпрНоменклатура.Ссылка = ШтрихкодыТоваров.Владелец
	 	|			И (СпрНоменклатура.ВестиУчетПоХарактеристикам = ЛОЖЬ)
	 	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	 	|			МАКСИМУМ(ДатыПроизводства.ДатаПроизводства) КАК ДатаПроизводства,
	 	|			МАКСИМУМ(ДатыПроизводства.Страна) КАК Страна,
	 	|			ДатыПроизводства.Номенклатура КАК Номенклатура
	 	|		ИЗ
	 	|			РегистрСведений.ДатыПроизводства КАК ДатыПроизводства
	 	|		
	 	|		СГРУППИРОВАТЬ ПО
	 	|			ДатыПроизводства.Номенклатура) КАК ВложенныйЗапрос
	 	|		ПО СпрНоменклатура.Ссылка = ВложенныйЗапрос.Номенклатура
	 	|			И СпрНоменклатура.Ссылка = ВложенныйЗапрос.Номенклатура
	 	|ГДЕ
	 	|	(СпрНоменклатура.Ссылка, ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) В
	 	|			(ВЫБРАТЬ
	 	|				ТаблНоменклатураХарактеристики.Номенклатура,
	 	|				ТаблНоменклатураХарактеристики.Характеристика
	 	|			ИЗ
	 	|				ТаблНоменклатураХарактеристики КАК ТаблНоменклатураХарактеристики)
	 	|
	 	|УПОРЯДОЧИТЬ ПО
	 	|	ОсновнойТовар УБЫВ";
		Запрос.УстановитьПараметр("ВидКатегорий", СхемаОбмена.ВидКатегорийНоменклатуры);
	КонецЕсли;	
		
	Запрос.УстановитьПараметр("сп", сп);
	ТаблНоменклатураХарактеристики = ТабЧасть.Выгрузить(,"Номенклатура, Характеристика");
	Запрос.УстановитьПараметр("ТаблНоменклатураХарактеристики", ТаблНоменклатураХарактеристики);
	
	Если СхемаОбмена.ХранениеКатегорийСайта = Перечисления.сви_ВидыХраненияКатегорийСайта.КатегорииНоменклатуры Тогда
		ЗапросДопКатегорий = Новый Запрос;
		ЗапросДопКатегорий.Текст = 
		"ВЫБРАТЬ
		|	мпи_ЗначенияКатегорийНоменклатуры.НоменклатураОбъект,
		|	мпи_ЗначенияКатегорийНоменклатуры.Значение.КодВэбСинхронизации КАК КодВэбСинхронизации
		|ИЗ
		|	РегистрСведений.мпи_ЗначенияКатегорийНоменклатуры КАК мпи_ЗначенияКатегорийНоменклатуры
		|ГДЕ
		|	мпи_ЗначенияКатегорийНоменклатуры.ВидКатегории = &ВидКатегории
		|	И мпи_ЗначенияКатегорийНоменклатуры.Основная = ЛОЖЬ";
		ЗапросДопКатегорий.УстановитьПараметр("ВидКатегории", СхемаОбмена.ВидКатегорийНоменклатуры);
		ТаблДопКатегорий = ЗапросДопКатегорий.Выполнить().Выгрузить();
	КонецЕсли;	
	
	КвоХарактеристик = 0;
	ПоляХарактеристик = "";
	Для каждого текСтр Из СхемаОбмена.СоответствияРеквизитовИХарактеристикСайта Цикл
		Если СокрЛП(текСтр.ИмяРеквизита1С) <> "" Тогда
			ПоляХарактеристик = ПоляХарактеристик + "СпрНоменклатура."+СокрЛП(текСтр.ИмяРеквизита1С)+","+Символы.ПС;
			КвоХарактеристик = КвоХарактеристик + 1;
		КонецЕсли;
	КонецЦикла;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА КАК ПоляХарактеристик,", ПоляХарактеристик);
	
	ИмяРеквизитаИдентификатора = СокрЛП(СхемаОбмена.РеквизитИдентификацииНоменклатуры);
	
	Запрос.УстановитьПараметр("ИмяРеквизита", ИмяРеквизитаИдентификатора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Рез = Новый Структура;
	Рез.Вставить("Успешно",Ложь);
	Рез.Вставить("Сообщение","");
	
	
	ТокенРез = ПолучитьТокен_Хорошоп(НастройкиПодключений); 
	
	Если ТокенРез.Статус = "OK" Тогда
		ТокенСтр = ТокенРез.Токен; 
	Иначе
		Рез.Вставить("Сообщение", ТокенРез.Сообщение);
		Успешно = Ложь;
		Возврат Рез;
	КонецЕсли;
	
	КодЯзыка = ?(ЗначениеЗаполнено(СхемаОбмена.КодЯзыка),СхемаОбмена.КодЯзыка,"ru");
	
	Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
		ИмяИсходящегоФайла = СхемаОбмена.ПапкаФайлаЛога + "hs_goods.json";
	Иначе
		ИмяИсходящегоФайла = ПолучитьИмяВременногоФайла("json");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
		ИмяФайлаОтвета = СхемаОбмена.ПапкаФайлаЛога + "hs_goods_answ.json";
	Иначе
		ИмяФайлаОтвета = ПолучитьИмяВременногоФайла("json");
	КонецЕсли;
	
	АдресСкриптаВыгрузка       = НастройкиПодключений.АдресСкриптаВыгрузкаТоваров;
	
	Соединение = СоздатьHTTPСоединение(НастройкиПодключений);
		
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept-Language",КодЯзыка);
	Заголовки.Вставить("Accept-Charset","UTF-8");
	Заголовки.Вставить("Content-Language",КодЯзыка);
	Заголовки.Вставить("Content-Charset","UTF-8");
	Заголовки.Вставить("Content-Type","application/json");
	
	Лимит = СхемаОбмена.РазмерПакетаПереаваемыхДанных;
	Если Лимит = 0 тогда
		 Лимит = 300;
	КонецЕсли; 
	Пока Истина ЦИкл
	
		ЗаписьДЖС = Новый ЗаписьJSON;
		ЗаписьДЖС.ПроверятьСтруктуру = Истина;
		ПараметрыЗаписиДЖС = Новый ПараметрыЗаписиJSON(,Символы.Таб);
		ЗаписьДЖС.ОткрытьФайл(ИмяИсходящегоФайла,КодировкаТекста.UTF8,Ложь,ПараметрыЗаписиДЖС);
		//ЗаписьДЖС.УстановитьСтроку();
			
		ЗаписьДЖС.ЗаписатьНачалоОбъекта();
		ЗаписьДЖС.ЗаписатьИмяСвойства("token");
		ЗаписьДЖС.ЗаписатьЗначение(ТокенСтр);
		ЗаписьДЖС.ЗаписатьИмяСвойства("products");
		ЗаписьДЖС.ЗаписатьНачалоМассива();
		
		УстанавливатьВидимостьТовараНаСайте = СхемаОбмена.УстанавливатьВидимостьТовараНаСайте;
		КвоЗаписейВФайле = 0;
		Пока Выборка.Следующий() Цикл
			Если ИмяРеквизитаИдентификатора <> "Штрихкод" И ЗначениеЗаполнено(Выборка.Характеристика) И НЕ ЗначениеЗаполнено(Выборка.сви_КодВэбСинхронизации) Тогда
				Сообщить("Для характеристики """ + Выборка.Характеристика + """ не указан код веб-синхронизации");
				Продолжить;
			КонецЕсли;	
			
			КвоЗаписейВФайле = КвоЗаписейВФайле + 1;
			//
			ЗаписьДЖС.ЗаписатьНачалоОбъекта();
			ЗаписьДЖС.ЗаписатьИмяСвойства("article");
			// -+-+
			ИД = Выборка[ИмяРеквизитаИдентификатора];
			Если ИмяРеквизитаИдентификатора <> "Штрихкод" И  ЗначениеЗаполнено(Выборка.Характеристика) Тогда
				ИД = Выборка.сви_КодВэбСинхронизации;
			КонецЕсли;	
			ИД = СокрЛП(ИД);
			ЗаписьДЖС.ЗаписатьЗначение(ИД);
			
			Если СхемаОбмена.ВедетсяУчетПоМодификациям Тогда
				Если Выборка.ОсновнойТовар = Истина Тогда
					ЗаписьДЖС.ЗаписатьИмяСвойства("parent_article");
					ЗаписьДЖС.ЗаписатьЗначение(ИД);
				ИначеЕсли ЗначениеЗаполнено(Выборка.КодОсновнойХарактеристики) ТОгда
					ЗаписьДЖС.ЗаписатьИмяСвойства("parent_article");
					ЗаписьДЖС.ЗаписатьЗначение(Выборка.КодОсновнойХарактеристики);
				КонецЕсли; 	
			КонецЕсли; 	
			
			Наим = Выборка.НоменклатураНаименование;
		    ЗаписьДЖС.ЗаписатьИмяСвойства("title");
			
			
			//с.д.(
			//ДобавитьЗаписьДЖС(ЗаписьДЖС,КодЯзыка,Наим);
			ЗаписьДЖС.ЗаписатьНачалоОбъекта();
			ЗаписьДЖС.ЗаписатьИмяСвойства(КодЯзыка);
			ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(Наим));
			ЗаписьДЖС.ЗаписатьИмяСвойства("ua");
			ЗаписьДЖС.ЗаписатьЗначение(ПеревестиНаУкраинский(Наим));
			ЗаписьДЖС.ЗаписатьКонецОбъекта(); 
			
			
			ЗаписьДЖС.ЗаписатьИмяСвойства("brand");
			ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(Выборка.Ссылка.Производитель));
			
			Знач_icons = "";
			Знач_icons = ""+?(Выборка.Ссылка.Распродажа_СайтХорошоп_СД,"Распродажа","");
			Знач_icons = ""+Знач_icons+?(Выборка.Ссылка.Новинка_СайтХорошоп_СД,?(Знач_icons = "","",",")+"Новинка","");
			Знач_icons = ""+Знач_icons+?(Выборка.Ссылка.Хит_СайтХорошоп_СД,?(Знач_icons = "","",",")+"Хит",""); 

			ЗаписьДЖС.ЗаписатьИмяСвойства("icons");
			ЗаписьДЖС.ЗаписатьНачалоМассива();
			//ЗаписьДЖС.ЗаписатьЗначение(Знач_icons);
			Если Выборка.Ссылка.Распродажа_СайтХорошоп_СД Тогда
				ЗаписьДЖС.ЗаписатьЗначение("Распродажа");	
			КонецЕсли;
			Если Выборка.Ссылка.Новинка_СайтХорошоп_СД Тогда
				ЗаписьДЖС.ЗаписатьЗначение("Новинка");	
			КонецЕсли;
			Если Выборка.Ссылка.Хит_СайтХорошоп_СД Тогда
				ЗаписьДЖС.ЗаписатьЗначение("Хит");	
			КонецЕсли;
			ЗаписьДЖС.ЗаписатьКонецМассива();  
			
			ЗаписьДЖС.ЗаписатьИмяСвойства("export_to_marketplace");
			ЗаписьДЖС.ЗаписатьЗначение("Google Feed for Merchant Center;Hotline Feed");
			//с.д.)
					
			//ЗаписьДЖС.ЗаписатьЗначение(Наим);
			//Если Не выборка.ГлавныйЭлемент Тогда
			    ЗаписьДЖС.ЗаписатьИмяСвойства("mod_title");
				Если ЗначениеЗаполнено(Выборка.Характеристика) И СхемаОбмена.ДополнятьНаименованиеИменемМодификации Тогда
					
					//с.д.( 
					//ДобавитьЗаписьДЖС(ЗаписьДЖС,КодЯзыка,Наим + " " + СокрЛП(Выборка.Характеристика)); 
					ЗаписьДЖС.ЗаписатьНачалоОбъекта();
					ЗаписьДЖС.ЗаписатьИмяСвойства(КодЯзыка);
					ЗаписьДЖС.ЗаписатьЗначение(Наим + " " + СокрЛП(Выборка.Характеристика));
					ЗаписьДЖС.ЗаписатьИмяСвойства("ua");
					ЗаписьДЖС.ЗаписатьЗначение(ПеревестиНаУкраинский(Наим + " " + СокрЛП(Выборка.Характеристика)));
					ЗаписьДЖС.ЗаписатьКонецОбъекта();

					//с.д.)    
				Иначе	
					
					//с.д.(   
					//ДобавитьЗаписьДЖС(ЗаписьДЖС,КодЯзыка,Наим);
					ЗаписьДЖС.ЗаписатьНачалоОбъекта();
					ЗаписьДЖС.ЗаписатьИмяСвойства(КодЯзыка);
					ЗаписьДЖС.ЗаписатьЗначение(Наим);
					ЗаписьДЖС.ЗаписатьИмяСвойства("ua");
					ЗаписьДЖС.ЗаписатьЗначение(ПеревестиНаУкраинский(Наим));
					ЗаписьДЖС.ЗаписатьКонецОбъекта();
					//с.д.)
				КонецЕсли;	
				//ЗаписьДЖС.ЗаписатьЗначение(Наим);
			//КонецЕсли;
			//ДобавитьМультиязычныеОписания_Хорошоп(ЗаписьДЖС,Выборка.Ссылка,"Наименование",Выборка.Наименование);
			//
			//ЗаписьДЖС.ЗаписатьИмяСвойства("parent_article");
			//ЗаписьДЖС.ЗаписатьЗначение(ИДГлавныйЭлемент);
			//
			Если УстанавливатьВидимостьТовараНаСайте ТОгда
				ЗаписьДЖС.ЗаписатьИмяСвойства("display_in_showcase");
				ЗаписьДЖС.ЗаписатьЗначение(1);
			КонецЕсли;
			//
		    ЗаписьДЖС.ЗаписатьИмяСвойства("parent");
			ДобавитьЗаписьДЖС(ЗаписьДЖС,"id",Выборка.РодительКодВэбСинхронизации);
			Если СхемаОбмена.ХранениеКатегорийСайта = Перечисления.сви_ВидыХраненияКатегорийСайта.КатегорииНоменклатуры Тогда
				СтрокиДопКатегорий = ТаблДопКатегорий.НайтиСтроки(Новый Структура("НоменклатураОбъект", Выборка.Ссылка));
				Если СтрокиДопКатегорий.Количество() ТОгда
					ЗаписьДЖС.ЗаписатьИмяСвойства("alt_parent");
					ЗаписьДЖС.ЗаписатьНачалоМассива();	
					Для Каждого ТекСтрДопКатегорий Из СтрокиДопКатегорий Цикл
						ДобавитьЗаписьДЖС(ЗаписьДЖС,"id", ТекСтрДопКатегорий.КодВэбСинхронизации);
					КонецЦикла;
					ЗаписьДЖС.ЗаписатьКонецМассива();
				КонецЕсли;
			КонецЕсли;   
			
			
			
			//
			Если СхемаОбмена.ВыгружатьОписаниеНаСайт Тогда
				ЗаписьДЖС.ЗаписатьИмяСвойства("description");
				//++ Выгрузка форматированного описания
				СтрокаФорматированногоОписанияТовара = ПолучитьФорматированноеОписание(Выборка.Ссылка);

				Если СхемаОбмена.ВыгружатьДополнительноеОписаниеНоменклатуры ТОгда
					Если НЕ СтрокаФорматированногоОписанияТовара = "" Тогда
					    ДобавитьЗаписьДЖС(ЗаписьДЖС,КодЯзыка,СокрЛП(СтрокаФорматированногоОписанияТовара));
					Иначе				
						ДобавитьЗаписьДЖС(ЗаписьДЖС,КодЯзыка,СокрЛП(Выборка.ДополнительноеОписаниеНоменклатуры));
					КонецЕсли;
				Иначе	
					ДобавитьЗаписьДЖС(ЗаписьДЖС,КодЯзыка,СокрЛП(Выборка.Комментарий));
				КонецЕсли;
			КонецЕсли;
			
			//
			Если СхемаОбмена.ОтображатьНаСайтеАртикулТовара Тогда
				ЗаписьДЖС.ЗаписатьИмяСвойства("article_for_display");
				ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(Выборка.Артикул));
			КонецЕсли;	
			
			СтрокиСвойствТовара = ТаблСвойств.НайтиСтроки(Новый Структура("Объект, ВидРеквизитаНаСайте", Выборка.Ссылка, Перечисления.сви_ВидыРеквизитовСайта.Модификация));
			Если ЗначениеЗаполнено(Выборка.Характеристика) Тогда
				СтрокиСвойствХарактеристики = ТаблСвойств.НайтиСтроки(Новый Структура("Объект, ВидРеквизитаНаСайте", Выборка.Характеристика, Перечисления.сви_ВидыРеквизитовСайта.Модификация));
			Иначе
				СтрокиСвойствХарактеристики = Новый Массив;
			КонецЕсли;	
			
			Для Каждого ТекСтрСвойств Из СтрокиСвойствТовара Цикл
				ЗаписьДЖС.ЗаписатьИмяСвойства(ТекСтрСвойств.КодСвойства);
				ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(ТекСтрСвойств.Значение));
			КонецЦикла;	
			Для Каждого ТекСтрСвойств Из СтрокиСвойствХарактеристики Цикл
				ЗаписьДЖС.ЗаписатьИмяСвойства(ТекСтрСвойств.КодСвойства);
				ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(ТекСтрСвойств.Значение));
			КонецЦикла;	
			
			СтрокиСвойствТовара = ТаблСвойств.НайтиСтроки(Новый Структура("Объект, ВидРеквизитаНаСайте", Выборка.Ссылка, Перечисления.сви_ВидыРеквизитовСайта.Характеристика));
			Если ЗначениеЗаполнено(Выборка.Характеристика) Тогда
				СтрокиСвойствХарактеристики = ТаблСвойств.НайтиСтроки(Новый Структура("Объект, ВидРеквизитаНаСайте", Выборка.Характеристика, Перечисления.сви_ВидыРеквизитовСайта.Характеристика));
			Иначе
				СтрокиСвойствХарактеристики = Новый Массив;
			КонецЕсли;	
			
			Если КвоХарактеристик + СтрокиСвойствТовара.Количество() + СтрокиСвойствХарактеристики.Количество() > 0 ТОгда
				ЗаписьДЖС.ЗаписатьИмяСвойства("characteristics");
				ЗаписьДЖС.ЗаписатьНачалоОбъекта();
				Для Каждого ТекСтрСвойств Из СтрокиСвойствТовара Цикл
					ЗаписьДЖС.ЗаписатьИмяСвойства(ТекСтрСвойств.КодСвойства);
					ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(ТекСтрСвойств.Значение));
				КонецЦикла;	
				Для Каждого ТекСтрСвойств Из СтрокиСвойствХарактеристики Цикл
					ЗаписьДЖС.ЗаписатьИмяСвойства(ТекСтрСвойств.КодСвойства);
					ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(ТекСтрСвойств.Значение));
				КонецЦикла;
				Для каждого текСтр Из СхемаОбмена.СоответствияРеквизитовИХарактеристикСайта Цикл
					ЗаписьДЖС.ЗаписатьИмяСвойства(текСтр.ИдХарактеристикиСайта);
	                ЗаписьДЖС.ЗаписатьЗначение(Строка(Выборка [текСтр.ИмяРеквизита1С]));
				КонецЦикла; 
				
				//с.д.(
				ЗаписьДЖС.ЗаписатьИмяСвойства("dataProizvodstva");
				ЗаписьДЖС.ЗаписатьЗначение(Строка(Выборка.ДатаПроизводства));
				ЗаписьДЖС.ЗаписатьИмяСвойства("stranaProizvoditel");
				ЗаписьДЖС.ЗаписатьЗначение(Строка(Выборка.Страна));
				//с.д.)
				
				ЗаписьДЖС.ЗаписатьКОнецОбъекта();
			КонецЕсли;
			ЗаписьДЖС.ЗаписатьКонецОбъекта();
			Если КвоЗаписейВФайле >= Лимит Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		Если КвоЗаписейВФайле = 0 Тогда
			Прервать;
		КонецЕсли;	
		ЗаписьДЖС.ЗаписатьКонецМассива();
		ЗаписьДЖС.ЗаписатьИмяСвойства("beta");
		ЗаписьДЖС.ЗаписатьЗначение("true");
		ЗаписьДЖС.ЗаписатьКонецОбъекта();
		
		ЗаписьДЖС.Закрыть();	
		//
		
		ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
		Если ФайлОтвета.Существует() Тогда
			УдалитьФайлы(ИмяФайлаОтвета);
		КонецЕсли;
		
		Соединение.ОтправитьДляОбработки(ИмяИсходящегоФайла, АдресСкриптаВыгрузка, ИмяФайлаОтвета, Заголовки);
			
		ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
		
		Если ФайлОтвета.Существует() Тогда
			
			ТекстОтвета = Новый ТекстовыйДокумент();
			ТекстОтвета.Прочитать(ИмяФайлаОтвета);
			Если ТекстОтвета.КоличествоСтрок()>0 Тогда
				ОтветСервера = ТекстОтвета.ПолучитьТекст();	
			Иначе
				Т = "Получен пустой ответ сервера.";
				Сообщить(Т);
				Рез.Вставить("Успешно",Ложь);
				Рез.Вставить("Сообщение",Т);
				Успешно = Ложь;
				Возврат Рез;
			КонецЕсли;	
			
		Иначе	
			Т = "Ответ сервера не получен.";
			Сообщить(Т);
			Рез.Вставить("Успешно",Ложь);
			Рез.Вставить("Сообщение",Т);
			Успешно = Ложь;
			Возврат Рез;
		КонецЕсли;
		
		ОбработкаОтвета(ИмяФайлаОтвета, НастройкиПодключений, ТабЧасть,Истина,, Успешно);
	КонецЦикла;
	//ОчисткаРегистрацииНовых(сп);
			
	Рез.Вставить("Успешно",Истина);	
	Возврат Рез;
	
	
КонецФункции	

Функция ПолучитьФорматированноеОписание (НомСсылка)
	
	Рез = "";
	ДетальноеОписание = НомСсылка.ФорматированноеОписание.Получить();
	НачТела = Найти (ДетальноеОписание,"<BODY>") + 6;
	КонТела = Найти (ДетальноеОписание,"/BODY");
	Если НЕ НачТела + КонТела = 0 Тогда
		ТелоОписания = Сред(ДетальноеОписание, НачТела, КонТела-НачТела-1);
		Рез = ТелоОписания;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

Процедура флПриЗаписиХранилищеДополнительнойИнформацииПриЗаписи(Источник, Отказ) Экспорт
	Товар = Источник.Объект;
	Если ТипЗнч(Товар)  <> Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат;
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(Товар) Тогда
		Возврат;
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	сви_ИзмененияФотографийНоменклатуры.Номенклатура
	|ИЗ
	|	РегистрСведений.сви_ИзмененияФотографийНоменклатуры КАК сви_ИзмененияФотографийНоменклатуры
	|ГДЕ
	|	сви_ИзмененияФотографийНоменклатуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Товар);
	Если Запрос.Выполнить().Пустой() ТОгда
		МЗ = РегистрыСведений.сви_ИзмененияФотографийНоменклатуры.СоздатьМенеджерЗаписи();
		МЗ.Номенклатура = Товар;
		МЗ.Записать();
	КонецЕсли;	
КонецПроцедуры

Функция ВыгрузитьФото(МассивТоваров, НастройкиПодключения, НастройкиПодключенияФТП, ТаблЧасть, СхемаОбмена) Экспорт
	
	//Подключение = Новый FTPСоединение(НастройкиПодключенияФТП.Адрес, , НастройкиПодключенияФТП.ИмяПользователя, НастройкиПодключенияФТП.Пароль,,,15,Новый ЗащищенноеСоединениеOpenSSL);
	
	//Подключение.УстановитьТекущийКаталог("/content/import_images/"); 
	//Подключение.Удалить("/content/import_images/", "*.*");
	
	
	sessionOptions = Новый COMОбъект("WinSCP.SessionOptions"); //Создаем объект SessionOptions 
	sessionOptions.ParseUrl("ftpes://" + НастройкиПодключенияФТП.ИмяПользователя + ":" + НастройкиПодключенияФТП.Пароль + "@" + НастройкиПодключенияФТП.Адрес + "/"); 
	sessionOptions.TlsHostCertificateFingerprint = НастройкиПодключенияФТП.Ключ;
	session = Новый COMОбъект("WinSCP.Session"); //Создаем объект Session 
	session.Open(sessionOptions); 
	
	session.RemoveFiles("*.*");
	
	
	Запрос = Новый Запрос;
	
	Если СхемаОбмена.РеквизитИдентификацииНоменклатуры = "Штрихкод" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод
		|ПОМЕСТИТЬ ШтрихкодыНоменклатуры
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО Штрихкоды.Владелец = Номенклатура.Ссылка
		|			И (Штрихкоды.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(Штрихкоды.Штрихкод) КАК Штрихкод,
		|	Штрихкоды.ХарактеристикаНоменклатуры
		|ПОМЕСТИТЬ ШтрихкодыХарактеристик
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО Штрихкоды.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатуры.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Штрихкоды.ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХранилищеДополнительнойИнформации.Ссылка,
		|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Штрихкод, """") КАК КодСинхронизации,
		|	ХранилищеДополнительнойИнформации.Объект,
		|	ХранилищеДополнительнойИнформации.Хранилище,
		|	ХранилищеДополнительнойИнформации.ИмяФайла
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ХранилищеДополнительнойИнформации.Объект = ШтрихкодыНоменклатуры.Ссылка
		|ГДЕ
		|	ХранилищеДополнительнойИнформации.Объект В(&МассивТоваров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.Объект,
		|	ХарактеристикиНоменклатуры.сви_ГлавныйЭлемент,
		|	ШтрихкодыХарактеристик.Штрихкод КАК сви_КодВэбСинхронизации
		|ПОМЕСТИТЬ ХарактеристикиТоваров
		|ИЗ
		|	Данные КАК Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ШтрихкодыХарактеристик КАК ШтрихкодыХарактеристик
		|			ПО ХарактеристикиНоменклатуры.Ссылка = ШтрихкодыХарактеристик.ХарактеристикаНоменклатуры
		|		ПО Данные.Объект = ХарактеристикиНоменклатуры.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХарактеристикиТоваров.Объект,
		|	МАКСИМУМ(ХарактеристикиТоваров.сви_ГлавныйЭлемент) КАК сви_ГлавныйЭлемент
		|ПОМЕСТИТЬ НаличиеГлавногоЭлемента
		|ИЗ
		|	ХарактеристикиТоваров КАК ХарактеристикиТоваров
		|
		|СГРУППИРОВАТЬ ПО
		|	ХарактеристикиТоваров.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХарактеристикиТоваров.Объект,
		|	МАКСИМУМ(ХарактеристикиТоваров.сви_КодВэбСинхронизации) КАК сви_КодВэбСинхронизации
		|ПОМЕСТИТЬ КОдыХарактеристик
		|ИЗ
		|	ХарактеристикиТоваров КАК ХарактеристикиТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаличиеГлавногоЭлемента КАК НаличиеГлавногоЭлемента
		|		ПО ХарактеристикиТоваров.Объект = НаличиеГлавногоЭлемента.Объект
		|			И ХарактеристикиТоваров.сви_ГлавныйЭлемент = НаличиеГлавногоЭлемента.сви_ГлавныйЭлемент
		|
		|СГРУППИРОВАТЬ ПО
		|	ХарактеристикиТоваров.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.Ссылка,
		|	ЕСТЬNULL(КОдыХарактеристик.сви_КодВэбСинхронизации, Данные.КодСинхронизации) КАК КодСинхронизации,
		|	Данные.Объект,
		|	ЛОЖЬ КАК Успешно,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(200)) КАК ОтветФото,
		|	Данные.Хранилище,
		|	Данные.ИмяФайла
		|ИЗ
		|	Данные КАК Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ КОдыХарактеристик КАК КОдыХарактеристик
		|		ПО Данные.Объект = КОдыХарактеристик.Объект
		|ГДЕ
		|	ЕСТЬNULL(КОдыХарактеристик.сви_КодВэбСинхронизации, Данные.КодСинхронизации) <> """"";

	Иначе	
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранилищеДополнительнойИнформации.Ссылка,
		|	ЕСТЬNULL(ХранилищеДополнительнойИнформации.Объект.сви_КодВэбСинхронизации, """") КАК КодСинхронизации,
		|	ХранилищеДополнительнойИнформации.Объект,
		|	ХранилищеДополнительнойИнформации.Хранилище,
		|	ХранилищеДополнительнойИнформации.ИмяФайла
		|ПОМЕСТИТЬ Данные
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|ГДЕ
		|	ХранилищеДополнительнойИнформации.Объект В(&МассивТоваров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.Объект,
		|	ХарактеристикиНоменклатуры.сви_ГлавныйЭлемент,
		|	ХарактеристикиНоменклатуры.сви_КодВэбСинхронизации
		|ПОМЕСТИТЬ ХарактеристикиТоваров
		|ИЗ
		|	Данные КАК Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО Данные.Объект = ХарактеристикиНоменклатуры.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХарактеристикиТоваров.Объект,
		|	МАКСИМУМ(ХарактеристикиТоваров.сви_ГлавныйЭлемент) КАК сви_ГлавныйЭлемент
		|ПОМЕСТИТЬ НаличиеГлавногоЭлемента
		|ИЗ
		|	ХарактеристикиТоваров КАК ХарактеристикиТоваров
		|
		|СГРУППИРОВАТЬ ПО
		|	ХарактеристикиТоваров.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХарактеристикиТоваров.Объект,
		|	МАКСИМУМ(ХарактеристикиТоваров.сви_КодВэбСинхронизации) КАК сви_КодВэбСинхронизации
		|ПОМЕСТИТЬ КОдыХарактеристик
		|ИЗ
		|	ХарактеристикиТоваров КАК ХарактеристикиТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаличиеГлавногоЭлемента КАК НаличиеГлавногоЭлемента
		|		ПО ХарактеристикиТоваров.Объект = НаличиеГлавногоЭлемента.Объект
		|			И ХарактеристикиТоваров.сви_ГлавныйЭлемент = НаличиеГлавногоЭлемента.сви_ГлавныйЭлемент
		|
		|СГРУППИРОВАТЬ ПО
		|	ХарактеристикиТоваров.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Данные.Ссылка,
		|	ЕСТЬNULL(КОдыХарактеристик.сви_КодВэбСинхронизации, Данные.КодСинхронизации) КАК КодСинхронизации,
		|	Данные.Объект,
		|	ЛОЖЬ КАК Успешно,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(200)) КАК ОтветФото,
		|	Данные.Хранилище,
		|	Данные.ИмяФайла
		|ИЗ
		|	Данные КАК Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ КОдыХарактеристик КАК КОдыХарактеристик
		|		ПО Данные.Объект = КОдыХарактеристик.Объект
		|ГДЕ
		|	ЕСТЬNULL(КОдыХарактеристик.сви_КодВэбСинхронизации, Данные.КодСинхронизации) <> """"";
		
		Если ЗначениеЗаполнено(СхемаОбмена.РеквизитИдентификацииНоменклатуры) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Объект.сви_КодВэбСинхронизации", "Объект." + СхемаОбмена.РеквизитИдентификацииНоменклатуры);
		КонецЕсли;	
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров);
	ТаблКартинок = Запрос.Выполнить().Выгрузить();
	
	ТаблТоваров = ТаблКартинок.Скопировать(, "КодСинхронизации");
	ТаблТоваров.Свернуть("КодСинхронизации");
	
	ЛокальныеФайлы = Новый Массив;
	
	Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
		Каталог = СхемаОбмена.ПапкаФайлаЛога + "pictures\";
		УдалитьФайлы(Каталог, "*.*");
	КонецЕсли;
	
	ОбъектыДляСнятияСРегистрации = Новый Массив;
	
	Для Каждого ТекСтрТоваров Из ТаблТоваров ЦИкл
		СтрокиТекТовара = ТаблКартинок.НайтиСтроки(Новый Структура("КодСинхронизации", ТекСтрТоваров.КодСинхронизации));
		ИндексФайла = 0;
		ДЛя Каждого ТекСтр Из СтрокиТекТовара ЦИкл
			//Если ОбъектыДляСнятияСРегистрации.Найти(ТекСтр.Объект) = Неопределено ТОгда
			//	ОбъектыДляСнятияСРегистрации.Добавить(ТекСтр.Объект);
			//КонецЕсли;	
			Данные = ТекСтр.Хранилище.Получить();
			Расширение = "";
			Если ТипЗнч(Данные) = Тип("Картинка") Тогда
				ДвоичныеДанные = Данные.ПОлучитьДвоичныеДанные();
				ФОрматТекКартинки = Данные.Формат();
				Если ФОрматТекКартинки = ФорматКартинки.BMP ТОгда
					Расширение = "bmp";
				ИначеЕсли  ФОрматТекКартинки = ФорматКартинки.GIF ТОгда
					Расширение = "gif";
				ИначеЕсли  ФОрматТекКартинки = ФорматКартинки.JPEG ТОгда
					Расширение = "jpg";
				ИначеЕсли  ФОрматТекКартинки = ФорматКартинки.PNG ТОгда
					Расширение = "png";
				КонецЕсли;	
			ИначеЕсли ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
				ДвоичныеДанные = Данные;
			Иначе
				Продолжить;
			КонецЕсли;
			Если Расширение = "" Тогда
				Длина = СтрДлина(ТекСтр.ИмяФайла);
				ДЛя хх = 0 По Длина - 1 ЦИкл
					ТекСИмвол = Сред(ТекСтр.ИмяФайла, Длина - хх, 1);
					Если ТекСИмвол = "." ТОгда
						Расширение = Прав(ТекСтр.ИмяФайла, хх);
						Прервать;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;	
			Если Расширение = "" ТОгда
				Продолжить;
			КонецЕсли;	
			
			ИмяВыходногоФайла = СокрЛП(ТекСтрТоваров.КодСинхронизации);
			Если ИндексФайла > 0 Тогда
				ИмяВыходногоФайла = ИмяВыходногоФайла + "@" + Формат(ИндексФайла, "ЧГ=");
			КонецЕсли;	
			ИмяВыходногоФайла = ИмяВыходногоФайла + "." + Расширение;
			
			ЛокФайл = Каталог + ИмяВыходногоФайла;
			ДвоичныеДанные.Записать(ЛокФайл);
			
			ТекСтр.ИмяФайла = ИмяВыходногоФайла;
			
			ИндексФайла = ИндексФайла + 1;
			
			transferResult = session.PutFiles(ЛокФайл, ИмяВыходногоФайла);
			transferResult.Check();

			Если transferResult.IsSuccess  = Истина Тогда
				ТекСтр.Успешно = Истина;
			КонецЕсли;	
			
		КонецЦикла;	
	КонецЦикла;	
	
	Рез = Новый Структура;
	Рез.Вставить("Успешно",Ложь);
	Рез.Вставить("Сообщение","");
	
	ИмяРеквизитаИдентификатора = СокрЛП(СхемаОбмена.РеквизитИдентификацииНоменклатуры);
	
	ТокенРез = ПолучитьТокен_Хорошоп(НастройкиПодключения); 
	Если ТокенРез.Статус = "OK" Тогда
		ТокенСтр = ТокенРез.Токен; 
	Иначе
		Сообщить(ТокенРез.Сообщение);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
		ИмяИсходящегоФайла = СхемаОбмена.ПапкаФайлаЛога + "hs_images.json";
	Иначе
		ИмяИсходящегоФайла = ПолучитьИмяВременногоФайла("json");
	КонецЕсли;
	
	ЗаписьДЖС = Новый ЗаписьJSON;
	ЗаписьДЖС.ПроверятьСтруктуру = Истина;
	ПараметрыЗаписиДЖС = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	ЗаписьДЖС.ОткрытьФайл(ИмяИсходящегоФайла,КодировкаТекста.UTF8,Ложь,ПараметрыЗаписиДЖС);
	
	ЗаписьДЖС.ЗаписатьНачалоОбъекта();
	ЗаписьДЖС.ЗаписатьИмяСвойства("token");
	ЗаписьДЖС.ЗаписатьЗначение(ТокенСтр);
	ЗаписьДЖС.ЗаписатьИмяСвойства("removePrevImages");
	ЗаписьДЖС.ЗаписатьЗначение(Истина);
	ЗаписьДЖС.ЗаписатьКонецОбъекта();
	ЗаписьДЖС.Закрыть();
	
	Если ЗначениеЗаполнено(СхемаОбмена.ПапкаФайлаЛога) Тогда
		ИмяФайлаОтвета = СхемаОбмена.ПапкаФайлаЛога + "hs_images_answ.json";
	Иначе
		ИмяФайлаОтвета = ПолучитьИмяВременногоФайла("json");
	КонецЕсли;
	
	АдресСкриптаАутентификация 	= СокрЛП(НастройкиПодключения.АдресСкриптаАутентификация);
	АдресСкрипта        		= СокрЛП(НастройкиПодключения.АдресСкриптаВыгрузкаИзображений);
	ОбновлениеКаталога = Ложь;
	
	Соединение = СоздатьHTTPСоединение(НастройкиПодключения);
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept-Language","ru");
	Заголовки.Вставить("Accept-Charset","UTF-8");
	Заголовки.Вставить("Content-Language","ru");
	Заголовки.Вставить("Content-Charset","UTF-8");
	Заголовки.Вставить("Content-Type","application/json");
	
	Соединение.ОтправитьДляОбработки(ИмяИсходящегоФайла, АдресСкрипта, ИмяФайлаОтвета, Заголовки);
	
	ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяФайлаОтвета);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		Иначе
			Т = "Получен пустой ответ сервера.";
			Сообщить(Т);
			Возврат Неопределено;
		КонецЕсли;	
		
	Иначе	
		Т = "Ответ сервера не получен.";
		Сообщить(Т);
		Возврат Неопределено;
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON;
	Чтение.ОткрытьФайл(ИмяФайлаОтвета);
	СтруктураОтвета = ПрочитатьJSON(Чтение);
	
	Успех = Ложь;
	Если СтруктураОтвета.Свойство("status") Тогда
		Если СтруктураОтвета.status = "OK" Тогда
			Успех = Истина;
			Если СтруктураОтвета.Свойство("response") Тогда
				Если СтруктураОтвета.response.Свойство("log") ТОгда
					Для Каждого ТекФайл Из СтруктураОтвета.response.log ЦИкл
						СтрокаТабл = ТаблКартинок.Найти(ТекФайл.fileName, "ИмяФайла");
						Если НЕ СтрокаТабл = Неопределено Тогда
							Если ТекФайл.code = 0 Тогда
								СтрокаТабл.Успешно = Истина;
								СтрокаТабл.ОтветФОто = "OK";
							Иначе	
								СтрокаТабл.Успешно = Ложь;
								СтрокаТабл.ОтветФОто = ТекФайл.message;
							КонецЕсли;	
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	Если Не Успех Тогда
		Сообщить("При выгрузке изображений возникли проблемы");
		Возврат Неопределено;
	КонецЕсли;	
	Статусы = ТаблКартинок.Скопировать();
	Статусы.Свернуть("Объект, ОтветФото");
	
	Для Каждого ТекСтр Из ТаблЧасть ЦИкл
		СтрокиТекТовара = Статусы.НайтиСтроки(Новый Структура("Объект", ТекСТр.Номенклатура));
		ТекСтр.ОтветФОто = "";
		ДЛя Каждого СТрокаСТатуса Из СтрокиТекТовара Цикл
			Если НЕ ЗначениеЗаполнено(СТрокаСТатуса.ОтветФото) Тогда
				Продолжить;
			КонецЕсли;	
			Если ТекСтр.ОтветФОто <> "" ТОгда
				ТекСтр.ОтветФОто = ТекСтр.ОтветФОто + ","
			КонецЕсли;	
			ТекСтр.ОтветФОто = ТекСтр.ОтветФОто + СТрокаСТатуса.ОтветФото;
		КонецЦикла;	
	КонецЦикла;	
	
	ТаблКартинок.Свернуть("Объект, Успешно");
	Для Каждого ТекСтр Из ТаблКартинок ЦИкл
		Если ТекСтр.Успешно Тогда
			ОбъектыДляСнятияСРегистрации.Добавить(ТекСтр.Объект);
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого ТекСтр Из ТаблКартинок ЦИкл
		Если ТекСтр.Успешно = Ложь Тогда
			Инд = ОбъектыДляСнятияСРегистрации.Найти(ТекСтр.Объект);
			Если Инд <> Неопределено ТОгда
				ОбъектыДляСнятияСРегистрации.Удалить(Инд);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого ТекОбъект Из ОбъектыДляСнятияСРегистрации Цикл
		СТрокиТаблЧасти = ТаблЧасть.НайтиСтроки(Новый Структура("Номенклатура", ТекОбъект));
		Для Каждого СТрокаТаблЧасти Из СТрокиТаблЧасти Цикл
			Если СТрокаТаблЧасти <> Неопределено ТОгда
				СТрокаТаблЧасти.ВыгружатьКартинки = Ложь;
			КонецЕсли;	
		КонецЦикла;
		
		НЗ = РегистрыСведений.сви_ИзмененияФотографийНоменклатуры.СоздатьНаборЗаписей();
		НЗ.Отбор.Номенклатура.Установить(ТекОбъект);
		НЗ.Записать();
	КонецЦикла;	
	
КонецФункции

Процедура мпи_ПередЗаписьюВзаиморасчетовСКонтрагентомПередЗаписью(Источник, Отказ, Замещение) Экспорт
	Узлы = Новый Массив;
	
	СхемыОбмена = Справочники.сви_СхемыОбменаССайтом.Выбрать();
	Пока СхемыОбмена.Следующий() Цикл
		Если ЗначениеЗаполнено(СхемыОбмена.УзелПланаОбменаБалансСКлиентомБ2Б) Тогда
			Узлы.Добавить(СхемыОбмена.УзелПланаОбменаБалансСКлиентомБ2Б);
		КонецЕсли;
	КонецЦикла;	
	
	Если Узлы.Количество() = 0 ТОгда
		Возврат;
	КонецЕсли;	
	
	КонтрагентыИзИсточника = Новый Массив;
	Для Каждого ТекЗапись Из Источник Цикл
		Если КонтрагентыИзИсточника.Найти(ТекЗапись.Контрагент) = Неопределено Тогда
			КонтрагентыИзИсточника.Добавить(ТекЗапись.Контрагент);
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	сви_ЗарегистрированныеКонтрагентыБ2Б.Контрагент
	               |ИЗ
	               |	РегистрСведений.сви_ЗарегистрированныеКонтрагентыБ2Б КАК сви_ЗарегистрированныеКонтрагентыБ2Б
	               |ГДЕ
	               |	сви_ЗарегистрированныеКонтрагентыБ2Б.Контрагент В(&КонтрагентыИзИсточника)";
	Запрос.УстановитьПараметр("КонтрагентыИзИсточника",КонтрагентыИзИсточника);
	КонтрагентыДляРегистрации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");
	
	Источник.ДополнительныеСвойства.Вставить("КонтрагентыДляРегистрации", КонтрагентыДляРегистрации);
	Источник.ДополнительныеСвойства.Вставить("УзлыДляРегистрации", Узлы);
КонецПроцедуры

Процедура мпи_ПриЗаписиВзаиморасчетовСКонтрагентомПриЗаписи(Источник, Отказ, Замещение) Экспорт
	КонтрагентыДляРегистрации = Неопределено;
	Узлы = Неопределено;
	
	Если Источник.ДополнительныеСвойства.Свойство("КонтрагентыДляРегистрации", КонтрагентыДляРегистрации) И Источник.ДополнительныеСвойства.Свойство("УзлыДляРегистрации", Узлы) ТОгда
		Для Каждого УзелДляРегистрации Из Узлы Цикл
			ДЛя Каждого ТекКонтрагент Из КонтрагентыДляРегистрации Цикл
				ПланыОбмена.ЗарегистрироватьИзменения(УзелДляРегистрации, ТекКонтрагент);
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

Процедура флПередЗаписьРегистраПередЗаписью(Источник, Отказ, Замещение) Экспорт
	Узлы = Новый Массив;
	
	СхемыОбмена = Справочники.сви_СхемыОбменаССайтом.Выбрать();
	Пока СхемыОбмена.Следующий() Цикл
		Если ТипЗнч(Источник) = Тип("РегистрНакопленияНаборЗаписей.ТоварыНаСкладах") 
			ИЛИ ТипЗнч(Источник) = Тип("РегистрНакопленияНаборЗаписей.ТоварыВРезервеНаСкладах") 
			//с.д.(
			ИЛИ ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатурыКонтрагентов") 
			//с.д.)
			Тогда
			Если Не ЗначениеЗаполнено(СхемыОбмена.УзелПланаОбменаОстатки) Тогда Продолжить; КонецЕсли;
			Узлы.Добавить(СхемыОбмена.УзелПланаОбменаОстатки);
			//с.д.(
			Узлы.Добавить(СхемыОбмена.УзелПланаОбменаТовары);//може змінитися країна і дата виробництва
			//с.д.)
		Иначе
			Если Не ЗначениеЗаполнено(СхемыОбмена.УзелПланаОбменаЦены) Тогда Продолжить; КонецЕсли;
			Узлы.Добавить(СхемыОбмена.УзелПланаОбменаЦены);
		КонецЕсли;
	КонецЦикла;	
	
	Если Узлы.Количество() = 0 ТОгда
		Возврат;
	КонецЕсли;	
	
	ТоварыДляРегистрации = Новый Массив;
	
	
	Если Замещение Тогда
		
		Если НЕ Найти(Строка (Источник),"РегистрНакопления") = 0 Тогда
			ИмяБазовогоТипа = "РегистрыНакопления";
		Иначе
			ИмяБазовогоТипа = "РегистрыСведений";
		КонецЕсли;
		
		ТипЗначенияИсточника = ТипЗнч(Источник);
	
		МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗначенияИсточника);
	
		//СтарыйНаборЗаписей = РегистрыСведений[МетаданныеРегистра.Имя].СоздатьНаборЗаписей();
		
		Если ИмяБазовогоТипа = "РегистрыСведений" Тогда
			СтарыйНаборЗаписей = РегистрыСведений[МетаданныеРегистра.Имя].СоздатьНаборЗаписей();
		ИначеЕсли ИмяБазовогоТипа = "РегистрыНакопления" Тогда
			СтарыйНаборЗаписей = РегистрыНакопления[МетаданныеРегистра.Имя].СоздатьНаборЗаписей();
		КонецЕсли;
		
		
		Для Каждого ЗначениеОтбора Из Источник.Отбор Цикл
			
			Если ЗначениеОтбора.Использование = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаОтбора = СтарыйНаборЗаписей.Отбор.Найти(ЗначениеОтбора.Имя);
			СтрокаОтбора.Значение = ЗначениеОтбора.Значение;
			СтрокаОтбора.Использование = Истина;
			
		КонецЦикла;
		
		СтарыйНаборЗаписей.Прочитать();
		
		Для Каждого ТекЗапись Из СтарыйНаборЗаписей Цикл
			Если ТоварыДляРегистрации.Найти(ТекЗапись.Номенклатура) = Неопределено ТОгда
				ТоварыДляРегистрации.Добавить(ТекЗапись.Номенклатура);
			КонецЕсли;	
		КонецЦикла;		
		
		
	КонецЕсли;	
	
	
	
	Для Каждого ТекЗапись Из Источник Цикл
		Если ТоварыДляРегистрации.Найти(ТекЗапись.Номенклатура) = Неопределено ТОгда
			ТоварыДляРегистрации.Добавить(ТекЗапись.Номенклатура);
		КонецЕсли;	
	КонецЦикла;
	
	Регистратор = Источник.Отбор.Регистратор.Значение;
	Если ЗначениеЗаполнено(Регистратор) тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Регистр.Номенклатура
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры КАК Регистр
		|ГДЕ
		|	Регистр.Регистратор = &Регистратор
		|	И НЕ Регистр.Номенклатура В (&Номенклатура)";
		Если ТипЗнч(Источник) = Тип("РегистрНакопленияНаборЗаписей.ТоварыНаСкладах") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрСведений.ЦеныНоменклатуры", "РегистрНакопления.ТоварыНаСкладах");
		ИначеЕсли ТипЗнч(Источник) = Тип("РегистрНакопленияНаборЗаписей.ТоварыВРезервеНаСкладах") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрСведений.ЦеныНоменклатуры", "РегистрНакопления.ТоварыВРезервеНаСкладах");
		//с.д.(
		ИначеЕсли ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатурыКонтрагентов") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрСведений.ЦеныНоменклатуры", "РегистрСведений.ЦеныНоменклатурыКонтрагентов");
		//с.д.)
		КонецЕсли;	
		
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		Запрос.УстановитьПараметр("Номенклатура", ТоварыДляРегистрации);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ТоварыДляРегистрации.Добавить(Выборка.Номенклатура);
		КонецЦикла;	
	КонецЕсли;	
	Источник.ДополнительныеСвойства.Вставить("ТоварыДляРегистрации", ТоварыДляРегистрации);
	Источник.ДополнительныеСвойства.Вставить("УзлыДляРегистрации", Узлы);
КонецПроцедуры

Процедура флПриЗаписиРегистраПриЗаписи(Источник, Отказ, Замещение) Экспорт
	ТоварыДляРегистрации = Неопределено;
	Узлы = Неопределено;
	
	Если Источник.ДополнительныеСвойства.Свойство("ТоварыДляРегистрации", ТоварыДляРегистрации) И Источник.ДополнительныеСвойства.Свойство("УзлыДляРегистрации", Узлы) ТОгда
		Для Каждого УзелДляРегистрации Из Узлы Цикл
			ДЛя Каждого ТекТовар Из ТоварыДляРегистрации Цикл
				ПланыОбмена.ЗарегистрироватьИзменения(УзелДляРегистрации, ТекТовар);
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

Процедура флПередЗаписьюСвойствПередЗаписью(Источник, Отказ, Замещение) Экспорт
	Узлы = Новый Массив;
	
	СхемыОбмена = Справочники.сви_СхемыОбменаССайтом.Выбрать();
	Пока СхемыОбмена.Следующий() Цикл
		Узлы.Добавить(СхемыОбмена.УзелПланаОбменаТовары);
	КонецЦикла;	
	
	Если Узлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ТоварыДляРегистрации = Новый Массив;
	Для Каждого ТекЗапись Из Источник Цикл
		Если ЗначениеЗаполнено(ТекЗапись.Объект) Тогда
			Если ТипЗнч(ТекЗапись.Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
				ТекТовар = ТекЗапись.Объект;
			ИначеЕсли ТипЗнч(ТекЗапись.Объект) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
				ТекТовар = ТекЗапись.Объект.Владелец;
			Иначе	
				Продолжить;
			КонецЕсли;	
			Если ТоварыДляРегистрации.Найти(ТекТовар) = Неопределено Тогда
				ТоварыДляРегистрации.Добавить(ТекТовар);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	Если Источник.Отбор.Объект.Использование Тогда
		ТекТовар = Неопределено;
		Если ТипЗнч(Источник.Отбор.Объект.Значение) = Тип("СправочникСсылка.Номенклатура") Тогда
			ТекТовар = Источник.Отбор.Объект.Значение;
		ИначеЕсли ТипЗнч(Источник.Отбор.Объект.Значение) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
			ТекТовар = Источник.Отбор.Объект.Значение.Владелец;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекТовар) Тогда
			Если ТоварыДляРегистрации.Найти(ТекТовар) = Неопределено Тогда
				ТоварыДляРегистрации.Добавить(ТекТовар);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	Если ТоварыДляРегистрации.Количество() Тогда
		Источник.ДополнительныеСвойства.Вставить("ТоварыДляРегистрации", ТоварыДляРегистрации);
		Источник.ДополнительныеСвойства.Вставить("УзелДляРегистрации", Узлы);
	КонецЕсли;	
КонецПроцедуры

Процедура флПриЗаписиСвойствПриЗаписи(Источник, Отказ, Замещение) Экспорт
	ТоварыДляРегистрации = Неопределено;
	Узлы = Неопределено;
	
	Если Источник.ДополнительныеСвойства.Свойство("ТоварыДляРегистрации", ТоварыДляРегистрации) И Источник.ДополнительныеСвойства.Свойство("УзлыДляРегистрации", Узлы) ТОгда
		Для Каждого УзелДляРегистрации Из Узлы Цикл
			Для Каждого ТекТовар Из ТоварыДляРегистрации Цикл
				ПланыОбмена.ЗарегистрироватьИзменения(УзелДляРегистрации, ТекТовар);
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

Процедура мпи_ПриЗаписиХарактеристикиПриЗаписи(Источник, Отказ) Экспорт
	УЗел = Константы.сви_ОсновнойИнтернетМагазин.Получить().сви_СхемаОбменаССайтом.УзелПланаОбменаТовары;
	Если НЕ ЗначениеЗаполнено(Узел) Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Источник.Владелец) Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, Источник.Владелец);
	КонецЕсли;
КонецПроцедуры

Процедура сви_ЗагрузкаЗаказов(СхемаОбмена,Полное ) Экспорт // Полное = Ложь
	Обр = Обработки.сви_СинхронизацияХорошоп.Создать();
	//СхемаОбмена = Справочники.сви_СхемыОбменаССайтом.НайтиПоКоду("000000001");

	Обр.СхемаОбмена = СхемаОбмена;
	Обр.Подразделение = Справочники.Подразделения.НайтиПоРеквизиту("сви_СхемаОбменаССайтом",СхемаОбмена);
	Если НЕ ЗначениеЗаполнено(Обр.Подразделение) Тогда
		Возврат;
	КонецЕсли;
	Обр.Дата1 = НачалоДня(ТекущаяДата()) - 86400;
	Обр.ЗагрузкаЗаказов(Ложь);
КонецПроцедуры

Процедура сви_ВыгрузкиТоваров(Полное = Ложь) Экспорт
	Обр = Обработки.сви_ВыгрузкаНоменклатуры.Создать();
	Обр.СхемаОбмена = Справочники.сви_СхемыОбменаССайтом.НайтиПоКоду("000000001");
	Обр.ЗаполнитьПоСхемеОбмена();
	Если Полное Тогда
		Обр.РежимОтбора = "Расширенный";	
	Иначе
		Обр.РежимОтбора = "Товары";
	КонецЕсли;
	Обр.ЗаполнитьВсе();
	Обр.ВыгрузитьТовары();
КонецПроцедуры

Процедура сви_ВыгрузкаЦен(СхемаОбмена,Полное = Ложь) Экспорт
	Обр = Обработки.сви_ВыгрузкаНоменклатуры.Создать();
	Обр.СхемаОбмена = СхемаОбмена;
	Обр.ЗаполнитьПоСхемеОбмена();
	Если Полное Тогда
		Обр.РежимОтбора = "Расширенный";	
	Иначе
		Обр.РежимОтбора = "Цены";
	КонецЕсли;
	Обр.ЗаполнитьВсе();
	Обр.ВыгрузитьЦены();
КонецПроцедуры

Процедура сви_ВыгрузкаОстатков(Полное = Ложь) Экспорт
	Обр = Обработки.сви_ВыгрузкаНоменклатуры.Создать();  
	Обр.СхемаОбмена = Справочники.сви_СхемыОбменаССайтом.НайтиПоКоду("000000001");

	//Обр.СхемаОбмена = СхемаОбмена;
	Обр.ЗаполнитьПоСхемеОбмена();
	Если Полное Тогда
		Обр.РежимОтбора = "Расширенный";	
	Иначе
		Обр.РежимОтбора = "Остатки";
	КонецЕсли;
	Обр.ЗаполнитьВсе();
	Обр.ВыгрузитьОстатки();
КонецПроцедуры

//Б2Б
Функция ЗарегистрироватьКонтрагентаБТБ(Клиент,СхемаОбмена) Экспорт
	
	Рез = Новый Структура;
	Рез.Вставить("Успешно",Ложь);
	Рез.Вставить("Сообщение","");
	
	Магазин = Справочники.Подразделения.НайтиПоРеквизиту("сви_СхемаОбменаССайтом",СхемаОбмена);
	Если Не ЗначениеЗаполнено(Магазин) Тогда
		Т = "Назначте подразделение для этого сайта";
		Рез.Вставить("Сообщение",Т);
		Возврат Рез;
	КонецЕсли;	
	
	КодГруппыПользователей = "";
	Для Каждого Стр ИЗ Клиент.сви_ТипЦен.сви_КодыМагазинов Цикл
		Если Стр.Магазин = Магазин Тогда
			КодГруппыПользователей = Стр.КодГруппыПокупателей;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(КодГруппыПользователей) Тогда
		Т = "Тип цен не связан с группой покупателей в Хорошопе";
		Рез.Вставить("Сообщение",Т);
		Возврат Рез;
	КонецЕсли;	
	
	ВалютаБаланса = СхемаОбмена.ВалютаБалансаДляСайта;
	Если Не ЗначениеЗАполнено(ВалютаБаланса) Тогда
		Т = "Не заполнена валюта баланса в схеме обмена. Регистрация не возможна.";
		Рез.Вставить("Сообщение",Т);
		Возврат Рез;
	КонецЕсли;	
	
	Емейл = "";
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)"
	;
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Объект",Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Емейл = Выборка.Представление;
	КонецЦикла;
	
	//Поскольку в Хорошоп идентификация происходит по Емейлу
	//то если оно не заполнено, то не передаем контрагента на сайт
	Если Емейл = "" Тогда
		Рез.Вставить("Сообщение","У текущего контрагента не заполнена электронная почта.");
		Возврат Рез;
	КонецЕсли;	
		
	Телефон = "";
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип"
	;
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Объект",Клиент);
	Запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Телефон = Выборка.Представление;
	КонецЦикла;
	
	//БАЛАНС
	СуммаБаланса = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток КАК СуммаБаланса
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(, Контрагент = &Клиент) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	Запрос.УстановитьПараметр("Клиент",Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СуммаБаланса = Выборка.СуммаБаланса;
	КонецЕсли;
	
	ВалютаУпрУчета = Константы.ВалютаУправленческогоУчета.Получить();
	
	Если ВалютаБаланса <> ВалютаУпрУчета Тогда
		КурсВалютаБаланса = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаБаланса,ТекущаяДата());
		КурсВалютаУпрУчета = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаУпрУчета,ТекущаяДата());
		
		СуммаБаланса = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаБаланса,ВалютаУпрУчета,ВалютаБаланса,КурсВалютаУпрУчета.Курс,КурсВалютаБаланса.КУрс,КурсВалютаУпрУчета.Кратность,КурсВалютаБаланса.Кратность);
	КонецЕсли;
	//----------------
	
	НП = СхемаОбмена.НастройкаПодключения;
	ТокенРез = ПолучитьТокен_Хорошоп(НП); 
	Если ТокенРез.Статус = "OK" Тогда
		ТокенСтр = ТокенРез.Токен; 
	Иначе
		Рез.Вставить("Сообщение",ТокенСтр.Сообщение);
		Возврат Рез;
	КонецЕсли;
	//
	ЗаписьДЖС = Новый ЗаписьJSON;
	ЗаписьДЖС.ПроверятьСтруктуру = Истина;
	ПараметрыЗаписиДЖС = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	ЗаписьДЖС.УстановитьСтроку(ПараметрыЗаписиДЖС);
	
	ЗаписьДЖС.ЗаписатьНачалоОбъекта();
	ЗаписьДЖС.ЗаписатьИмяСвойства("token");
	ЗаписьДЖС.ЗаписатьЗначение(ТокенСтр);
	ЗаписьДЖС.ЗаписатьИмяСвойства("users");
	ЗаписьДЖС.ЗаписатьНачалоМассива();
	//
	ЗаписьДЖС.ЗаписатьНачалоОбъекта();
	
	ЗаписьДЖС.ЗаписатьИмяСвойства("title");
	ЗаписьДЖС.ЗаписатьЗначение(СокрЛП(Клиент.Наименование));
	
	ЗаписьДЖС.ЗаписатьИмяСвойства("email");
	ЗаписьДЖС.ЗаписатьЗначение(Емейл);
	
	СтандартизированныйТелефон = СтандартизироватьТелефон(Телефон);
	ЗаписьДЖС.ЗаписатьИмяСвойства("phone");
	ЗаписьДЖС.ЗаписатьЗначение(СтандартизированныйТелефон);
	
	ЗаписьДЖС.ЗаписатьИмяСвойства("customer_group_id");
	ЗаписьДЖС.ЗаписатьЗначение(КодГруппыПользователей);
	ЗаписьДЖС.ЗаписатьИмяСвойства("company");
	ЗаписьДЖС.ЗаписатьЗначение(Клиент.Наименование);
	
	////БАЛАНС  
	Если ЗначениеЗаполнено(ВалютаБаланса.КодВебСинхронизации) Тогда
		ЗаписьДЖС.ЗаписатьИмяСвойства("balance");
		ЗаписьДЖС.ЗаписатьЗначение(СуммаБаланса);
		
		ЗаписьДЖС.ЗаписатьИмяСвойства("balance_currency");
		ЗаписьДЖС.ЗаписатьЗначение(ВалютаБаланса.КодВебСинхронизации);
	КонецЕсли;
	//
	ЗаписьДЖС.ЗаписатьКонецОбъекта();
	ЗаписьДЖС.ЗаписатьКонецМассива();
	ЗаписьДЖС.ЗаписатьКонецОбъекта();
	ТелоЗапроса = ЗаписьДЖС.Закрыть();
	
	Если НП.ЗащищенноеСоединение Тогда
		Порт = 443;
		ЗС   = Новый ЗащищенноеСоединениеOpenSSL; 
	Иначе
		ЗС 	 = Неопределено;
		Порт = 80;
	КонецЕсли;
	Прокси     = Новый ИнтернетПрокси(Ложь);		
	Соединение = Новый HTTPСоединение(НП.Адрес,Порт, , , Прокси,,ЗС);
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type","application/json");
	
	Сервис = "/api/users/import/";
	ЗапросHTTP = Новый HTTPЗапрос(Сервис,Заголовки);
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса,,ИспользованиеByteOrderMark.НеИспользовать);
	РезультатЗапроса = Соединение.ОтправитьДляОбработки(ЗапросHTTP);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		Т = "Ошибка выполнения. Код "+РезультатЗапроса.КодСостояния;
		Т = Т+Символы.ПС+РезультатЗапроса.ПолучитьТелоКакСтроку();
		Рез.Вставить("Сообщение",Т);
		Сообщить(Т);
		Возврат Рез;
	КонецЕсли;
	
	Рез.Вставить("Успешно",Истина);
	Возврат Рез;
	
КонецФункции	

Процедура сви_ВыгрузкаЦенБтБ(СхемаОбмена,Полное = Ложь) Экспорт
	Обр = Обработки.сви_ВыгрузкаЦенБ2БХорошоп.Создать();
	Обр.СхемаОбмена = СхемаОбмена;
	Обр.ЗаполнитьПоСхемеОбмена();
	Если Полное Тогда
		Обр.РежимОтбора = "Расширенный";	
	Иначе
		Обр.РежимОтбора = "Цены";
	КонецЕсли;
	Обр.ЗаполнитьВсе();
	Обр.ВыгрузитьЦены();
КонецПроцедуры

Процедура сви_ВыгрузкаБалансовБ2Б(СхемаОбмена,Полное = Ложь) Экспорт
	Обр = Обработки.сви_ВыгрузкаБалансовКонтрагентовБ2Б.Создать();
	Обр.СхемаОбмена = СхемаОбмена;
	Обр.ЗаполнитьПоСхемеОбмена();
	Если Полное Тогда
		Обр.РежимОтбора = "Расширенный";	
	Иначе
		Обр.РежимОтбора = "ИзмененияБалансов";
	КонецЕсли;
	Обр.ЗаполнитьВсе();
	Обр.ВыгрузитьБалансыКонтрагентовБ2Б();
КонецПроцедуры

//с.д.(
Функция ПеревестиНаУкраинский(ФразаСтрока)
	ФразаСтрока_Перевод = ФразаСтрока;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокПереводов_СД.НаРуском,
		|	СписокПереводов_СД.НаУкраинском
		|ИЗ
		|	РегистрСведений.СписокПереводов_СД КАК СписокПереводов_СД";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ФразаСтрока_Перевод = СтрЗаменить(ФразаСтрока_Перевод,ВыборкаДетальныеЗаписи.НаРуском,ВыборкаДетальныеЗаписи.НаУкраинском);
	КонецЦикла;
	
	Возврат ФразаСтрока_Перевод;		
КонецФункции

Процедура ПроверкаУстановленыхКатегорийДляСайта() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Значение,
		|	ВложенныйЗапрос.Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|		ЕСТЬNULL(мпи_ЗначенияКатегорийНоменклатуры.Значение, """") КАК Значение,
		|		ВложенныйЗапрос.Количество КАК Количество
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|			СУММА(ВложенныйЗапрос.Количество) КАК Количество
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ТоварыНаСкладахОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|				СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток) КАК Количество
		|			ИЗ
		|				РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&Дата, &Дата, , , ) КАК ТоварыНаСкладахОстаткиИОбороты
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ТоварыНаСкладахОстаткиИОбороты.Номенклатура
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
		|				ЦеныНоменклатурыКонтрагентовСрезПоследних.Остаток
		|			ИЗ
		|				РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(, ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		|			
		|			СГРУППИРОВАТЬ ПО
		|				ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
		|				ЦеныНоменклатурыКонтрагентовСрезПоследних.Остаток) КАК ВложенныйЗапрос
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВложенныйЗапрос.Номенклатура) КАК ВложенныйЗапрос
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мпи_ЗначенияКатегорийНоменклатуры КАК мпи_ЗначенияКатегорийНоменклатуры
		|			ПО ВложенныйЗапрос.Номенклатура = мпи_ЗначенияКатегорийНоменклатуры.НоменклатураОбъект) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Значение = """"";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Номенклатура.ВидНоменклатуры.КатегорияСайтаХорошоп_СД) Тогда
			Продолжить;
		КонецЕсли;
		ПолНом = ВыборкаДетальныеЗаписи.Номенклатура.ПолучитьОбъект();
		ПолНом.Активная_СайтХорошоп_СД = истина;
		ПолНом.Записать();
		
		МЗ = РегистрыСведений.мпи_ЗначенияКатегорийНоменклатуры.СоздатьМенеджерЗаписи();
		МЗ.ВидКатегории = ВыборкаДетальныеЗаписи.Номенклатура.ВидНоменклатуры.КатегорияСайтаХорошоп_СД.Владелец;
		МЗ.Значение = ВыборкаДетальныеЗаписи.Номенклатура.ВидНоменклатуры.КатегорияСайтаХорошоп_СД;
		МЗ.НоменклатураОбъект = ВыборкаДетальныеЗаписи.Номенклатура;
		МЗ.Основная = Истина;
		МЗ.Записать(); 
		
		#Если Клиент Тогда
			Сообщить("Установлена категория " + ВыборкаДетальныеЗаписи.Номенклатура.ВидНоменклатуры.КатегорияСайтаХорошоп_СД + " для товара " + ВыборкаДетальныеЗаписи.Номенклатура);
		#КонецЕсли	
	КонецЦикла;
	
	
КонецПроцедуры

Процедура Гараж_СенсорныйЕкран_СДДействие() Экспорт
	ПроверкаУстановленыхКатегорийДляСайта();
КонецПроцедуры
//с.д.)


