
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для Каждого Строка Из ДокументыТ Цикл
		Попытка
			Д = Строка.Документ.Сделка.ПолучитьОбъект();
			Если Статус = Перечисления.СтатусыЭкспедиторок.Создан Тогда
				Д.Статус = Справочники.Статусы.ВЭкспедиторке; 
			Иначе
			КонецЕсли;
			Д.Записать();
			Сообщить(Строка(Д.Ссылка)+", перевели в статус в экспедиторке");
		Исключение
			Попытка
				Д = Строка.Документ.ПолучитьОбъект();
				Д.Статус = Справочники.Статусы.НайтиПоКоду("000000016"); 
				Д.Записать();
				Сообщить(Строка(Д.Ссылка)+", перевели в статус в экспедиторке");
				
			Исключение
			КонецПопытки;
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Для Каждого Строка Из ДокументыТ Цикл
		Попытка
			Д = Строка.Документ.ПолучитьОбъект();
			Если Д.Статус <> Справочники.Статусы.НайтиПоКоду("000000016") и Д.Статус <> Справочники.Статусы.НайтиПоКоду("000000002") Тогда
				Д.Статус = Справочники.Статусы.НайтиПоКоду("000000002"); 
				Д.Записать();
				Сообщить(Строка(Д.Ссылка)+", перевели в статус в экспедиторке");
			КонецЕслИ;
			
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры
