
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регістр БП_РейтингНоменклатуры	
	НаборЗаписей = РегистрыСведений.БП_РейтингНоменклатуры.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);  
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = НаборЗаписей.Добавить();
		Движение.Период = Дата;
		Движение.ТипЦеныРасчета = ТипЦеныРасчета;
//		Движение.Поставщик = ТекСтрокаТовары.Поставщик;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Рейтинг = ТекСтрокаТовары.Рейтинг;
		Движение.Активность = Истина;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
	
	Если Не Отказ И ТипЦеныРасчета = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("ionity.tires",,,) тогда  
		Попытка
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Дата);
            МассивПараметров.Добавить(ТипЦеныРасчета);
			МассивПараметров.Добавить(Ссылка); 
			
			ФоновыеЗадания.Выполнить("БП_ОбменMagentoВФоне.БП_ВыполнитьОтправкуНаСайтРейтинга", МассивПараметров,,"ОтправкаРейтингаНоменклатурыНаСайт");
			Сообщить("Вивантаження номенклатури на сайт почалось. Ви можете продовжувати користуватись програмою, невдовзі оновлені дані з'являться на сайті.");
		Исключение
			Сообщить("Не вдалося запустити вивантаження на сайт. Зверніться до адміністратора!");
		КонецПопытки; 
	КонецЕсли;

КонецПроцедуры  




