
Процедура ПередЗаписью(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БП_ПравилаРанжировки.Ссылка,
		|	БП_ПравилаРанжировки.ТипЦеныРасчета,
		|	БП_ПравилаРанжировки.ВидНоменклатуры
		|ИЗ
		|	Справочник.БП_ПравилаРанжировки КАК БП_ПравилаРанжировки
		|ГДЕ
		|	БП_ПравилаРанжировки.ВидНоменклатуры = &ВидНоменклатуры
		|	И БП_ПравилаРанжировки.ТипЦеныРасчета = &ТипЦеныРасчета
		|	И НЕ БП_ПравилаРанжировки.ПометкаУдаления
		|	И БП_ПравилаРанжировки.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("ТипЦеныРасчета", ТипЦеныРасчета); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если Запрос.Выполнить().Выгрузить().Количество() тогда
		Сообщить("Запис не унікальний! В даному довіднику уже є не помічений на видалення запис з таким видом номенклатури та типом цін!");	
		Отказ = Истина;	
	КонецЕсли;
		
КонецПроцедуры
