
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Групируем новый набор бейджиков по номенклатуре
	НовыйНабор = Новый Соответствие;
	Для Каждого Строка Из Товары Цикл
		
		// Проверка наличия ключа
		МассивБейджиков = НовыйНабор.Получить(Строка.Номенклатура);
		Если МассивБейджиков = Неопределено Тогда
			МассивБейджиков = Новый Массив;
			НовыйНабор.Вставить(Строка.Номенклатура, МассивБейджиков);
		КонецЕсли;
		СтруктураБейджика = Новый Структура("Код, Наименование", Строка.Бейджик.Код,Строка.Бейджик.Наименование);
		МассивБейджиков.Добавить(СтруктураБейджика);
		
	КонецЦикла;
	
	
	НаборЗаписей = РегистрыСведений.БП_БейджикиНоменклатуры.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);  
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();	     
	
	СписокНоменклатур = Новый Массив;
	Для Каждого Номенклатура Из НовыйНабор Цикл
		СписокНоменклатур.Добавить(Номенклатура.Ключ);
		
		Движение = НаборЗаписей.Добавить();
		Движение.Период = Дата;
		Движение.ТипЦеныРасчета = ТипЦеныРасчета;
		Движение.Номенклатура = Номенклатура.Ключ; 
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Номенклатура.Значение);
		БейджикиJSON = ЗаписьJSON.Закрыть();
		
		БейджикиТекст = "";
		Для каждого Стр из Номенклатура.Значение цикл
			БейджикиТекст = ?(БейджикиТекст = "", Стр.Наименование,БейджикиТекст + ", " + Стр.Наименование);	
		КонецЦикла;
		
		
		Движение.БейджикиJSON = БейджикиJSON;
		Движение.БейджикиТекст = БейджикиТекст;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);    
	
	//БП_ОбменMagentoВФоне.БП_ВыполнитьОтправкуНаСайтБейджиков(Дата,ТипЦеныРасчета,Ссылка);
		
	
	Если Не Отказ И ТипЦеныРасчета = Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("ionity.tires",,,) тогда  
		Попытка
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Дата);
	        МассивПараметров.Добавить(ТипЦеныРасчета);
			МассивПараметров.Добавить(Ссылка); 
			
			ФоновыеЗадания.Выполнить("БП_ОбменMagentoВФоне.БП_ВыполнитьОтправкуНаСайтБейджиков", МассивПараметров,,"ОтправкаБейджиковНоменклатурыНаСайт");
			Сообщить("Вивантаження бейджиків на сайт почалось. Ви можете продовжувати користуватись програмою, невдовзі оновлені дані з'являться на сайті.");
		Исключение
			Сообщить("Не вдалося запустити вивантаження на сайт. Зверніться до адміністратора!");
		КонецПопытки; 
	КонецЕсли;

	
	
 КонецПроцедуры  


Процедура Проведение(Отказ, Режим)

 
КонецПроцедуры



