Функция ПолучитьСписокПолучателей(Контрагент, НП_APIКлюч) Экспорт   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НП_КонтрагентыПолучатели.Ссылка КАК Получатели
	               |ИЗ
	               |	Справочник.НП_КонтрагентыПолучатели КАК НП_КонтрагентыПолучатели
	               |ГДЕ
	               |	(НП_КонтрагентыПолучатели.Контрагент = &НаименованиеКонтрагента
	               |			ИЛИ НП_КонтрагентыПолучатели.Контрагент = ""Приватна Особа"")
	               |	И НП_КонтрагентыПолучатели.API_ключ = &API_ключ";
	Запрос.УстановитьПараметр("НаименованиеКонтрагента",Контрагент.Наименование);
	Запрос.УстановитьПараметр("API_ключ",НП_APIКлюч);
	
	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции