Функция СуществуетДокумент(Поставщик, Договор, НаДату) Экспорт
	Запрос = Новый Запрос;
	Запрос .Текст = "ВЫБРАТЬ
	                |	ДокументПроданногоТовараДанногоНаРеализацию.Ссылка
	                |ИЗ
	                |	Документ.ДокументПроданногоТовараДанногоНаРеализацию КАК ДокументПроданногоТовараДанногоНаРеализацию
	                |ГДЕ
	                |	ДокументПроданногоТовараДанногоНаРеализацию.ДоговорПоставщика = &ДоговорПоставщика
	                |	И ДокументПроданногоТовараДанногоНаРеализацию.Поставщик = &Поставщик
	                |	И ДокументПроданногоТовараДанногоНаРеализацию.Проведен
	                |	И ДокументПроданногоТовараДанногоНаРеализацию.ПродажиНаДату = &ПродажиНаДату";
	
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("ДоговорПоставщика",Договор);
	Запрос.УстановитьПараметр("ПродажиНаДату",НаДату);
	
	 Возврат Запрос.Выполнить().Выгрузить().Количество() <> 0; 
КонецФункции