//////////////////////////////////////////////////////////
//ОБРАБОТЧИКИ РЕГЛАМЕНТНЫХ ЗАДАНИЙ

// Процедура выполняет импорт звонков с сервера Binotel
//
Процедура Э_ИмпортВходящихЗвонковBinotel() Экспорт
	Перем НачПериода,НачПериодаЧасНазад,КонПериода;
		
	НачПериода = Э_ПолучитьДатуПоследнегоЗавершенногоЗвонка(Истина);
	//Э_NCT(10.05.2019	
	НачПериодаЧасНазад = ТекущаяДата() - (3600);
	Если НачПериода <> неопределено и НачПериодаЧасНазад<НачПериода Тогда
		 НачПериода=НачПериодаЧасНазад;
	//Э_NCT)
	иначеЕсли НачПериода = неопределено тогда
		 НачПериода = НачалоДня(ТекущаяДата());
	КонецЕсли;
		
	КонПериода = ТекущаяДата();
	
	Э_ПолучитьЗвонкиЗаПериод(НачПериода, КонПериода, Истина, Ложь,,ИСТИНА);
КонецПроцедуры

// Процедура выполняет импорт звонков с сервера Binotel
//
Процедура Э_ИмпортИсходящихЗвонковBinotel() Экспорт
	Перем НачПериода,НачПериодаЧасНазад,КонПериода;
		
	НачПериода = Э_ПолучитьДатуПоследнегоЗавершенногоЗвонка(Ложь);
	//Э_NCT(10.05.2019	
	НачПериодаЧасНазад = ТекущаяДата() - (3600);
	Если НачПериода <> неопределено и НачПериодаЧасНазад<НачПериода Тогда
		 НачПериода=НачПериодаЧасНазад;
	//Э_NCT)
	иначеЕсли НачПериода = неопределено тогда
		 НачПериода = НачалоДня(ТекущаяДата());
	КонецЕсли;
		
	КонПериода = ТекущаяДата();
	
	Э_ПолучитьЗвонкиЗаПериод(НачПериода, КонПериода, Ложь, Истина,,ИСТИНА);
КонецПроцедуры

// Процедура выполняет выгрузку данных по клиентам в мини-срм "Мои клиенты" (Binotel)
//
Процедура Э_ВыгрузкаДанныхПоКлиентамBinotel() Экспорт
	Э_ВыгрузитьДанныеКлиентовВМиниСрмМоиКлиенты(,Истина);
КонецПроцедуры




Процедура Э_ЗаполнитьРегистрЭ_ТелефонияПотерянныеЗвонки() Экспорт
	ОбработкаТелефонии = Обработки.Э_BinotelPhone.Создать();
	
	Э_НастройкиБинотел=Э_ТелефонияBinotel.Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
	     Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Э_ПотерянныеЗвонки.НомерТелефона,
		//Э_Волощук (03.11.2018 19:48:31
		|	Э_ПотерянныеЗвонки.Э_НашНомерТелефона,
		//Э_Волощук)
		|	Э_ПотерянныеЗвонки.Контрагент,
		|	Э_ПотерянныеЗвонки.КонтактноеЛицо,
		//Э_Волощук (10.12.2018 00:32:19
		|	Э_ПотерянныеЗвонки.Э_Лид,
		//Э_Волощук)
		|	Э_ПотерянныеЗвонки.ВремяЗвонка,
		|	Э_ПотерянныеЗвонки.ВремяОжиданияСоединения,
		|	Э_ПотерянныеЗвонки.Э_CallIDЗвонка,
		|	Э_ПотерянныеЗвонки.Ответственный,
		|	Э_ПотерянныеЗвонки.КомуЗвонили,
		|	Э_ПотерянныеЗвонки.Комментарий
		|ИЗ
		|	РегистрСведений.Э_ТелефонияПотерянныеЗвонки КАК Э_ПотерянныеЗвонки
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(Э_ПотерянныеЗвонки.ДатаЗаписи, день) = &ДатаОтбора";
	Запрос.УстановитьПараметр("ДатаОтбора", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.Э_ТелефонияПотерянныеЗвонки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.НомерТелефона.Установить(ВыборкаДетальныеЗаписи.НомерТелефона);
		//Э_Волощук (23.07.2019 17:17:52
		////Э_Волощук (03.11.2018 19:49:39
		//НаборЗаписей.Отбор.НомерТелефона.Установить(ВыборкаДетальныеЗаписи.Э_НашНомерТелефона);
		////Э_Волощук)
		НаборЗаписей.Отбор.Э_НашНомерТелефона.Установить(ВыборкаДетальныеЗаписи.Э_НашНомерТелефона);
		//Э_Волощук)
		НаборЗаписей.Отбор.Контрагент.Установить(ВыборкаДетальныеЗаписи.Контрагент);
		НаборЗаписей.Отбор.КонтактноеЛицо.Установить(ВыборкаДетальныеЗаписи.КонтактноеЛицо);
		//Э_Волощук (10.12.2018 00:33:00
		НаборЗаписей.Отбор.Э_Лид.Установить(ВыборкаДетальныеЗаписи.Э_Лид);
		//Э_Волощук)
		НаборЗаписей.Отбор.ВремяЗвонка.Установить(ВыборкаДетальныеЗаписи.ВремяЗвонка);
		НаборЗаписей.Отбор.ВремяОжиданияСоединения.Установить(ВыборкаДетальныеЗаписи.ВремяОжиданияСоединения);
		НаборЗаписей.Отбор.Э_CallIDЗвонка.Установить(ВыборкаДетальныеЗаписи.Э_CallIDЗвонка);
		НаборЗаписей.Отбор.Ответственный.Установить(ВыборкаДетальныеЗаписи.Ответственный);
		НаборЗаписей.Отбор.КомуЗвонили.Установить(ВыборкаДетальныеЗаписи.КомуЗвонили);
		НаборЗаписей.Отбор.Комментарий.Установить(ВыборкаДетальныеЗаписи.Комментарий);
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
		
	result_in = ОбработкаТелефонии.sendRequest("stats/list-of-lost-calls-today", Новый Структура,Ложь,Истина);
	СтруктураРезультат_IN = Э_РаботаСJSON.Э_ПрочитатьJSON(result_in);
	Если ТипЗнч(СтруктураРезультат_IN) = Тип("Структура") Тогда
		Если Найти(СтруктураРезультат_IN["status"], "success") > 0 Тогда
			для каждого эл из СтруктураРезультат_IN.callDetails цикл
			     CallID = эл.Значение.CallID;
				  	  
				 Э_ЗаписатьНовыйПотерянныйЗвонокВРегистр(эл.Значение,Э_НастройкиБинотел);
			КонецЦикла;
		Иначе
			СообщениеОбОшибке="Ошибка: "+ Строка(СтруктураРезультат_IN["code"])+", "+СтруктураРезультат_IN["message"];	
			ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке );
			#Если Клиент Тогда
			СообщитьИнформацию(СообщениеОбОшибке);	
			#КонецЕсли
		КонецЕсли;
	Иначе
		СообщениеОбОшибке="Ошибка. "+Строка(result_in);	
		ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке );
		#Если Клиент Тогда
		СообщитьИнформацию(СообщениеОбОшибке);	
		#КонецЕсли
	КонецЕсли;
	
	//Очищаем регистр от ненужных записей
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Э_ПотерянныеЗвонки.НомерТелефона,
		//Э_Волощук (03.11.2018 19:51:14
		|	Э_ПотерянныеЗвонки.Э_НашНомерТелефона,
		//Э_Волощук)
		|	Э_ПотерянныеЗвонки.Контрагент,
		|	Э_ПотерянныеЗвонки.КонтактноеЛицо,
		//Э_Волощук (10.12.2018 00:33:53
		|	Э_ПотерянныеЗвонки.Э_Лид,
		//Э_Волощук)
		|	Э_ПотерянныеЗвонки.ВремяЗвонка,
		|	Э_ПотерянныеЗвонки.ВремяОжиданияСоединения,
		|	Э_ПотерянныеЗвонки.Э_CallIDЗвонка,
		|	Э_ПотерянныеЗвонки.Ответственный,
		|	Э_ПотерянныеЗвонки.КомуЗвонили,
		|	Э_ПотерянныеЗвонки.Комментарий
		|ИЗ
		|	РегистрСведений.Э_ТелефонияПотерянныеЗвонки КАК Э_ПотерянныеЗвонки
		|ГДЕ
		|	Э_ПотерянныеЗвонки.ДатаЗаписи < &ДатаОтбора";
	Если ЗначениеЗаполнено(Э_НастройкиБинотел.Э_КоличествоДнейХраненияПропущенныхЗвонков) Тогда
		Э_КоличествоДнейХраненияПропущенныхЗвонков = Э_НастройкиБинотел.Э_КоличествоДнейХраненияПропущенныхЗвонков;
	Иначе
		Э_КоличествоДнейХраненияПропущенныхЗвонков = 3;
	КонецЕсли;
	
	ДатаОтбора = НачалоДня(ТекущаяДата()) - 86400*(Э_КоличествоДнейХраненияПропущенныхЗвонков-1);
	Запрос.УстановитьПараметр("ДатаОтбора", ДатаОтбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.Э_ТелефонияПотерянныеЗвонки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.НомерТелефона.Установить(ВыборкаДетальныеЗаписи.НомерТелефона);
		//Э_Волощук (26.03.2019 00:48:31
		НаборЗаписей.Отбор.Э_НашНомерТелефона.Установить(ВыборкаДетальныеЗаписи.Э_НашНомерТелефона);
		//Э_Волощук)
		НаборЗаписей.Отбор.Контрагент.Установить(ВыборкаДетальныеЗаписи.Контрагент);
		НаборЗаписей.Отбор.КонтактноеЛицо.Установить(ВыборкаДетальныеЗаписи.КонтактноеЛицо);
		//Э_Волощук (10.12.2018 00:34:24
		НаборЗаписей.Отбор.Э_Лид.Установить(ВыборкаДетальныеЗаписи.Э_Лид);
		//Э_Волощук)
		НаборЗаписей.Отбор.ВремяЗвонка.Установить(ВыборкаДетальныеЗаписи.ВремяЗвонка);
		НаборЗаписей.Отбор.ВремяОжиданияСоединения.Установить(ВыборкаДетальныеЗаписи.ВремяОжиданияСоединения);
		НаборЗаписей.Отбор.Э_CallIDЗвонка.Установить(ВыборкаДетальныеЗаписи.Э_CallIDЗвонка);
		НаборЗаписей.Отбор.Ответственный.Установить(ВыборкаДетальныеЗаписи.Ответственный);
		НаборЗаписей.Отбор.КомуЗвонили.Установить(ВыборкаДетальныеЗаписи.КомуЗвонили);
		НаборЗаписей.Отбор.Комментарий.Установить(ВыборкаДетальныеЗаписи.Комментарий);
		//Э_Волощук (26.03.2019 00:44:36
		//НаборЗаписей.Записать();
		НаборЗаписей.Записать(Истина);
		//Э_Волощук)   
		
		
	КонецЦикла;
	
	//ЦВ
	 ОбработатьПропущенныеИСоздатьПредЗаказ(Э_НастройкиБинотел);
	//ЦВ 
	
КонецПроцедуры
  
Функция ОбработатьПропущенныеИСоздатьПредЗаказ(Э_НастройкиБинотел) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Э_ТелефонияПотерянныеЗвонки.НомерТелефона,
	               |	Э_ТелефонияПотерянныеЗвонки.Э_НашНомерТелефона,
	               |	Э_ТелефонияПотерянныеЗвонки.Контрагент,
	               |	Э_ТелефонияПотерянныеЗвонки.КонтактноеЛицо,
	               |	Э_ТелефонияПотерянныеЗвонки.Э_Лид,
	               |	Э_ТелефонияПотерянныеЗвонки.ВремяЗвонка,
	               |	Э_ТелефонияПотерянныеЗвонки.ВремяОжиданияСоединения,
	               |	Э_ТелефонияПотерянныеЗвонки.Э_CallIDЗвонка,
	               |	Э_ТелефонияПотерянныеЗвонки.Ответственный,
	               |	Э_ТелефонияПотерянныеЗвонки.КомуЗвонили,
	               |	Э_ТелефонияПотерянныеЗвонки.Комментарий,
	               |	Э_ТелефонияПотерянныеЗвонки.ДатаЗаписи
	               |ИЗ
	               |	РегистрСведений.Э_ТелефонияПотерянныеЗвонки КАК Э_ТелефонияПотерянныеЗвонки";
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		Номер = Выборка.НомерТелефона;
		ВремяЗвонка = Выборка.ВремяЗвонка;
		Э_НашНомерТелефона = Выборка.Э_НашНомерТелефона; 
		ОбработатьПропущенный(Номер, Э_НашНомерТелефона, ВремяЗвонка);
	КонецЦикла;	
КонецФункции 

Функция ОбработатьПропущенный(Номер, НашНомер, ВремяЗвонка) Экспорт
	
	
	ТекстКомментария = "Пропущений дзвінок " + ВремяЗвонка + " " + НашНомер ;//+ Символы.ПС + "Отладка док создан - " + ТекущаяДата();
	ПредЗаказСсылка = Документы.ПредЗаказ.ПолучитьПредзаказПропущенного(Номер, ТекстКомментария);
	
	
	Ответственный = ПолучитьАктуальногоОтветственного(Номер);
	Подразделение = Справочники.Подразделения.ПолучитьПодразделениеПоНомеру(НашНомер);
	Организация = Справочники.ТипыЦенНоменклатуры
	.НайтиПоКоду("000000001")
	.Организация;
	
	
	Если ПредЗаказСсылка = Неопределено Тогда
		
		ПредЗаказ = Документы.ПредЗаказ.СоздатьДокумент();
		
		ПредЗаказ.Дата = ВремяЗвонка;
		ПредЗаказ.Телефон = Номер;
		ПредЗаказ.Комментарий = ТекстКомментария;
		
		ПредЗаказ.Статус = Справочники.Статусы.НайтиПоКоду("000000072"); //Пропущенный номер 

		ПредЗаказ.Ответственный = Ответственный;
		ПредЗаказ.ОтветственныйМенеджер = Ответственный;
		ПредЗаказ.Подразделение = Подразделение;
		ПредЗаказ.Организация = Организация;
		
		ПредЗаказ.Записать();		
	Иначе
		
		ПредЗаказ = ПредЗаказСсылка.ПолучитьОбъект();
		
		Если ПредЗаказ.Дата <> ВремяЗвонка Тогда
						
			ПредЗаказ.Дата = ВремяЗвонка;
			
			ПредЗаказ.Ответственный = Ответственный;
			ПредЗаказ.ОтветственныйМенеджер = Ответственный;
	       	ПредЗаказ.Подразделение = Подразделение;
	        ПредЗаказ.Организация = Организация;	
			ПредЗаказ.Комментарий = 		
				ПредЗаказ.Комментарий 
				+ Символы.ПС 
				+ ТекстКомментария;
			ПредЗаказ.Записать();
						
		КонецЕсли;
				
	КонецЕсли; 
		

КонецФункции  

функция ПолучитьАктуальногоОтветственного(Номер) 
	
	ПоследнийОтветсвенныйКтоКонтактировал = Справочники.Пользователи.ПолучитьПоследнегоОтветсвенногоКтоКонтактировал(Номер);
	Если ПоследнийОтветсвенныйКтоКонтактировал <> Неопределено Тогда 				
		Ответственный = ПоследнийОтветсвенныйКтоКонтактировал; 				
	Иначе 
		Ответственный = Справочники.Пользователи.ПолучитьМенеджераУКоторогоНаименьшнееКолВоПредЗаказовВСтатусеПропущенный();				
	КонецЕсли;
	Возврат Ответственный;	
КонецФункции

//////////////////////////////////////////////////////////
//ОБЩИЕ ПРОЦЕДУРЫ

// Функция преобразовывает номер телефона (без разделителей)
//
Функция Э_ТолькоЦифрыТелефона(НомерТелефона)
	Перем ТолькоЦифрыНомера;
	
	ТолькоЦифрыНомера="";
	Для а=1 По СтрДлина(НомерТелефона) Цикл
		Если СтрЧислоВхождений("1234567890",Сред(НомерТелефона,а,1)) > 0 Тогда
			ТолькоЦифрыНомера = ТолькоЦифрыНомера + Сред(НомерТелефона,а,1);
		иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ТолькоЦифрыНомера;
КонецФункции	

// Функция преобразовывает номер телефона (без разделителей)
//
Функция Э_ПреобразоватьНомерТелефонаБезРазделителей(Знач НомерТелефона) Экспорт
	Если НЕ ЗначениеЗаполнено(НомерТелефона) Тогда
		Возврат "";
	КонецЕсли;
	
	Если СтрДлина(НомерТелефона) < 5 Тогда
		Возврат СокрЛП(НомерТелефона);
	КонецЕсли;
	
	ПозицияЗапятой = Найти(НомерТелефона, ",");
	Если ПозицияЗапятой > 0 Тогда
		НомерТелефона = Лев(НомерТелефона, ПозицияЗапятой-1);
	КонецЕсли;	
	НомерТелефона = СтрЗаменить(НомерТелефона, Символы.НПП, "");
	НомерТелефона = СтрЗаменить(НомерТелефона, "+38", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, "+3", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, " ", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, "(", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, ")", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, "-", "");
	НомерТелефона = СтрЗаменить(НомерТелефона, "+", "");
	ДлинаНомера = СтрДлина(НомерТелефона);
	Если Лев(НомерТелефона, 2) = "38" И ДлинаНомера = 12 Тогда
		НомерТелефона = Прав(НомерТелефона, ДлинаНомера-2);
	КонецЕсли;
	НомерТелефона = СокрЛП(НомерТелефона);
	
	НомерТелефона=Э_ТолькоЦифрыТелефона(НомерТелефона);
	
	Возврат НомерТелефона;
КонецФункции	

Функция Э_ВнутреннийНомерТелефонаПользователя(Пользователь) Экспорт 
	перем Э_НастройкиБинотел,ТекстЗапроса,Запрос,Выборка;
	
	Э_НастройкиБинотел=Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
	     Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.CRM_НомерТелефона КАК НомерТелефона
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Пользователь
	|	И КонтактнаяИнформация.Тип = &ТипКонтактнойИнформации
	|	И КонтактнаяИнформация.Вид = &ВидКонтактнойИнформации";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипКонтактнойИнформации", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ВидКонтактнойИнформации", Э_НастройкиБинотел.Э_BinotelВнутреннийТелефонПользователяВид);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат СокрЛП(Выборка.НомерТелефона);
	Иначе	
		Возврат "";
	КонецЕсли;
КонецФункции	

Функция Э_ИсточникИнформацииПоНомеруТелефона(НомерТелефона, ДатаСобытия) Экспорт 
	Если Не ЗначениеЗаполнено(НомерТелефона) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаКон", ДатаСобытия);
	Запрос.УстановитьПараметр("НомерТелефона", "%"+НомерТелефона);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КИ.Э_ИсточникИнформации КАК ИсточникИнформации
	|ИЗ
	|	РегистрСведений.Э_СоответствиеТелефоновИсточникамИнформации.СрезПоследних(&ДатаКон, ) КАК КИ
	|ГДЕ
	|	КИ.Э_НомерТелефона ПОДОБНО &НомерТелефона";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИсточникИнформации;
	Иначе	
		Возврат Справочники.ИсточникиИнформацииПриОбращенииПокупателей.ПустаяСсылка();
	КонецЕсли;
КонецФункции	

Функция Э_ПользовательПоНомеруТелефона(НомерТелефона) Экспорт 
	Если Не ЗначениеЗаполнено(НомерТелефона) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Объект
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &ТипКонтактнойИнформации
	|	И КонтактнаяИнформация.Вид.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации
	|	И КонтактнаяИнформация.CRM_НомерТелефона ПОДОБНО &НомерТелефона";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипКонтактнойИнформации", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи);
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Объект;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
КонецФункции	

Функция Э_ОпределитьПользователяВБазе1С(employeeEmail, НомерТелефона) Экспорт 
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ТелефонияКодыСотрудников.Сотрудник КАК Пользователь
	|ИЗ
	|	РегистрСведений.Э_ТелефонияКодыСотрудников КАК ТелефонияКодыСотрудников
	|ГДЕ
	|	ТелефонияКодыСотрудников.employeeEmail = &employeeEmail
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &ТипКонтактнойИнформации
	|	И КонтактнаяИнформация.Вид.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации
	|	И КонтактнаяИнформация.CRM_НомерТелефона ПОДОБНО &НомерТелефона";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипКонтактнойИнформации", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", Перечисления.ВидыОбъектовКонтактнойИнформации.Пользователи);
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	Запрос.УстановитьПараметр("employeeEmail", employeeEmail);
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Пользователь;
	Иначе
		Возврат Э_ПользовательПоНомеруТелефона(НомерТелефона);
	КонецЕсли;
КонецФункции	

Функция Э_ОбъектСобытияПоНомеруТелефона(НомерТелефона, ВидОбъектаКонтактнойИнформации=Неопределено, ДопИнфо="") Экспорт 
	Перем Запрос,ОбъектСобытия,тНомерТелефона;
	
	Если ДопИнфо = Неопределено Тогда
		ДопИнфо = "";
	КонецЕсли;	
	
	ВидОбъектаКонтактнойИнформации = Неопределено;
	ОбъектСобытия = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипКонтактнойИнформации", Перечисления.ТипыКонтактнойИнформации.Телефон);
	тНомерТелефона = Э_ТелефонияBinotel.Э_ПреобразоватьНомерТелефонаБезРазделителей(НомерТелефона);
	//Э_NCT(27.11.2018 17:34:34 www.nct.ua 
	//Если тНомерТелефона="" Тогда
	Если тНомерТелефона="" или СтрДлина(тНомерТелефона)<=6 Тогда
	//Э_NCT) 	
		Возврат Неопределено;
	КонецЕсли;	
	Запрос.УстановитьПараметр("НомерТелефона", "%"+тНомерТелефона);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Вид.ВидОбъектаКонтактнойИнформации КАК ВидОбъектаКонтактнойИнформации,
	|	КонтактнаяИнформация.CRM_НомерТелефона КАК НомерТелефона,
	|	КонтактнаяИнформация.Объект.Представление КАК ОбъектПредставление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &ТипКонтактнойИнформации
	|	И КонтактнаяИнформация.Вид.ВидОбъектаКонтактнойИнформации В (ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовКонтактнойИнформации.Контрагенты), ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица), ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов))
	|	И КонтактнаяИнформация.CRM_НомерТелефона ПОДОБНО &НомерТелефона
	|	И Не КонтактнаяИнформация.Объект.ПометкаУдаления
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ВидОбъектаКонтактнойИнформации = Выборка.ВидОбъектаКонтактнойИнформации;
		ОбъектСобытия = Выборка.Объект;
	КонецЕсли;
	Если Выборка.Количество() > 1 Тогда
		ДопИнфо = ДопИнфо + "Обнаружены дублирующиеся контактные данные: ";
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл
			ДопИнфо = ДопИнфо + Символы.ПС+Строка(Выборка.ОбъектПредставление)+": "+СокрЛП(Выборка.НомерТелефона)+";";
		КонецЦикла;;
	КонецЕсли;
	
	Возврат ОбъектСобытия;
КонецФункции	

//Э_Волощук (14.05.2019 10:19:34
Функция Э_ДубликатиКонтактовПоНомеруТелефона(НомерТелефона, ОбъектИсключение=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипКонтактнойИнформации", Перечисления.ТипыКонтактнойИнформации.Телефон);
	тНомерТелефона = Э_ТелефонияBinotel.Э_ПреобразоватьНомерТелефонаБезРазделителей(НомерТелефона);
	Если тНомерТелефона="" или СтрДлина(тНомерТелефона)<=6 Тогда
		Возврат Неопределено;
	КонецЕсли;	
	Запрос.УстановитьПараметр("НомерТелефона", "%"+тНомерТелефона);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Вид.ВидОбъектаКонтактнойИнформации КАК ВидОбъектаКонтактнойИнформации,
	|	КонтактнаяИнформация.CRM_НомерТелефона КАК НомерТелефона,
	|	КонтактнаяИнформация.Объект.Представление КАК ОбъектПредставление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &ТипКонтактнойИнформации
	|	И КонтактнаяИнформация.Вид.ВидОбъектаКонтактнойИнформации В (ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовКонтактнойИнформации.Контрагенты), ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица), ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов))
	|	И КонтактнаяИнформация.CRM_НомерТелефона ПОДОБНО &НомерТелефона
	|	И Не КонтактнаяИнформация.Объект.ПометкаУдаления
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДублиКонтактов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Объект = ОбъектИсключение Тогда
			Продолжить;
		КонецЕсли;
		
		ДублиКонтактов.Добавить(Выборка.Объект);
	КонецЦикла;
	
	Возврат ДублиКонтактов;
КонецФункции
//Э_Волощук)

Функция Э_ПоискКонтактаВБазе1С(CustomerID, ВидОбъектаКонтактнойИнформации=Неопределено, ДопИнфо="", Э_НастройкиБинотел=Неопределено) Экспорт 
	Перем ТекКонтакт;
	
	Если Э_НастройкиБинотел=Неопределено Тогда
		Э_НастройкиБинотел=Э_ПолучитьНастройкиБинотел();
		Если Э_НастройкиБинотел=Неопределено Тогда
		     Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ВидОбъектаКонтактнойИнформации = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("CustomerID", CustomerID);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ТелефонияКодыКлиентов.Контакт
	|ИЗ
	|	РегистрСведений.Э_ТелефонияКодыКлиентов КАК ТелефонияКодыКлиентов
	|ГДЕ
	|	ТелефонияКодыКлиентов.ТелефонияКод = &CustomerID";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТекКонтакт = Выборка.Контакт;
		
		Если ТипЗнч(ТекКонтакт) = Тип("СправочникСсылка.Контрагенты") Тогда
			ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты;
		ИначеЕсли ВернутьЕстьСправочникКонтактныеЛицаКонтрагентов() и ТипЗнч(ТекКонтакт) = Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов") Тогда
			ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов;
		ИначеЕсли ВернутьЕстьСправочникКонтактныеЛица() и ТипЗнч(ТекКонтакт) = Тип("СправочникСсылка.КонтактныеЛица") Тогда
			ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов;
		//Э_NCT(06.12.2018 17:41:33 www.nct.ua 	
		//иначеЕсли Э_НастройкиБинотел.Э_BinotelУправлениеЛидами и ТипЗнч(ТекКонтакт) = Тип("СправочникСсылка.Э_Лиды") Тогда
	    иначеЕсли Э_НастройкиБинотел.Э_BinotelУправлениеЛидами и ТипЗнч(ТекКонтакт) = Тип("СправочникСсылка.Э_Лиды") и Не ТекКонтакт.Закрыт Тогда
		//Э_NCT) 
			ВидОбъектаКонтактнойИнформации = "Э_Лиды";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекКонтакт;
КонецФункции	

Функция Э_СтрокаСодержитНомер(ТекСтрока, НомерТелефона) Экспорт 
	ЕстьНомер = Ложь;
	
	МассивНомеровПеренаправлено	= ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ТекСтрока, ">");
	Для Каждого ТекНомер Из МассивНомеровПеренаправлено Цикл
		Если СокрЛП(ТекНомер) = НомерТелефона Тогда
			ЕстьНомер = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ЕстьНомер;
КонецФункции	

// Выводит информационное сообщение
//
// Параметры:
//  ТекстСообщения - строка, текст сообщения.
//  Отказ          - строка, заголовок.
//  Статус         - СтатусСообщения
//
Процедура СообщитьИнформацию(ТекстСообщения, Заголовок = "", Статус = Неопределено) Экспорт

	#Если Клиент Тогда
		
		Если Статус = Неопределено Тогда
			Статус = СтатусСообщения.Информация;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Заголовок) Тогда
			Сообщить(Заголовок);
			Заголовок = "";
		КонецЕсли;
		
		Сообщить(ТекстСообщения, Статус);
		
	#КонецЕсли
	
КонецПроцедуры 

Процедура Э_ПередЗаписьюРегистраСведенийКонтактнаяИнформацияПередЗаписью(Источник, Отказ, Замещение) Экспорт
	Для каждого Запись Из Источник Цикл
		Если Запись.Тип<>Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Продолжить;
		КонецЕсли;	
		Э_НомерТелефона = Э_ТелефонияBinotel.Э_ПреобразоватьНомерТелефонаБезРазделителей(Запись.Представление);
		Если (СокрЛП(Запись.CRM_НомерТелефона) <> СокрЛП(Э_НомерТелефона)) Тогда
			Запись.CRM_НомерТелефона = Э_НомерТелефона;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура Э_ЗаполнитьКонтактыВСобытияхГдеНеНеЗаполненоПоНомеруТелефонаВОписанииСобытия() Экспорт
    Э_ЗаполнитьКонтактыВСобытияхГдеНеЗаполненоПоНомеруТелефона();
КонецПроцедуры

Функция ПолучитьЧасовойПояс()
	ТекДата = ТекущаяДата();
	UTC = УниверсальноеВремя(ТекДата);
	ЧасовойПояс = (ТекДата-UTC)/3600;
	
	Возврат ЧасовойПояс;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С МИНИ-СРМ "МОИ КЛИНТЫ"

Функция Э_ЗаписатьIDКлиентаВСистемеБинотел(CustomerID, Numbers=Неопределено, Клиент=Неопределено) Экспорт 
	Если ЗначениеЗаполнено(CustomerID) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("CustomerID", CustomerID);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Э_ТелефонияКодыКлиентов.Контакт.Ссылка
		|ИЗ
		|	РегистрСведений.Э_ТелефонияКодыКлиентов КАК Э_ТелефонияКодыКлиентов
		|ГДЕ
		|	Э_ТелефонияКодыКлиентов.ТелефонияКод = &CustomerID";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		НаборЗаписей = РегистрыСведений.Э_ТелефонияКодыКлиентов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Контакт.Установить(Клиент);
		Если ЗначениеЗаполнено(CustomerID) Тогда
			
			 НовЗапись = НаборЗаписей.Добавить();
			 НовЗапись.Контакт =  Клиент;
			 НовЗапись.ТелефонияКод = CustomerID ; 
		КонецЕсли;
		Попытка
			НаборЗаписей.Записать();
		Исключение
			СообщитьИнформацию(НСтр("ru='Не записано ID в виртуальной АТС для: ';uk='Не записано ID в віртуальній АТС для: '")+Строка(Клиент)+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки());  
			Возврат Ложь;
		КонецПопытки;
		
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивНомеров", Numbers);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтактнаяИнформация.Объект КАК Ссылка
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтактнаяИнформация.CRM_НомерТелефона В(&МассивНомеров)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 1 Тогда
		СтрокаТелефонов = "";
		Для Каждого ТекТелефон Из Numbers Цикл
			СтрокаТелефонов = СтрокаТелефонов + ТекТелефон + ", ";
		КонецЦикла;
		СтрокаТелефонов = Лев(СтрокаТелефонов, СтрДлина(СтрокаТелефонов)-2);
		СообщитьИнформацию(НСтр("ru='Некоторые номера из списка принадлежат более чем одному контрагенту: ';uk='Деякі номери зі списку належать більш ніж одному контрагенту: '")+СтрокаТелефонов);  
	КонецЕсли;	
	
	Пока Выборка.Следующий() Цикл
		ТекКлиент = Выборка.Ссылка;
		//Э_NCT(23.11.2018 14:40:01 www.nct.ua 
		//Если Не (ТипЗнч(ТекКлиент)=тип("СправочникСсылка.Контрагенты") или ТипЗнч(ТекКлиент)=тип("СправочникСсылка.КонтактныеЛицаКонтрагентов")) Тогда
		Если Не (ТипЗнч(ТекКлиент)=тип("СправочникСсылка.Контрагенты") 
		или (ВернутьЕстьСправочникКонтактныеЛицаКонтрагентов() и ТипЗнч(ТекКлиент)=тип("СправочникСсылка.КонтактныеЛицаКонтрагентов")) 
		или (ВернутьЕстьСправочникКонтактныеЛица() и ТипЗнч(ТекКлиент)=тип("СправочникСсылка.КонтактныеЛица"))) Тогда
		//Э_NCT) 
		     Продолжить;
		КонецЕсли; 
		
		МенеджерЗаписи = РегистрыСведений.Э_ТелефонияКодыКлиентов.СоздатьМенеджерЗаписи();	
		МенеджерЗаписи.Контакт = ТекКлиент;
		МенеджерЗаписи.ТелефонияКод = CustomerID;
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			СообщитьИнформацию(НСтр("ru='Не записано ID в виртуальной АТС для: ';uk='Не записано ID в віртуальній АТС для: '")+Строка(ТекКлиент)+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки()); 
			Возврат Ложь;
		КонецПопытки;
		
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции 	

Функция Э_ЗаписатьIDСотрудникаВСистеме(employeeID, extNumber="", employeeEmail="", ТекСотрудник=Неопределено) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("employeeID", employeeID);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Э_ТелефонияКодыСотрудников.Сотрудник.Ссылка
	|ИЗ
	|	РегистрСведений.Э_ТелефонияКодыСотрудников КАК Э_ТелефонияКодыСотрудников
	|ГДЕ
	|	Э_ТелефонияКодыСотрудников.ТелефонияКод = &employeeID";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Э_НастройкиБинотел=Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
	     Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("extNumber", extNumber);
	Запрос.УстановитьПараметр("ОтборПоВнутреннемуНомеру", ?(ЗначениеЗаполнено(extNumber),Истина,Ложь));
	Запрос.УстановитьПараметр("ТекСотрудник", ТекСотрудник);
	Запрос.УстановитьПараметр("ОтборПоСсылкеНаСотрудник", ?(ЗначениеЗаполнено(ТекСотрудник),Истина,Ложь));
	Запрос.УстановитьПараметр("ВидКонтактнойИнформации", Э_НастройкиБинотел.Э_BinotelВнутреннийТелефонПользователяВид);
	Запрос.УстановитьПараметр("Э_ДлинаВнутреннегоНомераТелефона", Э_НастройкиБинотел.Э_BinotelДлинаВнутреннегоНомераТелефона);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтактнаяИнформация.Объект КАК Ссылка,
	|	Э_ТелефонияКодыСотрудников.ТелефонияКод КАК Э_EmployeeID
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Э_ТелефонияКодыСотрудников КАК Э_ТелефонияКодыСотрудников
	|		ПО КонтактнаяИнформация.Объект.Ссылка = Э_ТелефонияКодыСотрудников.Сотрудник.Ссылка
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтактнаяИнформация.Вид = &ВидКонтактнойИнформации
	|	И ВЫБОР
	|			КОГДА &ОтборПоСсылкеНаСотрудник
	|				ТОГДА КонтактнаяИнформация.Объект = &ТекСотрудник
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоВнутреннемуНомеру
	|				ТОГДА ПОДСТРОКА(КонтактнаяИнформация.CRM_НомерТелефона, 1, &Э_ДлинаВнутреннегоНомераТелефона) = &extNumber
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не ЗначениеЗаполнено(ТекСотрудник) и ЗначениеЗаполнено(extNumber) и Выборка.Количество() > 1 Тогда
		СообщитьИнформацию(НСтр("ru='Внутренний номер ';uk='Внутрішній номер '")+Строка(extNumber)+НСтр("ru=' принадлежат более чем одному сотруднику.';uk=' належить більш ніж одному співробітнику.'"));   
	КонецЕсли;	
	
	Пока Выборка.Следующий() Цикл
		ТекПользователь = Выборка.Ссылка;
		НаборЗаписей = РегистрыСведений.Э_ТелефонияКодыСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Сотрудник.Установить(ТекПользователь);
		НовЗапись = НаборЗаписей.Добавить();
		НовЗапись.Сотрудник = ТекПользователь;
		НовЗапись.ТелефонияКод = employeeID;
		//в параметрах функции добавлено параметр "employeeEmail"
		НовЗапись.employeeEmail = employeeEmail;
		Попытка
			НаборЗаписей.Записать();
		Исключение
			СообщитьИнформацию(НСтр("ru='Не записано ID в виртуальной АТС ';uk='Не записано ID в віртуальній АТС '")+Строка(extNumber)+НСтр("ru=' для пользователя ';uk=' для користувача '")+Строка(ТекПользователь)+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки());     
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции 	

Процедура Э_ПередЗаписьюСобытияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Э_НастройкиБинотел=Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
	     Возврат;
	КонецЕсли;
	Если Э_НастройкиБинотел.Э_BinotelУправлениеЛидами Тогда
		Э_УправлениеЛидами.Э_ПередЗаписьюСобытияПередЗаписью_Лиды(Источник, Отказ, РежимЗаписи, РежимПроведения);
	КонецЕсли;	
КонецПроцедуры

Процедура Э_ПриЗаписиСобытияПриЗаписи(Источник, Отказ) Экспорт
	Э_УдалитьЗаписиИзСпискаПропущенныхЕслиПерезвонили(Источник.Ссылка);
	//Э_Волощук (25.03.2019 16:36:08
	Э_АвтоматическиЗакрытьЗадачиПоПропущеннымЗвонкам(Источник.Ссылка);
	//Э_Волощук)
КонецПроцедуры

Функция ОпределитьВерсиюПлатформы() Экспорт
	
    СисИнфо = Новый СистемнаяИнформация;
    Возврат Лев(СисИнфо.ВерсияПриложения,3);
	
КонецФункции

Функция Э_ОпределитьНомерТелефонаКонтрагента(ПараметрыЗвонка) Экспорт
	Если ПараметрыЗвонка.callType="0" Тогда // входящий
		НомерТелефона = ПараметрыЗвонка.srcNumber;
	ИначеЕсли ПараметрыЗвонка.callType="1" Тогда // исходящий
		НомерТелефона = ПараметрыЗвонка.dstNumbers[0].dstNumber;
	КонецЕсли;	
	Возврат НомерТелефона;
Конецфункции	

Процедура Э_ЗарегистрироватьИзмененияПоКонтактнымЛицамКонтрагента(Контрагент) Экспорт
	Перем Э_НастройкиБинотел,Э_BinotelПланОбмена,Запрос,РезультатЗапроса;
	
	Э_НастройкиБинотел=Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
	     Возврат;
	КонецЕсли;
	
	Если Не Э_НастройкиБинотел.Э_BinotelВыполнятьСинхронизациюКонтрагентов Тогда
	    Возврат;
	КонецЕсли;
	
	Э_BinotelПланОбмена	= Э_НастройкиБинотел.Э_BinotelПланОбмена;
	Если ЗначениеЗаполнено(Э_BinotelПланОбмена) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		             |	КонтактныеЛицаКонтрагентов.Ссылка
		             |ИЗ
		             |	Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
		             |ГДЕ
		             |	КонтактныеЛицаКонтрагентов.Владелец = &Контрагент";
		Запрос.УстановитьПараметр("Контрагент",Контрагент.Ссылка);			 
		РезультатЗапроса=Запрос.Выполнить().Выбрать();			 
		Пока РезультатЗапроса.Следующий() Цикл
		     ПланыОбмена.ЗарегистрироватьИзменения(Э_BinotelПланОбмена,РезультатЗапроса.Ссылка);
		КонецЦикла; 
	иначе
		СообщитьИнформацию(НСтр("ru='В настройках интеграции с Бинотел не заполнен план обмена с ""Бинотел"". Регистр сведений ""Binotel: Настройки""';uk='В налаштуваннях інтеграції з Бінотел не заповнено план обміну з ""Бінотел"". Реєстр відомостей ""Binotel: Налаштування""'"));   
	КонецЕсли;
КонецПроцедуры

Функция Э_ПолучитьНастройкиБинотел() Экспорт
	 	
	Э_BinotelЧасовойПояс = ПолучитьЧасовойПояс();
				
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	             |	Э_BinotelНастройки.Э_BinotelapiKey,
	             |	Э_BinotelНастройки.Э_BinotelapiSecret,
				 |	0 КАК Э_BinotelЧасовойПояс,
				 |	Э_BinotelНастройки.Э_BinotelВнутреннийТелефонПользователяВид,
	             |	Э_BinotelНастройки.Э_BinotelДлинаВнутреннегоНомераТелефона,
	             |	Э_BinotelНастройки.Э_BinotelПериодБлокировкиЗапросов,
	             |	Э_BinotelНастройки.Э_BinotelПланОбмена,
	             |	Э_BinotelНастройки.Э_BinotelПриЗвонкеВоспроизводитьАудиоОжидайтеПожалуйстаНаЛинии,
	             |	Э_BinotelНастройки.Э_BinotelЕслиСобытиеНеНайденоПоIDТоИскатьПервоеЗапланированноеПоКонтрагенту,
				 |	Э_BinotelНастройки.Э_BinotelВыполнятьСинхронизациюКонтрагентов,
				 |	Э_BinotelНастройки.Э_BinotelУправлениеЛидами
				 |  ,Э_BinotelНастройки.Э_BinotelИнформацияОЗвонке
				 |	,Э_BinotelВыводитьЗакладкуФизическиеЛица,
				 |	Э_BinotelВыводитьЗакладкуКонтрагенты
				 |,Э_BinotelСоздаватьЗапланированныеСобытияТелефонныйЗвонок,
				 |Э_BinotelБазовоеВремяДляПланированияЗвонка,
				 |Э_BinotelПериодСозданияСобитияДляГорячегоЛида,
				 |Э_BinotelПериодСозданияСобитияДляТеплогоЛида,
				 |Э_BinotelПериодСозданияСобитияДляХолодногоЛида
				 |,Э_BinotelДатаНачалаОбработкиЛидов
				 |  ,Э_BinotelИспользоватьФункционалИнтеграции
				 |  ,Э_BinotelapiIDМетки
				 |  ,Э_BinotelСоздаватьЗадачиНапоминанияПоПропущеннымЗвонкам
				 |	,Э_BinotelГруппыПартнеров,                              
				 |	Э_BinotelОграничитьВыгрузкуПартнеровПоГруппам,
				 |  Э_BinotelВыводитьВСобытииКонтактыНайденныеПоТелефонуЕслиБольшеОдного
				 |,Э_КоличествоДнейХраненияПропущенныхЗвонков
				 //Э_Волощук (10.12.2018 15:55:12
				 |,Э_СписокВнутреннихТелефоновПоКоторымНеЗагружатьЗвонки,
				 | Выразить(Э_ПутьКПрограммеВоспроизведенияЗвука КАК Строка(1000)) КАК Э_ПутьКПрограммеВоспроизведенияЗвука
				 //Э_Волощук)
				 //Э_Волощук (06.07.2019 17:12:01
				 ////Э_Волощук (18.02.2019 16:12:19
				 //|	,Э_ОткрыватьЖурналЗаказовПоКлиентуПриСозданииЗаказаПокупателя
				 ////Э_Волощук)
				 |	,Э_ОткрыватьЖурналЗаказовПоКлиенту
				 //Э_Волощук)
				 //Э_Волощук (25.03.2019 15:50:01
				 |	,Э_АвтоматическиЗакрыватьЗадачиПоПропущеннымЗвонкам
				 //Э_Волощук)
				 //Э_Волощук (13.05.2019 20:27:05
				 |	,Э_ОткрыватьНовыйЗаказПокупателяПриПолученииИнформацииОТекущемЗвонке
				 //Э_Волощук)
				 //Э_Волощук (27.09.2019 16:11:46
				 |	,Э_КоличествоДнейОтТекущейДатыКогдаПредЗаказСчитаетсяНовым
				 //Э_Волощук)
		 		 |ИЗ
	             |	РегистрСведений.Э_BinotelНастройки КАК Э_BinotelНастройки";
		
	РезультатЗапроса=Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		СообщитьИнформацию(НСтр("ru='В регистре сведений ""Binotel:Настройки"" не обнаружена запись с настройками.';uk='У реєстрі відомостей ""Binotel:Налаштування"" не знайдено запис з налаштуваннями.'"));
	Иначе
		РезультатТаблица = РезультатЗапроса.Выгрузить();
		РезультатТаблица[0].Э_BinotelЧасовойПояс = Э_BinotelЧасовойПояс;
		 
		Если Не ЗначениеЗаполнено(РезультатТаблица[0].Э_КоличествоДнейХраненияПропущенныхЗвонков) Тогда
		     РезультатТаблица[0].Э_КоличествоДнейХраненияПропущенныхЗвонков = 3;
		КонецЕсли;
		 
		Возврат РезультатТаблица[0];
	КонецЕсли;
	
	
	Возврат Неопределено;
КонецФункции 

Процедура Э_ПриЗаписиКонтрагентаПриЗаписи(Источник, Отказ) Экспорт
   Э_ТелефонияBinotel.Э_ЗарегистрироватьИзмененияПоКонтактнымЛицамКонтрагента(Источник);
КонецПроцедуры

Процедура Э_ПриЗаписиРегистраСведенийКонтактнаяИнформацияПриЗаписи(Источник, Отказ, Замещение) Экспорт
	Э_НастройкиБинотел=Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
	     Возврат;
	КонецЕсли;
	Если Э_НастройкиБинотел.Э_BinotelУправлениеЛидами Тогда
		Э_УправлениеЛидами.Э_ПриЗаписиРегистраСведенийКонтактнаяИнформацияПриЗаписи_Лиды(Источник, Отказ, Замещение);
	КонецЕсли;	
	//Не выходит так записывать, может не быть доступа. Будет продолжать делать это регламентное задание
	//Э_ПриЗаписиРегистраСведенийКонтактнаяИнформацияПриЗаписи_Контрагенты(Источник, Отказ, Замещение);
КонецПроцедуры

Процедура Э_ПередЗаписьюСправочникКонтрагентыПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ЭтоГруппа Тогда 
		Возврат;
	КонецЕсли;
	
	Если Источник.МенеджерыПокупателя.НайтиСтроки(Новый Структура("МенеджерПокупателя", Источник.ОсновнойМенеджерПокупателя)).Количество() = 0 тогда
		Источник.ОсновнойМенеджерПокупателя = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

Функция Э_ПолучитьКодКлиентаВТелефонии(ТекКлиент) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ разрешенные
	             |	Э_ТелефонияКодыКлиентов.ТелефонияКод,
	             |	Э_ТелефонияКодыКлиентов.Контакт
	             |ИЗ
	             |	РегистрСведений.Э_ТелефонияКодыКлиентов КАК Э_ТелефонияКодыКлиентов
	             |ГДЕ
	             |	Э_ТелефонияКодыКлиентов.Контакт = &Контакт";
	Запрос.УстановитьПараметр("Контакт",ТекКлиент);			 
	Результат=Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ТелефонияКод;
	иначе
		Возврат Неопределено;
    КонецЕсли;
КонецФункции 
 
// ─────────────────────────────────────────────────────────────────────────────
//  ПРОЦЕДУРЫ И ФУНКЦИИ ОТПРАВКИ ЗАПРОСА

// Дата в стандартном формате 
//
//Примеры:
// 1370034000 - Sat, 01 Jun 2013 00:00:00 +0300
// 1370120399 - Sat, 01 Jun 2013 23:59:59 +0300
Функция Дата_формат1С(Дата,ЧасовойПояс) Экспорт 
	Если ТипЗнч(Дата) = Тип("Число") Тогда
		ДатаUNIX = Дата;
	Иначе
		Попытка
			ДатаUNIX = Число(Дата);
		Исключение
			Возврат Дата(1,1,1);
		КонецПопытки;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач",		Дата(1970,1,1));
	Запрос.УстановитьПараметр("ДатаUNIX",		ДатаUNIX);
	Запрос.УстановитьПараметр("ВременнойПояс",	ЧасовойПояс);
	Запрос.Текст = "ВЫБРАТЬ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&ДатаНач, СЕКУНДА, &ДатаUNIX), ЧАС, &ВременнойПояс) КАК Date";
		
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Date;
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
	
КонецФункции // Дата_unix_timestamp()

// Дата в формате unix timestamp
//
//Примеры:
// 1370034000 - Sat, 01 Jun 2013 00:00:00 +0300
// 1370120399 - Sat, 01 Jun 2013 23:59:59 +0300
Функция Дата_unix_timestamp(Дата,ЧасовойПояс) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", Дата(1970,1,1));
	Запрос.УстановитьПараметр("ДатаТек", Дата);
	Запрос.УстановитьПараметр("ВременнойПояс", ЧасовойПояс);
	Запрос.Текст = "ВЫБРАТЬ РАЗНОСТЬДАТ(&ДатаНач, ДОБАВИТЬКДАТЕ(&ДатаТек, ЧАС, -1*&ВременнойПояс), СЕКУНДА) КАК Date";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Date;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции // Дата_unix_timestamp()

Функция json_encode(params)
	json_представление = "";
	Кавычка = """";
	
	Если ТипЗнч(params) = Тип("Массив") Тогда
		Для Каждого Парам Из params Цикл
			Если НЕ ЗначениеЗаполнено(Парам) Тогда
				Продолжить;
			КонецЕсли;	
			Если ТипЗнч(Парам) = Тип("Строка") Тогда
				json_представление = json_представление +""""+Парам.Ключ+""""+":"+Кавычка+Парам+Кавычка+",";
			Иначе
				json_представление = json_представление +""""+Парам.Ключ+""""+":"+Парам.Значение+",";
			КонецЕсли;
		КонецЦикла; 
		json_представление = Лев(json_представление,СтрДлина(json_представление)-1);
		json_представление = СтрЗаменить(json_представление,Символы.НПП,"");
		json_представление = "["+json_представление+"]";
	ИначеЕсли ТипЗнч(params) = Тип("Структура") Тогда
		Для Каждого Парам Из params Цикл
			Если НЕ ЗначениеЗаполнено(Парам.Значение) Тогда
				Продолжить;
			КонецЕсли;	
			Если ТипЗнч(Парам.Значение) = Тип("Массив") Тогда
				json_представление_массив = "";
				Для Каждого ЭлМассива Из Парам.Значение Цикл
					json_представление_массив = json_представление_массив + Строка(ЭлМассива) + ","
				КонецЦикла;	
				json_представление_массив = Лев(json_представление_массив,СтрДлина(json_представление_массив)-1);
				json_представление = json_представление +""""+Парам.Ключ+""""+":"+"["+json_представление_массив+"]";
			ИначеЕсли ТипЗнч(Парам.Значение) = Тип("Строка") Тогда
				json_представление = json_представление +""""+Парам.Ключ+""""+":"+Кавычка+Парам.Значение+Кавычка+",";
			Иначе
				json_представление = json_представление +""""+Парам.Ключ+""""+":"+Парам.Значение+",";
			КонецЕсли;
		КонецЦикла; 
		json_представление = Лев(json_представление,СтрДлина(json_представление)-1);
		json_представление = СтрЗаменить(json_представление,Символы.НПП,"");
		json_представление = "{"+json_представление+"}";
	КонецЕсли;

	Возврат json_представление;
	
КонецФункции // json_encode()

Функция Э_НайтиСобытие(НачПериода,CallID, НомерТелефона,ВидОбъектаКонтактнойИнформации,Э_НастройкиБинотел) Экспорт 
	 Если Э_НастройкиБинотел=Неопределено Тогда
	    Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не заполнены настройки по синхронизации с ""Бинотел""';uk='Не заповнені налаштування по синхронізації з ""Бінотел""'")); 
		Возврат Неопределено;
	 КонецЕсли; 
	
	 НайденноеСобытие=Э_СобытиеПоIdBinotel(CallID); 
     
	 Если НайденноеСобытие=неопределено и Э_НастройкиБинотел.Э_BinotelЕслиСобытиеНеНайденоПоIDТоИскатьПервоеЗапланированноеПоКонтрагенту и ЗначениеЗаполнено(НомерТелефона) Тогда
		ТекКонтрагент=Неопределено;
		ТекКонтактноеЛицо=Неопределено;
		ТекКонтактноеЛицоБезКонтрагента=Неопределено;
	    Э_ОпределитьКонтрагентаКонтактноеЛицо(НомерТелефона, ВидОбъектаКонтактнойИнформации,ТекКонтрагент,ТекКонтактноеЛицо,ТекКонтактноеЛицоБезКонтрагента);
	    ЕстьОтборПоКонтрагенту                  =?(ЗначениеЗаполнено(ТекКонтрагент),Истина,Ложь);
	    ЕстьОтборПоКонтактномуЛицу              =?(ЗначениеЗаполнено(ТекКонтактноеЛицо),Истина,Ложь);
	    ЕстьОтборПоКонтактномуЛицуБезКонтрагента=?(ЗначениеЗаполнено(ТекКонтактноеЛицоБезКонтрагента),Истина,Ложь);
		
		Если ЕстьОтборПоКонтрагенту или ЕстьОтборПоКонтактномуЛицу или ЕстьОтборПоКонтактномуЛицуБезКонтрагента Тогда
			
			НайденноеСобытие=Э_НайтиЗапланированноеСобытиеПоКонтакту(ТекКонтрагент,ТекКонтактноеЛицо,ТекКонтактноеЛицоБезКонтрагента,Э_НастройкиБинотел);
		КонецЕсли;	
		Если НайденноеСобытие=неопределено и Э_НастройкиБинотел.Э_BinotelУправлениеЛидами Тогда  
			ТекЭ_Лид=Э_УправлениеЛидами.Э_НайтиЛид(НомерТелефона);
		     НайденноеСобытие=Э_НайтиЗапланированноеСобытиеПоКонтакту(,,,Э_НастройкиБинотел,ТекЭ_Лид);
		КонецЕсли;
	 КонецЕсли;
	 Возврат НайденноеСобытие; 
КонецФункции	

Функция Э_НайтиЗапланированноеСобытиеПоКонтакту(ТекКонтрагент,ТекКонтактноеЛицо,ТекКонтактноеЛицоБезКонтрагента,Э_НастройкиБинотел,Э_Лид=Неопределено) Экспорт
   Перем ЕстьОтборПоКонтрагенту,ЕстьОтборПоКонтактномуЛицу,ЕстьОтборПоКонтактномуЛицуБезКонтрагента,ЕстьОтборПоЭ_Лид,Запрос,Результат;	
   
   Если Э_НастройкиБинотел=Неопределено Тогда
	    Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не заполнены настройки по синхронизации с ""Бинотел""';uk='Не заповнені налаштування по синхронізації з ""Бінотел""'")); 
		Возврат Неопределено;
   КонецЕсли; 
   
   ЕстьОтборПоКонтрагенту                  =?(ЗначениеЗаполнено(ТекКонтрагент),Истина,Ложь);
   ЕстьОтборПоКонтактномуЛицу              =?(ЗначениеЗаполнено(ТекКонтактноеЛицо),Истина,Ложь);
   ЕстьОтборПоКонтактномуЛицуБезКонтрагента=?(ЗначениеЗаполнено(ТекКонтактноеЛицоБезКонтрагента),Истина,Ложь);
   ЕстьОтборПоЭ_Лид=?(ЗначениеЗаполнено(Э_Лид),Истина,Ложь);	
   
   Если ЕстьОтборПоКонтрагенту или ЕстьОтборПоКонтактномуЛицу или ЕстьОтборПоКонтактномуЛицуБезКонтрагента или ЕстьОтборПоЭ_Лид Тогда
		 
	   Запрос=Новый Запрос;
	   Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                |	Событие.Ссылка
	                |ИЗ
	                |	Документ.Событие КАК Событие
	                |ГДЕ
	                |	НЕ Событие.ПометкаУдаления
	                |	И Событие.ВидСобытия = &ВидСобытия
	                |	И Событие.СостояниеСобытия = &СостояниеСобытия
	                |	И ВЫБОР
	                |			КОГДА &ЕстьОтборПоКонтрагенту
	                |				ТОГДА Событие.Контрагент = &Контрагент
	                |			ИНАЧЕ ИСТИНА
	                |		КОНЕЦ
	                |	И ВЫБОР
	                |			КОГДА &ЕстьОтборПоКонтактномуЛицу
	                |				ТОГДА Событие.КонтактноеЛицо = &КонтактноеЛицо
	                |			ИНАЧЕ ИСТИНА
	                |		КОНЕЦ
	                |	И ВЫБОР
	                |			КОГДА &ЕстьОтборПоКонтактномуЛицуБезКонтрагента
	                |				ТОГДА Событие.КонтактноеЛицоБезКонтрагента = &КонтактноеЛицоБезКонтрагента
	                |			ИНАЧЕ ИСТИНА
	                |		КОНЕЦ";
					Если Э_НастройкиБинотел.Э_BinotelУправлениеЛидами Тогда
					    Запрос.Текст=Запрос.Текст+"
		                |	И ВЫБОР
		                |			КОГДА &ЕстьОтборПоЭ_Лид
		                |				ТОГДА Событие.Э_Лид = &Э_Лид
		                |			ИНАЧЕ ИСТИНА
		                |		КОНЕЦ";
					КонецЕсли; 
				    Запрос.Текст=Запрос.Текст+"
	                |
	                |УПОРЯДОЧИТЬ ПО
					|	Событие.Дата";
					
					
	    //Запрос.УстановитьПараметр("ДатаНачало",НачалоМесяца(НачПериода));									
		Запрос.УстановитьПараметр("ЕстьОтборПоКонтрагенту",ЕстьОтборПоКонтрагенту);			
		Запрос.УстановитьПараметр("Контрагент",ТекКонтрагент);			
		Запрос.УстановитьПараметр("ЕстьОтборПоКонтактномуЛицу",ЕстьОтборПоКонтактномуЛицу);			
		Запрос.УстановитьПараметр("КонтактноеЛицо",ТекКонтактноеЛицо);			
		Запрос.УстановитьПараметр("ЕстьОтборПоКонтактномуЛицуБезКонтрагента",ЕстьОтборПоКонтактномуЛицуБезКонтрагента);			
		Запрос.УстановитьПараметр("КонтактноеЛицоБезКонтрагента",ТекКонтактноеЛицоБезКонтрагента);			
		Запрос.УстановитьПараметр("ЕстьОтборПоЭ_Лид",ЕстьОтборПоЭ_Лид);			
		Запрос.УстановитьПараметр("Э_Лид",Э_Лид);			
		Запрос.УстановитьПараметр("ВидСобытия",Перечисления.ВидыСобытий.ТелефонныйЗвонок);			
		Запрос.УстановитьПараметр("СостояниеСобытия",Перечисления.СостоянияСобытий.Запланировано);			
		Результат=Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
		     Возврат Результат.Ссылка;
		иначе	 
		     возврат Неопределено;	 
		КонецЕсли;
	иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции 

Функция Э_СобытиеПоIdBinotel(CallID) Экспорт 
	ЗапросЗвонок = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Док.Ссылка ИЗ Документ.Событие КАК Док ГДЕ Док.Э_CallIDЗвонкаBinotel ПОДОБНО &CallID");
	ЗапросЗвонок.УстановитьПараметр("CallID", CallID+"%");
	ВыборкаЗвонок = ЗапросЗвонок.Выполнить().Выбрать();
	Если ВыборкаЗвонок.Следующий() Тогда
		Возврат ВыборкаЗвонок.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции	


//Процедура Э_ОпределитьКонтрагентаКонтактноеЛицо(НомерТелефона, ВидОбъектаКонтактнойИнформации,ТекКонтрагент,ТекКонтактноеЛицо=Неопределено,ТекКонтактноеЛицоБезКонтрагента=Неопределено)
Процедура Э_ОпределитьКонтрагентаКонтактноеЛицо(НомерТелефона, ВидОбъектаКонтактнойИнформации,ТекКонтрагент,ТекКонтактноеЛицо=Неопределено,ТекКонтактноеЛицоБезКонтрагента=Неопределено) Экспорт

	ОбъектСобытия = Э_ТелефонияBinotel.Э_ОбъектСобытияПоНомеруТелефона(НомерТелефона, ВидОбъектаКонтактнойИнформации);
	ТекКонтрагент=Неопределено;
	ТекКонтактноеЛицо=Неопределено;
	ТекКонтактноеЛицоБезКонтрагента=Неопределено;
	Если ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты Тогда
		Если ВернутьЕстьСправочникКонтактныеЛицаКонтрагентов() Тогда
			Если типЗнч(ОбъектСобытия)=Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов") Тогда
			    ТекКонтактноеЛицо = ОбъектСобытия;
				ТекКонтрагент     = ОбъектСобытия.Владелец;
			иначе	
				ТекКонтрагент = ОбъектСобытия;
				ТекКонтактноеЛицо = Справочники.КонтактныеЛицаКонтрагентов.ПустаяСсылка();
			КонецЕсли;
		иначеЕсли ВернутьЕстьСправочникКонтактныеЛица()Тогда
			Если типЗнч(ОбъектСобытия)=Тип("СправочникСсылка.КонтактныеЛица") Тогда
			    ТекКонтактноеЛицо = ОбъектСобытия;
				ТекКонтрагент     = ОбъектСобытия.Владелец;
			иначе	
				ТекКонтрагент = ОбъектСобытия;
				ТекКонтактноеЛицо = Справочники.КонтактныеЛица.ПустаяСсылка();
			КонецЕсли;
		иначе	
			ТекКонтрагент     = ОбъектСобытия;
		КонецЕсли;	
	ИначеЕсли ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов Тогда
		ТекКонтрагент = ОбъектСобытия.Владелец;
		ТекКонтактноеЛицо = ОбъектСобытия;
	ИначеЕсли ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица Тогда
		ТекКонтактноеЛицоБезКонтрагента = ОбъектСобытия;
		ТекКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		ТекКонтактноеЛицо = Справочники.КонтактныеЛица.ПустаяСсылка();
	Иначе
		ТекКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		ТекКонтактноеЛицо = "";
	КонецЕсли;
КонецПроцедуры

Процедура Э_ЗаполнитьКонтрагентаКонтактноеЛицо(ДокОбъект,НомерТелефона,ВидОбъектаКонтактнойИнформации,Э_ПерезаполнятьЕслиНеПустое=Ложь)
	ОбъектСобытия = Э_ТелефонияBinotel.Э_ОбъектСобытияПоНомеруТелефона(НомерТелефона, ВидОбъектаКонтактнойИнформации);
	ТекКонтрагент=Неопределено;
	ТекКонтактноеЛицо=Неопределено;
	ТекКонтактноеЛицоБезКонтрагента=Неопределено;
	Если ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты Тогда
		ТекКонтрагент = ОбъектСобытия;
		ТекКонтактноеЛицо = Справочники.КонтактныеЛицаКонтрагентов.ПустаяСсылка();
	ИначеЕсли ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов Тогда
		ТекКонтрагент = ОбъектСобытия.Владелец;
		ТекКонтактноеЛицо = ОбъектСобытия;
	ИначеЕсли ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица Тогда
		ТекКонтактноеЛицоБезКонтрагента = ОбъектСобытия;
		ТекКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		ТекКонтактноеЛицо = Справочники.КонтактныеЛица.ПустаяСсылка();
	Иначе
		ТекКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		ТекКонтактноеЛицо = "";
	КонецЕсли;
    Если ЗначениеЗаполнено(ТекКонтрагент) и ((ЗначениеЗаполнено(ДокОбъект.Контрагент) и ДокОбъект.Контрагент<>ТекКонтрагент и Э_ПерезаполнятьЕслиНеПустое) или 
		 (Не ЗначениеЗаполнено(ДокОбъект.Контрагент))) Тогда 
         ДокОбъект.Контрагент=ТекКонтрагент;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ТекКонтактноеЛицо) и ((ЗначениеЗаполнено(ДокОбъект.КонтактноеЛицо) и ДокОбъект.КонтактноеЛицо<>ТекКонтактноеЛицо и Э_ПерезаполнятьЕслиНеПустое) или 
		 (Не ЗначениеЗаполнено(ДокОбъект.КонтактноеЛицо))) Тогда
		 ДокОбъект.КонтактноеЛицо=ТекКонтактноеЛицо;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ТекКонтактноеЛицоБезКонтрагента) и ((ЗначениеЗаполнено(ДокОбъект.КонтактноеЛицоБезКонтрагента) и ДокОбъект.КонтактноеЛицоБезКонтрагента<>ТекКонтактноеЛицоБезКонтрагента и Э_ПерезаполнятьЕслиНеПустое) или 
		 (Не ЗначениеЗаполнено(ДокОбъект.КонтактноеЛицоБезКонтрагента))) Тогда
		 ДокОбъект.КонтактноеЛицоБезКонтрагента=ТекКонтактноеЛицоБезКонтрагента;
    КонецЕсли;	
	
КонецПроцедуры	
 
Процедура Э_ОбновитьСобытиеЕслиНеПерезаписатьВсеПоля(ДокОбъект,ПараметрыЗвонка,Э_НастройкиБинотел) Экспорт
	Перем  ТекНачалоСобытия,Э_КвоСекундРазговора,ТекОкончаниеСобытия,ТекCRM_Трудозатраты;
	
	ТекНачалоСобытия = Дата_формат1С(ПараметрыЗвонка.startTime,Э_НастройкиБинотел.Э_BinotelЧасовойПояс);
	Если ДокОбъект.НачалоСобытия<>ТекНачалоСобытия Тогда
		ДокОбъект.НачалоСобытия=ТекНачалоСобытия;
	КонецЕсли;	
	
	Попытка
		Э_КвоСекундРазговора=Число(ПараметрыЗвонка.billsec);
	исключение
		Э_КвоСекундРазговора=0;
	КонецПопытки;	
	Если ПараметрыЗвонка.Свойство("billsec") и Э_КвоСекундРазговора>0 Тогда
		ТекОкончаниеСобытия = ТекНачалоСобытия + Э_КвоСекундРазговора;
	иначе
		//Э_NCT(11.05.2019 00:31:49 www.nct.ua 
		//ТекОкончаниеСобытия = ТекНачалоСобытия+60;
		ТекОкончаниеСобытия = ТекНачалоСобытия;
		//Э_NCT) 
	КонецЕсли;
	Если ДокОбъект.ОкончаниеСобытия<>ТекОкончаниеСобытия Тогда
		Если ТекОкончаниеСобытия>ТекНачалоСобытия Тогда
		     ДокОбъект.ОкончаниеСобытия=ТекОкончаниеСобытия;
		иначе
			 //Э_NCT(11.05.2019 00:32:02 www.nct.ua 
			 //ДокОбъект.ОкончаниеСобытия=ДокОбъект.НачалоСобыти+60;  //прибавляем 1 минуту
			 ДокОбъект.ОкончаниеСобытия=ДокОбъект.НачалоСобытия;  
			 //Э_NCT) 
		Конецесли;	 
	КонецЕсли;	
	ТекCRM_Трудозатраты = Окр((ДокОбъект.ОкончаниеСобытия - ТекНачалоСобытия)/3600,3);
	Если ДокОбъект.CRM_Трудозатраты<>ТекCRM_Трудозатраты Тогда
		ДокОбъект.CRM_Трудозатраты=ТекCRM_Трудозатраты;
	КонецЕсли;	
	Если ДокОбъект.ЭтоНовый() или Не ЗначениеЗаполнено(ДокОбъект.Дата) или ДокОбъект.Дата <> ТекНачалоСобытия Тогда
		ДокОбъект.Дата = ТекНачалоСобытия;
	КонецЕсли;
	ЭтоЭ_ПропущенныйЗвонок=ПараметрыЗвонка.Свойство("billsec") и Э_КвоСекундРазговора=0 и Не ПараметрыЗвонка.Свойство("smsContent");
	Если ЭтоЭ_ПропущенныйЗвонок и Не ДокОбъект.Э_ПропущенныйЗвонок Тогда
		ДокОбъект.Э_ПропущенныйЗвонок=Истина;
	иначеЕсли не ЭтоЭ_ПропущенныйЗвонок и ДокОбъект.Э_ПропущенныйЗвонок Тогда	
		ДокОбъект.Э_ПропущенныйЗвонок=Ложь;
	КонецЕсли;	
КонецПроцедуры

Функция Э_ОпределитьНашНомерТелефона(ПараметрыЗвонка)
	Перем Э_НашНомерТелефона,ЭтоВходящееСобытие;
	Э_НашНомерТелефона="";
	ЭтоВходящееСобытие = ?(ПараметрыЗвонка.callType="0", Истина, Ложь);
	Если ЭтоВходящееСобытие Тогда
		Если ЗначениеЗаполнено(СокрЛП(ПараметрыЗвонка.didName)) Тогда
		    Э_НашНомерТелефона=СокрЛП(ПараметрыЗвонка.didName);
		иначеЕсли ЗначениеЗаполнено(СокрЛП(ПараметрыЗвонка.did)) Тогда
		    Э_НашНомерТелефона=СокрЛП(ПараметрыЗвонка.did);
		КонецЕсли;	
	иначе
		Э_НашНомерТелефона=СокрЛП(ПараметрыЗвонка.trunkNumber);
	КонецЕсли;
    Возврат Э_НашНомерТелефона;
КонецФункции // Э_ОпределитьНашНомерТелефона()
 
// Заполняет документы "Событие" данными о звонке
//
//  Параметр "Звонки" имеет тип "Соответствие"
Процедура Э_ЗаполнитьСобытие(ДокОбъект, ПараметрыЗвонка,Э_НастройкиБинотел) Экспорт 
	Перем ВидОбъектаКонтактнойИнформации,НомерТелефона,ОписаниеСобытия,СодержаниеСобытия,ТекТипСобытия,ТекНачалоСобытия;
	Перем Э_КвоСекундРазговора,ТекОкончаниеСобытия,ТекCRM_Трудозатраты,ТекИсточникИнформацииПриОбращении;
	Перем ТекОтветственный, ОбъектСобытия, ТекВидОбъекта, СловоТелефонКратко; 
	
	СловоТелефонКратко="Тел.:";

	Если Э_НастройкиБинотел=Неопределено Тогда
	    Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не заполнены настройки по синхронизации с ""Бинотел""';uk='Не заповнені налаштування по синхронізації з ""Бінотел""'")); 
		Возврат;
	КонецЕсли; 
	
	
	ОписаниеСобытия = "";
	Если ПараметрыЗвонка.Свойство("smsContent") и Не ДокОбъект.Э_SMSСообщение Тогда
		СодержаниеСобытия=ПараметрыЗвонка.smsContent;
		ДокОбъект.Э_SMSСообщение=Истина;
	иначе
		СодержаниеСобытия = "";
	 	
	КонецЕсли;	
		 
	
	Если СокрЛП(ДокОбъект.Э_CallIDЗвонкаBinotel) <> СокрЛП(ПараметрыЗвонка.CallID) Тогда
	    ДокОбъект.Э_CallIDЗвонкаBinotel = ПараметрыЗвонка.CallID;
	КонецЕсли;
	Если ДокОбъект.ВидСобытия <> Перечисления.ВидыСобытий.ТелефонныйЗвонок Тогда
	    ДокОбъект.ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
	КонецЕсли;
	
	ТекТипСобытия = ?(ПараметрыЗвонка.callType="0", Перечисления.ВходящееИсходящееСобытие.Входящее, Перечисления.ВходящееИсходящееСобытие.Исходящее);
	Если ДокОбъект.ТипСобытия<>ТекТипСобытия Тогда
		ДокОбъект.ТипСобытия=ТекТипСобытия;
	КонецЕсли;	
	Если ДокОбъект.СостояниеСобытия<>Перечисления.СостоянияСобытий.Завершено Тогда
	    ДокОбъект.СостояниеСобытия=Перечисления.СостоянияСобытий.Завершено;
	КонецЕсли;
	
	Э_ОбновитьСобытиеЕслиНеПерезаписатьВсеПоля(ДокОбъект,ПараметрыЗвонка,Э_НастройкиБинотел);
	
    Э_НашНомерТелефона=Э_ОпределитьНашНомерТелефона(ПараметрыЗвонка);
	Если СокрЛП(ДокОбъект.Э_НашНомерТелефона)<>Э_НашНомерТелефона Тогда
	    ДокОбъект.Э_НашНомерТелефона=Э_НашНомерТелефона;
	КонецЕсли;	
		
    Если ДокОбъект.ТипСобытия=Перечисления.ВходящееИсходящееСобытие.Входящее Тогда
		ТекИсточникИнформацииПриОбращении = Э_ТелефонияBinotel.Э_ИсточникИнформацииПоНомеруТелефона(ДокОбъект.Э_НашНомерТелефона, ДокОбъект.Дата);
		Если ДокОбъект.ИсточникИнформацииПриОбращении<>ТекИсточникИнформацииПриОбращении Тогда
		     ДокОбъект.ИсточникИнформацииПриОбращении=ТекИсточникИнформацииПриОбращении;
		КонецЕсли;
	КонецЕсли;
	
	//Э_Волощук (23.07.2019 17:03:55
	//Если ПараметрыЗвонка.callType="0" Тогда // входящий
	//	НомерТелефона = ПараметрыЗвонка.dstNumbers[0].dstNumber;
	//	Если Найти(НомерТелефона, ">") > 0 Тогда
	//		НомерТелефона = Прав(НомерТелефона, Э_НастройкиБинотел.Э_BinotelДлинаВнутреннегоНомераТелефона);
	//	ИначеЕсли Не ЗначениеЗаполнено(НомерТелефона) Тогда
	//		НомерТелефона = СокрЛП(ПараметрыЗвонка.did);
	//	КонецЕсли;
	//ИначеЕсли ПараметрыЗвонка.callType="1" Тогда // исходящий
	//	НомерТелефона = ПараметрыЗвонка.srcNumber;
	//КонецЕсли;
	
	НомерТелефона = Э_ОпределитьВнутреннийНомерТелефона(ПараметрыЗвонка, Э_НастройкиБинотел);
	//Э_Волощук)
	
	
	ТекОтветственный = Э_ТелефонияBinotel.Э_ОпределитьПользователяВБазе1С(ПараметрыЗвонка.employeeEmail, НомерТелефона);
		
	Если НЕ ЗначениеЗаполнено(ТекОтветственный) Тогда
		ОписаниеСобытия = ОписаниеСобытия + "Тел. внутр.: "+НомерТелефона+"; "   
	КонецЕсли;
	
	
	
	НомерТелефона=Э_ОпределитьНомерТелефонаКонтрагента(ПараметрыЗвонка);
		
	Если ПараметрыЗвонка.Свойство("customerData") и ЗначениеЗаполнено(ПараметрыЗвонка.customerData) Тогда
		ОбъектСобытия = Э_ТелефонияBinotel.Э_ПоискКонтактаВБазе1С(ПараметрыЗвонка.customerData.id, ВидОбъектаКонтактнойИнформации,,Э_НастройкиБинотел);
	КонецЕсли;
	Если ОбъектСобытия = Неопределено Тогда
		ОбъектСобытия = Э_ТелефонияBinotel.Э_ОбъектСобытияПоНомеруТелефона(НомерТелефона, ВидОбъектаКонтактнойИнформации, ?(Э_НастройкиБинотел.Э_BinotelВыводитьВСобытииКонтактыНайденныеПоТелефонуЕслиБольшеОдного,СодержаниеСобытия,""));
	КонецЕсли;	
		
	
	Если СокрЛП(ДокОбъект.Э_ТелефонАбонента)<>СокрЛП(НомерТелефона) Тогда
	     ДокОбъект.Э_ТелефонАбонента=НомерТелефона;
	КонецЕсли;	 
	
	Если ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты Тогда
		ТекВидОбъекта = Перечисления.ВидыОбъектовСобытия.Контрагент;
	ИначеЕсли ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов Тогда
		ТекВидОбъекта = Перечисления.ВидыОбъектовСобытия.Контрагент;
	ИначеЕсли ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица Тогда
		ТекВидОбъекта = Перечисления.ВидыОбъектовСобытия.ПрочиеКонтактныеЛица;
	Иначе
		ТекВидОбъекта = Перечисления.ВидыОбъектовСобытия.Контрагент;
		ОписаниеСобытия = ОписаниеСобытия + СловоТелефонКратко+НомерТелефона+"; "
	КонецЕсли;
	Если ДокОбъект.ВидОбъекта<>ТекВидОбъекта Тогда
	    ДокОбъект.ВидОбъекта=ТекВидОбъекта;
	КонецЕсли;
	Э_ЗаполнитьКонтрагентаКонтактноеЛицо(ДокОбъект,НомерТелефона,ВидОбъектаКонтактнойИнформации,истина);
	Если Э_НастройкиБинотел.Э_BinotelУправлениеЛидами Тогда
		 
		 Если Не ЗначениеЗаполнено(ДокОбъект.Контрагент) Тогда
			Если ПараметрыЗвонка.Свойство("customerData") и ЗначениеЗаполнено(ПараметрыЗвонка.customerData) Тогда
			     Э_НазваниеКлиентаВВиртуальнойАТС=ПараметрыЗвонка.customerData.Name;
				 CustomerIDВиртуальнойАТС        =ПараметрыЗвонка.customerData.id;
			иначе
				 Э_НазваниеКлиентаВВиртуальнойАТС="";
				 CustomerIDВиртуальнойАТС        ="";
			КонецЕсли;
		 иначе
			Э_НазваниеКлиентаВВиртуальнойАТС=СокрЛП(ДокОбъект.Контрагент);
		 Конецесли;	
		 Э_ТекЛид=Э_УправлениеЛидами.Э_СоздатьНайтиЛид(НомерТелефона,ДокОбъект.Контрагент,Э_НазваниеКлиентаВВиртуальнойАТС,,,,,ТекОтветственный,ДокОбъект.ИсточникИнформацииПриОбращении,CustomerIDВиртуальнойАТС);
		  
		 Если ДокОбъект.Э_Лид <> Э_ТекЛид Тогда
		     ДокОбъект.Э_Лид=Э_ТекЛид;
		 КонецЕсли;	 
	КонецЕсли;
	
	//Э_Волощук (25.02.2019 16:05:57
	Если ДокОбъект.Э_SMSСообщение И ДокОбъект.ТипСобытия = Перечисления.ВходящееИсходящееСобытие.Входящее Тогда
		Если ЗначениеЗаполнено(ДокОбъект.Контрагент)
			И ТипЗнч(ДокОбъект.Контрагент) = Тип("СправочникСсылка.Контрагенты")
			И ЗначениеЗаполнено(ДокОбъект.Контрагент.ОсновнойМенеджерПокупателя) Тогда
			ТекОтветственный = ДокОбъект.Контрагент.ОсновнойМенеджерПокупателя;
		Иначе
			ТекОтветственный = Справочники.Пользователи.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	//Э_Волощук)
	
	Если ДокОбъект.Ответственный <> ТекОтветственный Тогда
		 ДокОбъект.Ответственный = ТекОтветственный
	КонецЕслИ;
	
	Если Не ЗначениеЗаполнено(ДокОбъект.ОписаниеСобытия) и СокрЛП(ДокОбъект.ОписаниеСобытия) <> СокрЛП(ОписаниеСобытия) Тогда
	     ДокОбъект.ОписаниеСобытия = ОписаниеСобытия;
	КонецЕсли;	 
	
	 
	Если Не ЗначениеЗаполнено(ДокОбъект.СодержаниеСобытия) и СокрЛП(ДокОбъект.СодержаниеСобытия) <> СокрЛП(СодержаниеСобытия) Тогда
	     ДокОбъект.СодержаниеСобытия = СодержаниеСобытия;
	КонецЕсли;	
	 
	
	
	Если Э_НастройкиБинотел.Э_BinotelСоздаватьЗадачиНапоминанияПоПропущеннымЗвонкам
		и ДокОбъект.ЭтоНовый()
		 
		и ДокОбъект.ТипСобытия = Перечисления.ВходящееИсходящееСобытие.Входящее
		и НачалоДня(ДокОбъект.Дата) = НачалоДня(ТекущаяДата())
		и ЗначениеЗаполнено(ДокОбъект.Ответственный) Тогда
		Попытка
			Э_КвоСекундРазговора=Число(ПараметрыЗвонка.billsec);
		исключение
			Э_КвоСекундРазговора=0;
		КонецПопытки;	
		
		Если ПараметрыЗвонка.Свойство("billsec") и Э_КвоСекундРазговора=0 и
		     Метаданные.Задачи.Найти("ЗадачиПользователя")<>Неопределено Тогда
			Э_СоздатьЗадачуПоНесостоявшемусяЗвонку(ДокОбъект,ДокОбъект.НачалоСобытия,ДокОбъект.Контрагент,ДокОбъект.КонтактноеЛицо,?(Э_НастройкиБинотел.Э_BinotelУправлениеЛидами,ДокОбъект.Э_Лид,Неопределено));
	    КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

Процедура Э_ЗаписатьНовоеСобытие(ПараметрыЗвонка,Э_НастройкиБинотел) Экспорт 
	ДокОбъектСобытие = Документы.Событие.СоздатьДокумент();
	
	ДокОбъектСобытие.УстановитьСсылкуНового(Документы.Событие.ПолучитьСсылку(Новый УникальныйИдентификатор()));	
	
	Э_ЗаполнитьСобытие(ДокОбъектСобытие, ПараметрыЗвонка,Э_НастройкиБинотел);	
	Если ДокОбъектСобытие.Модифицированность() Тогда
		Попытка
			ДокОбъектСобытие.Записать(РежимЗаписиДокумента.Запись);
			#Если Не Клиент Тогда
			//ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Информация, ,ДокОбъектСобытие.Ссылка,"Binotel IP-телефония:Запись нового события");  //bsoft (21.08.2024)
			#КонецЕсли
		    Э_СобытиеУспешноЗаписано=Истина;
		Исключение
			Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не удалось записать событие с ID в виртуальной АТС: ';uk='Не вдалося записати подію з ID в віртуальній АТС: '")+ПараметрыЗвонка.CallID+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки()); 
			Э_СобытиеУспешноЗаписано=Ложь;
		КонецПопытки;
		//Э_NCT(01.08.2019 00:34:00 www.nct.ua 
		Если Э_СобытиеУспешноЗаписано Тогда  //проведем событие
			Попытка
				ДокОбъектСобытие.Записать(РежимЗаписиДокумента.Проведение);
				#Если Не Клиент Тогда
				//ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Информация, ,ДокОбъектСобытие.Ссылка,"Binotel IP-телефония:Проведение нового события") ;  //bsoft (21.08.2024)
				#КонецЕсли
			Исключение
				Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не удалось провести новое событие с ID в виртуальной АТС: ';uk='Не вдалося провести нову подію з ID в віртуальній АТС: '")+ПараметрыЗвонка.CallID+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки()); 
			КонецПопытки;
		КонецЕсли;
		//Э_NCT) 
	КонецЕсли;
КонецПроцедуры

// Записывает документы "Событие" в базу
//
//  Параметр "Звонки" имеет тип "Соответствие"
Процедура Э_СформироватьСобытия(НачПериода,ЗвонкиДетали, ПерезаписатьВсеПоля=Ложь) Экспорт
	Перем ПараметрыЗвонка,ТекCallID,ДокСобытие,ДокОбъектСобытие;
	Перем ТекНачалоСобытия,ТекОкончаниеСобытия,ВидОбъектаКонтактнойИнформации,НомерТелефона;
	
	Э_НастройкиБинотел=Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
	     Возврат;
	КонецЕсли;
	
	ВсегоЗвонков=ЗвонкиДетали.Количество();
	КоличествоСтрокОбработано=0;
	Для каждого Звонок Из ЗвонкиДетали Цикл
		
		#Если Клиент Тогда
		КоличествоСтрокОбработано=КоличествоСтрокОбработано+1;
		КоличествоСтрокОбработаноПроцент=КоличествоСтрокОбработано*100/ВсегоЗвонков;	
		Состояние("Обработано записей "+Окр(КоличествоСтрокОбработаноПроцент,0)+" %");	
	    #КонецЕсли
	    	 

		Если ТипЗнч(Звонок) = Тип("Структура") Тогда
			ПараметрыЗвонка = Звонок;
		Иначе
			ПараметрыЗвонка = Звонок.Значение;
		КонецЕсли;
		
		ТекCallID = "";
		Если НЕ ПараметрыЗвонка.Свойство("callID", ТекCallID) Тогда
			Продолжить;
		КонецЕсли;	
		 
		
		 
		ВидОбъектаКонтактнойИнформации="";
		НомерТелефона=Э_ОпределитьНомерТелефонаКонтрагента(ПараметрыЗвонка);
		
		//Э_Волощук (23.07.2019 16:56:09
		////Э_Волощук (10.12.2018 15:50:43
		//Э_НашНомерТелефона=Э_ОпределитьНашНомерТелефона(ПараметрыЗвонка);
		//Если ЗначениеЗаполнено(Э_НастройкиБинотел.Э_СписокВнутреннихТелефоновПоКоторымНеЗагружатьЗвонки) и ЗначениеЗаполнено(Э_НашНомерТелефона) и Найти(Э_НастройкиБинотел.Э_СписокВнутреннихТелефоновПоКоторымНеЗагружатьЗвонки,СокрЛП(Э_НашНомерТелефона))>0 Тогда
		//	Продолжить;
		//КонецЕсли;
		
		ВнутреннийНомерТелефона = Э_ОпределитьВнутреннийНомерТелефона(ПараметрыЗвонка, Э_НастройкиБинотел);
		
		Если ЗначениеЗаполнено(Э_НастройкиБинотел.Э_СписокВнутреннихТелефоновПоКоторымНеЗагружатьЗвонки) и ЗначениеЗаполнено(ВнутреннийНомерТелефона) и Найти(Э_НастройкиБинотел.Э_СписокВнутреннихТелефоновПоКоторымНеЗагружатьЗвонки,СокрЛП(ВнутреннийНомерТелефона))>0 Тогда
			Продолжить;
		КонецЕсли;
		//Э_Волощук)
		ДокСобытие = Э_НайтиСобытие(НачПериода,ТекCallID,НомерТелефона,ВидОбъектаКонтактнойИнформации,Э_НастройкиБинотел);
		 

		Если ЗначениеЗаполнено(ДокСобытие) Тогда
			 
			#Если Не Клиент Тогда
			//ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Информация, ,ДокСобытие,"Binotel IP-телефония:Изменение существующего события"); //bsoft (21.08.2024)
			#КонецЕсли
	         
			ДокОбъектСобытие = ДокСобытие.ПолучитьОбъект();
			Попытка
			    ДокОбъектСобытие.Заблокировать();
				ФлДОкументЗаблокирован=Истина;
			исключение
				ФлДОкументЗаблокирован=Ложь;
				#Если Клиент Тогда
				Состояние(НСтр("ru='Ошибка при попытке заблокировать ';uk='Помилка при спробі заблокувати '")+ДокСобытие+НСтр("ru='. Изменения не внесены.';uk='. Зміни не внесені.'"));   
				#КонецЕсли
			КонецПопытки;	
			Если ФлДОкументЗаблокирован Тогда
				Если ПерезаписатьВсеПоля Тогда
					Э_ЗаполнитьСобытие(ДокОбъектСобытие, ПараметрыЗвонка,Э_НастройкиБинотел);
				Иначе	
					Э_ОбновитьСобытиеЕслиНеПерезаписатьВсеПоля(ДокОбъектСобытие,ПараметрыЗвонка,Э_НастройкиБинотел);
					ВидОбъектаКонтактнойИнформации="";
					НомерТелефона=Э_ОпределитьНомерТелефонаКонтрагента(ПараметрыЗвонка);
					Э_ЗаполнитьКонтрагентаКонтактноеЛицо(ДокОбъектСобытие,НомерТелефона,ВидОбъектаКонтактнойИнформации,Ложь);
				КонецЕсли;
				Э_СобытиеУспешноЗаписано = Ложь;
				Если ДокОбъектСобытие.Модифицированность() Тогда
					Попытка
						ДокОбъектСобытие.Записать(РежимЗаписиДокумента.Запись);
						Э_СобытиеУспешноЗаписано=Истина;
					Исключение
						Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не удалось записать событие с ID в виртуальной АТС:';uk='Не вдалося записати подію з ID в віртуальній АТС:'")+ПараметрыЗвонка.CallID+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки());       
						Э_СобытиеУспешноЗаписано=Ложь;
					КонецПопытки;
				КонецЕсли;	
				//Э_NCT(01.08.2019 00:36:46 www.nct.ua 
				Если Э_СобытиеУспешноЗаписано Тогда  //проведем событие
					Попытка
						ДокОбъектСобытие.Записать(РежимЗаписиДокумента.Проведение);
						#Если Не Клиент Тогда
						//ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Информация, ,ДокОбъектСобытие.Ссылка,"Binotel IP-телефония:Проведение нового события"); //bsoft (21.08.2024)
					    #КонецЕсли
					Исключение
						Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не удалось провести измененное событие с ID в виртуальной АТС: ';uk='Не вдалося провести змінену подію з ID в віртуальній АТС: '")+ПараметрыЗвонка.CallID+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки()); 
					КонецПопытки;
				КонецЕсли;
				//Э_NCT) 
				ДокОбъектСобытие.Разблокировать();
			КонецЕсли;	
		Иначе
			Э_ЗаписатьНовоеСобытие(ПараметрыЗвонка,Э_НастройкиБинотел);
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры	

Процедура Э_ЗаписатьНовыйПотерянныйЗвонок(Э_ПотерянныеЗвонки,ПараметрыЗвонка,Э_НастройкиБинотел) Экспорт 
    перем ВидОбъектаКонтактнойИнформации, СодержаниеСобытия;
	
	НовСтр = Э_ПотерянныеЗвонки.Добавить();
	
    НовСтр.Э_CallIDЗвонкаBinotel = ПараметрыЗвонка.CallID;
	НовСтр.НомерТелефона=Э_ОпределитьНомерТелефонаКонтрагента(ПараметрыЗвонка);
	НовСтр.ВремяЗвонка = Дата_формат1С(ПараметрыЗвонка.startTime,Э_НастройкиБинотел.Э_BinotelЧасовойПояс);
	НовСтр.Комментарий = ПараметрыЗвонка.comment;
	
	НовСтр.ВремяОжиданияСоединения = Дата(1, 1, 1, 0, 0,0)+Число(ПараметрыЗвонка.waitsec) ; //Дата_формат1С(ПараметрыЗвонка.startTime);

	ОбъектСобытия = Э_ТелефонияBinotel.Э_ОбъектСобытияПоНомеруТелефона(НовСтр.НомерТелефона, ВидОбъектаКонтактнойИнформации, СодержаниеСобытия);
	ПараметрыЗвонка.Вставить("ВидОбъектаКонтактнойИнформации", ВидОбъектаКонтактнойИнформации);
	Если ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты Тогда
		НовСтр["Контрагент"] = ОбъектСобытия;
	ИначеЕсли ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов Тогда
		НовСтр["Контрагент"] = ОбъектСобытия.Владелец;
		НовСтр["КонтактноеЛицо"]=ОбъектСобытия;
	ИначеЕсли ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица Тогда
		НовСтр["КонтактноеЛицо"]= ОбъектСобытия;
	Иначе	
	КонецЕсли;

	НомерТелефонаСотрудникаКомуПервомуПозвонили="";
	КомуЗвонили="";
	Если ПараметрыЗвонка.Свойство("dstnumbers") и ТипЗнч(ПараметрыЗвонка.dstnumbers)=тип("Массив") и ПараметрыЗвонка.dstnumbers.Количество()>0 Тогда
		ПоследнееЗначениеМассива=ПараметрыЗвонка.dstnumbers[ПараметрыЗвонка.dstnumbers.Количество()-1];
		Для каждого ЗначениеМассива Из ПараметрыЗвонка.dstnumbers Цикл
			Если типЗнч(ЗначениеМассива)=Тип("Структура") и ЗначениеМассива.Свойство("dstNumber")Тогда
			    КомуЗвонили=ЗначениеМассива.dstNumber+?(ПустаяСтрока(КомуЗвонили),"","->")+КомуЗвонили;
			    Если ЗначениеМассива=ПоследнееЗначениеМассива Тогда
		             НомерТелефонаСотрудникаКомуПервомуПозвонили=ЗначениеМассива.dstNumber;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;                                     
	Если ЗначениеЗаполнено(КомуЗвонили) Тогда
	    НовСтр["КомуЗвонили"]= КомуЗвонили;
	КонецЕсли;
	Если НомерТелефонаСотрудникаКомуПервомуПозвонили="" Тогда
	     НомерТелефонаСотрудникаКомуПервомуПозвонили = ПараметрыЗвонка.internalNumber;					
	КонецЕсли; 
    НовСтр["Ответственный"]= Э_ТелефонияBinotel.Э_ПользовательПоНомеруТелефона(НомерТелефонаСотрудникаКомуПервомуПозвонили);

КонецПроцедуры

Процедура Э_ЗаписатьНовыйПотерянныйЗвонокВРегистр(ПараметрыЗвонка,Э_НастройкиБинотел) Экспорт 
    перем ВидОбъектаКонтактнойИнформации, СодержаниеСобытия;
	
	//Найдем основные значения для записи в регистр
	СтруктураПараметров = Новый Структура;
	
	//Э_Волощук (23.07.2019 17:09:42
	////Э_Волощук (22.07.2019 14:28:05
	////не записываем пропущенные с номеров, которые в настройках
	//Э_НашНомерТелефона=Э_ОпределитьНашНомерТелефона(ПараметрыЗвонка);
	//СтруктураПараметров.Вставить("Э_НашНомерТелефона", Э_НашНомерТелефона);
	//
	//Если ЗначениеЗаполнено(Э_НастройкиБинотел.Э_СписокВнутреннихТелефоновПоКоторымНеЗагружатьЗвонки) и ЗначениеЗаполнено(Э_НашНомерТелефона) и Найти(Э_НастройкиБинотел.Э_СписокВнутреннихТелефоновПоКоторымНеЗагружатьЗвонки,СокрЛП(Э_НашНомерТелефона))>0 Тогда
	//	Возврат;
	//КонецЕсли;
	////Э_Волощук)
	
	ВнутреннийНомерТелефона = Э_ОпределитьВнутреннийНомерТелефона(ПараметрыЗвонка, Э_НастройкиБинотел);
	
	Если ЗначениеЗаполнено(Э_НастройкиБинотел.Э_СписокВнутреннихТелефоновПоКоторымНеЗагружатьЗвонки) и ЗначениеЗаполнено(ВнутреннийНомерТелефона) и Найти(Э_НастройкиБинотел.Э_СписокВнутреннихТелефоновПоКоторымНеЗагружатьЗвонки,СокрЛП(ВнутреннийНомерТелефона))>0 Тогда
		Возврат;
	КонецЕсли;
	//Э_Волощук)
	
	СтруктураПараметров.Вставить("НомерТелефона", Э_ОпределитьНомерТелефонаКонтрагента(ПараметрыЗвонка));
		
	ОбъектСобытия = Э_ТелефонияBinotel.Э_ОбъектСобытияПоНомеруТелефона(СтруктураПараметров.НомерТелефона, ВидОбъектаКонтактнойИнформации, СодержаниеСобытия);
	ПараметрыЗвонка.Вставить("ВидОбъектаКонтактнойИнформации", ВидОбъектаКонтактнойИнформации);
	СтруктураПараметров.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	СтруктураПараметров.Вставить("КонтактноеЛицо", Справочники.КонтактныеЛицаКонтрагентов.ПустаяСсылка());
	Если ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты Тогда
		СтруктураПараметров.Контрагент = ОбъектСобытия;
	ИначеЕсли ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛицаКонтрагентов Тогда
		СтруктураПараметров.Контрагент = ОбъектСобытия.Владелец;
		СтруктураПараметров.КонтактноеЛицо = ОбъектСобытия;
	ИначеЕсли ВидОбъектаКонтактнойИнформации = Перечисления.ВидыОбъектовКонтактнойИнформации.КонтактныеЛица Тогда
		СтруктураПараметров.КонтактноеЛицо = ОбъектСобытия;
	Иначе	
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ВремяЗвонка", Дата_формат1С(ПараметрыЗвонка.startTime,Э_НастройкиБинотел.Э_BinotelЧасовойПояс));
	СтруктураПараметров.Вставить("ВремяОжиданияСоединения", Дата(1, 1, 1, 0, 0,0)+Число(ПараметрыЗвонка.waitsec));
	СтруктураПараметров.Вставить("Э_CallIDЗвонка", ПараметрыЗвонка.CallID);
	
	НомерТелефонаСотрудникаКомуПервомуПозвонили="";
	СтруктураПараметров.Вставить("КомуЗвонили","");
	Если ПараметрыЗвонка.Свойство("dstnumbers") и ТипЗнч(ПараметрыЗвонка.dstnumbers)=тип("Массив") и ПараметрыЗвонка.dstnumbers.Количество()>0 Тогда
		ПоследнееЗначениеМассива=ПараметрыЗвонка.dstnumbers[ПараметрыЗвонка.dstnumbers.Количество()-1];
		Для каждого ЗначениеМассива Из ПараметрыЗвонка.dstnumbers Цикл
			Если типЗнч(ЗначениеМассива)=Тип("Структура") и ЗначениеМассива.Свойство("dstNumber")Тогда
			    СтруктураПараметров.КомуЗвонили=ЗначениеМассива.dstNumber+?(ПустаяСтрока(СтруктураПараметров.КомуЗвонили),"","->")+СтруктураПараметров.КомуЗвонили;
			    Если ЗначениеМассива=ПоследнееЗначениеМассива Тогда
		             НомерТелефонаСотрудникаКомуПервомуПозвонили=ЗначениеМассива.dstNumber;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;                                     
	Если НомерТелефонаСотрудникаКомуПервомуПозвонили="" Тогда
	     НомерТелефонаСотрудникаКомуПервомуПозвонили = ПараметрыЗвонка.internalNumber;					
	КонецЕсли; 
    СтруктураПараметров.Вставить("Ответственный", Э_ТелефонияBinotel.Э_ПользовательПоНомеруТелефона(НомерТелефонаСотрудникаКомуПервомуПозвонили));
	
	СтруктураПараметров.Вставить("Комментарий", ПараметрыЗвонка.comment);
	
	СтруктураПараметров.Вставить("ДатаЗаписи", ТекущаяДата());
	////Э_Волощук (10.12.2018 00:39:22
	////Э_Гашук(09.01.2019 16:57:38 www.nct.ua 
	//Если ПараметрыЗвонка.Свойство("Э_Лид") Тогда
	////Э_NCT) 	
	//     СтруктураПараметров.Вставить("Э_Лид", ПараметрыЗвонка.Э_Лид);
	////Э_Гашук(09.01.2019 16:57:45 www.nct.ua 	 
	//КонецЕсли;
	////Э_Волощук)
	
	Если Э_НастройкиБинотел.Э_BinotelУправлениеЛидами Тогда
		Э_Лид = Э_УправлениеЛидами.Э_СоздатьНайтиЛид(СтруктураПараметров.НомерТелефона,,,,,,,СтруктураПараметров.Ответственный);
		СтруктураПараметров.Вставить("Э_Лид", Э_Лид);
	КонецЕсли;
	//Э_Волощук)
	
	//Э_Гашук(21.11.2018 11:02:53 www.nct.ua 
	////Э_Волощук (03.11.2018 19:56:56
	//Э_НашНомерТелефона = "";
	//Если ЗначениеЗаполнено(СокрЛП(ПараметрыЗвонка.didName)) Тогда
	//    Э_НашНомерТелефона=СокрЛП(ПараметрыЗвонка.didName);
	//ИначеЕсли ЗначениеЗаполнено(СокрЛП(ПараметрыЗвонка.did)) Тогда
	//    Э_НашНомерТелефона=СокрЛП(ПараметрыЗвонка.did);
	//КонецЕсли;
	Э_НашНомерТелефона=Э_ОпределитьНашНомерТелефона(ПараметрыЗвонка);
	//Э_Гашук) 
	СтруктураПараметров.Вставить("Э_НашНомерТелефона", Э_НашНомерТелефона);
	//Э_Волощук)
	
	//Запишем в регистр
	Набор = РегистрыСведений.Э_ТелефонияПотерянныеЗвонки.СоздатьНаборЗаписей();
	Набор.Отбор.НомерТелефона.Установить(СтруктураПараметров.НомерТелефона);
	//Э_Волощук (03.11.2018 19:59:01
	Набор.Отбор.Э_НашНомерТелефона.Установить(СтруктураПараметров.Э_НашНомерТелефона);
	//Э_Волощук)
	//Набор.Отбор.Контрагент.Установить(СтруктураПараметров.Контрагент);
	//Набор.Отбор.КонтактноеЛицо.Установить(СтруктураПараметров.КонтактноеЛицо);
	//Набор.Отбор.ВремяЗвонка.Установить(СтруктураПараметров.ВремяЗвонка);
	//Набор.Отбор.ВремяОжиданияСоединения.Установить(СтруктураПараметров.ВремяОжиданияСоединения);
	//Набор.Отбор.Э_CallIDЗвонка.Установить(СтруктураПараметров.Э_CallIDЗвонка);
	//Набор.Отбор.КомуЗвонили.Установить(СтруктураПараметров.КомуЗвонили);
	//Набор.Отбор.Ответственный.Установить(СтруктураПараметров.Ответственный);
	//Набор.Отбор.Комментарий.Установить(СтруктураПараметров.Комментарий);
	
	СтрокаДанных = Набор.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДанных, СтруктураПараметров);
	
	//Набор.НомерТелефона = НомерТелефона;
	//Набор.Контрагент = Контрагент;
	//Набор.КонтактноеЛицо = КонтактноеЛицо;
	//Набор.ВремяЗвонка = ВремяЗвонка;
	//Набор.ВремяОжиданияСоединения = ВремяОжиданияСоединения;
	//Набор.Э_CallIDЗвонка = Э_CallIDЗвонкаBinotel;
	//Набор.КомуЗвонили = КомуЗвонили;
	//Набор.Ответственный = Ответственный;
	//Набор.Комментарий = Комментарий;
	Набор.Записать(Истина);
	
КонецПроцедуры

//Процедура Э_ЗаполнитьКонтактыВСобытияхГдеНеЗаполненоПоНомеруТелефонаВОписанииСобытия() Экспорт
//	перем Э_НастройкиБинотел,Запрос,РезультатЗапроса,ПозицияНачалоНомера,НомерТелефона,ДлинаОписаниеСобытия,ТекущийСимвол;
//	перем ДокОбъект,ВидОбъектаКонтактнойИнформации,СловоТелефонКратко;
//	
//	Э_НастройкиБинотел=Э_ПолучитьНастройкиБинотел();
//	Если Э_НастройкиБинотел=Неопределено Тогда
//	     Возврат;
//	КонецЕсли;
//	
//	СловоТелефонКратко="Тел.:";
//	
//	Если Э_НастройкиБинотел=Неопределено Тогда
//	    Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не заполнены настройки по синхронизации с ""Бинотел""';uk='Не заповнені налаштування по синхронізації з ""Бінотел""'")); 
//		Возврат;
//	КонецЕсли; 
//	
//	Запрос=Новый Запрос;
//	Если Э_НастройкиБинотел.Э_BinotelУправлениеЛидами Тогда
//		Запрос.Текст="ВЫБРАТЬ
//		             |	Событие.Ссылка,
//		             |	Событие.Э_CallIDЗвонкаBinotel,
//		             |	Событие.Контрагент,
//		             |	Событие.КонтактноеЛицо,
//		             |	Событие.Э_Лид.НомерТелефона КАК Э_ЛидНомерТелефона
//		             |ИЗ
//		             |	Документ.Событие КАК Событие
//		             |ГДЕ
//		             |	НЕ Событие.ПометкаУдаления
//		             |
//		             |УПОРЯДОЧИТЬ ПО
//		             |	Событие.Дата";
//	иначе
//		Запрос.Текст="ВЫБРАТЬ
//					 |	Событие.Ссылка,
//					 |	Событие.Э_CallIDЗвонкаBinotel,
//					 |	Событие.Контрагент,
//					 |	Событие.КонтактноеЛицо,
//					 |	Событие.ОписаниеСобытия КАК Э_ЛидНомерТелефона
//					 |ИЗ
//					 |	Документ.Событие КАК Событие
//					 |ГДЕ
//					 |	НЕ Событие.ПометкаУдаления
//					 |
//					 |УПОРЯДОЧИТЬ ПО
//					 |	Событие.Дата";
//	КонецЕсли;	
//	
//	РезультатЗапроса=Запрос.Выполнить().Выбрать();
//	Пока РезультатЗапроса.Следующий() Цикл
//		#Если Клиент Тогда
//		ОбработкаПрерыванияПользователя();	
//		#КонецЕсли			
//		Если (Не ЗначениеЗаполнено(РезультатЗапроса.Контрагент) или ТипЗнч(РезультатЗапроса.Контрагент)=Тип("Строка")) и ЗначениеЗаполнено(РезультатЗапроса.Э_ЛидНомерТелефона) Тогда
//			 #Если Клиент Тогда
//			 Состояние(НСтр("ru='Обработка события:';uk='Обробка події:'")+РезультатЗапроса.Ссылка);     
//			 #КонецЕсли
//			 Если Э_НастройкиБинотел.Э_BinotelУправлениеЛидами Тогда
//			     НомерТелефона=СокрЛП(РезультатЗапроса.Э_ЛидНомерТелефона);
//			 иначе
//				 ПозицияНачалоНомера=Найти(РезультатЗапроса.Э_ЛидНомерТелефона,СловоТелефонКратко)+СтрДлина(СловоТелефонКратко);
//				 НомерТелефона="";
//				 ДлинаОписаниеСобытия=СтрДлина(РезультатЗапроса.Э_ЛидНомерТелефона);
//				 
//				 Для ТекСимвол=ПозицияНачалоНомера По ДлинаОписаниеСобытия Цикл
//					 ТекущийСимвол=Сред(РезультатЗапроса.Э_ЛидНомерТелефона,ТекСимвол,1);
//					 Если Найти("0123456789 ",ТекущийСимвол)>0 Тогда
//						  НомерТелефона=НомерТелефона+ТекущийСимвол;
//					 иначе  
//						  Прервать;
//					 КонецЕсли;
//				 КонецЦикла;
//				 НомерТелефона=СокрЛП(НомерТелефона);
//			 КонецЕсли;	  
//			 Если ЗначениеЗаполнено(НомерТелефона) Тогда
//				  НомерТелефона = Э_ТелефонияBinotel.Э_ПреобразоватьНомерТелефонаБезРазделителей(НомерТелефона);
//				  ДокОбъект=РезультатЗапроса.Ссылка.ПолучитьОбъект();
//				  ВидОбъектаКонтактнойИнформации=Неопределено;
//				  Э_ЗаполнитьКонтрагентаКонтактноеЛицо(ДокОбъект,НомерТелефона,ВидОбъектаКонтактнойИнформации,Ложь);
//				  Если ДокОбъект.Модифицированность() Тогда
//						Попытка
//							ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
//						Исключение
//							Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не удалось записать событие ';uk='Не вдалось записати подію '")+РезультатЗапроса.Ссылка+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки());  
//						КонецПопытки;
//				  КонецЕсли;	
//			 КонецЕсли;
//		КонецЕсли;
//	КонецЦикла; 
//КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С МИНИ-СРМ "МОИ КЛИНТЫ"

Процедура Э_ОчиститьРегистрЭ_ТелефонияКодыКлиентов()
    ТекРег=регистрыСведений.Э_ТелефонияКодыКлиентов.СоздатьНаборЗаписей();
	ТекРег.Прочитать();
	ТекРег.Очистить();
	ТекРег.Записать(Истина);
	Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Выполнена очистка регистра сведений ""Телефония. Клиенты""';uk='Виконано очищення реєстра відомостей ""Телефонія. Клієнти""'"));   
КонецПроцедуры

Процедура Э_ВыгрузитьДанныеКлиентовВМиниСрмМоиКлиенты(ПолнаяВыгрузка=Ложь,ЭтоРегламентноеЗадание=Ложь) Экспорт 
	Перем НомерСообщения,МассивКонтрагентовКонтактныхЛиц,Выборка,Запрос,ТЗ_КлиентыТелефоны,ТЗ_Клиенты,Отбор_Клиент,Name,NameБезЛишнихСимволов;
	Перем ТелефоныКлиента,СтрокиТелефоны,КонтрагентПередан,Сч,result_upload,СтруктураРезультат,Э_BinotelPhoneLoc;
	
	Э_НастройкиБинотел=Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
	     Возврат;
	КонецЕсли;
	
	Если Э_НастройкиБинотел=Неопределено Тогда
	    Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Выгрузка клиентов в Бинотел:Не заполнены настройки по синхронизации с ""Бинотел""';uk='Вивантаження клієнтів в Бінотел:Не заповнені налаштування по синхронізації з ""Бінотел""'"));  
		Возврат;
	КонецЕсли; 
	
	Если Не Значениезаполнено(Э_НастройкиБинотел.Э_BinotelПланОбмена) Тогда
	    Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Выгрузка клиентов в Бинотел:Не заполнена настройка ""Binotel: План обмена"" в регистре сведений ""Binotel:Настройки"". Заполнить настройки можно в обработке ""Binotel IP-телефония"", нажав кнопку ""Настройка""';uk='Вивантаження клієнтів в Бінотел:Не заповнено налаштування ""Binotel: План обміну"" в реєстрі відомостей ""Binotel: Налаштування"". Заповнити налаштування можно в обробці ""Binotel IP-телефонія"", натиснувши кнопку ""Налаштування""'"));   
		Возврат;
	КонецЕсли;
	
	Если Не Э_НастройкиБинотел.Э_BinotelВыполнятьСинхронизациюКонтрагентов Тогда
	    Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Выгрузка клиентов в Бинотел:Не включена настройки ""Синхронизация контрагентов с клиентами ""Бинотел""';uk='Вивантаження клієнтів в Бінотел:Не вімкнено налаштування ""Синхронізація контрагентів з клієнтами ""Бінотел""'"));    
		Возврат;
	КонецЕсли;
	
		
	Если НЕ Э_НастройкиБинотел.Э_BinotelИспользоватьФункционалИнтеграции Тогда
	     Возврат;
	КонецЕсли;
		
	
	ГруппыПартнеров = Э_НастройкиБинотел.Э_BinotelГруппыПартнеров.Получить();
	ОграничитьВыгрузкуПартнеровПоГруппам = Э_НастройкиБинотел.Э_BinotelОграничитьВыгрузкуПартнеровПоГруппам;
	
	
	НомерСообщения = 0;
	МассивКонтрагентовКонтактныхЛиц = Новый Массив;
	Если НЕ ПолнаяВыгрузка Тогда
		Выборка = ПланыОбмена.ВыбратьИзменения(Э_НастройкиБинотел.Э_BinotelПланОбмена, НомерСообщения);
		Пока Выборка.Следующий() Цикл
			МассивКонтрагентовКонтактныхЛиц.Добавить(Выборка.Получить().Ссылка);
		КонецЦикла;	
	иначе
		Э_ОчиститьРегистрЭ_ТелефонияКодыКлиентов();
		СинхронизироватьКонтрагентов();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивКонтрагентовКонтактныхЛиц", МассивКонтрагентовКонтактныхЛиц);
	Запрос.УстановитьПараметр("ПолнаяВыгрузка", ПолнаяВыгрузка);
	
	Запрос.УстановитьПараметр("ГруппыПартнеров", ГруппыПартнеров);
	Запрос.УстановитьПараметр("ОграничитьВыгрузкуПартнеровПоГруппам", ОграничитьВыгрузкуПартнеровПоГруппам);
		
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Клиенты.Клиент,
	|	Клиенты.НомерТелефона КАК НомерТелефона,
	|	Клиенты.ОбъектКод КАК Код,
	|	Клиенты.Наименование,
	|	Клиенты.CustomerID,
	|	Клиенты.ВладелецНаименование,
	|	Клиенты.КлиентПометкаУдаления,
	|	Клиенты.ОсновнойМенеджерПокупателя,
	|	ЕСТЬNULL(Э_ТелефонияКодыСотрудников.ТелефонияКод, ""0"") КАК EmployeeID
	|ИЗ
	|	(ВЫБРАТЬ
	|		КонтактнаяИнформация.Объект КАК Клиент,
	|		КонтактнаяИнформация.CRM_НомерТелефона КАК НомерТелефона,
	|		КонтактнаяИнформация.Объект.Код КАК ОбъектКод,
	|		КонтактнаяИнформация.Объект.Наименование КАК Наименование,
	|		Э_ТелефонияКодыКлиентов.ТелефонияКод КАК CustomerID,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект.Ссылка) = ТИП(Справочник.КонтактныеЛицаКонтрагентов)
	|				ТОГДА КонтактнаяИнформация.Объект.Владелец.Наименование
	|			ИНАЧЕ """"""""
	|		КОНЕЦ КАК ВладелецНаименование,
	|		КонтактнаяИнформация.Объект.ПометкаУдаления КАК КлиентПометкаУдаления,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект.Ссылка) = ТИП(Справочник.КонтактныеЛицаКонтрагентов)
	|				ТОГДА КонтактнаяИнформация.Объект.Владелец.ОсновнойМенеджерПокупателя
	|			ИНАЧЕ КонтактнаяИнформация.Объект.ОсновнойМенеджерПокупателя
	|		КОНЕЦ КАК ОсновнойМенеджерПокупателя
	|	ИЗ
	|		РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Э_ТелефонияКодыКлиентов КАК Э_ТелефонияКодыКлиентов
	|			ПО КонтактнаяИнформация.Объект = Э_ТелефонияКодыКлиентов.Контакт
	|	ГДЕ
	|		КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|		И (ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект.Ссылка) = ТИП(Справочник.Контрагенты)
	|				ИЛИ ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект.Ссылка) = ТИП(Справочник.КонтактныеЛицаКонтрагентов))
	|		И ВЫБОР
	|				КОГДА &ПолнаяВыгрузка
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ КонтактнаяИнформация.Объект.Ссылка В (&МассивКонтрагентовКонтактныхЛиц)
	|			КОНЕЦ
	
	|		И ВЫБОР
	|			КОГДА НЕ &ОграничитьВыгрузкуПартнеровПоГруппам
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КонтактнаяИнформация.Объект.Ссылка В ИЕРАРХИИ (&ГруппыПартнеров) или КонтактнаяИнформация.Объект.Ссылка.Владелец В ИЕРАРХИИ (&ГруппыПартнеров)
	|		КОНЕЦ
		
	|		И КонтактнаяИнформация.CRM_НомерТелефона ЕСТЬ НЕ NULL ) КАК Клиенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Э_ТелефонияКодыСотрудников КАК Э_ТелефонияКодыСотрудников
	|		ПО Клиенты.ОсновнойМенеджерПокупателя = Э_ТелефонияКодыСотрудников.Сотрудник
	|";
	
	//Э_NCT(22.11.2018 13:48:21 www.nct.ua 
	Если Не ВернутьЕстьСправочникКонтактныеЛицаКонтрагентов() Тогда
	    ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"Справочник.КонтактныеЛицаКонтрагентов","Справочник.КонтактныеЛица");
	КонецЕсли;
	//Э_NCT) 
	
	Если Э_НастройкиБинотел.Э_BinotelУправлениеЛидами Тогда 
	    ТекстЗапроса=ТекстЗапроса+"
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Э_Лиды.Ссылка,
		|	Э_Лиды.НомерТелефона,
		|	Э_Лиды.Код,
		|	Э_Лиды.Наименование,
		|	Э_ТелефонияКодыКлиентов.ТелефонияКод,
		|	NULL,
		|	Э_Лиды.ПометкаУдаления,
		|	NULL,
		|	Э_ТелефонияКодыСотрудников.ТелефонияКод
		|ИЗ
		|	Справочник.Э_Лиды КАК Э_Лиды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Э_ТелефонияКодыСотрудников КАК Э_ТелефонияКодыСотрудников
		|		ПО Э_Лиды.ОтветсвенныйМенеджер = Э_ТелефонияКодыСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Э_ТелефонияКодыКлиентов КАК Э_ТелефонияКодыКлиентов
		|		ПО Э_Лиды.Ссылка = Э_ТелефонияКодыКлиентов.Контакт
		|ГДЕ
		|	НЕ Э_Лиды.Закрыт
		|	И ВЫБОР
		|			КОГДА &ПолнаяВыгрузка
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Э_Лиды.Ссылка В (&МассивКонтрагентовКонтактныхЛиц)
		|		КОНЕЦ
		|	И Э_Лиды.НомерТелефона ЕСТЬ НЕ NULL 
		|";
	КонецЕсли;
	ТекстЗапроса=ТекстЗапроса+"
	|УПОРЯДОЧИТЬ ПО
	|	НомерТелефона";

	Запрос.Текст=ТекстЗапроса;
	ТЗ_КлиентыТелефоны = Запрос.Выполнить().Выгрузить();
	
	ТЗ_Клиенты = ТЗ_КлиентыТелефоны.Скопировать(, "Клиент,КлиентПометкаУдаления,Код,Наименование,ВладелецНаименование,CustomerID,EmployeeID");
	ТЗ_Клиенты.Свернуть("Клиент,КлиентПометкаУдаления,Код,Наименование,ВладелецНаименование,CustomerID,EmployeeID");
	
	Отбор_Клиент = Новый Структура;
	ВсегоСтрокДляОбработки=ТЗ_КлиентыТелефоны.Количество();
	ОбработаноСтрок=0;
	Сч=0;	
	Э_BinotelPhoneLoc = Обработки.Э_BinotelPhone.Создать();

	Для Каждого СтрокаКлиент Из ТЗ_Клиенты Цикл
		Если ТипЗнч(СтрокаКлиент.Клиент)=Тип("СправочникСсылка.Контрагенты") Тогда
			ТипСправочникаВРодительском="контрагента";
		    Name = СтрокаКлиент.Наименование;
		иначеЕсли ВернутьЕстьСправочникКонтактныеЛицаКонтрагентов() и ТипЗнч(СтрокаКлиент.Клиент)=Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов") Тогда
			ТипСправочникаВРодительском="контактного лица";
			Name = СокрЛП(СтрокаКлиент.Наименование)+" ("+СокрЛП(СтрокаКлиент.ВладелецНаименование)+")";
		иначеЕсли ВернутьЕстьСправочникКонтактныеЛица() и ТипЗнч(СтрокаКлиент.Клиент)=Тип("СправочникСсылка.КонтактныеЛица") Тогда
			ТипСправочникаВРодительском="контактного лица";
			Name = СокрЛП(СтрокаКлиент.Наименование)+" ("+СокрЛП(СтрокаКлиент.ВладелецНаименование)+")";
		иначеЕсли Э_НастройкиБинотел.Э_BinotelУправлениеЛидами и ТипЗнч(СтрокаКлиент.Клиент)=Тип("СправочникСсылка.Э_Лиды") Тогда
			ТипСправочникаВРодительском="лида";
			Name = СтрокаКлиент.Наименование;
		КонецЕсли;	
		ОбработаноСтрок=ОбработаноСтрок+1;
		#Если Клиент Тогда
		ПроцентОбработки=Окр(ОбработаноСтрок*100/ВсегоСтрокДляОбработки,0);
		ОбработкаПрерыванияПользователя();          
		Состояние("Обработано:"+ПроцентОбработки+"%. Передача данных по """+Name+"""");
		#КонецЕсли
		NameБезЛишнихСимволов=СтрЗаменить(Name,"""","");
		NameБезЛишнихСимволов=СтрЗаменить(NameБезЛишнихСимволов,"«","");
		NameБезЛишнихСимволов=СтрЗаменить(NameБезЛишнихСимволов,"»","");
		NameБезЛишнихСимволов=СтрЗаменить(NameБезЛишнихСимволов,"№","");
		ТелефоныКлиента = Новый Массив;
		МассивКарточекКлиентовВТелефонии = Новый Массив;
		СтрокаСТелефонами="";
		Если Не СтрокаКлиент.КлиентПометкаУдаления Тогда
			
			Если Э_НастройкиБинотел.Э_BinotelУправлениеЛидами 
				и ТипЗнч(СтрокаКлиент.Клиент)=Тип("СправочникСсылка.Э_Лиды") Тогда
				Если  НЕ СтрокаКлиент.Клиент.Э_ВыгружатьВБДВиртуальнойАТС тогда
				     продолжить;
				КонецЕсли;
			КонецЕсли;	
				
			Отбор_Клиент.Вставить("Клиент", СтрокаКлиент.Клиент);
			СтрокиТелефоны = ТЗ_КлиентыТелефоны.НайтиСтроки(Отбор_Клиент);
			Для Каждого СтрокаТелефон Из СтрокиТелефоны Цикл
				НомерТелефонаДляБинотел=Э_ТелефонияBinotel.Э_ПреобразоватьНомерТелефонаБезРазделителей(СтрокаТелефон.НомерТелефона);
				     
				Если ЗначениеЗаполнено(НомерТелефонаДляБинотел) Тогда
					  Если Не Э_BinotelPhoneLoc.Э_НомерТелефонаПринадлежитДругомуКлиентуВТелефонии(НомерТелефонаДляБинотел,СтрокаКлиент.customerID) Тогда
						ТелефоныКлиента.Добавить(НомерТелефонаДляБинотел);
						СтрокаСТелефонами=СтрокаСТелефонами+?(ЗначениеЗаполнено(СтрокаСТелефонами),",","")+НомерТелефонаДляБинотел;
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;	
			
			Если ТелефоныКлиента.Количество()=0 Тогда
				ТекстТекущегоСообщения=НСтр("ru='Выгрузка клиентов в Бинотел: В карточке ';uk='Вивантаження клієнтів в Бінотел: В картці '")+ТипСправочникаВРодительском+" """+СтрокаКлиент.Наименование+НСтр("ru='"" пустой список телефонов ';uk=' порожній перелік телефонів '")+СтрокаСТелефонами+НСтр("ru='. Передача данных в Бинотел не будет выполнена';uk='. Передача даних в Бінотел не буде виконана'");      
				Если ЭтоРегламентноеЗадание Тогда
				    //ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Информация, ,СтрокаКлиент.Клиент,ТекстТекущегоСообщения );  //bsoft (21.08.2024)
				иначе
					Э_ТелефонияBinotel.СообщитьИнформацию(ТекстТекущегоСообщения);
				КонецЕсли;
				ПланыОбмена.УдалитьРегистрациюИзменений(Э_НастройкиБинотел.Э_BinotelПланОбмена,СтрокаКлиент.Клиент);
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	
		Э_РезультатПоследнегоОбменаСБинотел="";	
		
		КонтрагентПередан = ЗначениеЗаполнено(СтрокаКлиент.CustomerID);
				
		Если СтрокаКлиент.КлиентПометкаУдаления и Не КонтрагентПередан Тогда  
			ТекстТекущегоСообщения=НСтр("ru='Выгрузка клиентов в Бинотел: Карточка ';uk='Вивантаження клієнтів в Бінотел: Картка '")+ТипСправочникаВРодительском+" """+СтрокаКлиент.Наименование+НСтр("ru='"" пропускается так как объект помечен на удаление';uk=' пропускається так як об'єкт позначений на видалення'"); 
			Если ЭтоРегламентноеЗадание Тогда
			    //ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Информация, ,СтрокаКлиент.Клиент,ТекстТекущегоСообщения);  //bsoft (21.08.2024)
			иначе
			    Э_ТелефонияBinotel.СообщитьИнформацию(ТекстТекущегоСообщения);
			КонецЕсли;
			ПланыОбмена.УдалитьРегистрациюИзменений(Э_НастройкиБинотел.Э_BinotelПланОбмена,СтрокаКлиент.Клиент);
			Продолжить;
		КонецЕсли;	
		Для НомерПопытки=1 По 2 Цикл 
			Если НомерПопытки=2 Тогда
				
				NameБезЛишнихСимволов = NameБезЛишнихСимволов + " ("+СтрокаКлиент.Код+")";
			КонецЕсли;	
			
			Если КонтрагентПередан Тогда
				Если Не СтрокаКлиент.КлиентПометкаУдаления Тогда
					 
					Если ЗначениеЗаполнено(Э_НастройкиБинотел.Э_BinotelapiIDМетки) тогда
						МассивМеток = Новый Массив();
						МассивМеток.Добавить(Э_НастройкиБинотел.Э_BinotelapiIDМетки); 
						result_upload = Э_BinotelPhoneLoc.sendRequest("customers/update", Новый Структура("id,name,assignedToEmployeeID,numbers,labels",СтрокаКлиент.CustomerID,NameБезЛишнихСимволов,СтрокаКлиент.EmployeeID,ТелефоныКлиента,МассивМеток),,ЭтоРегламентноеЗадание);
					иначе
					
				     	result_upload = Э_BinotelPhoneLoc.sendRequest("customers/update", Новый Структура("id,name,assignedToEmployeeID,numbers",СтрокаКлиент.CustomerID,NameБезЛишнихСимволов,СтрокаКлиент.EmployeeID,ТелефоныКлиента),,ЭтоРегламентноеЗадание);
					 	
					КонецЕсли;
				    
				иначе
					 result_upload = Э_BinotelPhoneLoc.sendRequest("customers/delete", Новый Структура("customerID",СтрокаКлиент.CustomerID),,ЭтоРегламентноеЗадание);
				КонецЕсли;
			Иначе
				result_upload = Э_BinotelPhoneLoc.sendRequest("customers/create", Новый Структура("name,assignedToEmployeeID,numbers",NameБезЛишнихСимволов,СтрокаКлиент.EmployeeID,ТелефоныКлиента),,ЭтоРегламентноеЗадание);
			КонецЕсли;
		    ЕстьОшибка=Ложь;
			СтруктураРезультат = Э_РаботаСJSON.Э_ПрочитатьJSON(result_upload);
			Если ТипЗнч(СтруктураРезультат) = Тип("Структура") Тогда
				Если Найти(СтруктураРезультат["status"], "success") > 0 Тогда
					
					CustomerID="";
					Сч = Сч + 1;
					Если КонтрагентПередан Тогда
						Если СтрокаКлиент.КлиентПометкаУдаления Тогда
							 Э_ТелефонияBinotel.Э_ЗаписатьIDКлиентаВСистемеБинотел("",, СтрокаКлиент.Клиент);    
						КонецЕсли;	
					Иначе
						CustomerID = Строка(СтруктураРезультат.customerID);
						CustomerID = СтрЗаменить(CustomerID, Символы.НПП, "");
						Э_ТелефонияBinotel.Э_ЗаписатьIDКлиентаВСистемеБинотел(CustomerID,, СтрокаКлиент.Клиент);
						 
						Если ЗначениеЗаполнено(Э_НастройкиБинотел.Э_BinotelapiIDМетки) тогда  
							МассивМеток = Новый Массив();
							МассивМеток.Добавить(Э_НастройкиБинотел.Э_BinotelapiIDМетки); 
							Э_BinotelPhoneLoc.sendRequest("customers/update", Новый Структура("id,labels",CustomerID,МассивМеток),,ЭтоРегламентноеЗадание);
						КонецЕсли;
						
					КонецЕсли;
					
					ТекстСообщения="Успешная передача данных "+СокрЛП(ТипСправочникаВРодительском)+" в Бинотел: """+СокрЛП(СтрокаКлиент.Наименование)+""", переданное наименование """+СокрЛП(NameБезЛишнихСимволов)+""", телефоны """+СокрЛП(СтрокаСТелефонами)+"""";
					Э_РезультатПоследнегоОбменаСБинотел=Э_РезультатПоследнегоОбменаСБинотел+"
					|"+ТекстСообщения;	
					
					Если НомерПопытки = 2 Тогда
						ТекстСообщения="Наименование "+СокрЛП(ТипСправочникаВРодительском)+" """+СокрЛП(СтрокаКлиент.Наименование)+""" в системе Бинотел не уникальное. К имени добавлено код: "+ СокрЛП(СтрокаКлиент.Код)+". Таким образом, имя в Бинотел """+СокрЛП(NameБезЛишнихСимволов)+"""";
						Э_ТелефонияBinotel.СообщитьИнформацию(ТекстСообщения);
						Э_РезультатПоследнегоОбменаСБинотел=Э_РезультатПоследнегоОбменаСБинотел+"
						|"+ТекстСообщения;	
						ЕстьОшибка=истина;
					КонецЕсли;
					Прервать;
				Иначе
					ТекстСообщения="При передаче данные "+СокрЛП(ТипСправочникаВРодительском)+" """+СокрЛП(СтрокаКлиент.Наименование)+""", наименование для передачи """+СокрЛП(NameБезЛишнихСимволов)+""", телефоны """+СокрЛП(СтрокаСТелефонами)+""". Ошибка: "+ СокрЛП(Строка(СтруктураРезультат["code"]))+", "+СокрЛП(СтруктураРезультат["message"]);
					Э_ТелефонияBinotel.СообщитьИнформацию(ТекстСообщения);
					Э_РезультатПоследнегоОбменаСБинотел=Э_РезультатПоследнегоОбменаСБинотел+"
					|"+ТекстСообщения;	
					ЕстьОшибка=истина;
				КонецЕсли;
			Иначе
				ТекстСообщения="При передаче данные "+СокрЛП(ТипСправочникаВРодительском)+" """+СокрЛП(СтрокаКлиент.Наименование)+""", наименование для передачи """+СокрЛП(NameБезЛишнихСимволов)+""", телефоны """+СокрЛП(СтрокаСТелефонами)+""". Ошибка. "+СокрЛП(Строка(result_upload));
				Э_ТелефонияBinotel.СообщитьИнформацию(ТекстСообщения);
				Э_РезультатПоследнегоОбменаСБинотел=Э_РезультатПоследнегоОбменаСБинотел+"
				|"+ТекстСообщения;	
				ЕстьОшибка=истина;
			КонецЕсли;
		КонецЦикла;
		
		
		Если ЗначениеЗаполнено(Э_РезультатПоследнегоОбменаСБинотел) Тогда
			ЗаписьЖурналаРегистрации("Виртуальная АТС", ?(ЕстьОшибка,УровеньЖурналаРегистрации.Ошибка,УровеньЖурналаРегистрации.Информация), ,СтрокаКлиент.Клиент,СокрЛП(ТекущаяДата())+":"+Э_РезультатПоследнегоОбменаСБинотел );
		КонецЕсли;	
		ПланыОбмена.УдалитьРегистрациюИзменений(Э_НастройкиБинотел.Э_BinotelПланОбмена,СтрокаКлиент.Клиент);
	КонецЦикла;
	#Если Клиент Тогда
	Состояние("");	
	#КонецЕсли
	
	
	Если НЕ ПолнаяВыгрузка Тогда  
		Выборка = ПланыОбмена.ВыбратьИзменения(Э_НастройкиБинотел.Э_BinotelПланОбмена, НомерСообщения);
		Пока Выборка.Следующий() Цикл
			ПланыОбмена.УдалитьРегистрациюИзменений(Э_НастройкиБинотел.Э_BinotelПланОбмена,Выборка.Получить().Ссылка);
		КонецЦикла;	
	КонецЕсли;
	
	
	ТекстТекущегоСообщения="Выгрузка клиентов в Бинотел: Выгружено "+Строка(Сч)+" объектов.";
	Если ЭтоРегламентноеЗадание Тогда
	    //ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Информация, ,,ТекстТекущегоСообщения ); //bsoft (21.08.2024)
	иначе
	    Э_ТелефонияBinotel.СообщитьИнформацию(ТекстТекущегоСообщения);
	КонецЕсли;
КонецПроцедуры

//Э_Волощук (21.11.2018 16:01:51
//ТипЗвонков - допустимые значения: "входящие", "исходящие"
Процедура ИмпортЗвонков(Знач НачПериода, Знач КонПериода, ТипЗвонков, Э_НастройкиБинотел, ПерезаписатьВсеПоля=Ложь,ФоновоеЗадание=Ложь)
	Если ТипЗвонков <> "входящие" И ТипЗвонков <> "исходящие" Тогда
		Возврат;
	КонецЕсли;
	
	НачПериодаUnix = Э_ТелефонияBinotel.Дата_unix_timestamp(НачПериода,Э_НастройкиБинотел.Э_BinotelЧасовойПояс);
	КонПериодаUnix = Э_ТелефонияBinotel.Дата_unix_timestamp(КонПериода,Э_НастройкиБинотел.Э_BinotelЧасовойПояс);
	
	Э_BinotelPhoneLoc = Обработки.Э_BinotelPhone.Создать();
	ПрерватьИмпорт = Ложь;
		
	ТаблицаЗвонки = Новый ТаблицаЗначений;
	ТаблицаЗвонки.Колонки.Добавить("CallID");
	ТаблицаЗвонки.Колонки.Добавить("StartTime");
		
	КонецВыборкиПериод = КонПериодаUnix;
	Пока Не ПрерватьИмпорт Цикл
		ПолученУспешныйОтвет = Ложь;
		КоличествоПопыток = 3;
			
		Для счетчик = 1 По КоличествоПопыток Цикл
			Если счетчик <> 1 Тогда
				Пауза(12);
			КонецЕсли;
				
			Если ТипЗвонков = "входящие" Тогда
				result = Э_BinotelPhoneLoc.sendRequest("stats/incoming-calls-for-period", Новый Структура("startTime,stopTime",НачПериодаUnix,КонПериодаUnix),,ФоновоеЗадание);
			ИначеЕсли ТипЗвонков = "исходящие" Тогда
				result = Э_BinotelPhoneLoc.sendRequest("stats/outgoing-calls-for-period", Новый Структура("startTime,stopTime",НачПериодаUnix,КонПериодаUnix),,ФоновоеЗадание);
			КонецЕсли;
			СтруктураРезультат = Э_РаботаСJSON.Э_ПрочитатьJSON(result);
			Если ТипЗнч(СтруктураРезультат) = Тип("Структура") Тогда
				Если Найти(СтруктураРезультат["status"], "success") > 0 Тогда
					ПолученУспешныйОтвет = Истина;
					Прервать;
				Иначе
					Если счетчик = КоличествоПопыток Тогда
						Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Ошибка: ';uk='Помилка: '")+ Строка(СтруктураРезультат["code"])+", "+СтруктураРезультат["message"]);
					КонецЕсли;	
				КонецЕсли;
			Иначе
				Если счетчик = КоличествоПопыток Тогда
					Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Ошибка. ';uk='Помилка. '")+Строка(result));   
					#Если Не Клиент Тогда
					Если ТипЗвонков = "входящие" Тогда	
						СообщениеОбОшибке="Ошибка выполнения команды ""Получение входящих звонков"": Результат выполнения ""stats/incoming-calls-for-period"":"+СокрЛП(result)+", результат работы JSON:"+СокрЛП(СтруктураРезультат)+". Начало периода:"+СокрЛП(НачПериода)+", конец периода:"+СокрЛП(КонПериода);
					ИначеЕсли ТипЗвонков = "исходящие" Тогда
						СообщениеОбОшибке="Ошибка выполнения команды ""Получение исходящих звонков"": Результат выполнения ""stats/outgoing-calls-for-period"":"+СокрЛП(result)+", результат работы JSON:"+СокрЛП(СтруктураРезультат)+". Начало периода:"+СокрЛП(НачПериода)+", конец периода:"+СокрЛП(КонПериода);
					КонецЕсли;
					//ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке );  //bsoft (21.08.2024)
					#КонецЕсли
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
			
		Если ПолученУспешныйОтвет Тогда
			СоответствиеЗвонки = СтруктураРезультат["callDetails"];
					
			ПрерватьИмпорт = Истина;
				
			МассивКлючейДляУдаления = Новый Массив;
			//Э_Волощук (04.07.2019 10:37:29
			КонецВыборкиИнтервала = 0;
			//Э_Волощук)
			Для Каждого запись Из СоответствиеЗвонки Цикл
				НайденныеСтроки = ТаблицаЗвонки.НайтиСтроки(Новый Структура("CallID", запись.Ключ));
						
				Если НайденныеСтроки.Количество() = 0 Тогда
					ПрерватьИмпорт = Ложь;
						
					НоваяСтрока = ТаблицаЗвонки.Добавить();
					НоваяСтрока.CallID = запись.Ключ;
					НоваяСтрока.StartTime = запись.Значение.Starttime;
						
					//Э_Волощук (04.07.2019 10:38:23
					//Если Число(НоваяСтрока.StartTime) < КонецВыборкиПериод Тогда
					//	КонецВыборкиПериод = Число(НоваяСтрока.StartTime);
					Если Число(НоваяСтрока.StartTime) > КонецВыборкиИнтервала Тогда
						КонецВыборкиИнтервала = Число(НоваяСтрока.StartTime);
					//Э_Волощук)
					КонецЕсли;
				Иначе
					МассивКлючейДляУдаления.Добавить(запись.Ключ);
				КонецЕсли;
			КонецЦикла;
			
			//Э_Волощук (04.07.2019 10:39:05
			Если КонецВыборкиИнтервала > 0 И КонецВыборкиИнтервала < КонецВыборкиПериод Тогда
				КонецВыборкиПериод = КонецВыборкиИнтервала;
			КонецЕсли;
			//Э_Волощук)
			
			Для Каждого стр Из МассивКлючейДляУдаления Цикл 
				СоответствиеЗвонки.Удалить(стр);
			КонецЦикла;
				
			Э_ТелефонияBinotel.Э_СформироватьСобытия(НачПериода,СоответствиеЗвонки, ПерезаписатьВсеПоля);
				
			Если Не ПрерватьИмпорт Тогда
				Пауза(12);
			КонецЕсли;
		Иначе
			ПрерватьИмпорт = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
//Э_Волощук)

Процедура Э_ПолучитьЗвонкиЗаПериод(НачПериода, КонПериода, ВходящиеЗвонки=Истина, ИсходящиеЗвонки=Истина, ПерезаписатьВсеПоля=Ложь,ФоновоеЗадание=Ложь) Экспорт 
	Перем Э_BinotelPhoneLoc;

	Э_НастройкиБинотел=Э_ТелефонияBinotel.Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
	     Возврат;
	КонецЕсли;
	
	Если Э_НастройкиБинотел<>Неопределено и НЕ Э_НастройкиБинотел.Э_BinotelИспользоватьФункционалИнтеграции Тогда
	     Возврат;
	КонецЕсли;
	
	//Э_Волощук (21.11.2018 16:42:21
	//НачПериодаUnix = Э_ТелефонияBinotel.Дата_unix_timestamp(НачПериода,Э_НастройкиБинотел.Э_BinotelЧасовойПояс);
	//КонПериодаUnix = Э_ТелефонияBinotel.Дата_unix_timestamp(КонПериода,Э_НастройкиБинотел.Э_BinotelЧасовойПояс);
	//
	// Получение входящих звонков
	//Если ВходящиеЗвонки Тогда
	//	Э_BinotelPhoneLoc = Обработки.Э_BinotelPhone.Создать();
	//	result_in = Э_BinotelPhoneLoc.sendRequest("stats/incoming-calls-for-period", Новый Структура("startTime,stopTime",НачПериодаUnix,КонПериодаUnix),,ФоновоеЗадание);
	//	СтруктураРезультат_IN = Э_РаботаСJSON.Э_ПрочитатьJSON(result_in);
	//	Если ТипЗнч(СтруктураРезультат_IN) = Тип("Структура") Тогда
	//		Если Найти(СтруктураРезультат_IN["status"], "success") > 0 Тогда
	//			Э_ТелефонияBinotel.Э_СформироватьСобытия(НачПериода,СтруктураРезультат_IN["callDetails"], ПерезаписатьВсеПоля);
	//		Иначе
	//			Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Ошибка: ';uk='Помилка: '")+ Строка(СтруктураРезультат_IN["code"])+", "+СтруктураРезультат_IN["message"]);
	//		КонецЕсли;
	//	Иначе
	//		Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Ошибка. ';uk='Помилка. '")+Строка(result_in));   
	//		#Если Не Клиент Тогда
	//		СообщениеОбОшибке="Ошибка выполнения команды ""Получение входящих звонков"": Результат выполнения ""stats/incoming-calls-for-period"":"+СокрЛП(result_in)+", результат работы JSON:"+СокрЛП(СтруктураРезультат_IN)+". Начало периода:"+СокрЛП(НачПериода)+", конец периода:"+СокрЛП(КонПериода);	
	//		ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке );
	//		#КонецЕсли
	//	КонецЕсли;
	//КонецЕсли;
	//
	//// Получение исходящих звонков
	//Если ИсходящиеЗвонки Тогда
	//    Э_BinotelPhoneLoc = Обработки.Э_BinotelPhone.Создать();
	//	result_out = Э_BinotelPhoneLoc.sendRequest("stats/outgoing-calls-for-period", Новый Структура("startTime,stopTime",НачПериодаUnix,КонПериодаUnix),,ФоновоеЗадание);
	//	СтруктураРезультат_OUT = Э_РаботаСJSON.Э_ПрочитатьJSON(result_out);
	//	Если ТипЗнч(СтруктураРезультат_OUT) = Тип("Структура") Тогда
	//		Если Найти(СтруктураРезультат_OUT["status"], "success") > 0 Тогда
	//			Э_ТелефонияBinotel.Э_СформироватьСобытия(НачПериода,СтруктураРезультат_OUT["callDetails"], ПерезаписатьВсеПоля);
	//		Иначе
	//			Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Ошибка: ';uk='Помилка: '")+ Строка(СтруктураРезультат_OUT["code"])+", "+СтруктураРезультат_OUT["message"]);
	//		КонецЕсли;
	//	Иначе
	//		Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Ошибка. ';uk='Помилка. '")+Строка(result_out));
	//		#Если Не Клиент Тогда
	//		СообщениеОбОшибке="Ошибка выполнения команды ""Получение исходящих звонков"": Результат выполнения ""stats/outgoing-calls-for-period"":"+СокрЛП(result_in)+", результат работы JSON:"+СокрЛП(СтруктураРезультат_OUT)+". Начало периода:"+СокрЛП(НачПериода)+", конец периода:"+СокрЛП(КонПериода);	
	//		ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке,);
	//		#КонецЕсли
	//	КонецЕсли;
	//КонецЕсли;
	
	// Получение входящих звонков
	Если ВходящиеЗвонки Тогда
		ИмпортЗвонков(НачПериода, КонПериода, "входящие", Э_НастройкиБинотел, ПерезаписатьВсеПоля, ФоновоеЗадание);
	КонецЕсли;
	
	// Получение исходящих звонков
	Если ИсходящиеЗвонки Тогда
		ИмпортЗвонков(НачПериода, КонПериода, "исходящие", Э_НастройкиБинотел, ПерезаписатьВсеПоля, ФоновоеЗадание);
	КонецЕсли;
	//Э_Волощук)
КонецПроцедуры

Процедура СинхронизироватьКонтрагентов() Экспорт
	Перем Э_BinotelPhoneLoc;
    Э_BinotelPhoneLoc = Обработки.Э_BinotelPhone.Создать();
	result_customers = Э_BinotelPhoneLoc.sendRequest("customers/list", Новый Структура());
	СтруктураРезультат = Э_РаботаСJSON.Э_ПрочитатьJSON(result_customers);
	Если ТипЗнч(СтруктураРезультат) = Тип("Структура") Тогда
		Если Найти(СтруктураРезультат["status"], "success") > 0 Тогда
			Сч=0;
			ВсегоСтрокДляОбработки=СтруктураРезультат.customerData.Количество();
			ОбработаноСтрок=0;
			Для Каждого Клиент Из СтруктураРезультат.customerData Цикл
				ДанныеКлиента = Клиент.Значение;
				ОбработаноСтрок=ОбработаноСтрок+1;
				#Если Клиент Тогда
				ПроцентОбработки=Окр(ОбработаноСтрок*100/ВсегоСтрокДляОбработки,0);
				ОбработкаПрерыванияПользователя();          
				Состояние("Обработано:"+ПроцентОбработки+"%. Синхронизация клиента """+Строка(ДанныеКлиента)+"""");
				#КонецЕсли
				Если Э_ТелефонияBinotel.Э_ЗаписатьIDКлиентаВСистемеБинотел(ДанныеКлиента.id, ДанныеКлиента.numbers) Тогда
					Сч=Сч+1;
				КонецЕсли;
			КонецЦикла;	
		Иначе
			СтатусЗвонка = "error";
			Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Ошибка: ';uk='Помилка: '")+ Строка(СтруктураРезультат["code"])+", "+СтруктураРезультат["message"]);
		КонецЕсли;
	Иначе
		СтатусЗвонка = "error";
		Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Ошибка. ';uk='Помилка. '")+Строка(result_customers));
	КонецЕсли;
	
	Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Контрагенты: синхронизовано ';uk='Контрагенти: синхронізовано '")+Строка(Сч)+НСтр("ru=' объектов.';uk=' об'єктів.'"));      

КонецПроцедуры

Функция Э_ПоследнийЗаказПоКонтрагенту(ТекКонтрагент) Экспорт
	Если Не ЗначениеЗаполнено(ТекКонтрагент) Тогда
	    Возврат Неопределено;
	КонецЕсли;
	Если Метаданные.Документы.Найти("ЗаказПокупателя")<>Неопределено Тогда
		НазваниеВидаДокументаЗаказ="ЗаказПокупателя";
	иначеЕсли Метаданные.Документы.Найти("СчетНаОплатуПокупателю")<>Неопределено Тогда
		НазваниеВидаДокументаЗаказ="СчетНаОплатуПокупателю";
	иначе                                                       
		Возврат Неопределено;
	КонецЕсли;	
	НаименованиеРеквизитаКонтрагент="Контрагент";
	
	Запрос=Новый Запрос;
	ТекстЗапроса="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	              |	ЗаказКлиента.Ссылка
	              |ИЗ
	              |	Документ.ЗаказПокупателя КАК ЗаказКлиента
	              |ГДЕ
	              |	ЗаказКлиента.Контрагент = &Контрагент
	              |	И Не ЗаказКлиента.ПометкаУдаления
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	ЗаказКлиента.Дата УБЫВ";
	Запрос.УстановитьПараметр("Контрагент",ТекКонтрагент);			  
	
	Если НаименованиеРеквизитаКонтрагент<>"Контрагент" Тогда
	    ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"ЗаказКлиента.Контрагент","ЗаказКлиента."+НаименованиеРеквизитаКонтрагент);	
	КонецЕсли;			  
	Если НазваниеВидаДокументаЗаказ<>"ЗаказПокупателя" Тогда
	    ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"Документ.ЗаказПокупателя","Документ."+НазваниеВидаДокументаЗаказ);	
	КонецЕсли;			  
	
	Запрос.Текст=ТекстЗапроса;
    РезультатЗапрос=Запрос.Выполнить().Выбрать();
	Если РезультатЗапрос.Следующий() Тогда
	    Возврат РезультатЗапрос.Ссылка;
	иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции 

//Э_Гашук(28.09.2019 01:06:13 www.nct.ua 
//Э_Волощук (27.09.2019 16:39:50
//Функция Э_ПоследнийПредЗаказПоКонтрагенту(ТекКонтрагент) Экспорт
//	Если Не ЗначениеЗаполнено(ТекКонтрагент) Тогда
//	    Возврат Неопределено;
//	КонецЕсли;
//	Запрос=Новый Запрос;
//	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
//	              |	ПредЗаказ.Ссылка
//	              |ИЗ
//	              |	Документ.ПредЗаказ КАК ПредЗаказ
//	              |ГДЕ
//	              |	ПредЗаказ.Контрагент = &Контрагент
//	              |	И Не ПредЗаказ.ПометкаУдаления
//	              |
//	              |УПОРЯДОЧИТЬ ПО
//	              |	ПредЗаказ.Дата УБЫВ";
//	Запрос.УстановитьПараметр("Контрагент",ТекКонтрагент);			  
//	
//	РезультатЗапрос=Запрос.Выполнить().Выбрать();
//	Если РезультатЗапрос.Следующий() Тогда
//	    Возврат РезультатЗапрос.Ссылка;
//	иначе
//		Возврат Неопределено;
//	КонецЕсли;
//КонецФункции
//Э_Волощук)
Функция Э_ПоследнийПредЗаказПоКонтакту(ТекКонтрагент,Э_Лид=Неопределено) Экспорт
   Перем ЕстьОтборПоКонтрагенту,ЕстьОтборПоЭ_Лид,Запрос,Результат;	
   
   ЕстьОтборПоКонтрагенту                  =?(ЗначениеЗаполнено(ТекКонтрагент),Истина,Ложь);
   ЕстьОтборПоЭ_Лид=?(ЗначениеЗаполнено(Э_Лид),Истина,Ложь);	
   
   Если ЕстьОтборПоКонтрагенту или ЕстьОтборПоЭ_Лид Тогда
		 
	   Запрос=Новый Запрос;
	   Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                |	ПредЗаказ.Ссылка
	                |ИЗ
	                |	Документ.ПредЗаказ КАК ПредЗаказ
	                |ГДЕ
	                |	НЕ ПредЗаказ.ПометкаУдаления
	                |	И ВЫБОР
	                |			КОГДА &ЕстьОтборПоКонтрагенту
	                |				ТОГДА ПредЗаказ.Контрагент = &Контрагент
	                |			ИНАЧЕ ИСТИНА
	                |		КОНЕЦ";
					Если ЕстьОтборПоЭ_Лид Тогда
					    Запрос.Текст=Запрос.Текст+"
		                |	И ВЫБОР
		                |			КОГДА &ЕстьОтборПоЭ_Лид
		                |				ТОГДА ПредЗаказ.Э_Лид = &Э_Лид
		                |			ИНАЧЕ ИСТИНА
		                |		КОНЕЦ";
					КонецЕсли; 
				    Запрос.Текст=Запрос.Текст+"
	                |
	                |УПОРЯДОЧИТЬ ПО 
					|	ПредЗаказ.Дата УБЫВ";
					
					
	    //Запрос.УстановитьПараметр("ДатаНачало",НачалоМесяца(НачПериода));									
		Запрос.УстановитьПараметр("ЕстьОтборПоКонтрагенту",ЕстьОтборПоКонтрагенту);			
		Запрос.УстановитьПараметр("Контрагент",ТекКонтрагент);			
		Запрос.УстановитьПараметр("ЕстьОтборПоЭ_Лид",ЕстьОтборПоЭ_Лид);			
		Запрос.УстановитьПараметр("Э_Лид",Э_Лид);			
		Результат=Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
		     Возврат Результат.Ссылка;
		иначе	 
		     возврат Неопределено;	 
		КонецЕсли;
	иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции 
//Э_Гашук) 

//Э_Гашук(28.09.2019 00:52:26 www.nct.ua 
////Э_Волощук (27.09.2019 16:39:50
//Функция Э_ПоследнийОтветственныйИзСобытийПоКонтрагентуКонтактномуЛицу(ТекКонтрагент, ТекКонтактноеЛицо, Э_Лид, Ответственный, Входящий) Экспорт
//	Если Не ЗначениеЗаполнено(ТекКонтрагент) И Не ЗначениеЗаполнено(ТекКонтактноеЛицо)Тогда
//	    Возврат Неопределено;
//	КонецЕсли;
//	
//	Запрос=Новый Запрос;
//	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
//	              |	Событие.Ответственный
//	              |ИЗ
//	              |	Документ.Событие КАК Событие
//	              |ГДЕ
//	              |	ВЫБОР
//				  |		КОГДА &ОтборПоКонтрагенту ТОГДА Событие.Контрагент = &Контрагент
//				  |		ИНАЧЕ Событие.КонтактноеЛицо = &КонтактноеЛицо
//				  |	КОНЕЦ
//	              |	И Не Событие.ПометкаУдаления
//				  |	И Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТелефонныйЗвонок)
//	              |
//	              |УПОРЯДОЧИТЬ ПО
//	              |	Событие.Дата УБЫВ";
//	Запрос.УстановитьПараметр("Контрагент",ТекКонтрагент);
//	Запрос.УстановитьПараметр("КонтактноеЛицо",ТекКонтактноеЛицо);
//	Запрос.УстановитьПараметр("ОтборПоКонтрагенту",?(ЗначениеЗаполнено(ТекКонтрагент), Истина, Ложь));
//	
//	РезультатЗапрос=Запрос.Выполнить().Выбрать();
//	Если РезультатЗапрос.Следующий() Тогда
//	    Ответственный=РезультатЗапрос.Ответственный;
//	иначе
//		Возврат Неопределено;
//	КонецЕсли;
//КонецФункции
////Э_Волощук)
Функция Э_ПоследнееСобытиеПоКонтакту(ТекКонтрагент,ТекКонтактноеЛицо,Э_Лид=Неопределено) Экспорт
   Перем ЕстьОтборПоКонтрагенту,ЕстьОтборПоКонтактномуЛицу,ЕстьОтборПоЭ_Лид,Запрос,Результат;	
   
   ЕстьОтборПоКонтрагенту                  =?(ЗначениеЗаполнено(ТекКонтрагент),Истина,Ложь);
   ЕстьОтборПоКонтактномуЛицу              =?(ЗначениеЗаполнено(ТекКонтактноеЛицо),Истина,Ложь);
   ЕстьОтборПоЭ_Лид=?(ЗначениеЗаполнено(Э_Лид),Истина,Ложь);	
   
   Если ЕстьОтборПоКонтрагенту или ЕстьОтборПоКонтактномуЛицу или ЕстьОтборПоЭ_Лид Тогда
		 
	   Запрос=Новый Запрос;
	   Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                |	Событие.Ссылка
	                |ИЗ
	                |	Документ.Событие КАК Событие
	                |ГДЕ
	                |	НЕ Событие.ПометкаУдаления
	                |	И Событие.ВидСобытия = &ВидСобытия
	                |	И Событие.СостояниеСобытия = &СостояниеСобытия
	                |	И ВЫБОР
	                |			КОГДА &ЕстьОтборПоКонтрагенту
	                |				ТОГДА Событие.Контрагент = &Контрагент
	                |			ИНАЧЕ ИСТИНА
	                |		КОНЕЦ
	                |	И ВЫБОР
	                |			КОГДА &ЕстьОтборПоКонтактномуЛицу
	                |				ТОГДА Событие.КонтактноеЛицо = &КонтактноеЛицо
	                |			ИНАЧЕ ИСТИНА
	                |		КОНЕЦ";
					Если ЕстьОтборПоЭ_Лид Тогда
					    Запрос.Текст=Запрос.Текст+"
		                |	И ВЫБОР
		                |			КОГДА &ЕстьОтборПоЭ_Лид
		                |				ТОГДА Событие.Э_Лид = &Э_Лид
		                |			ИНАЧЕ ИСТИНА
		                |		КОНЕЦ";
					КонецЕсли; 
				    Запрос.Текст=Запрос.Текст+"
	                |
	                |УПОРЯДОЧИТЬ ПО 
					|	Событие.Дата УБЫВ";
					
					
	    //Запрос.УстановитьПараметр("ДатаНачало",НачалоМесяца(НачПериода));									
		Запрос.УстановитьПараметр("ЕстьОтборПоКонтрагенту",ЕстьОтборПоКонтрагенту);			
		Запрос.УстановитьПараметр("Контрагент",ТекКонтрагент);			
		Запрос.УстановитьПараметр("ЕстьОтборПоКонтактномуЛицу",ЕстьОтборПоКонтактномуЛицу);			
		Запрос.УстановитьПараметр("КонтактноеЛицо",ТекКонтактноеЛицо);			
		Запрос.УстановитьПараметр("ЕстьОтборПоЭ_Лид",ЕстьОтборПоЭ_Лид);			
		Запрос.УстановитьПараметр("Э_Лид",Э_Лид);			
		Запрос.УстановитьПараметр("ВидСобытия",Перечисления.ВидыСобытий.ТелефонныйЗвонок);			
		Запрос.УстановитьПараметр("СостояниеСобытия",Перечисления.СостоянияСобытий.Завершено);			
		Результат=Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
		     Возврат Результат.Ссылка;
		иначе	 
		     возврат Неопределено;	 
		КонецЕсли;
	иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции 
//Э_Гашук) 
Процедура ЗагрузитьКонтрагентов() Экспорт
	Перем Э_BinotelPhoneLoc;
	
	#Если Клиент Тогда	
	Ответ = Вопрос("Действительно желаете загрузить клиентов с Бинотел в ""1С""?. Соответсвующие контрагенты будут найдены в 1С по номеру телефона, если не найдены, то будут созданы новые.", РежимДиалогаВопрос.ДаНет);
	Если Ответ <> КодВозвратаДиалога.да Тогда
	    Возврат;
	КонецЕсли;
	#КонецЕсли
		
	Э_BinotelPhoneLoc = Обработки.Э_BinotelPhone.Создать();
	result_customers = Э_BinotelPhoneLoc.sendRequest("customers/list", Новый Структура());
	СтруктураРезультат = Э_РаботаСJSON.Э_ПрочитатьJSON(result_customers);
	Если ТипЗнч(СтруктураРезультат) = Тип("Структура") Тогда
		Если Найти(СтруктураРезультат["status"], "success") > 0 Тогда
			Сч=0;
			ВсегоСтрокДляОбработки=СтруктураРезультат.customerData.Количество();
			ОбработаноСтрок=0;
			Для Каждого Клиент Из СтруктураРезультат.customerData Цикл
				ДанныеКлиента = Клиент.Значение;
				ОбработаноСтрок=ОбработаноСтрок+1;
				#Если Клиент Тогда
				ПроцентОбработки=Окр(ОбработаноСтрок*100/ВсегоСтрокДляОбработки,0);
				ОбработкаПрерыванияПользователя();          
				Состояние("Обработано:"+ПроцентОбработки+"%. Синхронизация клиента """+Строка(ДанныеКлиента)+"""");
				#КонецЕсли
				Если Э_ТелефонияBinotel.Э_ЗаписатьНовогоКлиентаВСистемеБинотел(ДанныеКлиента.id,ДанныеКлиента.name, ДанныеКлиента.numbers, ДанныеКлиента.assignedToEmployeeID,ДанныеКлиента.email,ДанныеКлиента.labels) Тогда
					Сч=Сч+1;
				КонецЕсли;
			КонецЦикла;	
		Иначе
			СтатусЗвонка = "error";
			Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Ошибка: ';uk='Помилка: '")+ Строка(СтруктураРезультат["code"])+", "+СтруктураРезультат["message"]);
		КонецЕсли;
	Иначе
		СтатусЗвонка = "error";
		Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Ошибка. ';uk='Помилка. '")+Строка(result_customers));
	КонецЕсли;
	
	Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Контрагенты: синхронизовано ';uk='Контрагенти: синхронізовано '")+Строка(Сч)+НСтр("ru=' объектов.';uk=' об'єктів.'"));   
КонецПроцедуры

Функция Э_ЗаписатьНовогоКлиентаВСистемеБинотел(CustomerID,ИмяКлиента, Numbers=Неопределено,assignedToEmployeeID=Неопределено,email=Неопределено,Метки=Неопределено) Экспорт 
	ТекКлиент = Неопределено;
	Если ЗначениеЗаполнено(CustomerID) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("CustomerID", CustomerID);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Э_ТелефонияКодыКлиентов.Контакт.Ссылка как Ссылка
		|ИЗ
		|	РегистрСведений.Э_ТелефонияКодыКлиентов КАК Э_ТелефонияКодыКлиентов
		|ГДЕ
		|	Э_ТелефонияКодыКлиентов.ТелефонияКод = &CustomerID";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекКлиент = Выборка.Ссылка;
		КонецЕсли;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивНомеров", Numbers);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтактнаяИнформация.Объект КАК Ссылка
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КонтактнаяИнформация.CRM_НомерТелефона В(&МассивНомеров)";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 1 Тогда
		СтрокаТелефонов = "";
		Для Каждого ТекТелефон Из Numbers Цикл
			СтрокаТелефонов = СтрокаТелефонов + ТекТелефон + ", ";     
		КонецЦикла;
		СтрокаТелефонов = Лев(СтрокаТелефонов, СтрДлина(СтрокаТелефонов)-2);
		СообщитьИнформацию(НСтр("ru='Некоторые номера из списка принадлежат более чем одному контрагенту: ';uk='Деякі номера зі списку належать більш ніж одному контрагенту: '")+СтрокаТелефонов);
		Возврат Ложь;
		
	ИначеЕсли Выборка.Количество() = 0 и НЕ ЗначениеЗаполнено(ТекКлиент) Тогда
		ТекКлиент = Справочники.Контрагенты.СоздатьЭлемент();
		ТекКлиент.Наименование =  ИмяКлиента;
		ТекКлиент.НаименованиеПолное =  ИмяКлиента;
		Попытка
			ТекКлиент.Записать();              
		Исключение
			СообщитьИнформацию(НСтр("ru='Не записан контрагент с наименованием ';uk='Не записаний контрагент з найменуванням '")+Строка(ИмяКлиента)+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		ТекКлиент = ТекКлиент.Ссылка; 
		МенеджерЗаписи = РегистрыСведений.Э_ТелефонияКодыКлиентов.СоздатьМенеджерЗаписи();	
		МенеджерЗаписи.Контакт = ТекКлиент;
		МенеджерЗаписи.ТелефонияКод = CustomerID;
		Попытка
			МенеджерЗаписи.Записать();                   
		Исключение
			СообщитьИнформацию(НСтр("ru='Не записано ID в виртуальной АТС для контрагента ';uk='Не записано ID в віртуальній АТС для контрагента '")+Строка(ТекКлиент)+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;	

	РодительскаяПапка = Неопределено;
	Если ЗначениеЗаполнено(ТекКлиент) тогда
		
		Если Метки<>Неопределено тогда
			Если ТипЗнч(Метки)=Тип("Массив") тогда 
				Если Метки.Количество()	> 0 тогда
					НазваниеРодительскойПапки = Метки[0].name;
					РодительскаяПапка = Э_ПолучитьРодительскуюПапкуПоНаименованию(НазваниеРодительскойПапки);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		
		Если РодительскаяПапка <> ТекКлиент.Родитель тогда
			ТекКлиентОбъект = ТекКлиент.ПолучитьОбъект();	
			ТекКлиентОбъект.Родитель =  РодительскаяПапка;
			ТекКлиентОбъект.Записать();
		КонецЕсли;	
		
		ОтветственныйПользователь = Э_ПолучитьСотрудникаПоIDТелефонии(assignedToEmployeeID);
		Если ЗначениеЗаполнено(ОтветственныйПользователь) Тогда
			ОтветственныйПользовательФизЛицо=ОтветственныйПользователь.ФизЛицо;

			Если ЗначениеЗаполнено(ОтветственныйПользовательФизЛицо) Тогда
				Если ОтветственныйПользовательФизЛицо <> ТекКлиент.ОтветственныйМенеджер тогда
					ТекКлиентОбъект = ТекКлиент.ПолучитьОбъект();	
					ТекКлиентОбъект.ОтветственныйМенеджер =  ОтветственныйПользовательФизЛицо;		
					ТекКлиентОбъект.Записать();
				КонецЕсли;
			иначе
				Сообщить(НСтр("ru='В карточке пользователя ';uk='В картці користувача '")+ОтветственныйПользователь+НСтр("ru=' не заполнено физическое лицо';uk=' не заповнено фізичну особу'"));     
			КонецЕсли;
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(email) Тогда
			НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Значение      = ТекКлиент;
			НаборЗаписей.Отбор.Объект.Использование = Истина;
			НаборЗаписей.Отбор.Тип.Значение         = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			НаборЗаписей.Отбор.Тип.Использование = Истина;
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 тогда
				НоваяЗапись=НаборЗаписей.Добавить();
				НоваяЗапись.Объект=ТекКлиент;
				НоваяЗапись.Тип=Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				НоваяЗапись.Вид=Э_ПолучитьВидКонтактнойИнформации(ТекКлиент,НоваяЗапись.Тип);
				НоваяЗапись.Представление=email;
			КонецЕсли;	
			
			Если НаборЗаписей.Модифицированность() Тогда
				Попытка
					НаборЗаписей.Записать();		  

					Возврат Истина;
				исключение
					Сообщить(НСтр("ru='Ошибка записи email контрагента ';uk='Помилка запису email контрагента '")+СокрЛП(ТекКлиент)+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки());
				КонецПопытки;	
			КонецЕсли;	
		
		КонецЕсли;
		
	КонецЕсли;

	 
	СтатусВозвратаПриДобавленииТелефонов=Э_ДобавитьТелефоныКонтрагентуКонтактномуЛицу(ТекКлиент,Numbers, Перечисления.ВидыОбъектовКонтактнойИнформации.Контрагенты);
		 
	
	Возврат СтатусВозвратаПриДобавленииТелефонов;

КонецФункции 	

Функция Э_ДобавитьТелефоныКонтрагентуКонтактномуЛицу(Клиент,Numbers,ВидОбъектаКонтактнойИнформации) Экспорт
	Если НЕ ЗначениеЗаполнено(Клиент) или НЕ ЗначениеЗаполнено(Numbers) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", ВидОбъектаКонтактнойИнформации);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|
	|ГДЕ
	|	(ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ) И
	|	ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации  И
	|	ВидыКонтактнойИнформации.Тип = &Тип
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 
	
	ВидыКИ = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл 
		Если Выборка.Ссылка.ПометкаУдаления тогда продолжить; КонецЕсли;
		
		ВидыКИ.Добавить(Выборка.Ссылка);
	КонецЦикла;	 
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номер");
	ТЗ.Колонки.Добавить("ВидКИ");
	
	
	
	НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Значение      = Клиент;
	НаборЗаписей.Отбор.Объект.Использование = Истина;
	НаборЗаписей.Отбор.Тип.Значение         = Перечисления.ТипыКонтактнойИнформации.Телефон;
	НаборЗаписей.Отбор.Тип.Использование = Истина;
	НаборЗаписей.Прочитать();
	ТЗ_тек = НаборЗаписей.Выгрузить(,"CRM_НомерТелефона,Вид");
	
	Для каждого стр из ТЗ_тек Цикл
		индекс = Numbers.Найти(стр.CRM_НомерТелефона);		
		Если НЕ (индекс = Неопределено) тогда
			ВидыКИ.Удалить(ВидыКИ.НайтиПоЗначению(стр.Вид));	
		КонецЕсли;	
	КонецЦикла;		
	
	Для каждого Номер из Numbers Цикл
		НовСтр = ТЗ.Добавить();
		НовСтр.Номер = Номер;
		
		НайденнаяСтрока = ТЗ_тек.Найти(Номер,"CRM_НомерТелефона");
		Если НайденнаяСтрока = Неопределено Тогда
			Если ВидыКИ.Количество() > 0 тогда
				НовСтр.ВидКИ = ВидыКИ[0].Значение;
				ВидыКИ.Удалить(ВидыКИ[0]);
			КонецЕсли;
		иначе
			ВидКИ = НайденнаяСтрока.Вид;
			НовСтр.ВидКИ = ВидКИ;
		КонецЕсли;
	КонецЦикла;	
	
	Если ТЗ.Количество() =  ТЗ_тек.Количество() тогда	
		Возврат Ложь;
	КонецЕсли;
	
	
	ТЗ.Сортировать("ВидКИ Убыв");
	
	НаборЗаписей.Очистить();	
	Для каждого стр из ТЗ Цикл
		
		Если НЕ ЗначениеЗаполнено(стр.ВидКИ) тогда 
			СообщитьИнформацию(НСтр("ru='Не достаточно элементов контактной информации с видом ""Телефон"" для номера ';uk='Не достатньо елементів контактної інформації з видом ""Телефон"" для номера '")+Строка(стр.Номер)+" контрагента "+Строка(Клиент));      
			прервать;
		КонецЕсли;
		
		НоваяЗапись=НаборЗаписей.Добавить();
		НоваяЗапись.Объект=Клиент;
		НоваяЗапись.Тип=Перечисления.ТипыКонтактнойИнформации.Телефон;
		НоваяЗапись.Вид=стр.ВидКИ;
		НоваяЗапись.Поле3=Стр.Номер;
		НоваяЗапись.Представление=Стр.Номер;
		НоваяЗапись.CRM_НомерТелефона=Стр.Номер;
		
		
	КонецЦикла;	
	Если НаборЗаписей.Модифицированность() Тогда
		Попытка
			НаборЗаписей.Записать();		
			Возврат Истина;
		исключение
			Сообщить(НСтр("ru='Ошибка записи телефонов контрагента ';uk='Помилка запису телефонів контрагента '")+СокрЛП(Клиент)+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки());       
		КонецПопытки;	
	КонецЕсли;	 
	Возврат Ложь;
	
КонецФункции

Функция Э_ПолучитьВидКонтактнойИнформации(ТекКлиент,Тип) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Тип"   , Тип);                   
	Запрос.УстановитьПараметр("ВидОбъектаКонтактнойИнформации", УправлениеКонтактнойИнформацией.ВидОбъектаКИ(ТекКлиент));
	
	Запрос.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыКонтактнойИнформации.Ссылка  как Ссылка
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|
		|ГДЕ
		|	(ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ) И
		|	ВидыКонтактнойИнформации.ВидОбъектаКонтактнойИнформации = &ВидОбъектаКонтактнойИнформации  И
		|	ВидыКонтактнойИнформации.Тип = &Тип
		|";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Если Выборка.Следующий() тогда
		  Возврат Выборка.Ссылка;
	КонецЕсли;
	
Возврат Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
КонецФункции

Функция Э_ПолучитьРодительскуюПапкуПоНаименованию(НазваниеРодительскойПапки)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Контрагенты.Ссылка как Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ЭтоГруппа
	               |	И Контрагенты.Наименование = &НазваниеРодительскойПапки";
	Запрос.УстановитьПараметр("НазваниеРодительскойПапки",НазваниеРодительскойПапки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	
	НоваяПапка = Справочники.Контрагенты.СоздатьГруппу();
	НоваяПапка.Наименование = НазваниеРодительскойПапки;
	НоваяПапка.Записать();
	
	Возврат НоваяПапка.Ссылка;			   
КонецФункции

Функция Э_ПолучитьСотрудникаПоIDТелефонии(ID)
	Если ЗначениеЗаполнено(ID) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ID", ID);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Э_ТелефонияКодыСотрудников.Сотрудник.Ссылка как Ссылка
		|ИЗ
		|	РегистрСведений.Э_ТелефонияКодыСотрудников КАК Э_ТелефонияКодыСотрудников
		|ГДЕ
		|	Э_ТелефонияКодыСотрудников.ТелефонияКод = &ID";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;	
	КонецЕсли;
Возврат Справочники.Пользователи.ПустаяСсылка();
КонецФункции

Функция ОтключитьРегламентныеЗаданияТелефонии()  Экспорт
	РЗ = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	Для каждого РегламентноеЗадание из РЗ цикл
		Если метаданные.Подсистемы.Э_ТелефонияБинотел.Состав.Содержит( РегламентноеЗадание.метаданные) тогда
			РегламентноеЗадание.Использование=ложь;
			РегламентноеЗадание.Записать();
			
		КонецЕсли;	                                             
	КонецЦикла;
КонецФункции

Функция Э_УвеличитьСчетчикОбрывовСвязи()  Экспорт
	
	КлючОбъекта  = "КоличествоОшибокПодключения";
    КлючНастроек = "ПараметрыТелефонии";
   
	Попытка 
		ТекКолво = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,КлючНастроек);
	исключение
	    ТекКолво = 0;
	КонецПопытки;
	
	Если ТекКолво = неопределено тогда 
		ТекКолво = 0;
	КонецЕсли;	
	
	Сообщить(СокрЛП(ТекКолво));
	
	ТекКолво = ТекКолво + 1;

	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта,  КлючНастроек, ТекКолво);
	
	Возврат ТекКолво;
КонецФункции

Функция Э_СброситьСчетчикОбрывовСвязи() Экспорт
	
    КлючОбъекта  = "КоличествоОшибокПодключения";
    КлючНастроек = "ПараметрыТелефонии";
	
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта,  КлючНастроек, 0);
	Возврат 0;
	
КонецФункции

Процедура Э_ОтключитьФункционалИнтеграции() Экспорт
	НаборЗаписей = РегистрыСведений.Э_BinotelНастройки.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
Если НаборЗаписей.Количество() = 0 Тогда
    ЗаписьНастроек = НаборЗаписей.Добавить();
ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
    ЗаписьНастроек = НаборЗаписей[0];
КонецЕсли;
	ЗаписьНастроек.Э_BinotelИспользоватьФункционалИнтеграции = ЛОЖЬ;
	НаборЗаписей.Записать();
	
	Э_СброситьСчетчикОбрывовСвязи();
КонецПроцедуры

Процедура Э_СоздатьЗадачуПоНесостоявшемусяЗвонку(ДокСобытие, ВремяЗвонка, Контрагент, КонтактноеЛицо, Лид=Неопределено)
	Задача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
	Если ДокСобытие.ЭтоНовый()  тогда
		//Э_Волощук (31.07.2019 01:23:06
		//Задача.Объект = ДокСобытие.ПолучитьСсылкуНового();
		Если ДокСобытие.Ссылка = Документы.Событие.ПустаяСсылка() Тогда
			ДокСобытие.УстановитьСсылкуНового(Документы.Событие.ПолучитьСсылку());
			Задача.Объект = ДокСобытие.ПолучитьСсылкуНового();
		КонецЕсли;
		//Э_Волощук)
	иначе
		Задача.Объект = ДокСобытие.Ссылка;
	КонецЕсли;  
	Задача.Дата =  ТекущаяДата();
	Задача.Исполнитель = ДокСобытие.Ответственный;
	ТекстНаименование = ДокСобытие.СодержаниеСобытия;
	ТекстОписания =  "Дата и время звонка :"+ВремяЗвонка;
	Если ЗначениеЗаполнено(Контрагент) Тогда
	  ТекстОписания = ТекстОписания+"
	  |Контрагент :"+СокрЛП(Контрагент)+";";
	  ТекстНаименование=ТекстНаименование+"; "+СокрЛП(Контрагент);
	КонецЕсли;
	Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
	  ТекстОписания = ТекстОписания+"
	  |Контактное лицо :"+СокрЛП(КонтактноеЛицо)+";";
	  ТекстНаименование=ТекстНаименование+"; "+СокрЛП(КонтактноеЛицо);
	КонецЕсли;
	Если ЗначениеЗаполнено(Лид) Тогда
	  ТекстОписания = ТекстОписания+"
	  |Лид :"+СокрЛП(Лид)+";";
	  ТекстНаименование=ТекстНаименование+"; "+СокрЛП(Лид);
	КонецЕсли;
	//Э_Волощук (19.06.2019 15:48:05
	//Если ЗначениеЗаполнено(Лид) Тогда
	//  ТекстОписания = ТекстОписания+"
	//  |Звонили с :"+СокрЛП(Лид.НомерТелефона)+";";
	//КонецЕсли;
	ТекстОписания = ТекстОписания+"
	|Звонили с :"+СокрЛП(ДокСобытие.Э_ТелефонАбонента)+";";
	//Э_Волощук)  
	
	Задача.Наименование = ТекстНаименование;
	Задача.Описание =  ТекстОписания;
	Задача.Оповещение = истина;
	Задача.СрокОповещения =  ДокСобытие.Дата;
	Задача.СрокИсполнения =  ДокСобытие.Дата;
	Задача.Записать();
КонецПроцедуры

Функция ПолучитьМассивТелефонныхНомеров(Объект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.CRM_НомерТелефона
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Объект
	               |	И КонтактнаяИнформация.Тип = &Тип";
	Запрос.УстановитьПараметр("Тип",перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Объект", Объект);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("CRM_НомерТелефона");
	
КонецФункции	

Функция Э_СписокТелефоновПользователя(Пользователь) Экспорт 
	Перем ДлинаВнутреннегоНомераТелефона,Запрос,Выборка,СписокВнутреннихТелефонов,ТекНомер;
	
	Э_НастройкиБинотел=Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
	    Э_BinotelДлинаВнутреннегоНомераТелефона = 3;
	иначе	
	    Э_BinotelДлинаВнутреннегоНомераТелефона = Э_НастройкиБинотел.Э_BinotelДлинаВнутреннегоНомераТелефона;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипКонтактнойИнформации", Перечисления.ТипыКонтактнойИнформации.Телефон);
	//Э_NCT(20.02.2019 16:38:38 www.nct.ua 
	//Запрос.УстановитьПараметр("ВидКонтактнойИнформации", Э_НастройкиБинотел.Э_BinotelВнутреннийТелефонПользователяВид);
	//Э_NCT) 
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.CRM_НомерТелефона КАК НомерТелефона
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Пользователь
	|	И КонтактнаяИнформация.Тип = &ТипКонтактнойИнформации";
	//|	И КонтактнаяИнформация.Вид = &ВидКонтактнойИнформации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокВнутреннихТелефонов=Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		ТекНомер = СокрЛП(Выборка.НомерТелефона);
		Если СтрДлина(ТекНомер) = Э_BinotelДлинаВнутреннегоНомераТелефона Тогда
			 СписокВнутреннихТелефонов.Добавить(СокрЛП(ТекНомер));
		КонецЕсли;
	КонецЦикла;;
	
	Возврат СписокВнутреннихТелефонов;
КонецФункции	
 
Функция Э_ПредставлениеРазницыВремени(ДатаВремяНачало,ДатаВремяОкончания) Экспорт
	ВремяВыполнения = ДатаВремяОкончания - ДатаВремяНачало;
	Часов = Цел(ВремяВыполнения/3600);
	Минут = Цел((ВремяВыполнения-Часов*3600)/60);
	Секунд = ВремяВыполнения - Часов*3600 - Минут*60;
	Возврат "" + ?(Часов = 0, "", Формат(Часов, "ЧЦ=2; ЧДЦ=0; ЧВН=")+ ":") + ?(Минут = 0, "00", Формат(Минут, "ЧЦ=2; ЧДЦ=0; ЧВН=")) + ":" + ?(Секунд = 0, "00", Формат(Секунд, "ЧЦ=2; ЧВН="));
КонецФункции 

Функция Э_ПолучитьДатуПоследнегоЗавершенногоЗвонка(Входящий=Ложь)
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Событие.Дата КАК Дата
	               |ИЗ
	               |	Документ.Событие КАК Событие
	               |ГДЕ
	               |	НЕ Событие.ПометкаУдаления
				   |	И Событие.ВидСобытия = &ВидСобытия
	               |	И Событие.ТипСобытия = &ТипСобытия
	               |	И Событие.Э_CallIDЗвонкаBinotel > """"
	               |	И Событие.СостояниеСобытия = &СостояниеСобытия
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";
	Запрос.УстановитьПараметр("ВидСобытия",Перечисления.ВидыСобытий.ТелефонныйЗвонок);
	Запрос.УстановитьПараметр("ТипСобытия",?(Входящий,Перечисления.ВходящееИсходящееСобытие.Входящее,Перечисления.ВходящееИсходящееСобытие.Исходящее));
	Запрос.УстановитьПараметр("СостояниеСобытия",Перечисления.СостоянияСобытий.Завершено);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		 Возврат Выборка.Дата;
	КонецЕсли;
	Возврат неопределено; 
КонецФункции

Процедура Э_ЗаполнитьКонтактыВСобытияхГдеНеЗаполненоПоНомеруТелефона(Э_НомерТелефона=Неопределено) Экспорт
	перем Э_НастройкиБинотел,Запрос,РезультатЗапроса,ПозицияНачалоНомера,НомерТелефона,ДлинаОписаниеСобытия,ТекущийСимвол;
	перем ДокОбъект,ВидОбъектаКонтактнойИнформации,СловоТелефонКратко;
	
	Э_НастройкиБинотел=Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
	     Возврат;
	КонецЕсли;
	
	СловоТелефонКратко="Тел.:";
	
	Если Э_НастройкиБинотел=Неопределено Тогда
	    Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не заполнены настройки по синхронизации с ""Бинотел""';uk='Не заповнені налаштування по синхронізації з ""Бінотел""'")); 
		Возврат;
	КонецЕсли; 
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	Событие.Ссылка,
	             |	Событие.Э_CallIDЗвонкаBinotel,
	             |	Событие.Контрагент,
	             |	Событие.КонтактноеЛицо,
	             |	Событие.Э_ТелефонАбонента КАК Э_ТелефонАбонента
	             |ИЗ
	             |	Документ.Событие КАК Событие
	             |ГДЕ
	             |	НЕ Событие.ПометкаУдаления
	             |	И ВЫБОР
	             |			КОГДА &Э_НомерТелефонаЗадан
	             |				ТОГДА Событие.Э_ТелефонАбонента = &Э_НомерТелефона
	             |			ИНАЧЕ ИСТИНА
	             |		КОНЕЦ
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Событие.Дата";
	Запрос.УстановитьПараметр("Э_НомерТелефона", Э_НомерТелефона);
	Запрос.УстановитьПараметр("Э_НомерТелефонаЗадан", ЗначениеЗаполнено(Э_НомерТелефона));
	РезультатЗапроса=Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		#Если Клиент Тогда
		ОбработкаПрерыванияПользователя();	
		#КонецЕсли			
		Если (Не ЗначениеЗаполнено(РезультатЗапроса.Контрагент) или ТипЗнч(РезультатЗапроса.Контрагент)=Тип("Строка")) и ЗначениеЗаполнено(РезультатЗапроса.Э_ТелефонАбонента) Тогда
			 #Если Клиент Тогда
			 Состояние(НСтр("ru='Обработка события:';uk='Обробка події:'")+РезультатЗапроса.Ссылка);     
			 #КонецЕсли
			 
			 НомерТелефона=СокрЛП(РезультатЗапроса.Э_ТелефонАбонента);
	  
			 Если ЗначениеЗаполнено(НомерТелефона) Тогда
				  НомерТелефона = Э_ТелефонияBinotel.Э_ПреобразоватьНомерТелефонаБезРазделителей(НомерТелефона);
				  ДокОбъект=РезультатЗапроса.Ссылка.ПолучитьОбъект();
				  ВидОбъектаКонтактнойИнформации=Неопределено;
				  Э_ЗаполнитьКонтрагентаКонтактноеЛицо(ДокОбъект,НомерТелефона,ВидОбъектаКонтактнойИнформации,Ложь);
				  Если ДокОбъект.Модифицированность() Тогда
						Попытка
							ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
						Исключение
							Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не удалось записать событие ';uk='Не вдалось записати подію '")+РезультатЗапроса.Ссылка+НСтр("ru='. Ошибка:';uk='. Помилка:'")+ОписаниеОшибки());  
						КонецПопытки;
				  КонецЕсли;	
			 КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

Процедура Э_ПриЗаписиРегистраСведенийКонтактнаяИнформацияПриЗаписи_Контрагенты(Источник, Отказ, Замещение) Экспорт
	Перем Э_НомерТелефона;
	
	Для каждого Запись Из Источник Цикл
		Если Запись.Тип<>Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Продолжить;
		КонецЕсли;	
		Э_НомерТелефона = Запись.CRM_НомерТелефона;                                                                                                
		Если (ТипЗнч(Запись.Объект)=Тип("СправочникСсылка.Контрагенты")или 
			 //Э_NCT(22.11.2018 13:16:57 www.nct.ua 
			 //ТипЗнч(Запись.Объект)=Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов")) и ЗначениеЗаполнено(Э_НомерТелефона) Тогда
			 (ВернутьЕстьСправочникКонтактныеЛицаКонтрагентов() и ТипЗнч(Запись.Объект)=Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов")) или
			 (ВернутьЕстьСправочникКонтактныеЛица() и ТипЗнч(Запись.Объект)=Тип("СправочникСсылка.КонтактныеЛица"))) и
			 ЗначениеЗаполнено(Э_НомерТелефона) Тогда
			 //Э_NCT) 
			 Э_ЗаполнитьКонтактыВСобытияхГдеНеЗаполненоПоНомеруТелефона(Э_НомерТелефона);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Функция ЗаполнитьКонтактнуюИнформацию() Экспорт
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Объект,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &Тип
	|	И ПОДСТРОКА(КонтактнаяИнформация.Представление, 1, 10) <> &ПустаяСтрока
	|	И КонтактнаяИнформация.CRM_НомерТелефона = &ПустаяСтрока";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	Запрос.Текст = ТекстЗапроса;
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		Э_ТелефонияBinotel.СообщитьИнформацию("Ошибка заполнения телефонов без разделителей: "+ОписаниеОШибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Сч=0;
	Пока Выборка.Следующий() Цикл
		Попытка
			МЗ = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Выборка);
			МЗ.Прочитать();
			Если МЗ.Выбран() Тогда
				НомерТелефона = Э_ТелефонияBinotel.Э_ПреобразоватьНомерТелефонаБезРазделителей(МЗ.Представление);
				Если ЗначениеЗаполнено(НомерТелефона) Тогда
					МЗ.CRM_НомерТелефона = НомерТелефона;
					МЗ.Записать();
					Сч = Сч + 1;
				КонецЕсли;
			КонецЕсли;
		Исключение
			Э_ТелефонияBinotel.СообщитьИнформацию("Ошибка заполнения телефонов без разделителей: "+ОписаниеОШибки());
			Возврат Неопределено;
		КонецПопытки;
	КонецЦикла;
	
	Возврат Сч;
КонецФункции

//Э_Волощук (09.11.2018 10:15:18
Процедура Пауза(Время) Экспорт

	ВремяЗавершения = ТекущаяДата() + Время;
	Пока ТекущаяДата() < ВремяЗавершения Цикл
	КонецЦикла;

КонецПроцедуры
//Э_Волощук)

//Э_NCT(22.11.2018 13:58:17 www.nct.ua 
Функция ВернутьЕстьСправочникКонтактныеЛицаКонтрагентов() Экспорт
	Возврат Метаданные.Справочники.Найти("КонтактныеЛицаКонтрагентов")<>Неопределено;
КонецФункции

Функция ВернутьЕстьСправочникКонтактныеЛица() Экспорт
	Возврат Метаданные.Справочники.Найти("КонтактныеЛица")<>Неопределено;
КонецФункции
//Э_NCT) 

//Э_Волощук (15.11.2018 15:12:18
Процедура Э_УдалитьЗаписиИзСпискаПропущенныхЕслиПерезвонили(ИсточникСсылка) 
	Перем Запрос,РезультатЗапроса,НаборЗаписей;
	
	//Э_Волощук (04.07.2019 09:49:17
	тНомерТелефона = Э_ПреобразоватьНомерТелефонаБезРазделителей(ИсточникСсылка.Э_ТелефонАбонента);
	Если тНомерТелефона="" Тогда
		Возврат;
	КонецЕсли;
	//Э_Волощук)
	
	Если ЗначениеЗаполнено(ИсточникСсылка) и Не ИсточникСсылка.ПометкаУдаления
		И Не ИсточникСсылка.Э_ПропущенныйЗвонок и Не ИсточникСсылка.Э_SMSСообщение 
		И (ИсточникСсылка.ОкончаниеСобытия - ИсточникСсылка.НачалоСобытия) > 0 Тогда
		
		//найдем пропущенные по номеру телефона события и удалим их
		Запрос = Новый Запрос;                                                            
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Э_ТелефонияПотерянныеЗвонки.НомерТелефона                            
			|ИЗ
			|	РегистрСведений.Э_ТелефонияПотерянныеЗвонки КАК Э_ТелефонияПотерянныеЗвонки
			|ГДЕ
			//Э_Волощук (04.07.2019 10:40:53
			//|	Э_ТелефонияПотерянныеЗвонки.НомерТелефона = &НомерТелефона
			|	Э_ТелефонияПотерянныеЗвонки.НомерТелефона ПОДОБНО &НомерТелефона
			//Э_Волощук)
			|	И Э_ТелефонияПотерянныеЗвонки.ВремяЗвонка < &ВремяЗвонка";
		
		Запрос.УстановитьПараметр("ВремяЗвонка", ИсточникСсылка.НачалоСобытия);
		//Э_Волощук (04.07.2019 10:41:41
		//Запрос.УстановитьПараметр("НомерТелефона", ИсточникСсылка.Э_ТелефонАбонента);
		Запрос.УстановитьПараметр("НомерТелефона", "%"+тНомерТелефона);
		//Э_Волощук)
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			НаборЗаписей = РегистрыСведений.Э_ТелефонияПотерянныеЗвонки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.НомерТелефона.Установить(ИсточникСсылка.Э_ТелефонАбонента);
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//Э_Волощук)

//Э_Волощук (10.12.2018 16:20:59
Процедура Э_ПрослушатьЗаписьРазговора(СсылкаНаЗапись) Экспорт 
	Если ЗначениеЗаполнено(СсылкаНаЗапись) Тогда
		Э_НастройкиБинотел = Э_ПолучитьНастройкиБинотел();
		Если Э_НастройкиБинотел = Неопределено Тогда
		     Возврат;
		КонецЕсли;
		Э_ПутьКПрограммеВоспроизведенияЗвука = СокрЛП(Э_НастройкиБинотел.Э_ПутьКПрограммеВоспроизведенияЗвука);
		ЗапуститьПриложение(?(ЗначениеЗаполнено(Э_ПутьКПрограммеВоспроизведенияЗвука),Э_ПутьКПрограммеВоспроизведенияЗвука+" ","")+СсылкаНаЗапись);
	Иначе
		Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='Не удалось воспроизвести запись.',uk='Не вдалося выдтворити запис.'"));
	КонецЕсли;
КонецПроцедуры
//Э_Волощук)

//Э_Волощук (14.01.2019 15:04:12
Функция ДоступностьКнопкиПрослушиванияСохраненияЗаписиЗвонка(СтрокаИзСпискаСобытий = Неопределено, СсылкаСобытие = Неопределено) Экспорт
	
	ТекПользователь = ОбщегоНазначения.ПолучитьЗначениеПеременной("глТекущийПользователь");
	
	Доступность = Ложь;
	ЕстьСсылкаНаЗапись = Ложь;
	
	//Определим есть ли ссылка на запись
	Если СтрокаИзСпискаСобытий <> Неопределено 
		И ТипЗнч(СтрокаИзСпискаСобытий.Ссылка) = Тип("ДокументСсылка.Событие") 
		И ЗначениеЗаполнено(СтрокаИзСпискаСобытий.Ссылка.Э_CallIDЗвонкаBinotel) Тогда
				
		ЕстьСсылкаНаЗапись = Истина;
	ИначеЕсли СсылкаСобытие <> Неопределено 
		И ТипЗнч(СсылкаСобытие) = Тип("ДокументСсылка.Событие") 
		И ЗначениеЗаполнено(СсылкаСобытие.Э_CallIDЗвонкаBinotel) Тогда
		
		ЕстьСсылкаНаЗапись = Истина;
	КонецЕсли;	
	
	Если ЕстьСсылкаНаЗапись
		И (РольДоступна("ПолныеПрава") Или РольДоступна("Э_BinotelПрослушиватьЗаписиЧужихЗвонков")) Тогда
		Доступность = Истина;
	ИначеЕсли СтрокаИзСпискаСобытий <> Неопределено 
		И ТипЗнч(СтрокаИзСпискаСобытий.Ссылка) = Тип("ДокументСсылка.Событие") 
		И ТекПользователь = СтрокаИзСпискаСобытий.Ссылка.Ответственный
		И ЕстьСсылкаНаЗапись Тогда
		
		Доступность = Истина;
	ИначеЕсли СсылкаСобытие <> Неопределено 
		И ТипЗнч(СсылкаСобытие) = Тип("ДокументСсылка.Событие") 
		И ТекПользователь = СсылкаСобытие.Ответственный 
		И ЕстьСсылкаНаЗапись Тогда
		
		Доступность = Истина;
	КонецЕсли;	
	
	Возврат Доступность;
КонецФункции
//Э_Волощук)

//Э_Волощук (22.03.2019 15:27:26
Процедура Э_ОбработкаЗаполненияЗаказПокупателяОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	Если ДанныеЗаполнения<>Неопределено и ТипЗнч(ДанныеЗаполнения)=Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Э_Лид") и Не ЗначениеЗаполнено(Источник.Э_Лид) Тогда
		     Источник.Э_Лид = ДанныеЗаполнения.Э_Лид;
		КонецЕсли;	 
		
		Если ДанныеЗаполнения.Свойство("Контрагент") и  Не ЗначениеЗаполнено(Источник.Контрагент) Тогда
		     Источник.Контрагент = ДанныеЗаполнения.Контрагент;            
		КонецЕсли;
		 
		Если ДанныеЗаполнения.Свойство("КонтактноеЛицо")
			И ТипЗнч(ДанныеЗаполнения.КонтактноеЛицо) = Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов")
			И  Не ЗначениеЗаполнено(Источник.КонтактноеЛицоКонтрагента) Тогда
		     Источник.КонтактноеЛицоКонтрагента = ДанныеЗаполнения.КонтактноеЛицо;            
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//Э_Волощук)

//Э_Волощук (25.03.2019 15:58:49
Процедура Э_АвтоматическиЗакрытьЗадачиПоПропущеннымЗвонкам(ИсточникСсылка)
	Э_НастройкиБинотел=Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено И Не Э_НастройкиБинотел.Э_АвтоматическиЗакрыватьЗадачиПоПропущеннымЗвонкам Тогда
	     Возврат;
	КонецЕсли;
	 
	Если ЗначениеЗаполнено(ИсточникСсылка) и Не ИсточникСсылка.ПометкаУдаления
		И Не ИсточникСсылка.Э_ПропущенныйЗвонок и Не ИсточникСсылка.Э_SMSСообщение 
		И (ИсточникСсылка.ОкончаниеСобытия - ИсточникСсылка.НачалоСобытия) > 0 Тогда
		
		//найдем документы события по которым создали напоминания
		Запрос = Новый Запрос;                                                            
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Событие.Ссылка,
			|	Событие.ОписаниеСобытия
			|ПОМЕСТИТЬ ВТ_СобытияДляПоискаЗадач
			|ИЗ
			|	Документ.Событие КАК Событие
			|ГДЕ
			|	Событие.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ВходящееИсходящееСобытие.Входящее)
			|	И Событие.Э_ПропущенныйЗвонок
			|	И Событие.НачалоСобытия < &ДатаЗвонка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадачиПользователя.Ссылка КАК Задача
			|ИЗ
			|	ВТ_СобытияДляПоискаЗадач КАК ВТ_СобытияДляПоискаЗадач
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.ЗадачиПользователя КАК ЗадачиПользователя
			|		ПО ВТ_СобытияДляПоискаЗадач.Ссылка = ЗадачиПользователя.Объект
			|ГДЕ
			|	Описание ПОДОБНО &ТекстВОписании
			|	И Не Выполнена";
		
		//Э_NCT(24.05.2019 11:10:16 www.nct.ua 
		//ТекстВОписании = "Звонили с :"+СокрЛП(ИсточникСсылка.Э_Лид.НомерТелефона)+";";
		ТекстВОписании = "Звонили с :"+СокрЛП(ИсточникСсылка.Э_ТелефонАбонента)+";";
		//Э_NCT) 
		Запрос.УстановитьПараметр("ДатаЗвонка", ИсточникСсылка.НачалоСобытия);
		Запрос.УстановитьПараметр("ТекстВОписании", "%"+ТекстВОписании+"%");
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Попытка
					ЗадачаОб = ВыборкаДетальныеЗаписи.Задача.ПолучитьОбъект();
					ЗадачаОб.Выполнена = Истина;
					ЗадачаОб.Записать();
				Исключение
					СообщениеОбОшибке="Ошибка: "+ ОписаниеОшибки();	
					ЗаписьЖурналаРегистрации("Виртуальная АТС", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке );
					#Если Клиент Тогда
					СообщитьИнформацию(СообщениеОбОшибке);	
					#КонецЕсли
				КонецПопытки;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//Э_Волощук)

//Э_Волощук (23.07.2019 17:00:32
Функция Э_ОпределитьВнутреннийНомерТелефона(ПараметрыЗвонка, Э_НастройкиБинотел)
	ВнутреннийНомерТелефона = "";
	
	Если ПараметрыЗвонка.callType="0" Тогда // входящий
		ВнутреннийНомерТелефона = ПараметрыЗвонка.dstNumbers[0].dstNumber;
		Если Найти(ВнутреннийНомерТелефона, ">") > 0 Тогда
			ВнутреннийНомерТелефона = Прав(ВнутреннийНомерТелефона, Э_НастройкиБинотел.Э_BinotelДлинаВнутреннегоНомераТелефона);
		ИначеЕсли Не ЗначениеЗаполнено(ВнутреннийНомерТелефона) Тогда
			ВнутреннийНомерТелефона = СокрЛП(ПараметрыЗвонка.did);
		КонецЕсли;
	ИначеЕсли ПараметрыЗвонка.callType="1" Тогда // исходящий
		ВнутреннийНомерТелефона = ПараметрыЗвонка.srcNumber;
	КонецЕсли;
	
	Возврат ВнутреннийНомерТелефона;
КонецФункции
//Э_Волощук)

//Э_Волощук (30.07.2019 23:06:14
Функция Э_ВернутьНазваниеФормыСпискаОбъектаЗаказПокупателя() Экспорт
	Если Метаданные.Документы.Найти("ЗаказКлиента")<>Неопределено Тогда
		Если Метаданные.Документы.ЗаказКлиента.Формы.Найти("Э_ФормаСпискаДокументов")<>Неопределено Тогда
			Возврат "Э_ФормаСпискаДокументов";
		КонецЕсли;
	иначеЕсли Метаданные.Документы.Найти("ЗаказПокупателя")<>Неопределено Тогда
		Если Метаданные.Документы.ЗаказПокупателя.Формы.Найти("Э_ФормаСпискаДокументов")<>Неопределено Тогда
			Возврат "Э_ФормаСпискаДокументов";
		КонецЕсли;
	иначеЕсли Метаданные.Документы.Найти("CRM_Сделка")<>Неопределено Тогда
		Если Метаданные.Документы.CRM_Сделка.Формы.Найти("Э_ФормаСпискаДокументов")<>Неопределено Тогда
			Возврат "Э_ФормаСпискаДокументов";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции
//Э_Волощук)

//Э_Волощук (30.07.2019 23:06:14
Функция Э_ВернутьНазваниеДокументаЗаказа() Экспорт
	Если Метаданные.Документы.Найти("ЗаказКлиента")<>Неопределено Тогда
		Возврат "ЗаказКлиента";
	иначеЕсли Метаданные.Документы.Найти("ЗаказПокупателя")<>Неопределено Тогда
		Возврат "ЗаказПокупателя";
	иначеЕсли Метаданные.Документы.Найти("CRM_Сделка")<>Неопределено Тогда
		Возврат "CRM_Сделка";
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции
//Э_Волощук)

//Э_Волощук (27.09.2019 14:44:57
//Функция Э_СуществуетПредЗаказ(Контрагент, Э_Лид) Экспорт
//	Э_Настройки = Э_ПолучитьНастройкиБинотел();
//	КолДнейПредЗаказов = 0;
//	Если Э_Настройки <> Неопределено Тогда
//		КолДнейПредЗаказов = Э_Настройки.Э_КоличествоДнейОтПоследнегоПредЗаказаДляСозданияНового;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()) - КолДнейПредЗаказов*86400);
//	Если ЗначениеЗаполнено(Контрагент) Тогда
//		Запрос.Текст = "ВЫБРАТЬ
//						|	ПредЗаказ.Ссылка
//						|ИЗ
//						|	Документ.ПредЗаказ КАК ПредЗаказ
//						|ГДЕ
//						|	ПредЗаказ.ПометкаУдаления = Ложь
//						|	И ПредЗаказ.Контрагент = &Контрагент	
//						|	И ПредЗаказ.Дата >= &Дата";
//		Запрос.УстановитьПараметр("Контрагент", Контрагент);
//	Иначе
//		Запрос.Текст = "ВЫБРАТЬ
//						|	ПредЗаказ.Ссылка
//						|ИЗ
//						|	Документ.ПредЗаказ КАК ПредЗаказ
//						|ГДЕ
//						|	ПредЗаказ.ПометкаУдаления = Ложь
//						|	И ПредЗаказ.Э_Лид = &Э_Лид	
//						|	И ПредЗаказ.Дата >= &Дата";
//		Запрос.УстановитьПараметр("Э_Лид", Э_Лид);
//	КонецЕсли;
//	
//	Результат = Запрос.Выполнить();
//	
//	Если Результат.Пустой() Тогда
//		Возврат Ложь;
//	Иначе
//		Возврат Истина;
//	КонецЕсли;
//КонецФункции
////Э_Волощук)
