
Процедура БП_ПроверкаНа28СчетОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Отказ тогда
		Возврат;
	КонецЕсли; 
	
	ДатаЗапретаСчета28 = ПараметрыСеанса.БП_НастройкиУчета.ДатаЗапрета28Счета;
	
	Если Не ЗначениеЗаполнено(ДатаЗапретаСчета28) тогда
		Возврат;
	КонецЕсли;

	ДвиженияХР = Источник.Движения.Найти("Хозрасчетный"); 
	
	Если ДвиженияХР = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Если ДвиженияХР.Количество() = 0 тогда
		Возврат;
	КонецЕсли;

	Для каждого Проводка из ДвиженияХР цикл
		Если (Проводка.СчетКт.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.Товары) ИЛИ Проводка.СчетДт.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.Товары)) И Проводка.Период < КонецДня(ДатаЗапретаСчета28) тогда
			Отказ = Истина;
			Сообщить("Документ формує рухи по 28 рахунку для якого встановленна дата заборони ("+Формат(ДатаЗапретаСчета28,"ДФ=dd.MM.yyyy")+")!");
			Возврат;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Процедура БП_ОбработкаПроведенияВзаиморасчетовСКонтрагентамиБУОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Отказ тогда
		Возврат;
	КонецЕсли; 
	
	Если Не Источник.ОтражатьВБухгалтерскомУчете тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВР = Источник.Движения.Найти("ВзаиморасчетыСКонтрагентами");	
	
	Если ДвиженияВР = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияВР_БУ = Источник.Движения.БП_ВзаиморасчетыСКонтрагентамиБУ;
	
	Движения=РегистрыНакопления.БП_ВзаиморасчетыСКонтрагентамиБУ.СоздатьНаборЗаписей();
	
	Движения.Отбор.Регистратор.Установить(Источник.Ссылка);
	
	Для каждого Проводка из ДвиженияВР цикл
		СтрокаДвижениеВР_БУ=Движения.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаДвижениеВР_БУ,Проводка);
		СтрокаДвижениеВР_БУ.СуммаБУ = Проводка.СуммаВзаиморасчетов;
	КонецЦикла;		
	Движения.Записать();  
	
КонецПроцедуры

Процедура БП_ОбработкаУдаленияПроведенияРеализацияТоваровУслугОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если Отказ тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПереоценкаЗапасов_СД.Ссылка
	|ИЗ
	|	Документ.ПереоценкаЗапасов_СД КАК ПереоценкаЗапасов_СД
	|ГДЕ
	|	ПереоценкаЗапасов_СД.БП_Основание = &БП_Основание
	|	И НЕ ПереоценкаЗапасов_СД.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("БП_Основание",Источник.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		Попытка
			ДокПереоценка = Выборка.Ссылка.ПолучитьОбъект();
			ДокПереоценка.ПометкаУдаления = Истина; 
			ДокПереоценка.Комментарий = "#Відмінений автоматично! " + ДокПереоценка.Комментарий;
			ДокПереоценка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Исключение
			
		КонецПопытки;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура БП_ПриЗаписиДокументаХронологияПерепроведенияПриЗаписи(Источник, Отказ) Экспорт
	//+БП: d.matyash (09.11.2025) <> 
	
	УстановитьПривилегированныйРежим(Истина);
	Если Отказ тогда 
		Возврат;
	КонецЕсли;  
			
	ДокументРеализацияТоваровУслуг = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") тогда 
		Если НЕ Источник.ОтражатьВУправленческомУчете ИЛИ НЕ Источник.Проведен тогда
			Возврат;
		КонецЕсли;

		ДокументРеализацияТоваровУслуг = Источник.Ссылка;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя") тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	РеализацияТоваровУслуг.Ссылка
		                      |ИЗ
		                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		                      |ГДЕ
		                      |	РеализацияТоваровУслуг.Проведен
		                      |	И РеализацияТоваровУслуг.Сделка = &ДокументОснование
		                      |	И РеализацияТоваровУслуг.ОтражатьВУправленческомУчете");
		
		Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка); 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() цикл
			ДокументРеализацияТоваровУслуг = Выборка.Ссылка;	
		КонецЦикла;	
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПоставщику") тогда  
		
		Если НЕ ЗначениеЗаполнено(Источник.ДокументОснование) ИЛИ Источник.БП_ВидЗаказаПоставщику = Перечисления.БП_ВидЗаказаПоставщику.Бухгалтер тогда
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	РеализацияТоваровУслуг.Ссылка
		                      |ИЗ
		                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		                      |ГДЕ
		                      |	РеализацияТоваровУслуг.Проведен
		                      |	И РеализацияТоваровУслуг.ОтражатьВУправленческомУчете
		                      |	И РеализацияТоваровУслуг.Сделка = &ДокументОснование");
		
		Запрос.УстановитьПараметр("ДокументОснование", Источник.ДокументОснование); 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() цикл
			ДокументРеализацияТоваровУслуг = Выборка.Ссылка;	
		КонецЦикла;	
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") тогда  
		
		Если НЕ ЗначениеЗаполнено(Источник.Сделка) тогда
			Возврат;
		иначе
			Если НЕ ЗначениеЗаполнено(Источник.Сделка.ДокументОснование) тогда
				Возврат;
			КонецЕсли;			
		КонецЕсли;  
		
		Если НЕ Источник.ОтражатьВУправленческомУчете тогда
			Возврат;
		КонецЕсли;


		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	РеализацияТоваровУслуг.Ссылка
		                      |ИЗ
		                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		                      |ГДЕ
		                      |	РеализацияТоваровУслуг.Проведен
		                      |	И РеализацияТоваровУслуг.ОтражатьВУправленческомУчете
		                      |	И РеализацияТоваровУслуг.Сделка = &ДокументОснование");
		
		Запрос.УстановитьПараметр("ДокументОснование", Источник.Сделка.ДокументОснование); 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() цикл
			ДокументРеализацияТоваровУслуг = Выборка.Ссылка;	
		КонецЦикла;  
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПеремещениеТоваров") тогда  
		
		Если НЕ ЗначениеЗаполнено(Источник.ВнутреннийЗаказ) ИЛИ НЕ Источник.ОтражатьВУправленческомУчете тогда
			Возврат;
		КонецЕсли; 

		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	РеализацияТоваровУслуг.Ссылка
		                      |ИЗ
		                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		                      |ГДЕ
		                      |	РеализацияТоваровУслуг.Проведен
		                      |	И РеализацияТоваровУслуг.ОтражатьВУправленческомУчете
		                      |	И РеализацияТоваровУслуг.Сделка = &ДокументОснование");
		
		Запрос.УстановитьПараметр("ДокументОснование", Источник.ВнутреннийЗаказ); 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() цикл
			ДокументРеализацияТоваровУслуг = Выборка.Ссылка;	
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДокументРеализацияТоваровУслуг = Документы.РеализацияТоваровУслуг.ПустаяСсылка() ИЛИ НЕ ДокументРеализацияТоваровУслуг.ОтражатьВУправленческомУчете тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументРеализацияТоваровУслуг.Услуги.Количество() тогда
		Возврат;
	КонецЕсли;
	
	
	МенеджерЗаписи = РегистрыСведений.БП_ДокументыДляПерепроведения.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Документ = ДокументРеализацияТоваровУслуг;
	
	МенеджерЗаписи.Записать();
	
	//Сообщить(Строка(ДокументРеализацияТоваровУслуг));
	//-БП: d.matyash (09.11.2025) <>
КонецПроцедуры





