Перем мИтоговаяТаблица Экспорт;

Перем мВалютаРегламентированногоУчета Экспорт;

Перем ДопустимыеТипыДокументов Экспорт;

Перем СписокСформированныхДокументов Экспорт;

// при вызове обработки при вводе НН на основании, когда форма 
// обработки открываться не будет сформированные НН не будут записываться в базу.
Перем мНеЗаписыватьДокументы Экспорт;

Процедура ОбновитьДоговора(ПараметрОтборДоговоровКонтрагентов = Неопределено) Экспорт
	
	Если РежимПоДатам Тогда
	
		ОбновитьДоговораПоДатам(ПараметрОтборДоговоровКонтрагентов);
		
	Иначе	
		
		// установим в таблицах  дату равной дате заполнения
		СписокТаблиц = Новый Массив();
		СписокТаблиц.Добавить("Договора");
		СписокТаблиц.Добавить("ИсточникиНоменклатуры");
		СписокТаблиц.Добавить("Товары");
		СписокТаблиц.Добавить("ВозвратнаяТара");
		СписокТаблиц.Добавить("Услуги");
		СписокТаблиц.Добавить("Прочее");
			
		МассивДляЗаполненияДаты = Новый Массив();
			
		Для каждого Таблица Из СписокТаблиц Цикл
			
			ТЧ = ЭтотОбъект[Таблица];
				
			Для Инд = МассивДляЗаполненияДаты.Количество() + 1 По ТЧ.Количество() Цикл
				//Добавим в массив элементы, если его размерность меньше количества строк в таблице
				МассивДляЗаполненияДаты.Добавить(Дата);
			КонецЦикла; 
				
			ТЧ.ЗагрузитьКолонку(МассивДляЗаполненияДаты, "Дата");
			
		КонецЦикла;
		
		ОбновитьДоговораНаДату(ПараметрОтборДоговоровКонтрагентов);
	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбновитьДоговораНаДату(ПараметрОтборДоговоровКонтрагентов)

	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("ПустаяСтавкаНДС",Перечисления.СтавкиНДС.ПустаяСсылка());
	Запрос.УстановитьПараметр("Отгрузка", 		Перечисления.РасчетыВозврат.Расчеты);
	Запрос.УстановитьПараметр("Возврат", 		Перечисления.РасчетыВозврат.Возврат);
	
	СобытияНДСПродажОтгрузка = Новый СписокЗначений();
	СобытияНДСПродажОтгрузка.Добавить(Перечисления.СобытияНДСПродаж.РеализацияПокупателю);
	СобытияНДСПродажОтгрузка.Добавить(Перечисления.СобытияНДСПродаж.ОплатаПокупателем);
	Запрос.УстановитьПараметр("СобытияНДСПродажОтгрузка", СобытияНДСПродажОтгрузка);
	
	СобытияНДСПриобретенийВозврат = Новый СписокЗначений();
	СобытияНДСПриобретенийВозврат.Добавить(Перечисления.СобытияНДСПродаж.ВозвратОплатыПокупателю);
	СобытияНДСПриобретенийВозврат.Добавить(Перечисления.СобытияНДСПродаж.ВозвратОтПокупателя);
	Запрос.УстановитьПараметр("СобытияНДСПродажВозврат", СобытияНДСПриобретенийВозврат);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ДополнительныеУсловия = "";
	Если Не ПараметрОтборДоговоровКонтрагентов = Неопределено Тогда
		
		ДополнительныеУсловия =  ДополнительныеУсловия + " И ДоговорКонтрагента В (&ДоговораКонтрагентов) ";
		Запрос.УстановитьПараметр("ДоговораКонтрагентов", ПараметрОтборДоговоровКонтрагентов.ВыгрузитьКолонку("ДоговорКонтрагента"));
		
	Иначе
		
		ОтборДоговоров = ОтборДоговоровКонтрагентов.Выгрузить();
		ОтборДоговоров.Свернуть("ДоговорКонтрагента", "");
		СтрокаСПустымДоговором = ОтборДоговоров.Найти(Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
		Если НЕ СтрокаСПустымДоговором = Неопределено Тогда 
			ОтборДоговоров.Удалить(СтрокаСПустымДоговором);	
		КонецЕсли;
		
		// если остались строки, значит устанавливаем фильтр по договорам,
		// иначе - по контрагентам
		Если ОтборДоговоров.Количество() > 0 Тогда
			
			ДополнительныеУсловия =  ДополнительныеУсловия + " И ДоговорКонтрагента В (&ДоговораКонтрагентов) ";
			Запрос.УстановитьПараметр("ДоговораКонтрагентов", ОтборДоговоров);
			
		Иначе 
			
			ОтборКонтрагентов = ОтборДоговоровКонтрагентов.Выгрузить();
			ОтборКонтрагентов.Свернуть("Контрагент", "");
			Если ОтборКонтрагентов.Количество() > 0 Тогда
				ДополнительныеУсловия =  ДополнительныеУсловия + " И ДоговорКонтрагента.Владелец В ИЕРАРХИИ(&Контрагенты) ";
				Запрос.УстановитьПараметр("Контрагенты", ОтборКонтрагентов);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;		
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Запрос.УстановитьПараметр("МоментВремени", 	'000101010000');
	Иначе		
		Запрос.УстановитьПараметр("МоментВремени", 	Новый Граница(Дата, ВидГраницы.Включая));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	ТекстЗапросаРасчеты=
				  "	&Дата КАК Дата,
	               |	&Отгрузка КАК РасчетыВозврат,
	               |	НДСПродажОстатки.ДоговорКонтрагента.Владелец КАК Контрагент,
	               |	НДСПродажОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ВЫБОР КОГДА НДСПродажОстатки.ВозвратнаяТара = Истина ТОГДА НДСПродажОстатки.ДоговорКонтрагента.СхемаНалоговогоУчетаПоТаре.МоментОпределенияБазыНДСПоПродажам ИНАЧЕ НДСПродажОстатки.ДоговорКонтрагента.СхемаНалоговогоУчета.МоментОпределенияБазыНДСПоПродажам КОНЕЦ КАК Схема,
	               |	НДСПродажОстатки.СтавкаНДС КАК СтавкаНДС,
	               |	НДСПродажОстатки.ВозвратнаяТара КАК ЗаТару,
	               |	ВЫБОР
	               |		КОГДА НДСПродажОстатки.СтавкаНДС = &ПустаяСтавкаНДС
	               |			ТОГДА 0
	               |		ИНАЧЕ НДСПродажОстатки.СуммаВзаиморасчетовРеглОстаток
	               |	КОНЕЦ КАК СуммаОтгрузки,
	               |	ВЫБОР
	               |		КОГДА НДСПродажОстатки.СтавкаНДС = &ПустаяСтавкаНДС
	               |			ТОГДА 0
	               |		ИНАЧЕ НДСПродажОстатки.НДСОстаток
	               |	КОНЕЦ КАК СуммаНДСОтгрузки,
	               |	ВЫБОР
	               |		КОГДА НДСПродажОстатки.СтавкаНДС = &ПустаяСтавкаНДС
	               |			ТОГДА НДСПродажОстатки.СуммаВзаиморасчетовРеглОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаОплаты
	               |ИЗ
	               |	РегистрНакопления.НДСПродаж.Остатки(&МоментВремени, Организация = &Организация И СобытиеНДС В (&СобытияНДСПродажОтгрузка) " + ДополнительныеУсловия + ") КАК НДСПродажОстатки
	               |";
	 ТекстЗапросаВозврат=
				  "	&Дата КАК Дата,
	               |	&Возврат КАК РасчетыВозврат,
	               |	НДСПродажОстатки.ДоговорКонтрагента.Владелец КАК Контрагент,
	               |	НДСПродажОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ВЫБОР КОГДА НДСПродажОстатки.ВозвратнаяТара = Истина ТОГДА НДСПродажОстатки.ДоговорКонтрагента.СхемаНалоговогоУчетаПоТаре.МоментОпределенияБазыНДСПоПродажам ИНАЧЕ НДСПродажОстатки.ДоговорКонтрагента.СхемаНалоговогоУчета.МоментОпределенияБазыНДСПоПродажам КОНЕЦ КАК Схема,
	               |	НДСПродажОстатки.СтавкаНДС КАК СтавкаНДС,
	               |	НДСПродажОстатки.ВозвратнаяТара КАК ЗаТару,
	               |	ВЫБОР
	               |		КОГДА НДСПродажОстатки.СтавкаНДС = &ПустаяСтавкаНДС
	               |			ТОГДА 0
	               |		ИНАЧЕ НДСПродажОстатки.СуммаВзаиморасчетовРеглОстаток
	               |	КОНЕЦ  СуммаОтгрузки,
	               |	ВЫБОР
	               |		КОГДА НДСПродажОстатки.СтавкаНДС = &ПустаяСтавкаНДС
	               |			ТОГДА 0
	               |		ИНАЧЕ НДСПродажОстатки.НДСОстаток
	               |	КОНЕЦ КАК СуммаНДСОтгрузки,
	               |	ВЫБОР
	               |		КОГДА НДСПродажОстатки.СтавкаНДС = &ПустаяСтавкаНДС
	               |			ТОГДА НДСПродажОстатки.СуммаВзаиморасчетовРеглОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаОплаты
	               |ИЗ
	               |	РегистрНакопления.НДСПродаж.Остатки(&МоментВремени, Организация = &Организация И СобытиеНДС В (&СобытияНДСПродажВозврат) " + ДополнительныеУсловия + ") КАК НДСПродажОстатки
				   |";
	
	Если  НЕ ЗначениеЗаполнено(РасчетыВозврат) = Ложь
		И ПараметрОтборДоговоровКонтрагентов = Неопределено Тогда
		
		Если РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
							|" +ТекстЗапросаРасчеты;	
		Иначе
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
							|" +ТекстЗапросаВозврат;	
		КонецЕсли; 
		
	Иначе
		Запрос.Текст = 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|" + ТекстЗапросаРасчеты + "
						| ОБЪЕДИНИТЬ ВСЕ
						|
						|ВЫБРАТЬ
						|" + ТекстЗапросаВозврат;
	КонецЕсли;
					
	Запрос.Текст = Запрос.Текст + 
				   "ИТОГИ
				   |	МАКСИМУМ(Схема),
				   |	СУММА(СуммаОтгрузки),
				   |	СУММА(СуммаНДСОтгрузки),
				   |	СУММА(СуммаОплаты)
				   |ПО
				   |	Контрагент,
				   |	РасчетыВозврат,
				   |	ЗаТару,
				   |	ДоговорКонтрагента";

	
	
	Договора.Очистить();

	Выборка1 = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка1.Следующий() Цикл // Контрагент
		Выборка2 = Выборка1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка2.Следующий() Цикл //РасчетыВозврат
			Выборка3 = Выборка2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка3.Следующий() Цикл //ЗаТару
				// последний уровень итогов
				ВыборкаДоговора = Выборка3.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДоговора.Следующий() Цикл  //ДоговорКонтрагента
					
					Если ВыборкаДоговора.Схема = Перечисления.МоментыОпределенияНалоговойБазы.НеОпределять Тогда
						
						// ничего не делаем
						Продолжить;
						
					ИначеЕсли ВыборкаДоговора.Схема = Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате Тогда
						
						Если ВыборкаДоговора.СуммаОплаты < 0 Тогда
							// налоговых выписано уже больше чем нужно
							Продолжить;
						КонецЕсли;
						
						ДобавитьСтрокуВДоговора(ВыборкаДоговора);
						
					ИначеЕсли ВыборкаДоговора.Схема = Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке Тогда
						// в расчет берем только отгрузки (по ставкам НДС)
						ВыборкаСтавка = ВыборкаДоговора.Выбрать();
						Пока ВыборкаСтавка.Следующий() Цикл
							Если ВыборкаСтавка.СуммаОтгрузки > 0 Тогда
								ДобавитьСтрокуВДоговора(ВыборкаСтавка);
							КонецЕсли;
						КонецЦикла;
						
					ИначеЕсли ВыборкаДоговора.Схема = Перечисления.МоментыОпределенияНалоговойБазы.ПоПервомуСобытию Тогда
						
						СуммаНеподтверденнойПредоплаты = ВыборкаДоговора.СуммаОплаты;
						
						// по ставкам НДС
						ВыборкаСтавка = ВыборкаДоговора.Выбрать();
						Пока ВыборкаСтавка.Следующий() Цикл
							Если ВыборкаСтавка.СуммаОтгрузки > 0 Тогда
								ДобавитьСтрокуВДоговора(ВыборкаСтавка);
								СуммаНеподтверденнойПредоплаты = СуммаНеподтверденнойПредоплаты - ВыборкаСтавка.СуммаОтгрузки 
							КонецЕсли;
						КонецЦикла;
						
						// дополнительно имеется неподтверженная НД предоплата
						Если СуммаНеподтверденнойПредоплаты > 0 Тогда
							ДобавитьСтрокуВДоговора(ВыборкаДоговора, СуммаНеподтверденнойПредоплаты);
						КонецЕсли;
						
					Иначе
						
						ТекстСообщения = 
								  "Контрагент: " + ВыборкаДоговора.Контрагент
								  +", Договор: " + ВыборкаДоговора.ДоговорКонтрагента
								  + Символы.ПС
								  +	"Не указана схема налогового учета" 
								  + ?(ВыборкаДоговора.ЗаТару, " по таре", "")  
								  + ", либо в схеме не указан Момент определения базы НДС по продажам!"; 
						
						Сообщить(ТекстСообщения, СтатусСообщения.Важное);

					КонецЕсли;
				КонецЦикла; 	
				
			КонецЦикла; 	
		КонецЦикла; 	
	КонецЦикла; 	
	
	// Добавим в Договора строки, по которым нет остатков
	// в случае, если данная процедура вызвана в режиме обновления таблицы договоров (заполнен параметр ПараметрОтборДоговоровКонтрагентов)
	// И удалим  лишние (в запросе фильтр по Ресчету/Возврату не накладывался)
	Если Не ПараметрОтборДоговоровКонтрагентов = Неопределено Тогда
		
		// Добавляем новые
		СтруктураПоиска = Новый Структура("ДоговорКонтрагента, РасчетыВозврат");
		Для каждого СтрокаТаблицыДокументов Из ПараметрОтборДоговоровКонтрагентов Цикл
			
			СтруктураПоиска.ДоговорКонтрагента  = СтрокаТаблицыДокументов.ДоговорКонтрагента;		
			СтруктураПоиска.РасчетыВозврат 		= СтрокаТаблицыДокументов.РасчетыВозврат;		
			
			Если Договора.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
				СтрокаДоговоров = Договора.Добавить();
				СтрокаДоговоров.Дата = Дата;		
				СтрокаДоговоров.ДоговорКонтрагента  = СтрокаТаблицыДокументов.ДоговорКонтрагента;		
				СтрокаДоговоров.РасчетыВозврат 		= СтрокаТаблицыДокументов.РасчетыВозврат;		
			КонецЕсли;
			
		КонецЦикла; 
		
		// Удаляем Лишние
		СтруктураПоиска = Новый Структура();
		Сч = 0;
		Пока Сч <= Договора.Количество() - 1 Цикл
			
			СтрокаДоговоров = Договора.Получить(Сч);
			СтруктураПоиска.Вставить("ДоговорКонтрагента",	СтрокаДоговоров.ДоговорКонтрагента);		
			СтруктураПоиска.Вставить("РасчетыВозврат",		СтрокаДоговоров.РасчетыВозврат);		
			
			Если ПараметрОтборДоговоровКонтрагентов.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
				Договора.Удалить(СтрокаДоговоров);
			Иначе
				Сч = Сч + 1
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	// добавим строки-ссылки на номенклатуру, добавляемую пользователем.
	ДоговораКопия = Договора.Выгрузить();
	ДоговораКопия.Свернуть("ДоговорКонтрагента","");
	
	СтруктураПоиска = Новый Структура("ДоговорКонтрагента, РасчетыВозврат, Документ");
	// если "возврат" (формируем Приложения 2) - необходимо всегда указывать документ-основание: налоговую накладную - основание!
	СтруктураПоиска.РасчетыВозврат 	= Перечисления.РасчетыВозврат.Расчеты;
	СтруктураПоиска.Документ 		= Неопределено;
	Для каждого СтрокаДоговоров Из ДоговораКопия Цикл
		
		СтруктураПоиска.ДоговорКонтрагента 	= СтрокаДоговоров.ДоговорКонтрагента;
		СтрокиИсточниковНоменклатуры = ИсточникиНоменклатуры.НайтиСтроки(СтруктураПоиска);
		Если СтрокиИсточниковНоменклатуры.Количество() = 0 Тогда
			СтрокаИсточниковНоменклатуры = ИсточникиНоменклатуры.Добавить();
			СтрокаИсточниковНоменклатуры.Дата 					= Дата;		
			СтрокаИсточниковНоменклатуры.ДоговорКонтрагента 	= СтруктураПоиска.ДоговорКонтрагента;
			СтрокаИсточниковНоменклатуры.РасчетыВозврат 		= СтруктураПоиска.РасчетыВозврат;
			СтрокаИсточниковНоменклатуры.Документ	 	 		= Неопределено;	
		КонецЕсли;
	
	КонецЦикла;
КонецПроцедуры

Процедура ОбновитьДоговораПоДатам(ПараметрОтборДоговоровКонтрагентов)
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("ПоОтгрузке", 			Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке);
	Запрос.УстановитьПараметр("ПоОплате",				Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате);
	Запрос.УстановитьПараметр("ПоПервомуСобытию",		Перечисления.МоментыОпределенияНалоговойБазы.ПоПервомуСобытию);

	Запрос.УстановитьПараметр("Отгрузка", 		Перечисления.РасчетыВозврат.Расчеты);
	Запрос.УстановитьПараметр("Возврат", 		Перечисления.РасчетыВозврат.Возврат);
	
	МассивСобытияРасчет = Новый Массив();
	МассивСобытияРасчет.Добавить(Перечисления.СобытияНДСПродаж.ОплатаПокупателем);
	МассивСобытияРасчет.Добавить(Перечисления.СобытияНДСПродаж.РеализацияПокупателю);
	Запрос.УстановитьПараметр("СобытияРасчет",			МассивСобытияРасчет);
	
	МассивСобытияВозврат = Новый Массив();
	МассивСобытияВозврат.Добавить(Перечисления.СобытияНДСПродаж.ВозвратОплатыПокупателю);
	МассивСобытияВозврат.Добавить(Перечисления.СобытияНДСПродаж.ВозвратОтПокупателя);
	Запрос.УстановитьПараметр("СобытияВозврат",			МассивСобытияВозврат);
	
	МассивСобытияОтгрузка = Новый Массив();
	МассивСобытияОтгрузка.Добавить(Перечисления.СобытияНДСПродаж.РеализацияПокупателю);
	МассивСобытияОтгрузка.Добавить(Перечисления.СобытияНДСПродаж.ВозвратОтПокупателя);
	Запрос.УстановитьПараметр("СобытияОтгрузка",			МассивСобытияОтгрузка);
	
	МассивСобытияОплата = Новый Массив();
	МассивСобытияОплата.Добавить(Перечисления.СобытияНДСПродаж.ОплатаПокупателем);
	МассивСобытияОплата.Добавить(Перечисления.СобытияНДСПродаж.ВозвратОплатыПокупателю);
	Запрос.УстановитьПараметр("СобытияОплата",			МассивСобытияОплата);

	Запрос.УстановитьПараметр("РеализацияРасчет",	Перечисления.СобытияНДСПродаж.РеализацияПокупателю);
	Запрос.УстановитьПараметр("РеализацияВозврат",	Перечисления.СобытияНДСПродаж.ВозвратОтПокупателя);

	Запрос.УстановитьПараметр("Организация", Организация);
	
	ДополнительныеУсловия = "";
	Если Не ПараметрОтборДоговоровКонтрагентов = Неопределено Тогда
		
		ДополнительныеУсловия =  ДополнительныеУсловия + " И ДоговорКонтрагента В (&ДоговораКонтрагентов) ";
		Запрос.УстановитьПараметр("ДоговораКонтрагентов", ПараметрОтборДоговоровКонтрагентов.ВыгрузитьКолонку("ДоговорКонтрагента"));
		
	Иначе
		
		ОтборДоговоров = ОтборДоговоровКонтрагентов.Выгрузить();
		ОтборДоговоров.Свернуть("ДоговорКонтрагента", "");
		СтрокаСПустымДоговором = ОтборДоговоров.Найти(Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
		Если НЕ СтрокаСПустымДоговором = Неопределено Тогда 
			ОтборДоговоров.Удалить(СтрокаСПустымДоговором);	
		КонецЕсли;
		
		// если остались строки, значит устанавливаем фильтр по договорам,
		// иначе - по контрагентам
		Если ОтборДоговоров.Количество() > 0 Тогда
			
			ДополнительныеУсловия =  ДополнительныеУсловия + " И ДоговорКонтрагента В (&ДоговораКонтрагентов) ";
			Запрос.УстановитьПараметр("ДоговораКонтрагентов", ОтборДоговоров);
			
		Иначе 
			
			ОтборКонтрагентов = ОтборДоговоровКонтрагентов.Выгрузить();
			ОтборКонтрагентов.Свернуть("Контрагент", "");
			Если ОтборКонтрагентов.Количество() > 0 Тогда
				ДополнительныеУсловия =  ДополнительныеУсловия + " И ДоговорКонтрагента.Владелец В ИЕРАРХИИ(&Контрагенты) ";
				Запрос.УстановитьПараметр("Контрагенты", ОтборКонтрагентов);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;		
	
	Запрос.УстановитьПараметр("ДатаНач", 	НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаКон", 	КонецДня(ДатаКон));
	
	ТекстЗапросаРасчеты =
		  "		ДанныеПС.Период		 			КАК Дата,
		   | 	&Отгрузка 						КАК РасчетыВозврат,
		   |	ДанныеПС.ДоговорКонтрагента.Владелец КАК Контрагент,
		   |	ДанныеПС.ДоговорКонтрагента 	КАК ДоговорКонтрагента,
		   |	ДанныеПС.ЗаТару 				КАК ЗаТару,
		   |	ДанныеПС.Схема 					КАК Схема,
	       |	ВЫБОР
	       |		КОГДА ДанныеПС.Схема = &ПоОплате
	       |			ТОГДА ДанныеПС.ОплОбщПрих
	       |		КОГДА ДанныеПС.Схема = &ПоПервомуСобытию
	       |			ТОГДА ВЫБОР
	       |					КОГДА ДанныеПС.ОтгрОбщНач + ДанныеПС.ОтгрОбщПрих > ДанныеПС.ОплОбщНач + ДанныеПС.ОплОбщПрих
	       |						ТОГДА ДанныеПС.ОтгрОбщНач + ДанныеПС.ОтгрОбщПрих
	       |					ИНАЧЕ ДанныеПС.ОплОбщНач + ДанныеПС.ОплОбщПрих
	       |				КОНЕЦ - ВЫБОР
	       |					КОГДА ДанныеПС.ОтгрОбщНач > ДанныеПС.ОплОбщНач
	       |						ТОГДА ДанныеПС.ОтгрОбщНач
	       |					ИНАЧЕ ДанныеПС.ОплОбщНач
	       |				КОНЕЦ
	       |		КОГДА ДанныеПС.Схема = &ПоОтгрузке
	       |			ТОГДА ДанныеПС.ОтгрОбщПрих
	       |		ИНАЧЕ 0
	       |	КОНЕЦ КАК ПервоеСобытие,
		   |	ВЫБОР
		   |		КОГДА ДанныеПС.Схема = &ПоОтгрузке
		   |			ТОГДА ЛОЖЬ
		   |		КОГДА ДанныеПС.Схема = &ПоОплате
		   |			ТОГДА ИСТИНА
		   |		КОГДА ДанныеПС.Схема = &ПоПервомуСобытию
		   |			ТОГДА ВЫБОР
		   |					КОГДА ДанныеПС.ОтгрОбщНач + ДанныеПС.ОтгрОбщПрих > ДанныеПС.ОплОбщНач + ДанныеПС.ОплОбщПрих
		   |						ТОГДА ЛОЖЬ
		   |						ИНАЧЕ ИСТИНА
		   |				  КОНЕЦ
           | 	КОНЕЦ КАК ЭтоАванс,
		   | 	ДанныеОтгрузка.СтавкаНДС 							   КАК СтавкаНДС,		
		   | 	ДанныеОтгрузка.СуммаОтгрузки						   КАК СуммаОтгрузки,
   		   |    ДанныеОтгрузка.СуммаНДС			    				   КАК СуммаНДСОтгрузки,		   
		   | 	ЕстьNULL(ДанныеОтгрузка.РазличныеПараметрыОтгрузки, 0) КАК РазличныеПараметрыОтгрузки	
           |
	       |ИЗ
	       |	(ВЫБРАТЬ
	       |		ВспомогательныйЗапрос.ДоговорКонтрагента КАК ДоговорКонтрагента,
	       |		ВспомогательныйЗапрос.ВозвратнаяТара 	 КАК ЗаТару,
		   |		Выбор
		   |			КОГДА ВспомогательныйЗапрос.ВозвратнаяТара = ИСТИНА
	       |				ТОГДА ВспомогательныйЗапрос.ДоговорКонтрагента.СхемаНалоговогоУчетаПоТаре.МоментОпределенияБазыНДСПоПродажам
	       |			КОГДА ВспомогательныйЗапрос.ВозвратнаяТара = ЛОЖЬ
	       |				ТОГДА ВспомогательныйЗапрос.ДоговорКонтрагента.СхемаНалоговогоУчета.МоментОпределенияБазыНДСПоПродажам
	       |		КОНЕЦ КАК Схема,
	       |		ВспомогательныйЗапрос.ПериодДень 		КАК Период,
	       |		СУММА(ВспомогательныйЗапрос.ОплОбщНач) 	КАК ОплОбщНач,
	       |		СУММА(ВспомогательныйЗапрос.ОплОбщПрих) КАК ОплОбщПрих,
	       |		СУММА(ВспомогательныйЗапрос.ОтгрОбщНач) КАК ОтгрОбщНач,
	       |		СУММА(ВспомогательныйЗапрос.ОтгрОбщПрих) КАК ОтгрОбщПрих
	       |	ИЗ
	       |		(ВЫБРАТЬ
	       |			ОтгрузкаОплатаНач.ДоговорКонтрагента КАК ДоговорКонтрагента,
	       |			ОтгрузкаОплатаНач.ВозвратнаяТара КАК ВозвратнаяТара,
	       |			НАЧАЛОПЕРИОДА(ОтгрузкаОплатаНач.ПериодДень, ДЕНЬ) КАК ПериодДень,
	       |			ВЫБОР
	       |				КОГДА ОтгрузкаОплатаНач.СобытиеНДС В (&СобытияОтгрузка)
	       |					ТОГДА ОтгрузкаОплатаНач.СуммаВзаиморасчетовРеглОстаток
	       |				ИНАЧЕ 0
	       |			КОНЕЦ КАК ОтгрОбщНач,
	       |			ВЫБОР
	       |				КОГДА ОтгрузкаОплатаНач.СобытиеНДС В (&СобытияОплата)
	       |					ТОГДА ОтгрузкаОплатаНач.СуммаВзаиморасчетовРеглОстаток
	       |				ИНАЧЕ 0
	       |			КОНЕЦ КАК ОплОбщНач,
	       |			0 КАК ОплОбщПрих,
	       |			0 КАК ОтгрОбщПрих
		   |		ИЗ
	       |			(ВЫБРАТЬ
	       |				Периоды.ДоговорКонтрагента КАК ДоговорКонтрагента,
	       |				Периоды.ВозвратнаяТара КАК ВозвратнаяТара,
	       |				Периоды.Период КАК ПериодДень,
	       |				Остатки.СобытиеНДС КАК СобытиеНДС,
	       |				ЕСТЬNULL(СУММА(Остатки.СуммаНач), 0) КАК СуммаВзаиморасчетовРеглОстаток
	       |			ИЗ
	       |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	       |					Периоды.ДоговорКонтрагента КАК ДоговорКонтрагента,
	       |					Периоды.ВозвратнаяТара КАК ВозвратнаяТара,
	       |					НАЧАЛОПЕРИОДА(Периоды.Период, ДЕНЬ) КАК Период
	       |				ИЗ
	       |					РегистрНакопления.НДСПродаж.Обороты(
	       |						&ДатаНач,
	       |						&ДатаКон,
	       |						ДЕНЬ,
	       |						(СобытиеНДС В (&СобытияРасчет) " + ДополнительныеУсловия + "
	       |						 И Организация = &Организация)) КАК Периоды) КАК Периоды
	       |					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	       |						Остатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	       |						Остатки.ВозвратнаяТара КАК ВозвратнаяТара,
	       |						Остатки.СобытиеНДС КАК СобытиеНДС,
		   |						0 КАК Период,
	       |						Остатки.СуммаВзаиморасчетовРеглОстаток КАК СуммаНач
	       |					ИЗ
	       |						РегистрНакопления.НДСПродаж.Остатки(
	       |							&ДатаНач,
	       |							(СобытиеНДС В (&СобытияРасчет)  " + ДополнительныеУсловия + "
	       |							 И Организация = &Организация)) КАК Остатки		   
		   |
		   |                    ОБЪЕДИНИТЬ ВСЕ
		   |			   
		   |					ВЫБРАТЬ
	       |						Обороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	       |						Обороты.ВозвратнаяТара КАК ВозвратнаяТара,
	       |						Обороты.СобытиеНДС КАК СобытиеНДС,
		   |						НАЧАЛОПЕРИОДА(Обороты.Период, ДЕНЬ) КАК Период,		  
	       |						Обороты.СуммаВзаиморасчетовРеглПриход КАК СуммаНач
	       |					ИЗ
	       |						РегистрНакопления.НДСПродаж.Обороты(
	       |							&ДатаНач,
	       |							&ДатаКон,
	       |							ДЕНЬ,
	       |							(СобытиеНДС В (&СобытияРасчет) " + ДополнительныеУсловия + " 
	       |							 И Организация = &Организация)) КАК Обороты) КАК Остатки
	       |					ПО    Остатки.ДоговорКонтрагента = Периоды.ДоговорКонтрагента
	       |						И Остатки.ВозвратнаяТара = Периоды.ВозвратнаяТара
	       |						И (Остатки.Период = 0 ИЛИ Остатки.Период < НАЧАЛОПЕРИОДА(Периоды.Период, ДЕНЬ))
	       |			
	       |			СГРУППИРОВАТЬ ПО
	       |				Периоды.ДоговорКонтрагента,
	       |				Периоды.ВозвратнаяТара,
	       |				Периоды.Период,
	       |				Остатки.СобытиеНДС) КАК ОтгрузкаОплатаНач
	       |		
	       |		ОБЪЕДИНИТЬ ВСЕ
	       |		
	       |		ВЫБРАТЬ
	       |			ОтгрузкаОплатаОборот.ДоговорКонтрагента,
	       |			ОтгрузкаОплатаОборот.ВозвратнаяТара,
	       |			НАЧАЛОПЕРИОДА(ОтгрузкаОплатаОборот.Период, ДЕНЬ),
	       |			0,
	       |			0,
	       |			ВЫБОР
	       |				КОГДА ОтгрузкаОплатаОборот.СобытиеНДС В (&СобытияОплата)
	       |					ТОГДА ОтгрузкаОплатаОборот.СуммаВзаиморасчетовРеглПриход
	       |				ИНАЧЕ 0
	       |			КОНЕЦ,
	       |			ВЫБОР
	       |				КОГДА ОтгрузкаОплатаОборот.СобытиеНДС В (&СобытияОтгрузка)
	       |					ТОГДА ОтгрузкаОплатаОборот.СуммаВзаиморасчетовРеглПриход
	       |				ИНАЧЕ 0
	       |			КОНЕЦ
		   |		ИЗ
	       |			РегистрНакопления.НДСПродаж.Обороты(
	       |				&ДатаНач,
	       |				&ДатаКон,
	       |				ДЕНЬ,
	       |				(СобытиеНДС В (&СобытияРасчет) " + ДополнительныеУсловия + "
		   |				И Организация = &Организация)) КАК ОтгрузкаОплатаОборот) КАК ВспомогательныйЗапрос
	       |	
	       |	СГРУППИРОВАТЬ ПО
	       |		ВспомогательныйЗапрос.ДоговорКонтрагента,
	       |		ВспомогательныйЗапрос.ВозвратнаяТара,
	       |		ВспомогательныйЗапрос.ПериодДень,
	       |		ВЫБОР
	       |			КОГДА ВспомогательныйЗапрос.ВозвратнаяТара = ИСТИНА
	       |				ТОГДА ВспомогательныйЗапрос.ДоговорКонтрагента.СхемаНалоговогоУчетаПоТаре.МоментОпределенияБазыНДСПоПродажам
	       |			КОГДА ВспомогательныйЗапрос.ВозвратнаяТара = ЛОЖЬ
	       |				ТОГДА ВспомогательныйЗапрос.ДоговорКонтрагента.СхемаНалоговогоУчета.МоментОпределенияБазыНДСПоПродажам
	       |		КОНЕЦ) КАК ДанныеПС
	       |
		   |  ЛЕВОЕ СОЕДИНЕНИЕ 
		   |       (ВЫБРАТЬ
		   |          Отгрузка.ДоговорКонтрагента 			КАК ДоговорКонтрагента,
		   |          Отгрузка.ВозвратнаяТара				КАК ЗаТару,
		   |          НАЧАЛОПЕРИОДА(Отгрузка.Период, День) 	КАК Период,
		   |          МАКСИМУМ(Отгрузка.СтавкаНДС)			КАК СтавкаНДС,
		   |		  СУММА(1)								КАК РазличныеПараметрыОтгрузки,
		   |          СУММА(Отгрузка.СуммаВзаиморасчетовРеглПриход) КАК СуммаОтгрузки,
   		   |          СУММА(Отгрузка.НДСПриход)			    КАК СуммаНДС
		   |		ИЗ
		   |			РегистрНакопления.НДСПродаж.Обороты(
		   |						&ДатаНач,
		   |						&ДатаКон,
		   |						ДЕНЬ,
		   |						СобытиеНДС    = &РеализацияРасчет  " + ДополнительныеУсловия + "
		   |						И Организация = &Организация) КАК Отгрузка
		   |
		   |        СГРУППИРОВАТЬ ПО
		   |             Отгрузка.ДоговорКонтрагента,
		   |             Отгрузка.ВозвратнаяТара,
		   |             НАЧАЛОПЕРИОДА(Отгрузка.Период, День)) КАК ДанныеОтгрузка
		   |
 		   |		ПО 	  ДанныеПС.ДоговорКонтрагента 	= ДанныеОтгрузка.ДоговорКонтрагента
		   |			И ДанныеПС.ЗаТару 				= ДанныеОтгрузка.ЗаТару
		   |			И ДанныеПС.Период 				= ДанныеОтгрузка.Период
		   |"; 	
	
					   
   ТекстЗапросаВозврат=
		  "		ДанныеПС.Период		 			КАК Дата,
		   | 	&Возврат 						КАК РасчетыВозврат,
		   |	ДанныеПС.ДоговорКонтрагента.Владелец КАК Контрагент,
		   |	ДанныеПС.ДоговорКонтрагента 	КАК ДоговорКонтрагента,
		   |	ДанныеПС.ЗаТару 				КАК ЗаТару,
		   |	ДанныеПС.Схема 					КАК Схема,
	       |	ВЫБОР
	       |		КОГДА ДанныеПС.Схема = &ПоОплате
	       |			ТОГДА ДанныеПС.ОплОбщПрих
	       |		КОГДА ДанныеПС.Схема = &ПоПервомуСобытию
	       |			ТОГДА ВЫБОР
	       |					КОГДА ДанныеПС.ОтгрОбщНач + ДанныеПС.ОтгрОбщПрих > ДанныеПС.ОплОбщНач + ДанныеПС.ОплОбщПрих
	       |						ТОГДА ДанныеПС.ОтгрОбщНач + ДанныеПС.ОтгрОбщПрих
	       |					ИНАЧЕ ДанныеПС.ОплОбщНач + ДанныеПС.ОплОбщПрих
	       |				КОНЕЦ - ВЫБОР
	       |					КОГДА ДанныеПС.ОтгрОбщНач > ДанныеПС.ОплОбщНач
	       |						ТОГДА ДанныеПС.ОтгрОбщНач
	       |					ИНАЧЕ ДанныеПС.ОплОбщНач
	       |				КОНЕЦ
	       |		КОГДА ДанныеПС.Схема = &ПоОтгрузке
	       |			ТОГДА ДанныеПС.ОтгрОбщПрих
	       |		ИНАЧЕ 0
	       |	КОНЕЦ КАК ПервоеСобытие,
		   |	ВЫБОР
		   |		КОГДА ДанныеПС.Схема = &ПоОтгрузке
		   |			ТОГДА ЛОЖЬ
		   |		КОГДА ДанныеПС.Схема = &ПоОплате
		   |			ТОГДА ИСТИНА
		   |		КОГДА ДанныеПС.Схема = &ПоПервомуСобытию
		   |			ТОГДА ВЫБОР
		   |					КОГДА ДанныеПС.ОтгрОбщНач + ДанныеПС.ОтгрОбщПрих > ДанныеПС.ОплОбщНач + ДанныеПС.ОплОбщПрих
		   |						ТОГДА ЛОЖЬ
		   |						ИНАЧЕ ИСТИНА
		   |				  КОНЕЦ
           | 	КОНЕЦ КАК ЭтоАванс,
		   | 	ДанныеОтгрузка.СтавкаНДС 							   КАК СтавкаНДС,		
		   | 	ДанныеОтгрузка.СуммаОтгрузки						   КАК СуммаОтгрузки,
   		   |    ДанныеОтгрузка.СуммаНДС			    				   КАК СуммаНДСОтгрузки,		   
		   | 	ЕстьNULL(ДанныеОтгрузка.РазличныеПараметрыОтгрузки, 0) КАК РазличныеПараметрыОтгрузки	
           |
	       |ИЗ
	       |	(ВЫБРАТЬ
	       |		ВспомогательныйЗапрос.ДоговорКонтрагента КАК ДоговорКонтрагента,
	       |		ВспомогательныйЗапрос.ВозвратнаяТара 	 КАК ЗаТару,
		   |		Выбор
		   |			КОГДА ВспомогательныйЗапрос.ВозвратнаяТара = ИСТИНА
	       |				ТОГДА ВспомогательныйЗапрос.ДоговорКонтрагента.СхемаНалоговогоУчетаПоТаре.МоментОпределенияБазыНДСПоПродажам
	       |			КОГДА ВспомогательныйЗапрос.ВозвратнаяТара = ЛОЖЬ
	       |				ТОГДА ВспомогательныйЗапрос.ДоговорКонтрагента.СхемаНалоговогоУчета.МоментОпределенияБазыНДСПоПродажам
	       |		КОНЕЦ КАК Схема,
	       |		ВспомогательныйЗапрос.ПериодДень 		КАК Период,
	       |		СУММА(ВспомогательныйЗапрос.ОплОбщНач) 	КАК ОплОбщНач,
	       |		СУММА(ВспомогательныйЗапрос.ОплОбщПрих) КАК ОплОбщПрих,
	       |		СУММА(ВспомогательныйЗапрос.ОтгрОбщНач) КАК ОтгрОбщНач,
	       |		СУММА(ВспомогательныйЗапрос.ОтгрОбщПрих) КАК ОтгрОбщПрих
	       |	ИЗ
	       |		(ВЫБРАТЬ
	       |			ОтгрузкаОплатаНач.ДоговорКонтрагента КАК ДоговорКонтрагента,
	       |			ОтгрузкаОплатаНач.ВозвратнаяТара КАК ВозвратнаяТара,
	       |			НАЧАЛОПЕРИОДА(ОтгрузкаОплатаНач.ПериодДень, ДЕНЬ) КАК ПериодДень,
	       |			ВЫБОР
	       |				КОГДА ОтгрузкаОплатаНач.СобытиеНДС В (&СобытияОтгрузка)
	       |					ТОГДА ОтгрузкаОплатаНач.СуммаВзаиморасчетовРеглОстаток
	       |				ИНАЧЕ 0
	       |			КОНЕЦ КАК ОтгрОбщНач,
	       |			ВЫБОР
	       |				КОГДА ОтгрузкаОплатаНач.СобытиеНДС В (&СобытияОплата)
	       |					ТОГДА ОтгрузкаОплатаНач.СуммаВзаиморасчетовРеглОстаток
	       |				ИНАЧЕ 0
	       |			КОНЕЦ КАК ОплОбщНач,
	       |			0 КАК ОплОбщПрих,
	       |			0 КАК ОтгрОбщПрих
		   |		ИЗ
	       |			(ВЫБРАТЬ
	       |				Периоды.ДоговорКонтрагента КАК ДоговорКонтрагента,
	       |				Периоды.ВозвратнаяТара КАК ВозвратнаяТара,
	       |				Периоды.Период КАК ПериодДень,
	       |				Остатки.СобытиеНДС КАК СобытиеНДС,
	       |				ЕСТЬNULL(СУММА(Остатки.СуммаНач), 0) КАК СуммаВзаиморасчетовРеглОстаток
	       |			ИЗ
	       |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	       |					Периоды.ДоговорКонтрагента КАК ДоговорКонтрагента,
	       |					Периоды.ВозвратнаяТара КАК ВозвратнаяТара,
	       |					НАЧАЛОПЕРИОДА(Периоды.Период, ДЕНЬ) КАК Период
	       |				ИЗ
	       |					РегистрНакопления.НДСПродаж.Обороты(
	       |						&ДатаНач,
	       |						&ДатаКон,
	       |						ДЕНЬ,
	       |						(СобытиеНДС В (&СобытияВозврат) " + ДополнительныеУсловия + "
	       |						 И Организация = &Организация)) КАК Периоды) КАК Периоды
	       |					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	       |						Остатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	       |						Остатки.ВозвратнаяТара КАК ВозвратнаяТара,
	       |						Остатки.СобытиеНДС КАК СобытиеНДС,
		   |						0 КАК Период,
	       |						Остатки.СуммаВзаиморасчетовРеглОстаток КАК СуммаНач
	       |					ИЗ
	       |						РегистрНакопления.НДСПродаж.Остатки(
	       |							&ДатаНач,
	       |							(СобытиеНДС В (&СобытияВозврат)  " + ДополнительныеУсловия + "
	       |							 И Организация = &Организация)) КАК Остатки		   
		   |
		   |                    ОБЪЕДИНИТЬ ВСЕ
		   |			   
		   |					ВЫБРАТЬ
	       |						Обороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	       |						Обороты.ВозвратнаяТара КАК ВозвратнаяТара,
	       |						Обороты.СобытиеНДС КАК СобытиеНДС,
		   |						НАЧАЛОПЕРИОДА(Обороты.Период, ДЕНЬ) КАК Период,		  
	       |						Обороты.СуммаВзаиморасчетовРеглПриход КАК СуммаНач
	       |					ИЗ
	       |						РегистрНакопления.НДСПродаж.Обороты(
	       |							&ДатаНач,
	       |							&ДатаКон,
	       |							ДЕНЬ,
	       |							(СобытиеНДС В (&СобытияВозврат) " + ДополнительныеУсловия + " 
	       |							 И Организация = &Организация)) КАК Обороты) КАК Остатки
	       |					ПО    Остатки.ДоговорКонтрагента = Периоды.ДоговорКонтрагента
	       |						И Остатки.ВозвратнаяТара = Периоды.ВозвратнаяТара
	       |						И (Остатки.Период = 0 ИЛИ Остатки.Период < НАЧАЛОПЕРИОДА(Периоды.Период, ДЕНЬ))
	       |			
	       |			СГРУППИРОВАТЬ ПО
	       |				Периоды.ДоговорКонтрагента,
	       |				Периоды.ВозвратнаяТара,
	       |				Периоды.Период,
	       |				Остатки.СобытиеНДС) КАК ОтгрузкаОплатаНач
	       |		
	       |		ОБЪЕДИНИТЬ ВСЕ
	       |		
	       |		ВЫБРАТЬ
	       |			ОтгрузкаОплатаОборот.ДоговорКонтрагента,
	       |			ОтгрузкаОплатаОборот.ВозвратнаяТара,
	       |			НАЧАЛОПЕРИОДА(ОтгрузкаОплатаОборот.Период, ДЕНЬ),
	       |			0,
	       |			0,
	       |			ВЫБОР
	       |				КОГДА ОтгрузкаОплатаОборот.СобытиеНДС В (&СобытияОплата)
	       |					ТОГДА ОтгрузкаОплатаОборот.СуммаВзаиморасчетовРеглПриход
	       |				ИНАЧЕ 0
	       |			КОНЕЦ,
	       |			ВЫБОР
	       |				КОГДА ОтгрузкаОплатаОборот.СобытиеНДС В (&СобытияОтгрузка)
	       |					ТОГДА ОтгрузкаОплатаОборот.СуммаВзаиморасчетовРеглПриход
	       |				ИНАЧЕ 0
	       |			КОНЕЦ
		   |		ИЗ
	       |			РегистрНакопления.НДСПродаж.Обороты(
	       |				&ДатаНач,
	       |				&ДатаКон,
	       |				ДЕНЬ,
	       |				(СобытиеНДС В (&СобытияВозврат) " + ДополнительныеУсловия + "
		   |				И Организация = &Организация)) КАК ОтгрузкаОплатаОборот) КАК ВспомогательныйЗапрос
	       |	
	       |	СГРУППИРОВАТЬ ПО
	       |		ВспомогательныйЗапрос.ДоговорКонтрагента,
	       |		ВспомогательныйЗапрос.ВозвратнаяТара,
	       |		ВспомогательныйЗапрос.ПериодДень,
	       |		ВЫБОР
	       |			КОГДА ВспомогательныйЗапрос.ВозвратнаяТара = ИСТИНА
	       |				ТОГДА ВспомогательныйЗапрос.ДоговорКонтрагента.СхемаНалоговогоУчетаПоТаре.МоментОпределенияБазыНДСПоПродажам
	       |			КОГДА ВспомогательныйЗапрос.ВозвратнаяТара = ЛОЖЬ
	       |				ТОГДА ВспомогательныйЗапрос.ДоговорКонтрагента.СхемаНалоговогоУчета.МоментОпределенияБазыНДСПоПродажам
	       |		КОНЕЦ) КАК ДанныеПС
	       |
		   |  ЛЕВОЕ СОЕДИНЕНИЕ 
		   |       (ВЫБРАТЬ
		   |          Отгрузка.ДоговорКонтрагента 			КАК ДоговорКонтрагента,
		   |          Отгрузка.ВозвратнаяТара				КАК ЗаТару,
		   |          НАЧАЛОПЕРИОДА(Отгрузка.Период, День) 	КАК Период,
		   |          МАКСИМУМ(Отгрузка.СтавкаНДС)			КАК СтавкаНДС,
		   |		  СУММА(1)								КАК РазличныеПараметрыОтгрузки,
		   |          СУММА(Отгрузка.СуммаВзаиморасчетовРеглПриход) КАК СуммаОтгрузки,
   		   |          СУММА(Отгрузка.НДСПриход)			    КАК СуммаНДС
		   |		ИЗ
		   |			РегистрНакопления.НДСПродаж.Обороты(
		   |						&ДатаНач,
		   |						&ДатаКон,
		   |						ДЕНЬ,
		   |						СобытиеНДС    = &РеализацияВозврат  " + ДополнительныеУсловия + "
		   |						И Организация = &Организация) КАК Отгрузка
		   |
		   |        СГРУППИРОВАТЬ ПО
		   |             Отгрузка.ДоговорКонтрагента,
		   |             Отгрузка.ВозвратнаяТара,
		   |             НАЧАЛОПЕРИОДА(Отгрузка.Период, День)) КАК ДанныеОтгрузка
		   |
 		   |		ПО 	  ДанныеПС.ДоговорКонтрагента 	= ДанныеОтгрузка.ДоговорКонтрагента
		   |			И ДанныеПС.ЗаТару 				= ДанныеОтгрузка.ЗаТару
		   |			И ДанныеПС.Период 				= ДанныеОтгрузка.Период
		   |"; 
	
   

	Если  НЕ ЗначениеЗаполнено(РасчетыВозврат) = Ложь
		И ПараметрОтборДоговоровКонтрагентов = Неопределено Тогда
		
		Если РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
							|" +ТекстЗапросаРасчеты;	
		Иначе
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
							|" +ТекстЗапросаВозврат;	
		КонецЕсли; 
		
	Иначе
		Запрос.Текст = 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
						|" + ТекстЗапросаРасчеты + "
						| ОБЪЕДИНИТЬ ВСЕ
						|
						|ВЫБРАТЬ
						|" + ТекстЗапросаВозврат;
	КонецЕсли;
					
	Запрос.Текст = Запрос.Текст + 
				   "УПОРЯДОЧИТЬ ПО 
				   |	Контрагент,
				   |	ДоговорКонтрагента,
				   |	Дата,
				   |	РасчетыВозврат,
				   |	ЗаТару
				   |";
	
	Договора.Очистить();

	ВыборкаДоговора = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДоговора.Следующий() Цикл  
		
		ВыдатьПредупраждающееСообщение = Ложь;
		
		Если ВыборкаДоговора.ПервоеСобытие <= 0 Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		Если ВыборкаДоговора.Схема = Перечисления.МоментыОпределенияНалоговойБазы.НеОпределять Тогда
								
			// ничего не делаем
			Возврат;
								
		ИначеЕсли ВыборкаДоговора.Схема = Перечисления.МоментыОпределенияНалоговойБазы.ПоОплате Тогда
							
			Аванс = ВыборкаДоговора.ПервоеСобытие;
							
			Если  Аванс > 0 Тогда
				ДобавитьСтрокуВДоговораАванс(ВыборкаДоговора, Аванс);
			КонецЕсли;
								
		ИначеЕсли ВыборкаДоговора.Схема = Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке Тогда
								
			// Все отгрузки 
			Если ВыборкаДоговора.РазличныеПараметрыОтгрузки =  1 Тогда
			
				ДобавитьСтрокуВДоговораОтгрузка(ВыборкаДоговора);	
			
			Иначе
				
				// вариант когда при учете по отгрузке были отгрузки по нескольким ставкам не обрабатывается в полном объеме.
				Отгрузка = ВыборкаДоговора.ПервоеСобытие;
								
				ДобавитьСтрокуВДоговораАванс(ВыборкаДоговора, Отгрузка);
				
				ВыдатьПредупраждающееСообщение = Истина;
				
			КонецЕсли;
								
		ИначеЕсли ВыборкаДоговора.Схема = Перечисления.МоментыОпределенияНалоговойБазы.ПоПервомуСобытию Тогда
							
			
			Если ВыборкаДоговора.ЭтоАванс  Тогда
				
				Аванс = ВыборкаДоговора.ПервоеСобытие;
								
				ДобавитьСтрокуВДоговораАванс(ВыборкаДоговора, Аванс);
			
			ИначеЕсли ВыборкаДоговора.РазличныеПараметрыОтгрузки = 1  Тогда
				
				Если ВыборкаДоговора.СуммаОтгрузки > 0 Тогда
				
					ДобавитьСтрокуВДоговораОтгрузка(ВыборкаДоговора, ВыборкаДоговора.ПервоеСобытие/ВыборкаДоговора.СуммаОтгрузки);	
				
				Иначе
					
					// по-видимому излишне выписаны налоговые накладные, но это должен выявить пользователь с помощью отчетов
					Отгрузка = ВыборкаДоговора.ПервоеСобытие;
									
					ДобавитьСтрокуВДоговораАванс(ВыборкаДоговора, Отгрузка);
					
					ВыдатьПредупраждающееСообщение = Истина;
					
				КонецЕсли;
				
			Иначе
				
				Отгрузка = ВыборкаДоговора.ПервоеСобытие;
								
				ДобавитьСтрокуВДоговораАванс(ВыборкаДоговора, Отгрузка);
				
				ВыдатьПредупраждающееСообщение = Истина
				
			КонецЕсли;
			
		Иначе
							
			Если ВыборкаДоговора.ЗаТару Тогда
				ТекстСообщения = "Контрагент: " + ВыборкаДоговора.Контрагент+ ", Договор: " + ВыборкаДоговора.ДоговорКонтрагента + ""
								 "Не указана схема налогового учета по таре, либо в схеме не указан Момент определения базы НДС по продажам"; 
			Иначе
				ТекстСообщения = "Контрагент: " + ВыборкаДоговора.Контрагент+ ", Договор: " + ВыборкаДоговора.ДоговорКонтрагента + ""
								 "Не указана схема налогового учета, либо в схеме не указан Момент определения базы НДС по продажам"; 
			КонецЕсли;	
							
			Сообщить(ТекстСообщения, СтатусСообщения.Важное);

		КонецЕсли;					
		
		Если ВыдатьПредупраждающееСообщение Тогда
				ТекстСообщения = "Контрагент: " + ВыборкаДоговора.Контрагент + ", Договор: " + ВыборкаДоговора.ДоговорКонтрагента + ", Дата: " + Формат(ВыборкаДоговора.Дата,"ДФ=dd.MM.yyyy") + ""
								 "Нет возможности определить ставку налоговых обязательств. Общая сумма обязательств указана в колонке ""Аванс"""; 
			
			Сообщить(ТекстСообщения, СтатусСообщения.Информация);
			
		КонецЕсли;
		
	КонецЦикла; 	
	
	// Добавим в Договора строки, по которым нет остатков
	// в случае, если данная процедура вызвана в режиме обновления таблицы договоров (заполнен параметр ПараметрОтборДоговоровКонтрагентов)
	// И удалим  лишние (в запросе фильтр по Расчету/Возврату не накладывался)
	Если Не ПараметрОтборДоговоровКонтрагентов = Неопределено Тогда
		
		// Добавляем новые
		СтруктураПоиска = Новый Структура();
		Для каждого СтрокаТаблицыДокументов Из ПараметрОтборДоговоровКонтрагентов Цикл
			
			СтруктураПоиска.Вставить("Дата",				СтрокаТаблицыДокументов.Дата);		
			СтруктураПоиска.Вставить("ДоговорКонтрагента",	СтрокаТаблицыДокументов.ДоговорКонтрагента);		
			СтруктураПоиска.Вставить("РасчетыВозврат",		СтрокаТаблицыДокументов.РасчетыВозврат);		
			
			Если Договора.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
				СтрокаДоговоров = Договора.Добавить();
				СтрокаДоговоров.Дата = СтрокаТаблицыДокументов.Дата;		
				СтрокаДоговоров.ЗаТару    = СтрокаТаблицыДокументов.ЗаТару;		
				СтрокаДоговоров.СтавкаНДС = СтрокаТаблицыДокументов.СтавкаНДС;		
			КонецЕсли;
			
		КонецЦикла; 
		

		// Удаляем Лишние
		СтруктураПоиска = Новый Структура();
		Сч = 0;
		Пока Сч <= Договора.Количество() - 1 Цикл
			
			СтрокаДоговоров = Договора.Получить(Сч);
			СтруктураПоиска.Вставить("Дата",	СтрокаДоговоров.Дата);		
			СтруктураПоиска.Вставить("ДоговорКонтрагента",	СтрокаДоговоров.ДоговорКонтрагента);		
			СтруктураПоиска.Вставить("РасчетыВозврат",		СтрокаДоговоров.РасчетыВозврат);		
			
			Если ПараметрОтборДоговоровКонтрагентов.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
				Договора.Удалить(СтрокаДоговоров);
			Иначе
				Сч = Сч + 1
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	// добавим строки-ссылки на номенклатуру, добавляемую пользователем.
	ДоговораКопия = Договора.Выгрузить();
	ДоговораКопия.Свернуть("Дата, ДоговорКонтрагента","");
	
	СтруктураПоиска = Новый Структура("Дата, ДоговорКонтрагента, РасчетыВозврат, Документ");
	// если "возврат" (формируем Приложения 2) - необходимо всегда указывать документ-основание: налоговую накладную - основание!
	СтруктураПоиска.РасчетыВозврат 	= Перечисления.РасчетыВозврат.Расчеты;
	СтруктураПоиска.Документ 		= Неопределено;
	Для каждого СтрокаДоговоров Из ДоговораКопия Цикл
		СтруктураПоиска.Дата 				= СтрокаДоговоров.Дата;
		СтруктураПоиска.ДоговорКонтрагента 	= СтрокаДоговоров.ДоговорКонтрагента;
		
		СтрокиИсточниковНоменклатуры = ИсточникиНоменклатуры.НайтиСтроки(СтруктураПоиска);
		Если СтрокиИсточниковНоменклатуры.Количество() = 0 Тогда
			СтрокаИсточниковНоменклатуры = ИсточникиНоменклатуры.Добавить();
			СтрокаИсточниковНоменклатуры.Дата 					= СтруктураПоиска.Дата;		
			СтрокаИсточниковНоменклатуры.ДоговорКонтрагента 	= СтруктураПоиска.ДоговорКонтрагента;
			СтрокаИсточниковНоменклатуры.РасчетыВозврат 		= СтруктураПоиска.РасчетыВозврат;
			СтрокаИсточниковНоменклатуры.Документ	 	 		= Неопределено;	
		КонецЕсли;
	
	КонецЦикла;
	
	//теперь добавим уже выписанные  налоговые документы
	//Сначала удалим старые упоминания
	СтруктураОтбора = новый Структура("СуществующийДокумент", истина);
	УдалитьСтрокиТабличныхЧастейНоменклатуры(СтруктураОтбора);
	УдалитьСтрокиТабличнойЧасти(ИсточникиНоменклатуры, СтруктураОтбора);
	
	// Получим таблицу с датами/договорами для поиска выписанных документов
	ТаблицаДоговоров = Договора.Выгрузить();
	ТаблицаДоговоров.Свернуть("Дата,ДоговорКонтрагента,РасчетыВозврат","");
	
	ОтборИсточниковНоменклатуры = Новый Структура();
	
	Для каждого Строка Из ТаблицаДоговоров Цикл
	    // находим существующие налоговые документы
		Если Строка.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
		
			СуществующиеДокументы = Документы.НалоговаяНакладная.Выбрать(НачалоДня(Строка.Дата),
																		 КонецДня(Строка.Дата), 
																		 Новый Структура("ДоговорКонтрагента", Строка.ДоговорКонтрагента),
																		 "Дата");
		Иначе
																		 
			СуществующиеДокументы = Документы.Приложение2КНалоговойНакладной.Выбрать(НачалоДня(Строка.Дата),
																					 КонецДня(Строка.Дата), 
																					 Новый Структура("ДоговорКонтрагента", Строка.ДоговорКонтрагента),
																					 "Дата");

		КонецЕсли;	
		
		// добавляем существующие налоговые документы
		Пока СуществующиеДокументы.Следующий() Цикл
				
			Если СуществующиеДокументы.Проведен = Ложь Тогда
				Продолжить;
			КонецЕсли;
				
			СтрокаИсточниковНоменклатуры = ИсточникиНоменклатуры.Добавить();
			СтрокаИсточниковНоменклатуры.Дата	 			= Строка.Дата;
			СтрокаИсточниковНоменклатуры.СуществующийДокумент = Истина;
			СтрокаИсточниковНоменклатуры.Документ 			= СуществующиеДокументы.Ссылка;
			СтрокаИсточниковНоменклатуры.ДоговорКонтрагента = Строка.ДоговорКонтрагента;
			СтрокаИсточниковНоменклатуры.РасчетыВозврат 	= Строка.РасчетыВозврат;
			
			ОтборИсточниковНоменклатуры.Вставить("Дата",					СтрокаИсточниковНоменклатуры.Дата);
			ОтборИсточниковНоменклатуры.Вставить("СуществующийДокумент", 	Истина);
			ОтборИсточниковНоменклатуры.Вставить("Документ",				СтрокаИсточниковНоменклатуры.Документ);
			ОтборИсточниковНоменклатуры.Вставить("ДоговорКонтрагента",		СтрокаИсточниковНоменклатуры.ДоговорКонтрагента);
			ОтборИсточниковНоменклатуры.Вставить("РасчетыВозврат",			СтрокаИсточниковНоменклатуры.РасчетыВозврат);
			
			ЗаполнитьТабличныеЧасти(ОтборИсточниковНоменклатуры);
			
		КонецЦикла; 
	
	КонецЦикла; 

КонецПроцедуры


Процедура ДобавитьСтрокуВДоговора(Выборка, СуммаНеподтверденнойПредоплаты=Неопределено) Экспорт 
	
	СтрокаДоговоров = Договора.Добавить();
	
	СтрокаДоговоров.Дата		 		= Выборка.Дата;
	Если СтрокаДоговоров.Дата = '00010101' Тогда
		СтрокаДоговоров.Дата = Дата;	
	КонецЕсли;
	СтрокаДоговоров.РасчетыВозврат 		= Выборка.РасчетыВозврат;
	СтрокаДоговоров.ДоговорКонтрагента 	= Выборка.ДоговорКонтрагента;
	СтрокаДоговоров.ЗаТару 				= Выборка.ЗаТару;
	
	Если НЕ ЗначениеЗаполнено(Выборка.СтавкаНДС) Тогда
		
		СтрокаДоговоров.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
		Если СуммаНеподтверденнойПредоплаты=Неопределено Тогда
			СтрокаДоговоров.Сумма = Выборка.СуммаОплаты;
	    Иначе
			СтрокаДоговоров.Сумма = СуммаНеподтверденнойПредоплаты;
		КонецЕсли;
		
	Иначе
		
		СтрокаДоговоров.СтавкаНДС 	= Выборка.СтавкаНДС;
		СтрокаДоговоров.Сумма 		= Выборка.СуммаОтгрузки;
		СтрокаДоговоров.СуммаНДС	= Выборка.СуммаНДСОтгрузки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуВДоговораОтгрузка(Выборка, Коэффициент = 1)		
	
	Если  Выборка.СуммаОтгрузки = NULL 
	  ИЛИ Выборка.СуммаОтгрузки <= 0  Тогда
	  
	  Возврат
	  
    КонецЕсли;
	
	СтрокаДоговоров = Договора.Добавить();
	
	СтрокаДоговоров.Дата		 		= Выборка.Дата;
	СтрокаДоговоров.РасчетыВозврат 		= Выборка.РасчетыВозврат;
	СтрокаДоговоров.ДоговорКонтрагента 	= Выборка.ДоговорКонтрагента;
	СтрокаДоговоров.ЗаТару 				= Выборка.ЗаТару;
	СтрокаДоговоров.СтавкаНДС 			= Выборка.СтавкаНДС;

	СтрокаДоговоров.Сумма 		= Коэффициент * Выборка.СуммаОтгрузки;
	СтрокаДоговоров.СуммаНДС	= Коэффициент * Выборка.СуммаНДСОтгрузки;
	
КонецПроцедуры

Процедура ДобавитьСтрокуВДоговораАванс(Выборка, Аванс) 
	
	СтрокаДоговоров = Договора.Добавить();
	
	СтрокаДоговоров.Дата		 		= Выборка.Дата;
	Если СтрокаДоговоров.Дата = '00010101' Тогда
		СтрокаДоговоров.Дата = Дата;	
	КонецЕсли;
	СтрокаДоговоров.РасчетыВозврат 		= Выборка.РасчетыВозврат;
	СтрокаДоговоров.ДоговорКонтрагента 	= Выборка.ДоговорКонтрагента;
	СтрокаДоговоров.ЗаТару 				= Выборка.ЗаТару;
	СтрокаДоговоров.Сумма 				= Аванс;
	
КонецПроцедуры

Процедура УдалитьСтрокиТабличныхЧастейНоменклатуры(СтруктураУдаляемыхСтрок = Неопределено) Экспорт
	УдалитьСтрокиТабличнойЧасти(Товары, 			СтруктураУдаляемыхСтрок);
	УдалитьСтрокиТабличнойЧасти(ВозвратнаяТара, 	СтруктураУдаляемыхСтрок);
	УдалитьСтрокиТабличнойЧасти(Услуги, 			СтруктураУдаляемыхСтрок);
	УдалитьСтрокиТабличнойЧасти(Прочее, 			СтруктураУдаляемыхСтрок);
КонецПроцедуры

Процедура УдалитьСтрокиТабличнойЧасти(ТабличнаяЧасть, СтруктураУдаляемыхСтрок = Неопределено) Экспорт
	Если  СтруктураУдаляемыхСтрок = Неопределено Тогда
		
		ТабличнаяЧасть.Очистить();
		
	Иначе
		
		НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(СтруктураУдаляемыхСтрок);
		Для каждого НайденнаяСтрока  Из НайденныеСтроки Цикл
			ТабличнаяЧасть.Удалить(НайденнаяСтрока)
		КонецЦикла; 
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьТабличныеЧасти(СтруктураОтбора) Экспорт 
	
	//проверим наличие необходимого отбора
	Если НЕ СтруктураОтбора.Свойство("СуществующийДокумент") Тогда
	
		СтруктураОтбора.Вставить("СуществующийДокумент", Ложь);
	
	КонецЕсли;
	
	ДокументОснование = СтруктураОтбора.Документ; 
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда 
		// специфический случай. Отчет окмитенту о продажах: номенклатурный состав
		// самого документа не имеет никакого отношения к заполнению налоговой - в ней должна быть только информация
		// об услуге комиссии
		СтрокаУслуг = Услуги.Добавить();
		СтрокаУслуг.Дата = СтруктураОтбора.Дата;
		СтрокаУслуг.ДоговорКонтрагента = СтруктураОтбора.ДоговорКонтрагента;
		СтрокаУслуг.РасчетыВозврат = СтруктураОтбора.РасчетыВозврат;
		СтрокаУслуг.Документ = ДокументОснование;
		
		УслугаКомиссии = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяУслугаКомиссии");
		Если НЕ ЗначениеЗаполнено(УслугаКомиссии) Тогда
			Сообщить("Для текущего пользователя в настройках не задана """"Основная номенклатура-услуга по комиссии"""" ");
		КонецЕсли; 
		СтрокаУслуг.Номенклатура = УслугаКомиссии;
		СтрокаУслуг.Содержание 	 = УслугаКомиссии.НаименованиеПолное;
		
		СтрокаУслуг.Количество = 1;
		СтрокаУслуг.КоличествоВДокумент = 1;
		
		СтрокаУслуг.Цена 			  = ДокументОснование.Товары.Итог("СуммаВознаграждения");
		СтрокаУслуг.Сумма 			  = СтрокаУслуг.Цена;
		СтрокаУслуг.СуммаВДокумент 	  = СтрокаУслуг.Цена;
		СтрокаУслуг.СтавкаНДС 		  = ДокументОснование.СтавкаНДСВознаграждения;
		СтрокаУслуг.СуммаНДС 		  = ДокументОснование.Товары.Итог("СуммаНДСВознаграждения");
		СтрокаУслуг.СуммаНДСВДокумент = СтрокаУслуг.СуммаНДС;
	Иначе
		ЗаполнитьТабличнуюЧасть("Товары", 			СтруктураОтбора);
		ЗаполнитьТабличнуюЧасть("Услуги", 			СтруктураОтбора);
		ЗаполнитьТабличнуюЧасть("ВозвратнаяТара", 	СтруктураОтбора);
		ЗаполнитьТабличнуюЧасть("Прочее", 			СтруктураОтбора);
	КонецЕсли;
	
	ОбновитьИсточникиНоменклатуры(СтруктураОтбора);
	
КонецПроцедуры

Процедура ОбновитьСоставИсточниковНоменклатуры() Экспорт

	СтруктураПоиска = Новый Структура();
	
	Сч = 0;
	Пока Сч < ИсточникиНоменклатуры.Количество() Цикл
	
		СтрокаДокументов = ИсточникиНоменклатуры[Сч];
		
		СтруктураПоиска.Очистить();
		
		СтруктураПоиска.Вставить("Дата",		 	   СтрокаДокументов.Дата);
		СтруктураПоиска.Вставить("ДоговорКонтрагента", СтрокаДокументов.ДоговорКонтрагента);
		СтруктураПоиска.Вставить("РасчетыВозврат", 	   СтрокаДокументов.РасчетыВозврат);
		
		// поищем соответствующие строки в договорах
		НайденныеСтроки = Договора.НайтиСтроки(СтруктураПоиска);
		
		// если строк в таблице договоров нет - удалим строку Источников номенклатуры и соответсвтующие строки табличных частей
		Если НайденныеСтроки.Количество() = 0 Тогда
			// Для удаления строк табличных частей в структуру поиска добавим ссылку на документ
			СтруктураПоиска.Вставить("Документ", СтрокаДокументов.Документ);
			
			// Удалим лишние строки Табличных Частей с номенклатурой
			УдалитьСтрокиТабличныхЧастейНоменклатуры(СтруктураПоиска);
			
			// Удалим лишние строки Источников номенклатуры
			ИсточникиНоменклатуры.Удалить(СтрокаДокументов);
		КонецЕсли;	
		
		Сч = Сч + 1;

	КонецЦикла; 

КонецПроцедуры

Процедура ОбновитьИсточникиНоменклатуры(СтруктураОтбораНоменклатуры) Экспорт

	мИтоговаяТаблица.Очистить();
	
	ВыгрузитьТабличнуюЧастьВИтоговуюТаблицу(СтруктураОтбораНоменклатуры, мИтоговаяТаблица, "Товары");
	ВыгрузитьТабличнуюЧастьВИтоговуюТаблицу(СтруктураОтбораНоменклатуры, мИтоговаяТаблица, "Услуги");
	ВыгрузитьТабличнуюЧастьВИтоговуюТаблицу(СтруктураОтбораНоменклатуры, мИтоговаяТаблица, "ВозвратнаяТара");
	ВыгрузитьТабличнуюЧастьВИтоговуюТаблицу(СтруктураОтбораНоменклатуры, мИтоговаяТаблица, "Прочее");
	
	
	// получим реквизиты документа, связанные с НДС
	Документ = СтруктураОтбораНоменклатуры.Документ;
	Если Документ = Неопределено Тогда
		// Без документа- основания
		Если СтруктураОтбораНоменклатуры.ДоговорКонтрагента.Внешнеэкономический Тогда
			ВалютаДокумента  = СтруктураОтбораНоменклатуры.ДоговорКонтрагента.ВалютаВзаиморасчетов;
		Иначе	
			ВалютаДокумента  = мВалютаРегламентированногоУчета;
		КонецЕсли;
		УчитыватьНДС 	 = Истина;
		СуммаВключаетНДС = Истина;
	
	Иначе
		
		ВалютаДокумента  = Документ.ВалютаДокумента;
		УчитыватьНДС 	 = Документ.УчитыватьНДС;
		СуммаВключаетНДС = Документ.СуммаВключаетНДС;
	
	КонецЕсли; 
	
	// пересчитаем суммы с учетом ошибок округления и реквизитов учета НДС в документе в гривны
	ПогрешностиОкругления 	  = Новый Соответствие();
	ПогрешностиОкругленияТара = Новый Соответствие();
	
	ДанныеВалДок  = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	ДанныеВалРегл = МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаРегламентированногоУчета, Дата);
	
	Для каждого СтрокаТаблицы Из мИтоговаяТаблица Цикл
		
		// Рассчитаем суммы в документе в валюте документа
		СуммаСНДСВал    = СтрокаТаблицы.СуммаВДокумент + ?(СуммаВключаетНДС, 0, СтрокаТаблицы.СуммаНДСВДокумент);
		СуммаНДСВал     = СтрокаТаблицы.СуммаНДСВДокумент;
		
		// Рассчитаем суммы в документе в валюте регл. учета
		Если ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
			СтрокаТаблицы.СуммаВДокумент 	 = СуммаСНДСВал;
			СтрокаТаблицы.СуммаНДСВДокумент  = СуммаНДСВал;
		Иначе
			                             	
			СтрокаТаблицы.СуммаВДокумент 	= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаСНДСВал, 
																		ВалютаДокумента,
																		мВалютаРегламентированногоУчета, 
																		ДанныеВалДок.Курс, 
																		ДанныеВалРегл.Курс,
																		ДанныеВалДок.Кратность,
																		ДанныеВалРегл.Кратность,
																		, ?(СтрокаТаблицы.ЗаТару, ПогрешностиОкругленияТара, ПогрешностиОкругления) , "СуммаСНДСРегл");
			
			СтрокаТаблицы.СуммаНДСВДокумент  = НалоговыйУчет.РассчитатьСуммуНДСсУчетомПогрешности(СтрокаТаблицы.СуммаВДокумент,
																					УчитыватьНДС,
																					Истина,
																					СтрокаТаблицы.СтавкаНДС,
																					?(СтрокаТаблицы.ЗаТару, ПогрешностиОкругленияТара, ПогрешностиОкругления));
		КонецЕсли;
		
	КонецЦикла;	
	
	мИтоговаяТаблица.Свернуть("СтавкаНДС,ЗаТару","СуммаВДокумент, СуммаНДСВДокумент");
	
	// создадим новые строки в ИсточникахНоменклатуры, взамен старых
	СтарыеСтрокиИсточниковНоменклатуры = ИсточникиНоменклатуры.НайтиСтроки(СтруктураОтбораНоменклатуры);
	
	// Данные о документе установим установим в таблице в "старом" порядке
	МинПозиция = Неопределено;
	Для каждого СтрокаИсточниковНоменклатуры Из СтарыеСтрокиИсточниковНоменклатуры Цикл
		Позиция = ИсточникиНоменклатуры.Индекс(СтрокаИсточниковНоменклатуры);
		Если  МинПозиция = Неопределено 
		  ИЛИ Позиция < МинПозиция Тогда
			 МинПозиция = Позиция;
		КонецЕсли;
		
		ИсточникиНоменклатуры.Удалить(СтрокаИсточниковНоменклатуры);
	КонецЦикла; 
	
	Если МинПозиция = Неопределено Тогда
		МинПозиция = 0;
	КонецЕсли;
	
	
	Если мИтоговаяТаблица.Количество() = 0 Тогда
		// добавим единственную "пустую" строку
		СтрокаИсточниковНоменклатуры = ИсточникиНоменклатуры.Вставить(МинПозиция);
		СтрокаИсточниковНоменклатуры.СуществующийДокумент	= СтруктураОтбораНоменклатуры.СуществующийДокумент;
		СтрокаИсточниковНоменклатуры.Дата				 	= СтруктураОтбораНоменклатуры.Дата;
		СтрокаИсточниковНоменклатуры.ДоговорКонтрагента 	= СтруктураОтбораНоменклатуры.ДоговорКонтрагента;
		СтрокаИсточниковНоменклатуры.Документ 				= СтруктураОтбораНоменклатуры.Документ;
		СтрокаИсточниковНоменклатуры.РасчетыВозврат 		= СтруктураОтбораНоменклатуры.РасчетыВозврат;
	Иначе
		СтруктураОтбораДоговоров = Новый Структура();
		СтруктураОтбораДоговоров.Вставить("Дата", 				СтруктураОтбораНоменклатуры.Дата);
		СтруктураОтбораДоговоров.Вставить("ДоговорКонтрагента", СтруктураОтбораНоменклатуры.ДоговорКонтрагента);
		СтруктураОтбораДоговоров.Вставить("РасчетыВозврат",		СтруктураОтбораНоменклатуры.РасчетыВозврат);
		
		Для каждого СтрокаСумм Из мИтоговаяТаблица Цикл
			СтрокаИсточниковНоменклатуры = ИсточникиНоменклатуры.Вставить(МинПозиция);
			СтрокаИсточниковНоменклатуры.СуществующийДокумент	= СтруктураОтбораНоменклатуры.СуществующийДокумент;
			СтрокаИсточниковНоменклатуры.Дата				    = СтруктураОтбораНоменклатуры.Дата;
			СтрокаИсточниковНоменклатуры.ДоговорКонтрагента 	= СтруктураОтбораНоменклатуры.ДоговорКонтрагента;
			СтрокаИсточниковНоменклатуры.Документ 				= СтруктураОтбораНоменклатуры.Документ;
			СтрокаИсточниковНоменклатуры.РасчетыВозврат	 		= СтруктураОтбораНоменклатуры.РасчетыВозврат;
			СтрокаИсточниковНоменклатуры.ЗаТару    	  	   		= СтрокаСумм.ЗаТару;
			СтрокаИсточниковНоменклатуры.СтавкаНДС      		= СтрокаСумм.СтавкаНДС;
			СтрокаИсточниковНоменклатуры.СуммаНДС       		= СтрокаСумм.СуммаНДСВДокумент;
			СтрокаИсточниковНоменклатуры.Сумма		  			= СтрокаСумм.СуммаВДокумент;
			
			СтруктураОтбораДоговоров.Вставить("ЗаТару", 	СтрокаСумм.ЗаТару);
			СтруктураОтбораДоговоров.Вставить("СтавкаНДС",  СтрокаСумм.СтавкаНДС);
			
			СтрокиДоговоров = Договора.НайтиСтроки(СтруктураОтбораДоговоров);
			Если СтрокиДоговоров.Количество() = 0 Тогда
				СтрокаДоговоров = Договора.Добавить();
				Для каждого Параметр Из СтруктураОтбораДоговоров Цикл
					СтрокаДоговоров[Параметр.Ключ] = Параметр.Значение;
				КонецЦикла; 
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьТабличнуюЧастьВИтоговуюТаблицу(СтруктураОтбора, Таблица, ИмяТабличнойЧасти)
	
	КолонкиТабличнойЧасти = ЭтотОбъект.Метаданные().ТабличныеЧасти.Найти(ИмяТабличнойЧасти).Реквизиты;
	
	// выгружаем строки табличных частей документов в таблицу
	СтрокиПоДокументу = ЭтотОбъект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбора);
	Для каждого СтрокаТЧ Из СтрокиПоДокументу Цикл
		
		СтрокаИтоговойТаблицы = Таблица.Добавить();
		
		СтрокаИтоговойТаблицы.СуммаВДокумент = СтрокаТЧ.СуммаВДокумент;
		
		Если  КолонкиТабличнойЧасти.Найти("СтавкаНДС") = Неопределено 
		  ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.СтавкаНДС) Тогда
		  // если ставка в документе не заполнена считаем это ставкой НеНДС.
		  СтрокаИтоговойТаблицы.СтавкаНДС = Перечисления.СтавкиНДС.НеНДС;
		Иначе 
			СтрокаИтоговойТаблицы.СтавкаНДС = СтрокаТЧ.СтавкаНДС;
		КонецЕсли;
		
		Если  НЕ КолонкиТабличнойЧасти.Найти("СуммаНДСВДокумент") = Неопределено Тогда
			СтрокаИтоговойТаблицы.СуммаНДСВДокумент = СтрокаТЧ.СуммаНДСВДокумент;
		КонецЕсли; 
		
		Если ИмяТабличнойЧасти = "ВозвратнаяТара" Тогда
		  	СтрокаИтоговойТаблицы.ЗаТару = Истина;
		КонецЕсли;
	
	КонецЦикла; 

КонецПроцедуры

Функция ПолучитьДанныеЗаказаСУчетомКорректировок(ДокументСсылка, ИмяТабличнойЧасти = "Товары")
	
	// проверим были ли вообще корректировки по данной табличной части
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|   Ссылка
	|ИЗ
	|	Документ.КорректировкаЗаказаПокупателя."+ИмяТабличнойЧасти+" КАК КорректировкаЗаказаПокупателя
	|ГДЕ
	|	  КорректировкаЗаказаПокупателя.Ссылка.ЗаказПокупателя = &ТекущийДокумент
	|	И КорректировкаЗаказаПокупателя.Ссылка.Проведен        = Истина
	|";
	
	Если Запрос.Выполнить().Пустой() Тогда
		// нет корректировок - возвращаем сам документ
		Возврат ДокументСсылка;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ДокументСсылка);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МИНИМУМ(ЗапросСортировки.НомерСтроки)          КАК НомерСтроки,
	|	МИНИМУМ(ЗапросСортировки.НомерТЧ)              КАК НомерТЧ,
	|	ЗапросСоставаТЧ.Номенклатура                   КАК Номенклатура,
	|	ЗапросСоставаТЧ.Содержание					   КАК Содержание,
	|	МАКСИМУМ(ЗапросСоставаТЧ.Количество)           КАК Количество,
	|	ЗапросСоставаТЧ.ЕдиницаИзмерения			   КАК ЕдиницаИзмерения,
	|	ЗапросСоставаТЧ.ЕдиницаИзмерения.Коэффициент   КАК Коэффициент,
	|	ЗапросСоставаТЧ.ПроцентСкидкиНаценки           КАК ПроцентСкидкиНаценки,
	|	ЗапросСоставаТЧ.ПроцентАвтоматическихСкидок    КАК ПроцентАвтоматическихСкидок,
	|	МАКСИМУМ(ЗапросСоставаТЧ.СуммаНДС)             КАК СуммаНДС,
	|	ЗапросСоставаТЧ.Цена                           КАК Цена,
	|	МАКСИМУМ(ЗапросСоставаТЧ.Сумма)                КАК Сумма,
	|	ЗапросСоставаТЧ.ХарактеристикаНоменклатуры     КАК ХарактеристикаНоменклатуры,
	|	ЗапросСоставаТЧ.СтавкаНДС					   КАК СтавкаНДС
	|ИЗ
	|
	|(ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Содержание					    КАК Содержание,
	|	СУММА(ВложенныйЗапрос.Количество)               КАК Количество,
	|	ВложенныйЗапрос.ЕдиницаИзмерения                КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ПроцентСкидкиНаценки            КАК ПроцентСкидкиНаценки,
	|	ВложенныйЗапрос.ПроцентАвтоматическихСкидок     КАК ПроцентАвтоматическихСкидок,
	|	СУММА(ВложенныйЗапрос.СуммаНДС)                 КАК СуммаНДС,
	|	ВложенныйЗапрос.Цена                            КАК Цена,
	|	СУММА(ВложенныйЗапрос.Сумма)                    КАК Сумма,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры      КАК ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.СтавкаНДС      				    КАК СтавкаНДС
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|		ЗаказПокупателя.Номенклатура                КАК Номенклатура,
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) = "УСЛУГИ","
	|		ВЫБОР
	|			КОГДА ЗаказПокупателя.Содержание IS NULL ИЛИ ЗаказПокупателя.Содержание = """"
	|				ТОГДА ВЫРАЗИТЬ (ЗаказПокупателя.Номенклатура.НаименованиеПолное КАК Строка(1000))
	|			ИНАЧЕ ЗаказПокупателя.Содержание
	|		КОНЕЦ                                       КАК Содержание,"
	,"		NULL										КАК Содержание,") + "
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) = "ТОВАРЫ","
	|		ЗаказПокупателя.ЕдиницаИзмерения            КАК ЕдиницаИзмерения,"
	,"      ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) КАК ЕдиницаИзмерения,") + "
	
	|
	|		ЗаказПокупателя.Цена                        КАК Цена,
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) <> "ВОЗВРАТНАЯТАРА","
	|		ЗаказПокупателя.ПроцентСкидкиНаценки        КАК ПроцентСкидкиНаценки,
	|		ЗаказПокупателя.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,"
	,"      0									        КАК ПроцентСкидкиНаценки,
	|       0									        КАК ПроцентАвтоматическихСкидок,") + "
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) = "ТОВАРЫ","
	|		ЗаказПокупателя.ХарактеристикаНоменклатуры  КАК ХарактеристикаНоменклатуры,"
	,"      NULL									    КАК ХарактеристикаНоменклатуры,") + "
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) <> "ВОЗВРАТНАЯТАРА","
	|		ЗаказПокупателя.СуммаНДС        			КАК СуммаНДС,
	|		ЗаказПокупателя.СтавкаНДС       			КАК СтавкаНДС,"
	,"      0   									    КАК СуммаНДС,
	|       NULL									    КАК СтавкаНДС,") + "
	
	|		ЗаказПокупателя.Сумма                       КАК Сумма,
	|		ЗаказПокупателя.Количество                  КАК Количество
	
	|	ИЗ
	|		Документ.ЗаказПокупателя."+ИмяТабличнойЧасти+" КАК ЗаказПокупателя
	|
	|	ГДЕ
	|		ЗаказПокупателя.Ссылка = &ТекущийДокумент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		КорректировкаЗаказаПокупателя.Номенклатура                КАК Номенклатура,
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) = "УСЛУГИ","
	|		ВЫБОР
	|			КОГДА КорректировкаЗаказаПокупателя.Содержание IS NULL ИЛИ КорректировкаЗаказаПокупателя.Содержание = """"
	|				ТОГДА ВЫРАЗИТЬ (КорректировкаЗаказаПокупателя.Номенклатура.НаименованиеПолное КАК Строка(1000))
	|			ИНАЧЕ КорректировкаЗаказаПокупателя.Содержание
	|		КОНЕЦ                                       КАК Содержание,"
	,"		NULL										КАК Содержание,") + "
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) = "ТОВАРЫ","
	|		КорректировкаЗаказаПокупателя.ЕдиницаИзмерения            КАК ЕдиницаИзмерения,"
	,"      ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) КАК ЕдиницаИзмерения,") + "
	
	|
	|		КорректировкаЗаказаПокупателя.Цена                        КАК Цена,
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) <> "ВОЗВРАТНАЯТАРА","
	|		КорректировкаЗаказаПокупателя.ПроцентСкидкиНаценки        КАК ПроцентСкидкиНаценки,
	|		КорректировкаЗаказаПокупателя.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,"
	,"      0									        КАК ПроцентСкидкиНаценки,
	|       0									        КАК ПроцентАвтоматическихСкидок,") + "
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) = "ТОВАРЫ","
	|		КорректировкаЗаказаПокупателя.ХарактеристикаНоменклатуры  КАК ХарактеристикаНоменклатуры,"
	,"      NULL									    КАК ХарактеристикаНоменклатуры,") + "
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) <> "ВОЗВРАТНАЯТАРА","
	|		КорректировкаЗаказаПокупателя.СуммаНДС      КАК СуммаНДС,
	|		КорректировкаЗаказаПокупателя.СтавкаНДС     КАК СтавкаНДС,"
	,"      0   									    КАК СуммаНДС,
	|       NULL									    КАК СтавкаНДС,") + "
	
	|
	|		КорректировкаЗаказаПокупателя.Сумма          КАК Сумма,
	|		КорректировкаЗаказаПокупателя.Количество     КАК Количество
	
	|	ИЗ
	|		Документ.КорректировкаЗаказаПокупателя."+ИмяТабличнойЧасти+" КАК КорректировкаЗаказаПокупателя
	|
	|	ГДЕ
	|		КорректировкаЗаказаПокупателя.Ссылка.ЗаказПокупателя = &ТекущийДокумент
	|		И КорректировкаЗаказаПокупателя.Ссылка.Проведен      = Истина
	|) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Содержание,
	|	ВложенныйЗапрос.ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ПроцентСкидкиНаценки,
	|	ВложенныйЗапрос.ПроцентАвтоматическихСкидок,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.СтавкаНДС
	|) КАК ЗапросСоставаТЧ
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ (
	|	ВЫБРАТЬ
	|		ЗаказПокупателя.Номенклатура                КАК Номенклатура,
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) = "УСЛУГИ","
	|		ВЫБОР
	|			КОГДА ЗаказПокупателя.Содержание IS NULL ИЛИ ЗаказПокупателя.Содержание = """"
	|				ТОГДА ВЫРАЗИТЬ (ЗаказПокупателя.Номенклатура.НаименованиеПолное КАК Строка(1000))
	|			ИНАЧЕ ЗаказПокупателя.Содержание
	|		КОНЕЦ                                       КАК Содержание,"
	,"		NULL										КАК Содержание,") + "
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) = "ТОВАРЫ","
	|		ЗаказПокупателя.ЕдиницаИзмерения            КАК ЕдиницаИзмерения,"
	,"      ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) КАК ЕдиницаИзмерения,") + "
	
	|
	|		ЗаказПокупателя.Цена                        КАК Цена,
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) <> "ВОЗВРАТНАЯТАРА","
	|		ЗаказПокупателя.ПроцентСкидкиНаценки        КАК ПроцентСкидкиНаценки,
	|		ЗаказПокупателя.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,"
	,"      0									        КАК ПроцентСкидкиНаценки,
	|       0									        КАК ПроцентАвтоматическихСкидок,") + "
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) = "ТОВАРЫ","
	|		ЗаказПокупателя.ХарактеристикаНоменклатуры  КАК ХарактеристикаНоменклатуры,"
	,"      NULL									    КАК ХарактеристикаНоменклатуры,") + "
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) <> "ВОЗВРАТНАЯТАРА","
	|		ЗаказПокупателя.СтавкаНДС       			КАК СтавкаНДС,"
	,"      NULL									    КАК СтавкаНДС,") + "
	|
	|		ЗаказПокупателя.НомерСтроки                 КАК НомерСтроки,
	|		1                                           КАК НомерТЧ
	|	ИЗ
	|		Документ.ЗаказПокупателя."+ИмяТабличнойЧасти+" КАК ЗаказПокупателя
	|
	|	ГДЕ
	|		ЗаказПокупателя.Ссылка = &ТекущийДокумент
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		КорректировкаЗаказаПокупателя.Номенклатура                КАК Номенклатура,
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) = "УСЛУГИ","
	|		ВЫБОР
	|			КОГДА КорректировкаЗаказаПокупателя.Содержание IS NULL ИЛИ КорректировкаЗаказаПокупателя.Содержание = """"
	|				ТОГДА ВЫРАЗИТЬ (КорректировкаЗаказаПокупателя.Номенклатура.НаименованиеПолное КАК Строка(1000))
	|			ИНАЧЕ КорректировкаЗаказаПокупателя.Содержание
	|		КОНЕЦ                                       КАК Содержание,"
	,"		NULL										КАК Содержание,") + "
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) = "ТОВАРЫ","
	|		КорректировкаЗаказаПокупателя.ЕдиницаИзмерения            КАК ЕдиницаИзмерения,"
	,"      ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) КАК ЕдиницаИзмерения,") + "
	
	|
	|		КорректировкаЗаказаПокупателя.Цена                        КАК Цена,
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) <> "ВОЗВРАТНАЯТАРА","
	|		КорректировкаЗаказаПокупателя.ПроцентСкидкиНаценки        КАК ПроцентСкидкиНаценки,
	|		КорректировкаЗаказаПокупателя.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,"
	,"      0									        КАК ПроцентСкидкиНаценки,
	|       0									        КАК ПроцентАвтоматическихСкидок,") + "
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) = "ТОВАРЫ","
	|		КорректировкаЗаказаПокупателя.ХарактеристикаНоменклатуры  КАК ХарактеристикаНоменклатуры,"
	,"      NULL									    КАК ХарактеристикаНоменклатуры,") + "
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) <> "ВОЗВРАТНАЯТАРА","
	|		КорректировкаЗаказаПокупателя.СтавкаНДС       			КАК СтавкаНДС,"
	,"      NULL									    КАК СтавкаНДС,") + "
	|
	|		ВЫБОР
	|			КОГДА Заказ.НомерСтроки ЕСТЬ NULL
	|				ТОГДА КорректировкаЗаказаПокупателя.НомерСтроки
	|			ИНАЧЕ Заказ.НомерСтроки
	|		КОНЕЦ                                                    КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА Заказ.НомерСтроки ЕСТЬ NULL
	|				ТОГДА 2
	|			ИНАЧЕ 1
	|		КОНЕЦ                                                    КАК НомерТЧ
	|	ИЗ
	|		Документ.КорректировкаЗаказаПокупателя."+ИмяТабличнойЧасти+" КАК КорректировкаЗаказаПокупателя
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК Заказ
	|			ПО КорректировкаЗаказаПокупателя.Номенклатура = Заказ.Номенклатура
	|"
	
	+?(ВРЕГ(ИмяТабличнойЧасти) = "ТОВАРЫ","
	|			И КорректировкаЗаказаПокупателя.ХарактеристикаНоменклатуры = Заказ.ХарактеристикаНоменклатуры"
	,"") + "
	
	|			И (Заказ.Ссылка = &ТекущийДокумент)
	|
	|	ГДЕ
	|		КорректировкаЗаказаПокупателя.Ссылка.ЗаказПокупателя = &ТекущийДокумент
	|		И КорректировкаЗаказаПокупателя.Ссылка.Проведен      = Истина
	|) КАК ЗапросСортировки
	|
	|ПО
	|	  ЗапросСоставаТЧ.Номенклатура                = ЗапросСортировки.Номенклатура
	|	И ЗапросСоставаТЧ.Содержание                  = ЗапросСортировки.Содержание
	|	И ЗапросСоставаТЧ.ЕдиницаИзмерения            = ЗапросСортировки.ЕдиницаИзмерения
	|	И ЗапросСоставаТЧ.ПроцентСкидкиНаценки        = ЗапросСортировки.ПроцентСкидкиНаценки
	|	И ЗапросСоставаТЧ.ПроцентАвтоматическихСкидок = ЗапросСортировки.ПроцентАвтоматическихСкидок
	|	И ЗапросСоставаТЧ.ХарактеристикаНоменклатуры  = ЗапросСортировки.ХарактеристикаНоменклатуры
	|	И ЗапросСоставаТЧ.Цена                        = ЗапросСортировки.Цена
	|	И ЗапросСоставаТЧ.СтавкаНДС                   = ЗапросСортировки.СтавкаНДС
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапросСоставаТЧ.Номенклатура,
	|	ЗапросСоставаТЧ.Содержание,
	|	ЗапросСоставаТЧ.ЕдиницаИзмерения,
	|	ЗапросСоставаТЧ.ПроцентСкидкиНаценки,
	|	ЗапросСоставаТЧ.ПроцентАвтоматическихСкидок,
	|	ЗапросСоставаТЧ.Цена,
	|	ЗапросСоставаТЧ.СтавкаНДС,
	|	ЗапросСоставаТЧ.ХарактеристикаНоменклатуры
	|";
	ЗапросТЧ = Запрос.Выполнить().Выгрузить();
	
	// Уничтожим нумерацию строк для товаров, введенных корректировками
	Для Каждого СтрокаТаблицы Из ЗапросТЧ Цикл
		Если СтрокаТаблицы.НомерТЧ = 2 Тогда
			СтрокаТаблицы.НомерСтроки = 1;
		КонецЕсли;
	КонецЦикла;
	
	// Сгруппируем строки, чтобы не было одинаковых строк, введенных разными документами корректировки
	ЗапросТЧ.Свернуть("НомерСтроки, НомерТЧ, Номенклатура, Содержание, ЕдиницаИзмерения,  ХарактеристикаНоменклатуры, Цена, Коэффициент, СтавкаНДС, ПроцентСкидкиНаценки, ПроцентАвтоматическихСкидок", "Количество, СуммаНДС, Сумма");
	ЗапросТЧ.Сортировать("НомерТЧ, НомерСтроки, Содержание");
	
	ЗапросТЧ.Колонки.Добавить("КоличествоМест");
	ЗапросТЧ.Колонки.Добавить("ЕдиницаИзмеренияМест");
	
	Возврат Новый Структура(ИмяТабличнойЧасти,ЗапросТЧ);
	
КонецФункции

Процедура ЗаполнитьТабличнуюЧасть(ИмяТабличнойЧастиДокумента, СтруктураОтбора)
	Перем ИмяТабличнойЧастиОбработки;
	
	Документ = СтруктураОтбора.Документ;
	
	ИмяТабличнойЧастиОбработки = ИмяТабличнойЧастиДокумента;
	
	Если Документ.Метаданные().ТабличныеЧасти.Найти(ИмяТабличнойЧастиДокумента) = Неопределено Тогда
		// нет такой табличной части
		Возврат
	КонецЕсли;
	
	КолокниТЧОбработки = ЭтотОбъект.Метаданные().ТабличныеЧасти.Найти(ИмяТабличнойЧастиОбработки).Реквизиты;		
	КолокниТЧДокумента = Документ.Метаданные().ТабличныеЧасти.Найти(ИмяТабличнойЧастиДокумента).Реквизиты;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Документ = ПолучитьДанныеЗаказаСУчетомКорректировок(Документ, ИмяТабличнойЧастиДокумента);	
	КонецЕсли;
	
	Для каждого СтрокаТЧДокумента Из Документ[ИмяТабличнойЧастиДокумента] Цикл 
		
		СтрокаТЧОбработки = ЭтотОбъект[ИмяТабличнойЧастиОбработки].Добавить();
		
		Для каждого Колонка Из КолокниТЧОбработки Цикл
			
			ИмяКолонки = Колонка.Имя; 
			
			Если ИмяКолонки = "Документ" Тогда
				
				СтрокаТЧОбработки[ИмяКолонки] = СтруктураОтбора.Документ;	
				
			ИначеЕсли ИмяКолонки = "Дата" Тогда
				
				СтрокаТЧОбработки[ИмяКолонки] = СтруктураОтбора.Дата;	
				
			ИначеЕсли ИмяКолонки = "СуществующийДокумент" Тогда
				
				СтрокаТЧОбработки[ИмяКолонки] = СтруктураОтбора.СуществующийДокумент;	
				
			ИначеЕсли ИмяКолонки = "РасчетыВозврат" Тогда
				
				СтрокаТЧОбработки[ИмяКолонки] = СтруктураОтбора.РасчетыВозврат;	
				
			ИначеЕсли ИмяКолонки = "ДоговорКонтрагента" Тогда
				
				СтрокаТЧОбработки[ИмяКолонки] = СтруктураОтбора.ДоговорКонтрагента;	
			ИначеЕсли ИмяКолонки = "КодУКТВЭД" Тогда
				
				Если  НЕ КолокниТЧДокумента.Найти("КодУКТВЭД") = Неопределено Тогда
					СтрокаТЧОбработки.КодУКТВЭД = СтрокаТЧДокумента.КодУКТВЭД;
					
				ИначеЕсли НЕ КолокниТЧДокумента.Найти("Номенклатура") = Неопределено Тогда
					
					НоменклатураГТДНоменклатуры = СтрокаТЧДокумента.Номенклатура.НоменклатураГТД;
					
					Если НЕ КолокниТЧДокумента.Найти("ХарактеристикаНоменклатуры") = Неопределено Тогда
					
						НоменклатураГТДХарактеристики = СтрокаТЧДокумента.ХарактеристикаНоменклатуры.НоменклатураГТД;
						
						Если ЗначениеЗаполнено(НоменклатураГТДХарактеристики) Тогда
							ЗаполнитьУКТВЭДВСтроке(СтрокаТЧОбработки,НоменклатураГТДХарактеристики);
						Иначе
							ЗаполнитьУКТВЭДВСтроке(СтрокаТЧОбработки,НоменклатураГТДНоменклатуры);
						КонецЕсли;
					Иначе
						ЗаполнитьУКТВЭДВСтроке(СтрокаТЧОбработки,НоменклатураГТДНоменклатуры);
					КонецЕсли;	
					
				КонецЕсли;	
			
			ИначеЕсли ИмяКолонки = "НомерГТД" Тогда
				
				Если  НЕ КолокниТЧДокумента.Найти("НомерГТД") = Неопределено Тогда
					
					СтрокаТЧОбработки.НомерГТД = СтрокаТЧДокумента.НомерГТД;
					
				ИначеЕсли НЕ КолокниТЧДокумента.Найти("Номенклатура") = Неопределено Тогда
					
					НоменклатураГТДНоменклатуры = СтрокаТЧДокумента.Номенклатура.НоменклатураГТД;	
					
					Если НЕ КолокниТЧДокумента.Найти("ХарактеристикаНоменклатуры") = Неопределено Тогда
					
						НоменклатураГТДХарактеристики = СтрокаТЧДокумента.ХарактеристикаНоменклатуры.НоменклатураГТД;
						
						Если ЗначениеЗаполнено(НоменклатураГТДХарактеристики) Тогда
							ЗаполнитьНомерГТДВСтроке(СтрокаТЧОбработки,НоменклатураГТДХарактеристики);
						Иначе
							ЗаполнитьНомерГТДВСтроке(СтрокаТЧОбработки,НоменклатураГТДНоменклатуры);
						КонецЕсли;
					Иначе
						ЗаполнитьНомерГТДВСтроке(СтрокаТЧОбработки,НоменклатураГТДНоменклатуры);
					КонецЕсли;	
					
				КонецЕсли;	
			
			ИначеЕсли НЕ КолокниТЧДокумента.Найти(ИмяКолонки) = Неопределено Тогда
				
				СтрокаТЧОбработки[ИмяКолонки] = СтрокаТЧДокумента[ИмяКолонки]
				
			ИначеЕсли Прав(ИмяКолонки, 9) = "ВДокумент" Тогда
				
				ИмяКолонкиИсходногоЗначения = Лев(ИмяКолонки, СтрДлина(ИмяКолонки) - 9); 
				
				Если  НЕ КолокниТЧДокумента.Найти(ИмяКолонкиИсходногоЗначения) = Неопределено Тогда
					
					СтрокаТЧОбработки[ИмяКолонки] = СтрокаТЧДокумента[ИмяКолонкиИсходногоЗначения];
					
				КонецЕсли;

			КонецЕсли;
		
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗаполнитьУКТВЭДВСтроке(СтрокаТабличнойЧасти,ЗначениеНоменклатураГТД)
	
	Если ТипЗнч(ЗначениеНоменклатураГТД) = Тип("СправочникСсылка.НоменклатураГТД") Тогда
		СтрокаТабличнойЧасти.КодУКТВЭД = ЗначениеНоменклатураГТД.КодУКТВЭД;
	ИначеЕсли ТипЗнч(ЗначениеНоменклатураГТД) = Тип("СправочникСсылка.КлассификаторУКТВЭД") Тогда
		СтрокаТабличнойЧасти.КодУКТВЭД = ЗначениеНоменклатураГТД;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьНомерГТДВСтроке(СтрокаТабличнойЧасти,НоменклатураГТДНоменклатуры)
	
	Если ТипЗнч(НоменклатураГТДНоменклатуры) = Тип("СправочникСсылка.НоменклатураГТД") Тогда
		СтрокаТабличнойЧасти.НомерГТД  = НоменклатураГТДНоменклатуры.НомерГТД;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВозможныеВидыОпераций(Соответствие,  РасчетыВозврат)
	
	Соответствие.Очистить();
	
	ВидыОперацийНалоговаяНакладная = Перечисления.ВидыОперацийНалоговаяНакладная;
	ВидыОперацийПриложение2		   = Перечисления.ВидыОперацийПриложение2КНалоговойНакладной;
	
	Для каждого СтавкаНДС Из Перечисления.СтавкиНДС Цикл
		
		Если РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
			Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				ВидОперации = ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации;
			ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НеНДС Тогда
				ВидОперации = ВидыОперацийНалоговаяНакладная.НеНДСОперации;
			Иначе
				//0% или 20% - один вид операции
				ВидОперации = ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации;
			КонецЕсли;
		Иначе
			Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				ВидОперации = ВидыОперацийПриложение2.ОсвобожденныеОперацииВозврат;
			ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НеНДС Тогда
				ВидОперации = ВидыОперацийПриложение2.НеНДСОперацииВозврат;
			Иначе
				//0% или 20% - один вид операции
				ВидОперации = ВидыОперацийПриложение2.ОблагаемыеОперацииВозврат;
			КонецЕсли;
		КонецЕсли;	
		
		Соответствие.Вставить(СтавкаНДС, ВидОперации);
	КонецЦикла;
	
КонецФункции // ПолучитьВозможныеВидыОпераций(РасчетыВозврат, ВидДокумента)()

Функция ОтобратьСтрокиТабличнойЧасти(ИмяТабличнойЧасти, СтавкаНДС=Неопределено, СтруктураОтбораДанных)
	
	НайденныеСтроки = ЭтотОбъект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураОтбораДанных);
	
	Сч = 0;
	Пока Сч <= НайденныеСтроки.Количество()-1 Цикл
		ТекущаяСтрока = НайденныеСтроки.Получить(Сч);
		Если ТекущаяСтрока.КоличествоВДокумент = 0
			ИЛИ  (НЕ СтавкаНДС=Неопределено И НЕ ТекущаяСтрока.СтавкаНДС = СтавкаНДС) Тогда
			НайденныеСтроки.Удалить(Сч);	
		Иначе
			Сч = Сч + 1;
		КонецЕсли; 
	КонецЦикла;
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		МассивОтобранныхСтрок = Неопределено;
	Иначе
		МассивОтобранныхСтрок = НайденныеСтроки;
	КонецЕсли;
	
	Возврат МассивОтобранныхСтрок;
	
КонецФункции

Процедура СформироватьНалоговыеДокументы() Экспорт
	
	СписокСформированныхДокументов.Очистить();
	
	ТаблицаДанных = Новый ТаблицаЗначений();
	ТаблицаДанных.Колонки.Добавить("СуществующийДокумент",	Новый ОписаниеТипов("Булево"));
	ТаблицаДанных.Колонки.Добавить("Дата", 					Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("ДоговорКонтрагента", 	Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаДанных.Колонки.Добавить("РасчетыВозврат", 		Новый ОписаниеТипов("ПеречислениеСсылка.РасчетыВозврат"));
	ТаблицаДанных.Колонки.Добавить("ВалютаДокумента", 		Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаДанных.Колонки.Добавить("УчитыватьНДС", 			Новый ОписаниеТипов("Булево"));
	ТаблицаДанных.Колонки.Добавить("СуммаВключаетНДС", 		Новый ОписаниеТипов("Булево"));
	ТаблицаДанных.Колонки.Добавить("ДокументОснование",		Новый ОписаниеТипов(ДопустимыеТипыДокументов));
	ТаблицаДанных.Колонки.Добавить("СтруктураДанных", 		Новый ОписаниеТипов("Структура"));
	
	
	// Соберем все необходимые данные для формирвания документов
	СтруктураОтбора = Новый Структура("Дата, СуществующийДокумент, ДоговорКонтрагента, РасчетыВозврат, Документ");
	КопияИсточникиНоменклатуры = ИсточникиНоменклатуры.Выгрузить();
	КопияИсточникиНоменклатуры.Свернуть("СуществующийДокумент, Дата, ДоговорКонтрагента, РасчетыВозврат, Документ","");
	Для каждого СтрокаДокументов Из КопияИсточникиНоменклатуры Цикл
		
		Если СтрокаДокументов.СуществующийДокумент  Тогда
			
			//это информация о проведенном налоговом документе
			Продолжить;	
			
		КонецЕсли;
		
		// Обновим структуру отбора
		СтруктураОтбора.Дата			 	= СтрокаДокументов.Дата;
		СтруктураОтбора.СуществующийДокумент= Ложь;
		СтруктураОтбора.ДоговорКонтрагента 	= СтрокаДокументов.ДоговорКонтрагента;
		СтруктураОтбора.РасчетыВозврат 		= СтрокаДокументов.РасчетыВозврат;
		СтруктураОтбора.Документ			= СтрокаДокументов.Документ;
			
		ПолучитьДанныеДляФормированияНалоговыхДокументов(ТаблицаДанных, СтруктураОтбора);
			
	КонецЦикла; 
	
	//приступаем собственно к формированию и заполнению налоговых документов
	ТаблицаДанных.Сортировать("Дата,ДоговорКонтрагента,РасчетыВозврат,ВалютаДокумента,УчитыватьНДС,СуммаВключаетНДС");
	
	ТекущийДата					= Неопределено;
	ТекущийДоговорКонтрагента	= Неопределено;
	ТекущийРасчетыВозврат		= Неопределено;
	ТекущийВалютаДокумента		= Неопределено;
	ТекущийУчитыватьНДС			= Неопределено;
	ТекущийСуммаВключаетНДС		= Неопределено;
	
	// ставкаНДС <-> ВидОперации
	ВозможныеВидыОпераций= Новый Соответствие();
	// ВидОперации <-> Документ
	НалоговыеДокументы 	 = Новый Соответствие();
	
	фНужныНовыеДокументы = Истина;
	Для каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
		
		Если НЕ(  СтрокаТаблицыДанных.Дата			 		= ТекущийДата  
				И СтрокаТаблицыДанных.ДоговорКонтрагента	= ТекущийДоговорКонтрагента
			    И СтрокаТаблицыДанных.РасчетыВозврат 		= ТекущийРасчетыВозврат
			    И СтрокаТаблицыДанных.ВалютаДокумента 		= ТекущийВалютаДокумента
			    И СтрокаТаблицыДанных.УчитыватьНДС		 	= ТекущийУчитыватьНДС
			    И СтрокаТаблицыДанных.СуммаВключаетНДС 		= ТекущийСуммаВключаетНДС) Тогда
				
			фНужныНовыеДокументы = Истина;
	
			// Запомним новые текущие значения
			ТекущийДата 				= СтрокаТаблицыДанных.Дата;
			ТекущийДоговорКонтрагента 	= СтрокаТаблицыДанных.ДоговорКонтрагента;
			ТекущийРасчетыВозврат 		= СтрокаТаблицыДанных.РасчетыВозврат;
			ТекущийВалютаДокумента 		= СтрокаТаблицыДанных.ВалютаДокумента;
			ТекущийУчитыватьНДС 		= СтрокаТаблицыДанных.УчитыватьНДС;
			ТекущийСуммаВключаетНДС 	= СтрокаТаблицыДанных.СуммаВключаетНДС;
			
		ИначеЕсли НЕ  ФормироватьИтоговыеНакладные 
			      ИЛИ СтрокаТаблицыДанных.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат Тогда	
			   
		   //Изменился документ основание (либо формруются приложения 2, нужны новые документы
			фНужныНовыеДокументы = Истина;
			
		Иначе 
			
			// в итоговые налоговые накладные будем заносить данные из очередного документа-основания
			фНужныНовыеДокументы = Ложь;
			
		КонецЕсли;	
		
		Если фНужныНовыеДокументы  Тогда
			//Запишем старые, сформированные документы
			
			ЗаписатьПровестиНапечататьНалоговыеДокументы(НалоговыеДокументы);
			
			// "обнулим" документы
			НалоговыеДокументы.Очистить();
			ПолучитьВозможныеВидыОпераций(ВозможныеВидыОпераций, СтрокаТаблицыДанных.РасчетыВозврат);			
			Для каждого ВидОперации Из ВозможныеВидыОпераций Цикл
				Если СтрокаТаблицыДанных.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты Тогда
					НалоговыеДокументы.Вставить(ВидОперации.Значение, Документы.НалоговаяНакладная);
				Иначе
					НалоговыеДокументы.Вставить(ВидОперации.Значение, Документы.Приложение2КНалоговойНакладной);	
			    КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		СтруктураДанных = СтрокаТаблицыДанных.СтруктураДанных;
		
		ТаблицаВозвратнойТары = Неопределено;
		НужноДобавитьВозвратнуюТару = СтруктураДанных.Свойство("ВозвратнаяТара",ТаблицаВозвратнойТары);
		
		Для каждого СтавкаНДС Из Перечисления.СтавкиНДС Цикл
			
			СтруктураТаблиц = Неопределено;
			Если СтруктураДанных.Свойство(ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(СтавкаНДС), СтруктураТаблиц) Тогда
				// Имеются таблицы с указанной ставкой НДС
				
				ВидОперации = ВозможныеВидыОпераций.Получить(СтавкаНДС);
				НалоговыйДокумент = НалоговыеДокументы.Получить(ВидОперации);
				Если    ТипЗнч(НалоговыйДокумент) = Тип(Документы.НалоговаяНакладная)
					ИЛИ ТипЗнч(НалоговыйДокумент) = Тип(Документы.Приложение2КНалоговойНакладной) Тогда
					// документ-объект с таким видом операции еще не сформирован
					НалоговыйДокумент = НалоговыйДокумент.СоздатьДокумент();
					
					ЗаполнитьШапкуНалоговогоДокумента(НалоговыйДокумент, ВидОперации, СтрокаТаблицыДанных);
				КонецЕсли;
				
				Для каждого ТабличнаяЧасть Из СтруктураТаблиц Цикл
					
					ДобавитьСтрокиВТабличнуюЧастьНалоговогоДокумента(НалоговыйДокумент, ТабличнаяЧасть.Ключ, ТабличнаяЧасть.Значение, СтрокаТаблицыДанных);
				
				КонецЦикла;
				
				// добавим в первый формируемый документ всю возвратную тару
				Если НужноДобавитьВозвратнуюТару Тогда
					ДобавитьСтрокиВТабличнуюЧастьНалоговогоДокумента(НалоговыйДокумент, "ВозвратнаяТара", ТаблицаВозвратнойТары, СтрокаТаблицыДанных);	
					НужноДобавитьВозвратнуюТару = Ложь;
				КонецЕсли;
					
				НалоговыеДокументы.Вставить(ВозможныеВидыОпераций.Получить(СтавкаНДС), НалоговыйДокумент); 
			КонецЕсли;
		КонецЦикла; 
		
		Если  НужноДобавитьВозвратнуюТару Тогда
			// в налоговый документ должна попасть только тара, табличные части не заполнены
			// Вид операции в документе особого значения не имеет
			
			СтавкаНДСДляТары 	= Перечисления.СтавкиНДС.НДС20; 
			ВидОперацииДляТары  = ВозможныеВидыОпераций.Получить(СтавкаНДСДляТары);
			
			НалоговыйДокумент = НалоговыеДокументы.Получить(ВидОперацииДляТары);
			//гарантинровано документ-объект еще не создан
			НалоговыйДокумент = НалоговыйДокумент.СоздатьДокумент();
	
			ЗаполнитьШапкуНалоговогоДокумента(НалоговыйДокумент, ВидОперацииДляТары, СтрокаТаблицыДанных);
    		ДобавитьСтрокиВТабличнуюЧастьНалоговогоДокумента(НалоговыйДокумент, "ВозвратнаяТара", ТаблицаВозвратнойТары, СтрокаТаблицыДанных);
			НалоговыеДокументы.Вставить(ВидОперацииДляТары, НалоговыйДокумент); 
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Запишем последние сформированные документы
	ЗаписатьПровестиНапечататьНалоговыеДокументы(НалоговыеДокументы);
	
КонецПроцедуры

Процедура ЗаполнитьШапкуНалоговогоДокумента(НалоговыйДокумент, ВидОперации, Данные)
	
	Если НЕ РежимПоДатам Тогда
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			ТекущаяРабочаяДата = ОбщегоНазначения.ПолучитьРабочуюДату();
			Если НачалоДня(ТекущаяРабочаяДата) = НачалоДня(ТекущаяДата())  Тогда
				ДатаДокумента = ТекущаяДата();	
			Иначе
				ДатаДокумента = ТекущаяРабочаяДата;	
			КонецЕсли; 
		Иначе
			ДатаДокумента = Дата;	
		КонецЕсли;
	Иначе	
		// время установим на  12 часов
		ДатаДокумента = Данные.Дата + 43200;	
	КонецЕсли;
	НалоговыйДокумент.Дата = ДатаДокумента;
	
	НалоговыйДокумент.АвторасчетНДС = Ложь;
	НалоговыйДокумент.ВалютаДокумента 	= Данные.ВалютаДокумента;
	НалоговыйДокумент.ВидОперации 		= ВидОперации;
	НалоговыйДокумент.ДоговорКонтрагента= Данные.ДоговорКонтрагента;
	
	Если ТипЗнч(ВидОперации) = Тип("ПеречислениеСсылка.ВидыОперацийНалоговаяНакладная") Тогда
		// НалоговаяНакладная
		Если НЕ ФормироватьИтоговыеНакладные Тогда
			НалоговыйДокумент.ДокументОснование = Данные.ДокументОснование;
		Иначе
			НалоговыйДокумент.Сводная = Истина;	
		КонецЕсли;
	Иначе
		// Приложение 2
		НалоговыйДокумент.НалоговаяНакладная = Данные.ДокументОснование;
		НалоговыйДокумент.СпецРежимНалогообложения 	   = НалоговыйДокумент.НалоговаяНакладная.СпецРежимНалогообложения;
		НалоговыйДокумент.ТипПричиныНевыдачиПокупателю = НалоговыйДокумент.НалоговаяНакладная.ТипПричиныНевыдачиПокупателю;
	КонецЕсли; 
	НалоговыйДокумент.ДоговорКонтрагента = Данные.ДоговорКонтрагента;
	НалоговыйДокумент.Контрагент = Данные.ДоговорКонтрагента.Владелец;
	
	НалоговыйДокумент.ЗаполнитьУсловиеПродажи();
	Если ЗначениеЗаполнено(НалоговыйДокумент.ДоговорКонтрагента.ФормаРасчетов) Тогда
	    НалоговыйДокумент.ФормаРасчетов = НалоговыйДокумент.ДоговорКонтрагента.ФормаРасчетов;  	
		Если НалоговыйДокумент.Дата >= '2014-03-01' И НалоговыйДокумент.Дата < '2015-01-01' Тогда
			Если НалоговыйДокумент.ФормаРасчетов = "Оплата з поточного рахунка" Тогда
				НалоговыйДокумент.ФормаРасчетов = "Оплата з поточного рахунку";
			КонецЕсли;
		ИначеЕсли НалоговыйДокумент.Дата >= '2015-01-01' Тогда
			Если НалоговыйДокумент.ФормаРасчетов = "Оплата з поточного рахунку" Тогда
				НалоговыйДокумент.ФормаРасчетов = "Оплата з поточного рахунка";
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли НалоговыйДокумент.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
		НалоговыйДокумент.ФормаРасчетов = "Бартер";  	
	Иначе		
		//НалоговыйДокумент.ФормаРасчетов = "Оплата з розрахункового рахунку";  
		Если ДатаДокумента >='20110110' Тогда
		НалоговыйДокумент.ФормаРасчетов = "Оплата з поточного рахунку";                                                 
		Если глЗначениеПеременной("ДатаВступленияВСилуПриказа1379") <= ДатаДокумента И ДатаДокумента < '2014-03-01' ИЛИ ДатаДокумента >= '2015-01-01' Тогда
				НалоговыйДокумент.ФормаРасчетов = "Оплата з поточного рахунка";
			КонецЕсли;
		Иначе	
			НалоговыйДокумент.ФормаРасчетов = "Оплата з розрахункового рахунку";
		КонецЕсли;  
	КонецЕсли;
	
	НалоговыйДокумент.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
	НалоговыйДокумент.КтоВыписалНалоговуюНакладную = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "КтоВыписалНалоговуюНакладную");
	
	СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(НалоговыйДокумент.ДоговорКонтрагента.ВалютаВзаиморасчетов, НалоговыйДокумент.Дата);
	НалоговыйДокумент.КурсВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Курс;
	НалоговыйДокумент.КратностьВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Кратность;
	
	НалоговыйДокумент.Организация 	   = Организация;
	Если ТипЗнч(ВидОперации) = Тип("ПеречислениеСсылка.ВидыОперацийНалоговаяНакладная") Тогда
		НалоговыйДокумент.ОбособленноеПодразделение = ОбособленноеПодразделение;
	КонецЕсли;
	НалоговыйДокумент.СуммаВключаетНДС = Данные.СуммаВключаетНДС;
	НалоговыйДокумент.УчитыватьНДС 	   = Истина;
	Если ЗначениеЗаполнено(Данные.ДокументОснование) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("ТипЦен", Данные.ДокументОснование.Метаданные()) Тогда
			НалоговыйДокумент.ТипЦен = Данные.ДокументОснование.ТипЦен;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НалоговыйДокумент.ТипЦен) Тогда
	   НалоговыйДокумент.ТипЦен = Данные.ДоговорКонтрагента.ТипЦен;
	КонецЕсли; 
	

	НалоговыйДокумент.ЗаполнитьВидДоговора();
	Если ТипЗнч(ВидОперации) = Тип("ПеречислениеСсылка.ВидыОперацийНалоговаяНакладная") Тогда
		НалоговыйДокумент.УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокиВТабличнуюЧастьНалоговогоДокумента(Документ, ИмяТабличнойЧасти, СтрокиТабличнойЧастиОбработки, Данные)
	
	ИмяДокумента 		  	= Документ.Метаданные().ПолноеИмя();
	Если Данные.ДокументОснование = Неопределено Тогда
		ИмяДокументаОснования = Неопределено;
	Иначе
		ИмяДокументаОснования 	= Данные.ДокументОснование.Метаданные().ПолноеИмя();
		ДатаОтгрузкиОплаты 		= Данные.ДокументОснование.Дата;	
	КонецЕсли;
	
	КолонкиТЧОбработки 		= ЭтотОбъект.Метаданные().ТабличныеЧасти.Найти(ИмяТабличнойЧасти).Реквизиты;		
	КолонкиТЧДокумента 		= Документ.Метаданные().ТабличныеЧасти.Найти(ИмяТабличнойЧасти).Реквизиты;
	
	Для каждого СтрокаТЧОбработки Из СтрокиТабличнойЧастиОбработки Цикл
		
		СтрокаТЧДокумента = Документ[ИмяТабличнойЧасти].Добавить();
		
		Для Каждого КолонкаТЧДокумента Из КолонкиТЧДокумента Цикл
			
			ИмяКолонкиТЧДокумента = КолонкаТЧДокумента.Имя;
			
			// проверим, имеется ли колонка в ТЧ Обоработки с измененным значением 
			КолонкаВДокумент = КолонкиТЧОбработки.Найти(ИмяКолонкиТЧДокумента + "ВДокумент");
			Если НЕ КолонкаВДокумент = Неопределено Тогда
				ИмяКолонкиВДокумент = КолонкаВДокумент.Имя;
				Если ИмяДокумента = "Документ.НалоговаяНакладная" Тогда
					// колона ТЧ обработки с названием "..ВДокумент" должна попасть в колоку докумета без этого суффикса. 
					СтрокаТЧДокумента[ИмяКолонкиТЧДокумента] = СтрокаТЧОбработки[ИмяКолонкиВДокумент];
				Иначе // Документ.Приложение2КНалоговойНакладной
					// перенесем значение 
					СтрокаТЧДокумента[ИмяКолонкиТЧДокумента] = СтрокаТЧОбработки[ИмяКолонкиТЧДокумента];	
					
					// добавим значения по корректировке
					Если ИмяКолонкиВДокумент = "КоличествоВДокумент" Тогда
						
						СтрокаТЧДокумента["ИзменениеКоличества"]= - СтрокаТЧОбработки[ИмяКолонкиВДокумент];		
						
					ИначеЕсли ИмяКолонкиВДокумент = "СуммаВДокумент" Тогда
						
						СтрокаТЧДокумента["ИзменениеСуммы"]		= - СтрокаТЧОбработки[ИмяКолонкиВДокумент];		
						
					ИначеЕсли ИмяКолонкиВДокумент = "СуммаНДСВДокумент" Тогда
						
						СтрокаТЧДокумента["ИзменениеСуммыНДС"]	= - СтрокаТЧОбработки[ИмяКолонкиВДокумент];
						
					КонецЕсли;
				КонецЕсли;
			Иначе 
				// перенесем колонки с одинаковыми именами
				Если НЕ КолонкиТЧОбработки.Найти(ИмяКолонкиТЧДокумента) = Неопределено Тогда
					СтрокаТЧДокумента[ИмяКолонкиТЧДокумента] = СтрокаТЧОбработки[ИмяКолонкиТЧДокумента];
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		// Одноименные и связанные с ними колонки перенесли. 
		// Теперь заполним специфические колонки для каждой табличной части
		Документ. ЗаполнитьСтатьюКнигиПродаж(СтрокаТЧДокумента, ИмяТабличнойЧасти); 
		
		Если ИмяДокумента = "Документ.НалоговаяНакладная" Тогда
			
			// Дата отгрузки (оплаты) = дата документа-основания (кроме Счета)
			Если НЕ ИмяДокументаОснования = "Документ.СчетНаОплатуПокупателю"
			   И НЕ ИмяДокументаОснования = "Документ.ЗаказПокупателя"
			   И НЕ КолонкиТЧДокумента.Найти("ДатаОтгрузкиОплаты") = Неопределено Тогда
				СтрокаТЧДокумента["ДатаОтгрузкиОплаты"] = ДатаОтгрузкиОплаты;
			КонецЕсли;
			
			Если ИмяТабличнойЧасти = "Услуги" Тогда			
				СтрокаТЧДокумента["Товаротранспортная"] = СтрокаТЧОбработки["Номенклатура"].ТранспортнаяУслуга;
			КонецЕсли;
			
		Иначе// Документ.Приложение2КНалоговойНакладной
			
			Если НЕ КолонкиТЧДокумента.Найти("Причина") = Неопределено Тогда
				СтрокаТЧДокумента["Причина"] = "Повернення";
			КонецЕсли;
					
			Если НЕ КолонкиТЧДокумента.Найти("ДатаКорректировки") = Неопределено Тогда
				СтрокаТЧДокумента["ДатаКорректировки"] = Дата;
			КонецЕсли;
			
		КонецЕсли;			
			
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПодвалНалоговогоДокумента(НалоговыйДокумент)
	
	// Заполним ЛьготуНДС в документе
	Если  ТипЗнч(НалоговыйДокумент) = Тип("ДокументОбъект.НалоговаяНакладная") Тогда
		НалоговыйДокумент.ОбновитьЗначениеЛьготыНДС(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьПровестиНапечататьНалоговыеДокументы(НалоговыеДокументы)
	
	Для каждого ЭлементСоответствия Из НалоговыеДокументы Цикл
		
		НалоговыйДокумент = ЭлементСоответствия.Значение;
		Если  НЕ (ТипЗнч(НалоговыйДокумент) = Тип("ДокументОбъект.НалоговаяНакладная")
			  ИЛИ ТипЗнч(НалоговыйДокумент) = Тип("ДокументОбъект.Приложение2КНалоговойНакладной")) Тогда
			  Продолжить;
		КонецЕсли;
		
		ЗаполнитьПодвалНалоговогоДокумента(НалоговыйДокумент);
		
		Если глЗначениеПеременной("ДатаНачалаИспользованияФормыННПоЛекарствам") > НалоговыйДокумент.Дата  Тогда
			НалоговыйДокумент7 = НалоговыйДокумент.ВыделитьСтавкуНДС7ВОтдельныйДокумент(Ложь);
		Иначе
			НалоговыйДокумент7 = Неопределено;
		КонецЕсли;
		
		Если НЕ мНеЗаписыватьДокументы Тогда
			НалоговыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			Если НЕ НалоговыйДокумент7 = Неопределено Тогда
				НалоговыйДокумент7.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;
		
		Если  ПроводитьДокументы Тогда
			Попытка
				НалоговыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
			Если НЕ НалоговыйДокумент7 = Неопределено Тогда
				Попытка
					НалоговыйДокумент7.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
#Если Клиент Тогда		
		Если ПечататьДокументы Тогда
			Если мНеЗаписыватьДокументы Тогда
				// придется записать
				НалоговыйДокумент.Записать(РежимЗаписиДокумента.Запись);
				Если НЕ НалоговыйДокумент7 = Неопределено Тогда
					НалоговыйДокумент7.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
			КонецЕсли;
			
			УниверсальныеМеханизмы.НапечататьДокументПоУмолчанию(НалоговыйДокумент, ПечататьДокументыНаПринтер);
			Если НЕ НалоговыйДокумент7 = Неопределено Тогда
				УниверсальныеМеханизмы.НапечататьДокументПоУмолчанию(НалоговыйДокумент7, ПечататьДокументыНаПринтер);
			КонецЕсли;
		КонецЕсли;
#КонецЕсли

		Если ОткрыватьДокументы Тогда
			ФормаДокумента = НалоговыйДокумент.ПолучитьФорму();
			ФормаДокумента.Открыть();
			Если НЕ НалоговыйДокумент7 = Неопределено Тогда
				ФормаДокумента = НалоговыйДокумент7.ПолучитьФорму();
				ФормаДокумента.Открыть();
			КонецЕсли;
		КонецЕсли;
		
		СписокСформированныхДокументов.Добавить(НалоговыйДокумент.Ссылка);
		Если НЕ НалоговыйДокумент7 = Неопределено Тогда
			СписокСформированныхДокументов.Добавить(НалоговыйДокумент7.Ссылка);
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПолучитьДанныеДляФормированияНалоговыхДокументов(ТаблицаДанных, СтруктураОтбораДанных)

	Перем ТекущийДокумент;
	
	СтруктураДанных = Новый Структура();
	
	Если НЕ СтруктураОтбораДанных.Свойство("Документ", ТекущийДокумент) Тогда 
		// не указан конкретный документ
		Возврат;
	КонецЕсли;
			
	// для каждой ставки НДС создадим свой набор строк для каждой ТЧ кроме ВозвратнойТары
	СтруктураПоСтавкеНДС = Новый Структура();
	Для каждого СтавкаНДС Из Перечисления.СтавкиНДС Цикл
		СтруктураПоСтавкеНДС = Новый Структура();
		
		ТаблицаТовары = ОтобратьСтрокиТабличнойЧасти("Товары", СтавкаНДС, СтруктураОтбораДанных);
		ТаблицаУслуги = ОтобратьСтрокиТабличнойЧасти("Услуги", СтавкаНДС, СтруктураОтбораДанных);
		ТаблицаПрочее = ОтобратьСтрокиТабличнойЧасти("Прочее", СтавкаНДС, СтруктураОтбораДанных);
		
		Если НЕ ТаблицаТовары = Неопределено Тогда
			СтруктураПоСтавкеНДС.Вставить("Товары", ТаблицаТовары);
		КонецЕсли;
		Если НЕ ТаблицаУслуги = Неопределено Тогда
			СтруктураПоСтавкеНДС.Вставить("Услуги", ТаблицаУслуги);
		КонецЕсли;
		Если НЕ ТаблицаПрочее = Неопределено Тогда
			СтруктураПоСтавкеНДС.Вставить("Прочее", ТаблицаПрочее);
		КонецЕсли;
		
		Если НЕ СтруктураПоСтавкеНДС.Количество() = 0 Тогда
			// Имеются строки с указанной ставкой НДС
			СтруктураДанных.Вставить(ОбщегоНазначения.ПолучитьИмяЭлементаПеречисленияПоЗначению(СтавкаНДС), СтруктураПоСтавкеНДС);
		КонецЕсли;
		
	КонецЦикла; 
	
	// ... ВозвратнуюТару занесем отдельно: если имеются несколько ставок - тару можно отнести к любой из них.
	ТаблицаВозвратнаяТара = ОтобратьСтрокиТабличнойЧасти("ВозвратнаяТара", , СтруктураОтбораДанных);
	Если НЕ ТаблицаВозвратнаяТара = Неопределено Тогда
		СтруктураДанных.Вставить("ВозвратнаяТара", ТаблицаВозвратнаяТара);
	КонецЕсли;
	
	Если НЕ СтруктураДанных.Количество() = 0 Тогда
		// Нужно формировать документ
		СтрокаТаблицыДанных = ТаблицаДанных.Добавить();
		СтрокаТаблицыДанных.Дата				= СтруктураОтбораДанных.Дата;
		СтрокаТаблицыДанных.ДоговорКонтрагента	= СтруктураОтбораДанных.ДоговорКонтрагента;
		СтрокаТаблицыДанных.РасчетыВозврат		= СтруктураОтбораДанных.РасчетыВозврат;
		Если ТекущийДокумент = Неопределено Тогда
			Если СтруктураОтбораДанных.ДоговорКонтрагента.Внешнеэкономический Тогда
				СтрокаТаблицыДанных.ВалютаДокумента  = СтруктураОтбораДанных.ДоговорКонтрагента.ВалютаВзаиморасчетов;
			Иначе	
				СтрокаТаблицыДанных.ВалютаДокумента  = мВалютаРегламентированногоУчета;
			КонецЕсли;
			СтрокаТаблицыДанных.СуммаВключаетНДС 	= Истина;
			СтрокаТаблицыДанных.УчитыватьНДС 		= Истина;
		Иначе
			СтрокаТаблицыДанных.ВалютаДокумента 	= ТекущийДокумент.ВалютаДокумента;
			СтрокаТаблицыДанных.СуммаВключаетНДС 	= ТекущийДокумент.СуммаВключаетНДС;
			СтрокаТаблицыДанных.УчитыватьНДС 		= ТекущийДокумент.УчитыватьНДС;
		КонецЕсли;	
		СтрокаТаблицыДанных.ДокументОснование 	= ТекущийДокумент;
		СтрокаТаблицыДанных.СтруктураДанных		= СтруктураДанных;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьТабличныеЧасти() Экспорт
		
	ОтборДоговоровКонтрагентов.Очистить();
	Договора.Очистить();
	ИсточникиНоменклатуры.Очистить();
	Товары.Очистить();
	ВозвратнаяТара.Очистить();
	Услуги.Очистить();
	Прочее.Очистить();

КонецПроцедуры


// Функция проверяет, сумма неподтвержденных налоговых обязательств с учетом аванса не превышает ли
// сумму выбранной в ИсточникахНоменклатуры номенклатуры. При отрицательном результате возвращает таблицу
// содержащую суммы частичных отгрузок в разрезе ставок (суммы превышения разносятся по ставкам пропорционально)
Функция МожноФормироватьНалоговыеНакладные(СтуктураОтбораИсточниковНоменклатуры, ТаблицаЧастичнойОтгрузки = Неопределено) Экспорт
	
	// Пока не будет установлено обратное
	Результат = Истина;
	
	мИтоговаяТаблица.Очистить();
	
	ТаблицаНеподтвержденныхОбязательств = мИтоговаяТаблица.Скопировать();
	ТаблицаИтоговПоНоменклатуре 		= мИтоговаяТаблица.Скопировать();
	ТаблицаЧастичнойОтгрузки 			= мИтоговаяТаблица.Скопировать();
	ТаблицаЧастичнойОтгрузки.Колонки.Добавить("ЧастичнаяОтгрузка", 	Новый ОписаниеТипов("Булево"));
	ТаблицаЧастичнойОтгрузки.Колонки.Добавить("ЗаСчетАванса", 	   	Новый ОписаниеТипов("Булево"));
	// комбинации признаков означают следующее: ЧастичнаяОтгрузка/ЗаСчетАванса
	// Ложь	 /Ложь	 - Номенклатура по ставке/таре переносятся в налоговый документ полностью
	// Ложь	 /Истина - Номенклатура по ставке/таре НЕ переносятся в налоговый документ 
	// Истина/Истина - Образуется частичная отгрузка на сумму пропорционально распределенного между ставками аванса
	// Истина/Ложь   - Образуется частичная отгрузка на указанную сумму
	
	// Занесем в таблицу суммы неподтвержденных налоговых обязательств по каждой ставке и определим сумму
	// аванса, не подтвержденного налоговыми документами: ее можно будет закрыть по произвольной ставке.
	СуммаАванса = 0;
	СуммаАвансаТара = 0;
	СтруктураОбораДоговоров = Новый Структура();
	СтруктураОбораДоговоров.Вставить("Дата", СтуктураОтбораИсточниковНоменклатуры.Дата);	
	СтруктураОбораДоговоров.Вставить("ДоговорКонтрагента", СтуктураОтбораИсточниковНоменклатуры.ДоговорКонтрагента);	
	СтруктураОбораДоговоров.Вставить("РасчетыВозврат", СтуктураОтбораИсточниковНоменклатуры.РасчетыВозврат);	
	ДанныеДоговоров = Договора.НайтиСтроки(СтруктураОбораДоговоров);
	Для каждого СтрокаДоговоров Из ДанныеДоговоров Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаДоговоров.СтавкаНДС) Тогда
			
			Если СтрокаДоговоров.ЗаТару Тогда
				СуммаАвансаТара = СуммаАвансаТара + СтрокаДоговоров.Сумма;
			Иначе
				СуммаАванса = СуммаАванса + СтрокаДоговоров.Сумма;
			КонецЕсли;
			
		Иначе	
			
			СтрокаИтоговойТаблицы = ТаблицаНеподтвержденныхОбязательств.Добавить();
			СтрокаИтоговойТаблицы.СтавкаНДС 		= СтрокаДоговоров.СтавкаНДС;
			СтрокаИтоговойТаблицы.ЗаТару 			= СтрокаДоговоров.ЗаТару;
			СтрокаИтоговойТаблицы.СуммаВДокумент	= СтрокаДоговоров.Сумма;
			СтрокаИтоговойТаблицы.СуммаНДСВДокумент	= СтрокаДоговоров.СуммаНДС;
			
		КонецЕсли;
		
	КонецЦикла;
	ТаблицаНеподтвержденныхОбязательств.Свернуть("СтавкаНДС, ЗаТару", "СуммаВДокумент, СуммаНДСВДокумент");
		
	// Определим суммы по номенклатуре
	ДанныеИсточниковНоменклатуры = ИсточникиНоменклатуры.НайтиСтроки(СтуктураОтбораИсточниковНоменклатуры);
	Для каждого СтрокаИсточниковНоменклатуры Из ДанныеИсточниковНоменклатуры Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаИсточниковНоменклатуры.СтавкаНДС) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаИтоговойТаблицы = ТаблицаИтоговПоНоменклатуре.Добавить();
		СтрокаИтоговойТаблицы.СтавкаНДС 		= СтрокаИсточниковНоменклатуры.СтавкаНДС;
		СтрокаИтоговойТаблицы.ЗаТару 			= СтрокаИсточниковНоменклатуры.ЗаТару;
		СтрокаИтоговойТаблицы.СуммаВДокумент	= СтрокаИсточниковНоменклатуры.Сумма;
		СтрокаИтоговойТаблицы.СуммаНДСВДокумент	= СтрокаИсточниковНоменклатуры.СуммаНДС;
		
	КонецЦикла; 
	ТаблицаИтоговПоНоменклатуре.Свернуть("СтавкаНДС, ЗаТару", "СуммаВДокумент, СуммаНДСВДокумент");
	
	ОстатокАванса = СуммаАванса;
	ОстатокАвансаТара = СуммаАвансаТара;
	// пройдемся по таблице итогов по номенклатуре и определим имеются ли частичные отгрузки
	СтруктураОтбора = новый Структура();
	Для каждого СтрокаПоНоменклатуре Из ТаблицаИтоговПоНоменклатуре Цикл
		
		СтруктураОтбора.Вставить("СтавкаНДС", СтрокаПоНоменклатуре.СтавкаНДС);
		СтруктураОтбора.Вставить("ЗаТару", 	  СтрокаПоНоменклатуре.ЗаТару);
		СтрокиНеподтвержденныхОбязательств = ТаблицаНеподтвержденныхОбязательств.НайтиСтроки(СтруктураОтбора);
		Если СтрокиНеподтвержденныхОбязательств.Количество() = 0 Тогда
			// может попасть в НН за счет аванса
			СтрокаЧастичнойОтгрузки = ТаблицаЧастичнойОтгрузки.Добавить();
			СтрокаЧастичнойОтгрузки.СтавкаНДС 			= СтруктураОтбора.СтавкаНДС;
			СтрокаЧастичнойОтгрузки.ЗаТару 				= СтруктураОтбора.ЗаТару;
			СтрокаЧастичнойОтгрузки.СуммаВДокумент 		= СтрокаПоНоменклатуре.СуммаВДокумент;
			СтрокаЧастичнойОтгрузки.СуммаНДСВДокумент 	= СтрокаПоНоменклатуре.СуммаНДСВДокумент;
			СтрокаЧастичнойОтгрузки.ЧастичнаяОтгрузка   = Истина;
			СтрокаЧастичнойОтгрузки.ЗаСчетАванса		= Истина;
			
			Если СтруктураОтбора.ЗаТару Тогда
				ОстатокАвансаТара = ОстатокАвансаТара - СтрокаПоНоменклатуре.СуммаВДокумент;
			Иначе
				ОстатокАванса = ОстатокАванса - СтрокаПоНоменклатуре.СуммаВДокумент;
			КонецЕсли;

		Иначе
			// строка - единственная
			СтрокаНеподтвержденныхОбязательств = СтрокиНеподтвержденныхОбязательств[0];
			Если СтрокаНеподтвержденныхОбязательств.СуммаВДокумент > СтрокаПоНоменклатуре.СуммаВДокумент Тогда
				// эти данные должны попасть в налоговые документы полностью
				СтрокаЧастичнойОтгрузки = ТаблицаЧастичнойОтгрузки.Добавить();
				СтрокаЧастичнойОтгрузки.СтавкаНДС 			= СтруктураОтбора.СтавкаНДС;
				СтрокаЧастичнойОтгрузки.ЗаТару 				= СтруктураОтбора.ЗаТару;
				СтрокаЧастичнойОтгрузки.СуммаВДокумент 		= СтрокаПоНоменклатуре.СуммаВДокумент;
				СтрокаЧастичнойОтгрузки.СуммаНДСВДокумент 	= СтрокаПоНоменклатуре.СуммаНДСВДокумент;
				СтрокаЧастичнойОтгрузки.ЧастичнаяОтгрузка   = Ложь;
				СтрокаЧастичнойОтгрузки.ЗаСчетАванса		= Ложь;				
				
			ИначеЕсли СтрокаНеподтвержденныхОбязательств.СуммаВДокумент < СтрокаПоНоменклатуре.СуммаВДокумент Тогда
				// на сумму неподтвержденных обязательств возникает частичная отгрузка, остальное может попасть
				// в налоговый документ за счет аванса
				СтрокаЧастичнойОтгрузки = ТаблицаЧастичнойОтгрузки.Добавить();
				СтрокаЧастичнойОтгрузки.СтавкаНДС 			= СтруктураОтбора.СтавкаНДС;
				СтрокаЧастичнойОтгрузки.ЗаТару 				= СтруктураОтбора.ЗаТару;
				СтрокаЧастичнойОтгрузки.СуммаВДокумент 		= СтрокаНеподтвержденныхОбязательств.СуммаВДокумент;
				СтрокаЧастичнойОтгрузки.СуммаНДСВДокумент 	= СтрокаНеподтвержденныхОбязательств.СуммаНДСВДокумент;
				СтрокаЧастичнойОтгрузки.ЧастичнаяОтгрузка   = Истина;
				СтрокаЧастичнойОтгрузки.ЗаСчетАванса		= Ложь;
				
				СтрокаЧастичнойОтгрузки = ТаблицаЧастичнойОтгрузки.Добавить();
				СтрокаЧастичнойОтгрузки.СтавкаНДС 			= СтруктураОтбора.СтавкаНДС;
				СтрокаЧастичнойОтгрузки.ЗаТару 				= СтруктураОтбора.ЗаТару;
				СтрокаЧастичнойОтгрузки.СуммаВДокумент 		= СтрокаПоНоменклатуре.СуммаВДокумент - СтрокаНеподтвержденныхОбязательств.СуммаВДокумент;
				СтрокаЧастичнойОтгрузки.СуммаНДСВДокумент 	= СтрокаПоНоменклатуре.СуммаНДСВДокумент - СтрокаНеподтвержденныхОбязательств.СуммаНДСВДокумент;
				СтрокаЧастичнойОтгрузки.ЧастичнаяОтгрузка   = Истина;
				СтрокаЧастичнойОтгрузки.ЗаСчетАванса		= Истина;
				Если СтруктураОтбора.ЗаТару Тогда
					ОстатокАвансаТара = ОстатокАвансаТара - (СтрокаПоНоменклатуре.СуммаВДокумент - СтрокаНеподтвержденныхОбязательств.СуммаВДокумент);
				Иначе
					ОстатокАванса = ОстатокАванса - (СтрокаПоНоменклатуре.СуммаВДокумент - СтрокаНеподтвержденныхОбязательств.СуммаВДокумент);
				КонецЕсли;
				
			ИначеЕсли НЕ СтрокаНеподтвержденныхОбязательств.СуммаНДСВДокумент = СтрокаПоНоменклатуре.СуммаНДСВДокумент Тогда
				// ситуация с зависшими копейками по НДС (может возникнуть при частичных оплатах/отгрузках
				Результат = Ложь;
				
				СтрокаЧастичнойОтгрузки = ТаблицаЧастичнойОтгрузки.Добавить();
				СтрокаЧастичнойОтгрузки.СтавкаНДС 			= СтруктураОтбора.СтавкаНДС;
				СтрокаЧастичнойОтгрузки.ЗаТару 				= СтруктураОтбора.ЗаТару;
				СтрокаЧастичнойОтгрузки.СуммаВДокумент 		= СтрокаНеподтвержденныхОбязательств.СуммаВДокумент;
				СтрокаЧастичнойОтгрузки.СуммаНДСВДокумент 	= СтрокаНеподтвержденныхОбязательств.СуммаНДСВДокумент;
				СтрокаЧастичнойОтгрузки.ЧастичнаяОтгрузка	= Истина;
				СтрокаЧастичнойОтгрузки.ЗаСчетАванса   		= Ложь;
			Иначе
			    // эти данные должны попасть в налоговые документы полностью
				СтрокаЧастичнойОтгрузки = ТаблицаЧастичнойОтгрузки.Добавить();
				СтрокаЧастичнойОтгрузки.СтавкаНДС 			= СтруктураОтбора.СтавкаНДС;
				СтрокаЧастичнойОтгрузки.ЗаТару 				= СтруктураОтбора.ЗаТару;
				СтрокаЧастичнойОтгрузки.СуммаВДокумент 		= СтрокаПоНоменклатуре.СуммаВДокумент;
				СтрокаЧастичнойОтгрузки.СуммаНДСВДокумент 	= СтрокаПоНоменклатуре.СуммаНДСВДокумент;
				СтрокаЧастичнойОтгрузки.ЧастичнаяОтгрузка   = Ложь;
				СтрокаЧастичнойОтгрузки.ЗаСчетАванса		= Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//удалим строки с нулевыми суммами:
	НульСтроки = ТаблицаЧастичнойОтгрузки.НайтиСтроки(Новый Структура("СуммаВДокумент",0));
	Для каждого НульСтрока Из НульСтроки Цикл
		ТаблицаЧастичнойОтгрузки.удалить(НульСтрока);
	КонецЦикла; 

	Если ОстатокАванса < 0 ИЛИ ОстатокАвансаТара < 0 ИЛИ (ТаблицаЧастичнойОтгрузки.Количество() = 0 И ТаблицаИтоговПоНоменклатуре.Количество() > 0) Тогда
		Результат = Ложь;
	Иначе
		// суммы неподтвержденного аванса достаточно для того, чтобы по данным номенклатурного состава документа сформировать налогвые документы по определенным ставкам
	КонецЕсли;
		
	Если Результат = Ложь Тогда
		// попытаемся распределить авансы
		СтрокиТары 	 = ТаблицаЧастичнойОтгрузки.НайтиСтроки(Новый Структура("ЧастичнаяОтгрузка, ЗаСчетАванса, ЗаТару", Истина, Истина, Истина));
		СтрокиТоваров= ТаблицаЧастичнойОтгрузки.НайтиСтроки(Новый Структура("ЧастичнаяОтгрузка, ЗаСчетАванса, ЗаТару", Истина, Истина, Ложь));
		
		// За Товары
		Если СуммаАванса = 0 Тогда
			// аванса и не было
			Для каждого Строка Из СтрокиТоваров Цикл
				// Установим признак, означающий, что строки товаров по данной ставке не попадут в налоговую накладную.
				Строка.ЧастичнаяОтгрузка	= Ложь;
			КонецЦикла; 
		Иначе
			СуммаОтгрузокВсего = 0;
			Для каждого Строка Из СтрокиТоваров Цикл
				СуммаОтгрузокВсего = СуммаОтгрузокВсего + Строка.СуммаВДокумент;
			КонецЦикла;
			
			КоэффЧастичнойОтгрузки = ?(СуммаОтгрузокВсего = 0, 0, СуммаАванса / СуммаОтгрузокВсего);
			Если КоэффЧастичнойОтгрузки < 1 Тогда
				ПоследняяСтрока = Неопределено;
				ЗачтеноАванса 	= 0;
				Для каждого Строка Из СтрокиТоваров Цикл
					
					Строка.СуммаВДокумент  = Строка.СуммаВДокумент * КоэффЧастичнойОтгрузки;
					// пропорционально определим НДС (НДС в т. ч. - как в регистре НДС Продаж)
					Строка.СуммаНДСВДокумент =  НалоговыйУчет.РассчитатьСуммуНДС(Строка.СуммаВДокумент, Истина, Истина, НалоговыйУчет.ПолучитьСтавкуНДС(Строка.СтавкаНДС));
					
					ЗачтеноАванса 	= ЗачтеноАванса + Строка.СуммаВДокумент;
					ПоследняяСтрока = Строка;
				КонецЦикла;
				Если Не ПоследняяСтрока = Неопределено Тогда
					// ошибки округления отнесем на последнюю строку:
					ПоследняяСтрока.СуммаВДокумент = ПоследняяСтрока.СуммаВДокумент + СуммаАванса - ЗачтеноАванса;
					ПоследняяСтрока.СуммаНДСВДокумент =  НалоговыйУчет.РассчитатьСуммуНДС(ПоследняяСтрока.СуммаВДокумент, Истина, Истина, НалоговыйУчет.ПолучитьСтавкуНДС(ПоследняяСтрока.СтавкаНДС))
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;	
		
		// За Тару
		Если СуммаАвансаТара = 0 Тогда
			Для каждого Строка Из СтрокиТары Цикл
				Строка.ЧастичнаяОтгрузка	= Ложь;
			КонецЦикла; 
		Иначе
			СуммаОтгрузокВсего = 0;
			Для каждого Строка Из СтрокиТары Цикл
				СуммаОтгрузокВсего = СуммаОтгрузокВсего + Строка.СуммаВДокумент;
			КонецЦикла;
			
			КоэффЧастичнойОтгрузки = ?(СуммаОтгрузокВсего = 0, 0, СуммаАвансаТара / СуммаОтгрузокВсего);
			Если КоэффЧастичнойОтгрузки < 1 Тогда
				ПоследняяСтрока = Неопределено;
				ЗачтеноАванса 	= 0;
				Для каждого Строка Из СтрокиТары Цикл
					Строка.СуммаВДокумент  = Строка.СуммаВДокумент * КоэффЧастичнойОтгрузки;
					
					ЗачтеноАванса 	= ЗачтеноАванса + Строка.СуммаВДокумент;
					ПоследняяСтрока = Строка;
				КонецЦикла;
				Если Не ПоследняяСтрока = Неопределено Тогда
					// ошибки округления отнесем на последнюю строку:
					ПоследняяСтрока.СуммаВДокумент = ПоследняяСтрока.СуммаВДокумент + СуммаАвансаТара - ЗачтеноАванса;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция БудутСформированыНалоговыеНакладные(ТаблицаЧастичнойОтгрузки) Экспорт
	ТаблицаКопия = ТаблицаЧастичнойОтгрузки.Скопировать();
	ТаблицаКопия.Свернуть("ЧастичнаяОтгрузка, ЗаСчетАванса");
	
	Результат = Ложь;
	Для каждого Строка Из ТаблицаКопия Цикл
		
		Если  Строка.ЧастичнаяОтгрузка = Ложь
			И Строка.ЗаСчетАванса	   = Истина Тогда
			Продолжить;
		Иначе
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат Результат;
КонецФункции

Процедура ПодготовитьНоменклатурныйСоставПриЧастичнойОтгрузке(СтуктураОтбораНоменклатуры, ТаблицаЧастичнойОтгрузки) Экспорт
	
	ДанныеДокумента = Новый Структура();
	ДанныеДокумента.Вставить("Дата", 			СтуктураОтбораНоменклатуры.Документ.Дата);
	ДанныеДокумента.Вставить("СуммаВключаетНДС",СтуктураОтбораНоменклатуры.Документ.СуммаВключаетНДС);
	ДанныеДокумента.Вставить("ВалютаДокумента", СтуктураОтбораНоменклатуры.Документ.ВалютаДокумента);
	ДанныеВалютыДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ДанныеДокумента.ВалютаДокумента, ДанныеДокумента.Дата); 
	ДанныеДокумента.Вставить("КурсВалютыДокумента", 	ДанныеВалютыДокумента.Курс);
	ДанныеДокумента.Вставить("КратностьВалютыДокумента", 	ДанныеВалютыДокумента.Кратность);
	
	ДанныеВалютыРеглУчета = МодульВалютногоУчета.ПолучитьКурсВалюты(мВалютаРегламентированногоУчета, ДанныеДокумента.Дата); 
	
	СтруктураОтбораСтрокНоменклатуры = Новый Структура();
    СтруктураОтбораСтрокНоменклатуры.Вставить("Дата", 				СтуктураОтбораНоменклатуры.Дата);
	СтруктураОтбораСтрокНоменклатуры.Вставить("Документ", 			СтуктураОтбораНоменклатуры.Документ);
	СтруктураОтбораСтрокНоменклатуры.Вставить("ДоговорКонтрагента", СтуктураОтбораНоменклатуры.ДоговорКонтрагента);
	СтруктураОтбораСтрокНоменклатуры.Вставить("РасчетыВозврат", 	СтуктураОтбораНоменклатуры.РасчетыВозврат);
	
	// сначала удалим строки номенклатуры, которые или не перенесутся или перенесутся частично
	Для каждого СтрокаТаблицыЧастичнойОтгрузки Из ТаблицаЧастичнойОтгрузки Цикл
		
		Если СтрокаТаблицыЧастичнойОтгрузки.ЗаТару Тогда
			
			СтруктураОтбораСтрокНоменклатуры.Удалить("СтавкаНДС");
			
			Если  (СтрокаТаблицыЧастичнойОтгрузки.ЧастичнаяОтгрузка  = Ложь 
				И СтрокаТаблицыЧастичнойОтгрузки.ЗаСчетАванса	     = Истина)
				ИЛИ СтрокаТаблицыЧастичнойОтгрузки.ЧастичнаяОтгрузка = Истина Тогда
				// признак того, что строки номенклатуры не переносятся либо заменяются строкой "Частичная отгрузка"
				
				СтрокиТары = ВозвратнаяТара.НайтиСтроки(СтруктураОтбораСтрокНоменклатуры);
				Для каждого СтрокаТары Из СтрокиТары Цикл
					ВозвратнаяТара.Удалить(СтрокаТары);
				КонецЦикла; 
				
			КонецЕсли;
			
		Иначе
			
			СтруктураОтбораСтрокНоменклатуры.Вставить("СтавкаНДС", СтрокаТаблицыЧастичнойОтгрузки.СтавкаНДС);

			Если  (СтрокаТаблицыЧастичнойОтгрузки.ЧастичнаяОтгрузка  = Ложь 
				И СтрокаТаблицыЧастичнойОтгрузки.ЗаСчетАванса  		 = Истина) 
				ИЛИ СтрокаТаблицыЧастичнойОтгрузки.ЧастичнаяОтгрузка = Истина Тогда
				
				// строки номенклатуры или не переносятся вообще, либо заменяются строкой "Частичная отгрузка" в ТЧ Прочее
				Строки = Товары.НайтиСтроки(СтруктураОтбораСтрокНоменклатуры);
				Для каждого Строка Из Строки Цикл
					Товары.Удалить(Строка);
				КонецЦикла; 
				
				Строки = Услуги.НайтиСтроки(СтруктураОтбораСтрокНоменклатуры);
				Для каждого Строка Из Строки Цикл
					Услуги.Удалить(Строка);
				КонецЦикла; 
				
				Строки = Прочее.НайтиСтроки(СтруктураОтбораСтрокНоменклатуры);
				Для каждого Строка Из Строки Цикл
					Прочее.Удалить(Строка);
				КонецЦикла; 
				
			КонецЕсли;
						
		КонецЕсли;
	
	КонецЦикла; 
	
	// Теперь добавим строки "Частичная отгрузка"
	Для каждого СтрокаТаблицыЧастичнойОтгрузки Из ТаблицаЧастичнойОтгрузки Цикл
		
		Если СтрокаТаблицыЧастичнойОтгрузки.ЗаТару Тогда
			
			Если  СтрокаТаблицыЧастичнойОтгрузки.ЧастичнаяОтгрузка = Истина Тогда 
				
				СтрокаТары = ВозвратнаяТара.Добавить();
				СтрокаТары.Дата				 	= СтруктураОтбораСтрокНоменклатуры.Дата;
				СтрокаТары.ДоговорКонтрагента 	= СтуктураОтбораНоменклатуры.ДоговорКонтрагента;
				СтрокаТары.РасчетыВозврат		= СтуктураОтбораНоменклатуры.РасчетыВозврат;
				СтрокаТары.Документ 			= СтуктураОтбораНоменклатуры.Документ;
				СтрокаТары.Номенклатура			= Справочники.Номенклатура.ПустаяСсылка();
				СтрокаТары.КоличествоВДокумент 	= 1;
				СтрокаТары.СуммаВДокумент = СтрокаТаблицыЧастичнойОтгрузки.СуммаВДокумент;
				
			КонецЕсли;
			
		Иначе
			
			Если  СтрокаТаблицыЧастичнойОтгрузки.ЧастичнаяОтгрузка = Истина Тогда 
				
				// Добавим строку в ТЧ "Прочее" с наименованием "Частичная отгрузка"
				СтрокаПрочее = Прочее.Добавить();
				СтрокаПрочее.Дата				= СтруктураОтбораСтрокНоменклатуры.Дата;
				СтрокаПрочее.ДоговорКонтрагента = СтуктураОтбораНоменклатуры.ДоговорКонтрагента;
				СтрокаПрочее.РасчетыВозврат		= СтуктураОтбораНоменклатуры.РасчетыВозврат;
				СтрокаПрочее.Документ 			= СтуктураОтбораНоменклатуры.Документ;
				СтрокаПрочее.Наименование 		= "Товари та послуги в асортименті";
				СтрокаПрочее.КоличествоВДокумент= 1;
				СтрокаПрочее.ЕдиницаИзмерения 	= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяЕдиницаПоКлассификатору");
				СтрокаПрочее.СтавкаНДС 			= СтрокаТаблицыЧастичнойОтгрузки.СтавкаНДС;
				
				// Сумма в таблице частичной отгрузки в гривнах и включает НДС. Нужно пересчитать суммы
				СуммаВДокумент = ?(ДанныеДокумента.СуммаВключаетНДС,
								   СтрокаТаблицыЧастичнойОтгрузки.СуммаВДокумент, 
								   СтрокаТаблицыЧастичнойОтгрузки.СуммаВДокумент - СтрокаТаблицыЧастичнойОтгрузки.СуммаНДСВДокумент);
								   
				Если ДанныеДокумента.ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
					СтрокаПрочее.Цена 				= СуммаВДокумент;
					СтрокаПрочее.СуммаВДокумент	 	= СуммаВДокумент;
					СтрокаПрочее.СуммаНДСВДокумент 	= СтрокаТаблицыЧастичнойОтгрузки.СуммаНДСВДокумент;
				Иначе
					СтрокаПрочее.СуммаВДокумент = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаВДокумент,
														  мВалютаРегламентированногоУчета, 	ДанныеДокумента.ВалютаДокумента,
														  ДанныеВалютыРеглУчета.Курс, 		ДанныеДокумента.КурсВалютыДокумента,
														  ДанныеВалютыРеглУчета.Кратность, 	ДанныеДокумента.КратностьВалютыДокумента);
														  
					СтрокаПрочее.Цена = СтрокаПрочее.СуммаВДокумент;
														  
					СтрокаПрочее.СуммаНДСВДокумент = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицыЧастичнойОтгрузки.СуммаНДСВДокумент,
														  мВалютаРегламентированногоУчета, 	ДанныеДокумента.ВалютаДокумента,
														  ДанныеВалютыРеглУчета.Курс, 		ДанныеДокумента.КурсВалютыДокумента,
														  ДанныеВалютыРеглУчета.Кратность, 	ДанныеДокумента.КратностьВалютыДокумента);
																		  
														  
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

мВалютаРегламентированногоУчета   = Константы.ВалютаРегламентированногоУчета.Получить();

ДопустимыеТипыДокументов = Новый Массив;
ДопустимыеТипыДокументов.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));	
ДопустимыеТипыДокументов.Добавить(Тип("ДокументСсылка.СчетНаОплатуПокупателю"));	
ДопустимыеТипыДокументов.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));	
ДопустимыеТипыДокументов.Добавить(Тип("ДокументСсылка.НалоговаяНакладная"));	
ДопустимыеТипыДокументов.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОПродажах"));	
ДопустимыеТипыДокументов.Добавить(Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));	
	
мИтоговаяТаблица = Новый ТаблицаЗначений();
мИтоговаяТаблица.Колонки.Добавить("СтавкаНДС", 		Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
мИтоговаяТаблица.Колонки.Добавить("ЗаТару", 		Новый ОписаниеТипов("Булево"));
мИтоговаяТаблица.Колонки.Добавить("СуммаВДокумент", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
мИтоговаяТаблица.Колонки.Добавить("СуммаНДСВДокумент", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));

СписокСформированныхДокументов = Новый СписокЗначений;

мНеЗаписыватьДокументы = Ложь;