
Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого ТекЗапись Из ЭтотОбъект ЦИкл
		Если ТекЗапись.Основная ТОгда
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	мпи_ЗначенияКатегорийНоменклатуры.НоменклатураОбъект,
		|	мпи_ЗначенияКатегорийНоменклатуры.ВидКатегории
		|ИЗ
		|	РегистрСведений.мпи_ЗначенияКатегорийНоменклатуры КАК мпи_ЗначенияКатегорийНоменклатуры
		|ГДЕ
		|	мпи_ЗначенияКатегорийНоменклатуры.НоменклатураОбъект = &НоменклатураОбъект
		|	И мпи_ЗначенияКатегорийНоменклатуры.ВидКатегории = &ВидКатегории
		|	И мпи_ЗначенияКатегорийНоменклатуры.Основная";
		Запрос.УстановитьПараметр("НоменклатураОбъект", ТекЗапись.НоменклатураОбъект);
		Запрос.УстановитьПараметр("ВидКатегории", ТекЗапись.ВидКатегории);
		Если Запрос.Выполнить().Пустой() ТОгда
			ТекЗапись.Основная = Истина;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры
