
Процедура ВыгрузитьНоменклатуруТарас() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Валюта.Код,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВидНоменклатуры,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Код,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.СтранаПроисхождения,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Сезонность,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ширина,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДиаметрДиска,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВысотаПрофиля,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.МежболтовоерасстояниеPCD1,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВылетДисков,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Производитель,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Модель,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ИндексСкорости,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Покраска,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Тип,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.СпециальныйИндекс,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДополнительныеПараметры,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.РисункиПротектора,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.МежболтовоерасстояниеPCD2,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ИндексНагрузки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Акция,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ступица,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ЕстьЦена,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Шипы,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.МаркаАвтомобиля,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.МодельАвтомобиля,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Материал,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.СалонБагажник,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Емкость,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ПусковойТок,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Полярность,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Длинна,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ШиринаАкумулятора,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Высота,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Крепеж,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Износ,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.БУ,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТипСекреток,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.РезьбаСекретки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВысотаСекретки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВидСекретки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ПрижимнаяПоверхность,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Покрытие,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ключ,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметрСекреток,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТипПроставки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Сверловка1,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Сверловка2,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ступица1,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ступица2,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТолщинаПроставки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.КреплениеКДиску,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметрПроставок,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.МатериалЦентровочногоКольца,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметрыЦентровочныхКолец,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТипШпильки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДиаметрЗабивки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ОбщаяДлина,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметыШпильки,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Поставщик) КАК Поставщик,
	|	МАКСИМУМ(ДатыПроизводстваСрезПоследних.ДатаПроизводства) КАК ДатаПроизводства,
	|	МАКСИМУМ(ДатыПроизводстваСрезПоследних.Страна) КАК Страна,
	|	МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Остаток, 0)) КАК Остаток,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Артикул КАК Артикул,
	|	МАКСИМУМ(КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) КАК Поле1,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_НаименованиеРу КАК НоменклатураНаименованиеПолное,
	|	МАКСИМУМ(ЕСТЬNULL(ВложенныйЗапрос.КоличествоОстаток, 0)) КАК Ост2
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТЦ) КАК ЦеныНоменклатурыСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроизводства.СрезПоследних КАК ДатыПроизводстваСрезПоследних
	|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ДатыПроизводстваСрезПоследних.Номенклатура
	|			И ЦеныНоменклатурыСрезПоследних.Поставщик = ДатыПроизводстваСрезПоследних.Поставщик
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	|			И ЦеныНоменклатурыСрезПоследних.Поставщик = ЦеныНоменклатурыКонтрагентовСрезПоследних.ТипЦен.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	|		ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|			СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|		ИЗ
	|			РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТоварыНаСкладахОстатки.Номенклатура) КАК ВложенныйЗапрос
	|		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ВложенныйЗапрос.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Валюта.Код,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВидНоменклатуры,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Код,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.СтранаПроисхождения,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Сезонность,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ширина,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДиаметрДиска,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВысотаПрофиля,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.МежболтовоерасстояниеPCD1,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВылетДисков,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Производитель,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Модель,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ИндексСкорости,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Покраска,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Тип,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.СпециальныйИндекс,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДополнительныеПараметры,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.РисункиПротектора,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.МежболтовоерасстояниеPCD2,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ИндексНагрузки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Акция,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ступица,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ЕстьЦена,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Шипы,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.МаркаАвтомобиля,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.МодельАвтомобиля,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Материал,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.СалонБагажник,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Емкость,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ПусковойТок,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Полярность,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Длинна,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ШиринаАкумулятора,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Высота,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Крепеж,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Износ,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.БУ,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТипСекреток,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.РезьбаСекретки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВысотаСекретки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВидСекретки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ПрижимнаяПоверхность,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Покрытие,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ключ,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметрСекреток,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТипПроставки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Сверловка1,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Сверловка2,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ступица1,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ступица2,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТолщинаПроставки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.КреплениеКДиску,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметрПроставок,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.МатериалЦентровочногоКольца,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметрыЦентровочныхКолец,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТипШпильки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДиаметрЗабивки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ОбщаяДлина,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметыШпильки,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Артикул,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_НаименованиеРу";
	Запрос.УстановитьПараметр("ТЦ",Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000006"));
	Рез = Запрос.Выполнить().Выбрать();
	
	КаталогНаСервере = СокрЛП("1c"+"/");
	Адрессайта = СокрЛП("arant.com.ua");
	Логин = СокрЛП("ftp-myautoshop");
	Пароль = СокрЛП("t46bkAF81m");
	//    Попытка
	Сайт = Новый FTPСоединение(Адрессайта,,Логин,Пароль,,Истина,6000);
	Сайт.УстановитьТекущийКаталог(КаталогНаСервере);
	
	ЗаписьXML = Новый ЗаписьXML;
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");
	
	ЗаписьXML.ОткрытьФайл( "c:\temp\goods.xml");
	// Записать директиву
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	// Записать начало корневого элемента 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Start");
	// Записать атрибут корневого элеиента 
	ЗаписьXML.ЗаписатьАтрибут("Name", "goods");
	ЗаписьXML.ЗаписатьКомментарий("Export goods");
	
	пока Рез.Следующий() Цикл
		//Сообщить(Рез.Ссылка);
		
		Если Не ЗначениеЗаполнено(Рез.Цена) Тогда
			Продолжить;
		КонецЕслИ;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("item");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("id");
		ЗаписьXML.ЗаписатьТекст(Рез.НоменклатураКод); 
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("idvn");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.Номенклатура.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		
		//
		//           |	ЦеныНоменклатурыСрезПоследних.ВалютаКод,
		//           |	ЦеныНоменклатурыСрезПоследних.Цена,
		//           |	ЦеныНоменклатурыСрезПоследних.НоменклатураВидНоменклатуры,
		//           |	ЦеныНоменклатурыСрезПоследних.НоменклатураСтранаПроисхождения,
		//           |	ЦеныНоменклатурыСрезПоследних.НоменклатураСезонность,
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВалютаКод");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.ВалютаКод));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		//Попытка
		Если Рез.Поле1 <> Null  Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Цена");
			ЗаписьXML.ЗаписатьТекст(Формат(Окр(Рез.Цена*Рез.Поле1,2),"ЧЦ=12; ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0; ЧГ=3,0"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		//	Исключение
		//		ЗаписьXML.ЗаписатьНачалоЭлемента("Цена");
		//		ЗаписьXML.ЗаписатьТекст(Строка(Рез.Цена));
		//		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		//	КонецПопытки;
		ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВидНоменклатуры");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураВидНоменклатуры));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСтранаПроисхождения) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСтранаПроисхождения");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСтранаПроисхождения));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.НоменклатураСезонность) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСезонность");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСезонность));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.Артикул) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Артикул");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Артикул));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураШирина) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураШирина");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураШирина));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДиаметрДиска) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДиаметрДиска");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДиаметрДиска));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураВысотаПрофиля) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВысотаПрофиля");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураВысотаПрофиля));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМежболтовоерасстояниеPCD1) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМежболтовоерасстояниеPCD1");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМежболтовоерасстояниеPCD1));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураВылетДисков) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВылетДисков");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураВылетДисков));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураПроизводитель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПроизводитель");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураПроизводитель));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМодель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМодель");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМодель));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураИндексСкорости) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураИндексСкорости");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураИндексСкорости));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураПокраска) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПокраска");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураПокраска));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураТип) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТип");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураТип));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСпециальныйИндекс) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСпециальныйИндекс");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСпециальныйИндекс));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДополнительныеПараметры) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДополнительныеПараметры");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДополнительныеПараметры));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураРисункиПротектора) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураРисункиПротектора");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураРисункиПротектора));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМежболтовоерасстояниеPCD2) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМежболтовоерасстояниеPCD2");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМежболтовоерасстояниеPCD2));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураИндексНагрузки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураИндексНагрузки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураИндексНагрузки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураАкция) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураАкция");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураАкция));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСтупица) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСтупица");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСтупица));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураШипы) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураШипы");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураШипы));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМаркаАвтомобиля) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМаркаАвтомобиля");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМаркаАвтомобиля));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМодельАвтомобиля) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМодельАвтомобиля");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМодельАвтомобиля));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМатериал) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМатериал");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМатериал));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСалонБагажник) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСалонБагажник");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСалонБагажник));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураЕмкость) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураЕмкость");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураЕмкость));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураПусковойТок) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПусковойТок");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураПусковойТок));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураПолярность) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПолярность");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураПолярность));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДлинна) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДлинна");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДлинна));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураШиринаАкумулятора) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураШиринаАкумулятора");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураШиринаАкумулятора));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураВысота) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВысота");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураВысота));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураКрепеж) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураКрепеж");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураКрепеж));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураИзнос) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураИзнос");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураИзнос));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураБУ) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБУ");
			Если Рез.НоменклатураБУ Тогда
				ЗаписьXML.ЗаписатьТекст("Да");
			Иначе
				ЗаписьXML.ЗаписатьТекст("Нет");
			КонецЕслИ;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураТипСекреток) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТипСекреток");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураТипСекреток));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураРезьбаСекретки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураРезьбаСекретки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураРезьбаСекретки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураВысотаСекретки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВысотаСекретки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураВысотаСекретки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураВидСекретки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВидСекретки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураВидСекретки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураПрижимнаяПоверхность) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПрижимнаяПоверхность");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураПрижимнаяПоверхность));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураПокрытие) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПокрытие");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураПокрытие));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураКлюч) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураКлюч");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураКлюч));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДопПараметрСекреток) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДопПараметрСекреток");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДопПараметрСекреток));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураТипПроставки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТипПроставки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураТипПроставки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСверловка1) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСверловка1");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСверловка1));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСверловка2) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСверловка2");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСверловка2));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСтупица1) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСтупица1");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСтупица1));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСтупица2) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСтупица2");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСтупица2));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураТолщинаПроставки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТолщинаПроставки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураТолщинаПроставки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураКреплениеКДиску) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураКреплениеКДиску");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураКреплениеКДиску));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДопПараметрПроставок) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДопПараметрПроставок");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДопПараметрПроставок));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМатериалЦентровочногоКольца) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМатериалЦентровочногоКольца");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМатериалЦентровочногоКольца));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДопПараметрыЦентровочныхКолец) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДопПараметрыЦентровочныхКолец");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДопПараметрыЦентровочныхКолец));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураТипШпильки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТипШпильки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураТипШпильки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДиаметрЗабивки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДиаметрЗабивки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДиаметрЗабивки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураОбщаяДлина) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ОбщаяДлина");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураОбщаяДлина));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДопПараметыШпильки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДопПараметыШпильки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДопПараметыШпильки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураНаименованиеПолное) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураНаименованиеПолное");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураНаименованиеПолное));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Поставщик) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Поставщик");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Поставщик));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.ДатаПроизводства) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаПроизводства");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ДатаПроизводства));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.Страна) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Страна");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Страна));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Остаток) или ЗначениеЗаполнено(Рез.Ост2) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Остаток");
			ЗаписьXML.ЗаписатьТекст(Строка(Число(Рез.Остаток)+Число(Рез.Ост2)));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 
		
		
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 		
	ЗаписьXML.Закрыть();
	
	//ЗаписьXML.ОткрытьФайл( "c:\temp\return_"+ОбщегоНазначения.ПолучитьНомерНаПечать(Рез.Ссылка)+ДатаВ+".xml");
	
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");
	//Если Найти(ДатаВ,"PM") = 0 и Найти(ДатаВ,"AM") = 0 Тогда
	Сайт.Записать("c:\temp\goods.xml","_goods_"+ДатаВ+".xml"); 
	Сайт.Переместить("_goods_"+ДатаВ+".xml","goods_"+ДатаВ+".xml"); 
	//КонецЕслИ;
	
	
	
	
КонецПроцедуры

Процедура ВыгрузитьНоменклатуруТарас2() Экспорт
	//Вторая выгрузка 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Валюта.Код,
	               |	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВидНоменклатуры,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Код,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.СтранаПроисхождения,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Сезонность,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ширина,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДиаметрДиска,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВысотаПрофиля,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.МежболтовоерасстояниеPCD1,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВылетДисков,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Производитель,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Модель,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ИндексСкорости,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Покраска,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Тип,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.СпециальныйИндекс,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДополнительныеПараметры,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.РисункиПротектора,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.МежболтовоерасстояниеPCD2,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ИндексНагрузки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Акция,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ступица,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ЕстьЦена,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Шипы,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.МаркаАвтомобиля,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.МодельАвтомобиля,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Материал,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.СалонБагажник,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Емкость,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ПусковойТок,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Полярность,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Длинна,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ШиринаАкумулятора,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Высота,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Крепеж,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Износ,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БУ,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТипСекреток,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.РезьбаСекретки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВысотаСекретки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВидСекретки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ПрижимнаяПоверхность,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Покрытие,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ключ,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметрСекреток,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТипПроставки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Сверловка1,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Сверловка2,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ступица1,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ступица2,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТолщинаПроставки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.КреплениеКДиску,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметрПроставок,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.МатериалЦентровочногоКольца,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметрыЦентровочныхКолец,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТипШпильки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДиаметрЗабивки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ОбщаяДлина,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметыШпильки,
	               |	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Поставщик) КАК Поставщик,
	               |	МАКСИМУМ(ДатыПроизводстваСрезПоследних.ДатаПроизводства) КАК ДатаПроизводства,
	               |	МАКСИМУМ(ДатыПроизводстваСрезПоследних.Страна) КАК Страна,
	               |	МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Остаток, 0)) КАК Остаток,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Артикул КАК Артикул,
	               |	МАКСИМУМ(КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность) КАК Поле1,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_НаименованиеРу КАК НоменклатураНаименованиеПолное,
	               |	МАКСИМУМ(ЕСТЬNULL(ВложенныйЗапрос.КоличествоОстаток, 0)) КАК Ост2,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_Вязкость,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_Объем,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_ТипОснованияМасла,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_ТипДвигателя,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_Допуски.НаименованиеПолное КАК НоменклатураБП_Допуски,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_СтандартКачестваAPI,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_СтандартКачестваACEА,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_СтранаПроизводитель,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_ДополнительныеПараметрыМасла,
				   |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_ТипЗС,
				   |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_КоличествоФазЗС,
				   |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_КоличествоТочекПодключенияЗС,
				   |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_ТипыТочекПодключенияЗС,
				   |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_МаксимальнаяСилаТокаЗС,
				   |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_ОбщаяМощностьЗС
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТЦ) КАК ЦеныНоменклатурыСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроизводства.СрезПоследних КАК ДатыПроизводстваСрезПоследних
	               |		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ДатыПроизводстваСрезПоследних.Номенклатура
	               |			И ЦеныНоменклатурыСрезПоследних.Поставщик = ДатыПроизводстваСрезПоследних.Поставщик
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	               |		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	               |			И ЦеныНоменклатурыСрезПоследних.Поставщик = ЦеныНоменклатурыКонтрагентовСрезПоследних.ТипЦен.Владелец
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	               |		ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |			СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	               |		ИЗ
	               |			РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТоварыНаСкладахОстатки.Номенклатура) КАК ВложенныйЗапрос
	               |		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ВложенныйЗапрос.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЦеныНоменклатурыСрезПоследних.Валюта.Код,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВидНоменклатуры,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Код,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.СтранаПроисхождения,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Сезонность,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ширина,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДиаметрДиска,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВысотаПрофиля,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.МежболтовоерасстояниеPCD1,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВылетДисков,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Производитель,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Модель,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ИндексСкорости,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Покраска,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Тип,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.СпециальныйИндекс,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДополнительныеПараметры,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.РисункиПротектора,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.МежболтовоерасстояниеPCD2,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ИндексНагрузки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Акция,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ступица,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ЕстьЦена,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Шипы,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.МаркаАвтомобиля,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.МодельАвтомобиля,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Материал,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.СалонБагажник,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Емкость,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ПусковойТок,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Полярность,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Длинна,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ШиринаАкумулятора,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Высота,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Крепеж,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Износ,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БУ,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТипСекреток,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.РезьбаСекретки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВысотаСекретки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ВидСекретки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ПрижимнаяПоверхность,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Покрытие,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ключ,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметрСекреток,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТипПроставки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Сверловка1,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Сверловка2,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ступица1,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Ступица2,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТолщинаПроставки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.КреплениеКДиску,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметрПроставок,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.МатериалЦентровочногоКольца,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметрыЦентровочныхКолец,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ТипШпильки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДиаметрЗабивки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ОбщаяДлина,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.ДопПараметыШпильки,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Артикул,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_НаименованиеРу,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_Вязкость,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_Объем,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_ТипОснованияМасла,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_ТипДвигателя,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_Допуски.НаименованиеПолное,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_СтандартКачестваAPI,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_СтандартКачестваACEА,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_СтранаПроизводитель,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_ДополнительныеПараметрыМасла,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_ТипЗС,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_КоличествоФазЗС,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_КоличествоТочекПодключенияЗС,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_ТипыТочекПодключенияЗС,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_МаксимальнаяСилаТокаЗС,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.БП_ОбщаяМощностьЗС";
	Запрос.УстановитьПараметр("ТЦ",Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001"));
	Рез = Запрос.Выполнить().Выбрать();
	
	КаталогНаСервере = "1c"+"/";
	Адрессайта = СокрЛП("88.218.28.163");//СокрЛП("185.156.42.204");
	Логин = СокрЛП("ftp-garazh");
	Пароль = СокрЛП("t46KlF81m");
	//    Попытка
	
	ЗаписьXML = Новый ЗаписьXML;
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");  

		
	ЗаписьXML.ОткрытьФайл( "c:\temp\goods2.xml");
	// Записать директиву
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	// Записать начало корневого элемента 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Start");
	// Записать атрибут корневого элеиента 
	ЗаписьXML.ЗаписатьАтрибут("Name", "goods");
	ЗаписьXML.ЗаписатьКомментарий("Export goods");
	
	пока Рез.Следующий() Цикл
		//Сообщить(Рез.Ссылка);
		Если Не ЗначениеЗаполнено(Рез.Цена) Тогда
			Продолжить;
		КонецЕслИ;
		
		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("item");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("id");
		ЗаписьXML.ЗаписатьТекст(Рез.НоменклатураКод); 
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("idvn");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.Номенклатура.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		
		//
		//           |	ЦеныНоменклатурыСрезПоследних.ВалютаКод,
		//           |	ЦеныНоменклатурыСрезПоследних.Цена,
		//           |	ЦеныНоменклатурыСрезПоследних.НоменклатураВидНоменклатуры,
		//           |	ЦеныНоменклатурыСрезПоследних.НоменклатураСтранаПроисхождения,
		//           |	ЦеныНоменклатурыСрезПоследних.НоменклатураСезонность,
		ЗаписьXML.ЗаписатьНачалоЭлемента("ВалютаКод");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.ВалютаКод));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		//Попытка
		Если Рез.Поле1 <> Null  Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Цена");
			ЗаписьXML.ЗаписатьТекст(Формат(Окр(Рез.Цена*Рез.Поле1,2),"ЧЦ=12; ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0; ЧГ=3,0"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		//	Исключение
		//		ЗаписьXML.ЗаписатьНачалоЭлемента("Цена");
		//		ЗаписьXML.ЗаписатьТекст(Строка(Рез.Цена));
		//		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		//	КонецПопытки;
		ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВидНоменклатуры");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураВидНоменклатуры));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСтранаПроисхождения) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСтранаПроисхождения");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСтранаПроисхождения));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.НоменклатураСезонность) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСезонность");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСезонность));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.Артикул) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Артикул");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Артикул));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураШирина) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураШирина");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураШирина));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДиаметрДиска) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДиаметрДиска");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДиаметрДиска));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураВысотаПрофиля) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВысотаПрофиля");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураВысотаПрофиля));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМежболтовоерасстояниеPCD1) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМежболтовоерасстояниеPCD1");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМежболтовоерасстояниеPCD1));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураВылетДисков) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВылетДисков");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураВылетДисков));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураПроизводитель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПроизводитель");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураПроизводитель));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМодель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМодель");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМодель));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		//+БП:
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_Вязкость) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_Вязкость");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_Вязкость));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_Объем) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_Объем");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_Объем));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_ТипОснованияМасла) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_ТипОснованияМасла");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_ТипОснованияМасла));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_ТипДвигателя) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_ТипДвигателя");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_ТипДвигателя));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_Допуски) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_Допуски");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_Допуски));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_СтандартКачестваAPI) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_СтандартКачестваAPI");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_СтандартКачестваAPI));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_СтандартКачестваACEА) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_СтандартКачестваACEА");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_СтандартКачестваACEА));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_СтранаПроизводитель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_СтранаПроизводитель");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_СтранаПроизводитель));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_ДополнительныеПараметрыМасла) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_ДополнительныеПараметрыМасла");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_ДополнительныеПараметрыМасла));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;	 
		
		////----ЗС
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_ТипЗС) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_ТипЗС");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_ТипЗС));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;	
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_КоличествоФазЗС) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_КоличествоФазЗС");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_КоличествоФазЗС));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;	
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_КоличествоТочекПодключенияЗС) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_КоличествоТочекПодключенияЗС");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_КоличествоТочекПодключенияЗС));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;	
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_ТипыТочекПодключенияЗС) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_ТипыТочекПодключенияЗС");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_ТипыТочекПодключенияЗС));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;	
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_МаксимальнаяСилаТокаЗС) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_МаксимальнаяСилаТокаЗС");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_МаксимальнаяСилаТокаЗС));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;	
		Если ЗначениеЗаполнено(Рез.НоменклатураБП_ОбщаяМощностьЗС) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБП_ОбщаяМощностьЗС");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураБП_ОбщаяМощностьЗС));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;	
		//-БП:
		
		Если ЗначениеЗаполнено(Рез.НоменклатураИндексСкорости) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураИндексСкорости");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураИндексСкорости));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураПокраска) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПокраска");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураПокраска));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураТип) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТип");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураТип));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСпециальныйИндекс) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСпециальныйИндекс");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСпециальныйИндекс));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДополнительныеПараметры) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДополнительныеПараметры");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДополнительныеПараметры));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураРисункиПротектора) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураРисункиПротектора");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураРисункиПротектора));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМежболтовоерасстояниеPCD2) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМежболтовоерасстояниеPCD2");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМежболтовоерасстояниеPCD2));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураИндексНагрузки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураИндексНагрузки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураИндексНагрузки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураАкция) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураАкция");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураАкция));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСтупица) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСтупица");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСтупица));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураШипы) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураШипы");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураШипы));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМаркаАвтомобиля) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМаркаАвтомобиля");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМаркаАвтомобиля));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМодельАвтомобиля) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМодельАвтомобиля");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМодельАвтомобиля));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМатериал) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМатериал");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМатериал));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСалонБагажник) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСалонБагажник");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСалонБагажник));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураЕмкость) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураЕмкость");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураЕмкость));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураПусковойТок) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПусковойТок");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураПусковойТок));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураПолярность) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПолярность");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураПолярность));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДлинна) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДлинна");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДлинна));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураШиринаАкумулятора) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураШиринаАкумулятора");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураШиринаАкумулятора));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураВысота) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВысота");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураВысота));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураКрепеж) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураКрепеж");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураКрепеж));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураИзнос) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураИзнос");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураИзнос));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураБУ) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБУ");
			Если Рез.НоменклатураБУ Тогда
				ЗаписьXML.ЗаписатьТекст("Да");
			Иначе
				ЗаписьXML.ЗаписатьТекст("Нет");
			КонецЕслИ;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураТипСекреток) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТипСекреток");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураТипСекреток));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураРезьбаСекретки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураРезьбаСекретки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураРезьбаСекретки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураВысотаСекретки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВысотаСекретки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураВысотаСекретки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураВидСекретки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВидСекретки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураВидСекретки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураПрижимнаяПоверхность) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПрижимнаяПоверхность");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураПрижимнаяПоверхность));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураПокрытие) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПокрытие");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураПокрытие));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураКлюч) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураКлюч");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураКлюч));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДопПараметрСекреток) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДопПараметрСекреток");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДопПараметрСекреток));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураТипПроставки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТипПроставки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураТипПроставки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСверловка1) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСверловка1");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСверловка1));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСверловка2) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСверловка2");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСверловка2));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСтупица1) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСтупица1");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСтупица1));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураСтупица2) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСтупица2");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураСтупица2));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураТолщинаПроставки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТолщинаПроставки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураТолщинаПроставки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураКреплениеКДиску) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураКреплениеКДиску");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураКреплениеКДиску));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДопПараметрПроставок) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДопПараметрПроставок");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДопПараметрПроставок));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураМатериалЦентровочногоКольца) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМатериалЦентровочногоКольца");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураМатериалЦентровочногоКольца));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДопПараметрыЦентровочныхКолец) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДопПараметрыЦентровочныхКолец");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДопПараметрыЦентровочныхКолец));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураТипШпильки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТипШпильки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураТипШпильки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДиаметрЗабивки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДиаметрЗабивки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДиаметрЗабивки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураОбщаяДлина) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ОбщаяДлина");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураОбщаяДлина));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураДопПараметыШпильки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДопПараметыШпильки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураДопПараметыШпильки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НоменклатураНаименованиеПолное) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураНаименованиеПолное");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НоменклатураНаименованиеПолное));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Поставщик) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Поставщик");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Поставщик));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(Рез.ДатаПроизводства) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаПроизводства");
				ЗаписьXML.ЗаписатьТекст(Строка(Рез.ДатаПроизводства));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕслИ;
			Если ЗначениеЗаполнено(Рез.Страна) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Страна");
				ЗаписьXML.ЗаписатьТекст(Строка(Рез.Страна));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕслИ;
			
		Иначе
			
			СтранаДатаПроизводства = НайтиСтрануДатуПроизводства(Рез.Номенклатура);
			Страна = СтранаДатаПроизводства.Страна;
			ДатаПроизводства = СтранаДатаПроизводства.ДатаПроизводства;
			
			Если ЗначениеЗаполнено(ДатаПроизводства) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаПроизводства");
				ЗаписьXML.ЗаписатьТекст(Строка(ДатаПроизводства));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕслИ;
			Если ЗначениеЗаполнено(Страна) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("Страна");
				ЗаписьXML.ЗаписатьТекст(Строка(Страна));
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕслИ;

		
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Остаток) или ЗначениеЗаполнено(Рез.Ост2) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Остаток");
			ЗаписьXML.ЗаписатьТекст(Строка(Число(Рез.Остаток)+Число(Рез.Ост2)));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 
		
		
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 		
	ЗаписьXML.Закрыть();
	
	//ЗаписьXML.ОткрытьФайл( "c:\temp\return_"+ОбщегоНазначения.ПолучитьНомерНаПечать(Рез.Ссылка)+ДатаВ+".xml");
	
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");
	//Если Найти(ДатаВ,"PM") = 0 и Найти(ДатаВ,"AM") = 0 Тогда
	Сайт = Новый FTPСоединение(Адрессайта,,Логин,Пароль,,Истина,4000);
	Сайт.УстановитьТекущийКаталог(КаталогНаСервере);
	
	Сайт.Записать("c:\temp\goods2.xml","_goods_"+ДатаВ+".xml"); 
	Сайт.Переместить("_goods_"+ДатаВ+".xml","goods_"+ДатаВ+".xml"); 
	//КонецЕслИ;
	
КонецПроцедуры

Функция НайтиСтрануДатуПроизводства(Номенклатура) 
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ДатаПроизводства","");
	СтруктураВозврата.Вставить("Страна","");
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ДатыПроизводстваСрезПоследних.Номенклатура,
	                      |	ДатыПроизводстваСрезПоследних.ДатаПроизводства,
	                      |	ДатыПроизводстваСрезПоследних.Страна
	                      |ИЗ
	                      |	РегистрСведений.ДатыПроизводства.СрезПоследних(
	                      |			&ТекДата,
	                      |			Номенклатура = &Номенклатура
	                      |				И Документ ССЫЛКА Документ.ПоступлениеТоваровУслуг) КАК ДатыПроизводстваСрезПоследних
	                      |ГДЕ
	                      |	(ДатыПроизводстваСрезПоследних.ДатаПроизводства <> """"
	                      |			ИЛИ ДатыПроизводстваСрезПоследних.Страна <> """")
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатыПроизводстваСрезПоследних.Период УБЫВ"); 
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
		СтруктураВозврата.ДатаПроизводства = Выборка.ДатаПроизводства; 
		СтруктураВозврата.Страна = Выборка.Страна; 
	КонецЦикла; 
	
	Возврат СтруктураВозврата; 
	   	
КонецФункции

Процедура ВыгрузкаКонтрагентов() Экспорт
	
	
	//Вторая выгрузка 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Код КАК Код,
	|	Контрагенты.Наименование КАК Наименование,
	|	ПОДСТРОКА(Контрагенты.НаименованиеПолное, 1, 999) КАК НаименованиеПолное,
	|	Контрагенты.Диллер КАК Диллер,
	|	Контрагенты.Розница КАК Розница,
	|	Контрагенты.НомерСвидетельства КАК НомерСвидетельства,
	|	Контрагенты.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
	|	Контрагенты.ЮрФизЛицо КАК ЮрФизЛицо,
	|	Контрагенты.Покупатель КАК Покупатель,
	|	Контрагенты.Поставщик КАК Поставщик,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	ПОДСТРОКА(КонтактнаяИнформация.Представление, 1, 999) КАК Представление,
	|	Контрагенты.Ссылка КАК Ссылка,
	|	БонусыОбороты.БонусПриход КАК БонусПриход,
	|	БонусыОбороты.БонусРасход КАК БонусРасход
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО Контрагенты.Ссылка = КонтактнаяИнформация.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Бонусы.Обороты КАК БонусыОбороты
	|		ПО Контрагенты.Ссылка = БонусыОбороты.Контрагент
	|ГДЕ
	|	Контрагенты.Ссылка В(&Спис)
	|ИТОГИ
	|	МАКСИМУМ(Код),
	|	МАКСИМУМ(Наименование),
	|	МАКСИМУМ(НаименованиеПолное),
	|	МАКСИМУМ(Диллер),
	|	МАКСИМУМ(Розница),
	|	МАКСИМУМ(НомерСвидетельства),
	|	МАКСИМУМ(КодПоЕДРПОУ),
	|	МАКСИМУМ(ЮрФизЛицо),
	|	МАКСИМУМ(Покупатель),
	|	МАКСИМУМ(Поставщик),
	|	МАКСИМУМ(Представление),
	|	СУММА(БонусПриход),
	|	СУММА(БонусРасход)
	|ПО
	|	Ссылка,
	|	Вид";
	Спис = новый СписокЗначений;
	Контрагент = Справочники.Контрагенты.Выбрать();
	Пока Контрагент.Следующий() Цикл
		Если контрагент.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли; 
		Спис.Добавить(Контрагент.Ссылка);	
	КонецЦикла; 
	Запрос.УстановитьПараметр("Спис",Спис);
	РезК = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	КаталогНаСервере = "customers"+"/";
	Адрессайта = СокрЛП("88.218.28.163");//СокрЛП("185.156.42.204");
	Логин = СокрЛП("ftp-garazh");
	Пароль = СокрЛП("t46KlF81m");
	//    Попытка
	
	ЗаписьXML = Новый ЗаписьXML;
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");
	
	ЗаписьXML.ОткрытьФайл( "c:\temp\customers.xml");
	// Записать директиву
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	// Записать начало корневого элемента 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Start");
	// Записать атрибут корневого элеиента 
	ЗаписьXML.ЗаписатьАтрибут("Name", "goods");
	ЗаписьXML.ЗаписатьКомментарий("Export customers");
	
	пока РезК.Следующий() Цикл
		//Сообщить(Рез.Ссылка);
		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("customer");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("id");
		ЗаписьXML.ЗаписатьТекст(РезК.Код); 
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("idvn");
		ЗаписьXML.ЗаписатьТекст(Строка(РезК.Ссылка.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Наименование");
		ЗаписьXML.ЗаписатьТекст(Строка(Резк.Наименование));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("НаименованиеПолное");
		ЗаписьXML.ЗаписатьТекст(Строка(Резк.НаименованиеПолное));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Диллер");
		ЗаписьXML.ЗаписатьТекст(Строка(Резк.Диллер));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Розница");
		ЗаписьXML.ЗаписатьТекст(Строка(Резк.Розница));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ЮрФизЛицо");
		ЗаписьXML.ЗаписатьТекст(Строка(Резк.ЮрФизЛицо));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Покупатель");
		ЗаписьXML.ЗаписатьТекст(Строка(Резк.Покупатель));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Поставщик");
		ЗаписьXML.ЗаписатьТекст(Строка(Резк.Поставщик));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("БонусПриход");
		ЗаписьXML.ЗаписатьТекст(Строка(Резк.БонусПриход));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("БонусРасход");
		ЗаписьXML.ЗаписатьТекст(Строка(Резк.БонусРасход));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		
		РезК1 = РезК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("contact");
		н = 0;
		Пока РезК1.Следующий() Цикл
			н = н + 1;
			ЗаписьXML.ЗаписатьНачалоЭлемента("Contact"+Строка(н));
			
			ЗаписьXML.ЗаписатьАтрибут("Вид",Строка(Резк1.Вид)); 
			ЗаписьXML.ЗаписатьАтрибут("Значение",СокрЛП(Резк1.Представление)); 
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЦикла; 
		ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 	
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 
		
		
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 		
	ЗаписьXML.Закрыть();
	
	//ЗаписьXML.ОткрытьФайл( "c:\temp\return_"+ОбщегоНазначения.ПолучитьНомерНаПечать(Рез.Ссылка)+ДатаВ+".xml");
	
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");
	//Если Найти(ДатаВ,"PM") = 0 и Найти(ДатаВ,"AM") = 0 Тогда
	Сайт = Новый FTPСоединение(Адрессайта,,Логин,Пароль,,Истина,4000);
	Сайт.УстановитьТекущийКаталог(КаталогНаСервере);
	
	Сайт.Записать("c:\temp\customers.xml","_customers_"+ДатаВ+".xml"); 
	ДатВ = ТекущаяДата();
	Если СтрДлина(Строка(ДатВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатВ," "," 0");
	КонецЕслИ;
	ДатВ = стрЗаменить(ДатВ," ","");
	ДатВ = стрЗаменить(ДатВ,".","");
	ДатВ = стрЗаменить(ДатВ,":","");
	
	Сайт.Переместить("_customers_"+ДатаВ+".xml","customers_"+ДатаВ+"_"+ДатВ+".xml"); 
	
	
	
КонецПроцедуры

Процедура ВыгрузкаЗаказы() Экспорт
	// Вставити вміст обробника.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Изменения.Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя.Изменения КАК Изменения
	|ГДЕ
	|	Изменения.Узел = &Узел"
	;
	Запрос.УстановитьПараметр("Узел",планыОбмена.Сайт.НайтиПоКоду("Сайт"));
	Рез1 = Запрос.Выполнить().Выбрать();
	Спис1 = Новый списокЗначений;
	Пока Рез1.Следующий() Цикл
		Спис1.Добавить(Рез1.Ссылка);		
	КонецЦикла; 
	
	   Если Спис1.Количество() = 0 Тогда
	   	Возврат;
	   КонецЕсли; 
	Запрос = Новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Номер,
	               |	ЗаказПокупателя.Дата,
	               |	ЗаказПокупателя.Ссылка,
	               |	ЗаказПокупателя.Контрагент,
	               |	ЗаказПокупателя.Контрагент.Код КАК Код,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка,
	               |		Количество,
	               |		Номенклатура,
	               |		Номенклатура.Код КАК КодН,
	               |		Сумма,
	               |		Цена,
	               |		ПроцентСкидкиНаценки
	               |	),
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка,
	               |		Содержание,
	               |		Количество,
	               |		Номенклатура.Код КАК КодН,
	               |		Цена,
	               |		Сумма,
				   |		ПроцентСкидкиНаценки
	               |	),
	               |	ЗаказПокупателя.Телефон,
	               |	ЗаказПокупателя.Ответственный,
	               |	ЗаказПокупателя.УсловиеОплаты,
	               |	ЗаказПокупателя.УсловиеПриема,
	               |	ЗаказПокупателя.УсловиеПоставки,
	               |	ЗаказПокупателя.СкладГруппа,
	               |	ЗаказПокупателя.АдресДоставки,
	               |	ЗаказПокупателя.ДополнениеКАдресуДоставки,
	               |	ЗаказПокупателя.Статус,
	               |	ЗаказПокупателя.Комментарий,
	               |	ЗаказПокупателя.СуммаДокумента,
	               |	ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовПриход КАК РАСХОД,
	               |	ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовРасход КАК Приход
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты КАК ВзаиморасчетыСКонтрагентамиОбороты
	               |		ПО ЗаказПокупателя.Ссылка = ВзаиморасчетыСКонтрагентамиОбороты.Сделка
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка В(&Спис)";
	// Вставити вміст обробника.
	Запрос.УстановитьПараметр("Спис",Спис1);
	Спис = Новый СписокЗначений;
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Если Спис.НайтиПоЗначению(Рез.Контрагент) = Неопределено Тогда
			Спис.Добавить(Рез.Контрагент)
		КонецЕсли; 
	КонецЦикла; 
	
	
	
	
	КаталогНаСервере = "customers"+"/";
	Адрессайта = СокрЛП("88.218.28.163");//СокрЛП("185.156.42.204");
	Логин = СокрЛП("ftp-garazh");
	Пароль = СокрЛП("t46KlF81m");
	//    Попытка
	
	ЗаписьXML = Новый ЗаписьXML;
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");
	
	ЗаписьXML.ОткрытьФайл( "c:\temp\orders.xml");
	// Записать директиву
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	// Записать начало корневого элемента 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Start");
	// Записать атрибут корневого элеиента 
	ЗаписьXML.ЗаписатьАтрибут("Name", "goods");
	ЗаписьXML.ЗаписатьКомментарий("Export orders");
	рез.Сбросить();
	пока Рез.Следующий() Цикл
		//Сообщить(Рез.Ссылка);
		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("order");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("id");
		ЗаписьXML.ЗаписатьТекст(Рез.Номер); 
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("idvn");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.Ссылка.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Дата");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.Дата));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Код");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.Код));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Телефон");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.Телефон));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Ответственный");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.Ответственный));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("УсловиеПоставки");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.УсловиеПоставки));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СкладГруппа");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.СкладГруппа));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("АдресДоставки");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.АдресДоставки));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ДополнениеКАдресуДоставки");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.ДополнениеКАдресуДоставки));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Статус");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.Статус));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Комментарий");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.Комментарий));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаДокумента");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.СуммаДокумента));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("РАСХОД");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.РАСХОД));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Приход");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.Приход));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("items");
		
		Строки = Рез.Товары.Выгрузить();
		Для каждого Стр Из Строки Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("item");
			
			ЗаписьXML.ЗаписатьАтрибут("Номенклатура",Строка(Стр.Номенклатура)); 
			ЗаписьXML.ЗаписатьАтрибут("КодН",Строка(Стр.КодН)); 
			ЗаписьXML.ЗаписатьАтрибут("Количество",Строка(Стр.Количество)); 
			ЗаписьXML.ЗаписатьАтрибут("Цена",Строка(Стр.Цена)); 
			ЗаписьXML.ЗаписатьАтрибут("Сумма",Строка(Стр.Сумма)); 
			ЗаписьXML.ЗаписатьАтрибут("ПроцентСкидкиНаценки",Строка(Стр.ПроцентСкидкиНаценки)); 
			
			          
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЦикла; 
		Строки = Рез.Услуги.Выгрузить();
		
		Для каждого Стр Из Строки Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("item");
			
			ЗаписьXML.ЗаписатьАтрибут("Номенклатура",Строка(Стр.Содержание)); 
			ЗаписьXML.ЗаписатьАтрибут("КодН",Строка(Стр.КодН)); 
			ЗаписьXML.ЗаписатьАтрибут("Количество",Строка(Стр.Количество)); 
			ЗаписьXML.ЗаписатьАтрибут("Цена",Строка(Стр.Цена)); 
			ЗаписьXML.ЗаписатьАтрибут("Сумма",Строка(Стр.Сумма)); 
					ЗаписьXML.ЗаписатьАтрибут("ПроцентСкидкиНаценки",Строка(Стр.ПроцентСкидкиНаценки)); 
	
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЦикла; 
		
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 
		
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 
		
		
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 		
	ЗаписьXML.Закрыть();
	
	//ЗаписьXML.ОткрытьФайл( "c:\temp\return_"+ОбщегоНазначения.ПолучитьНомерНаПечать(Рез.Ссылка)+ДатаВ+".xml");
	
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");
	//Если Найти(ДатаВ,"PM") = 0 и Найти(ДатаВ,"AM") = 0 Тогда
	Сайт = Новый FTPСоединение(Адрессайта,,Логин,Пароль,,Истина,4000);
	Сайт.УстановитьТекущийКаталог(КаталогНаСервере);
	
	Сайт.Записать("c:\temp\orders.xml","_orders_"+ДатаВ+".xml"); 
	ДатВ = ТекущаяДата();
	Если СтрДлина(Строка(ДатВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатВ," "," 0");
	КонецЕслИ;
	ДатВ = стрЗаменить(ДатВ," ","");
	ДатВ = стрЗаменить(ДатВ,".","");
	ДатВ = стрЗаменить(ДатВ,":","");
	
	Сайт.Переместить("_orders_"+ДатаВ+".xml","orders_"+ДатаВ+"_"+ДатВ+".xml"); 
	
	
	Рез1.Сбросить();
	Пока Рез1.Следующий() Цикл
		ПланыОбмена.УдалитьРегистрациюИзменений(планыОбмена.Сайт.НайтиПоКоду("Сайт"),Рез1.Ссылка);
		
	КонецЦикла; 
КонецПроцедуры

Процедура ВыгрузитьНоменклатуруПоставщики() Экспорт
	//Вторая выгрузка 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Остаток, 0) КАК Остаток,
	               |	КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Поле1,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.ТипЦен.Владелец КАК Поставщик,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура.Код КАК НоменклатураКод,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Поставщик КАК Поставщик1,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.МІСТО КАК МІСТО,
	               |	ДатыПроизводстваСрезПоследних.ДатаПроизводства КАК ДатаПроизводства,
	               |	ДатыПроизводстваСрезПоследних.Страна КАК Страна,
	               |	ВложенныйЗапрос.Цена КАК Цена1
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			,
	               |			ТипЦен = &ТЦ
	               |				И Поставщик.Поставщик) КАК ЦеныНоменклатурыСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	               |		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	               |		ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроизводства.СрезПоследних КАК ДатыПроизводстваСрезПоследних
	               |		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ДатыПроизводстваСрезПоследних.Номенклатура
	               |			И ЦеныНоменклатурыСрезПоследних.Поставщик = ДатыПроизводстваСрезПоследних.Поставщик
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура1,
	               |			ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |		ИЗ
	               |			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен.Код = ""000000006"") КАК ЦеныНоменклатурыСрезПоследних) КАК ВложенныйЗапрос
	               |		ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ВложенныйЗапрос.Номенклатура1
	               |ИТОГИ
	               |	МАКСИМУМ(Цена),
	               |	СУММА(Остаток),
	               |	МАКСИМУМ(Поле1),
	               |	МАКСИМУМ(НоменклатураКод),
	               |	МАКСИМУМ(Поставщик1),
	               |	МАКСИМУМ(МІСТО),
	               |	МАКСИМУМ(ДатаПроизводства),
	               |	МАКСИМУМ(Страна),
	               |	МАКСИМУМ(Цена1)
	               |ПО
	               |	Номенклатура,
	               |	Поставщик";
	Запрос.УстановитьПараметр("ТЦ",Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001"));
	Рез = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	КаталогНаСервере = "opt partner"+"/";
	Адрессайта = СокрЛП("88.218.28.163");//СокрЛП("185.156.42.204");
	Логин = СокрЛП("ftp-garazh");
	Пароль = СокрЛП("t46KlF81m");
	//    Попытка
	
	ЗаписьXML = Новый ЗаписьXML;
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");
	
	ЗаписьXML.ОткрытьФайл( "c:\temp\goods2op.xml");
	// Записать директиву
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	// Записать начало корневого элемента 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Start");
	// Записать атрибут корневого элеиента 
	ЗаписьXML.ЗаписатьАтрибут("Name", "goods");
	ЗаписьXML.ЗаписатьКомментарий("Export goods");
	
	пока Рез.Следующий() Цикл
		//Сообщить(Рез.Ссылка);
		Если Не ЗначениеЗаполнено(Рез.Цена) Тогда
			Продолжить;
		КонецЕслИ;
		Если Не ЗначениеЗаполнено(Рез.Остаток) Тогда
			Продолжить;
		КонецЕслИ;
		
		//		Если Не ЗначениеЗаполнено(Рез.Поставщик) Тогда
		//		Продолжить;
		//	КонецЕслИ;
		//
		
		
		
		
		Рез1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		н = 1;
		Пока РЕз1.Следующий() Цикл
			Если ЗначениеЗаполнено(Рез1.Остаток) и ЗначениеЗаполнено(Рез1.Поставщик) Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("item");
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("id");
				ЗаписьXML.ЗаписатьТекст(Рез.НоменклатураКод); 
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				//ЗаписьXML.ЗаписатьНачалоЭлемента("idvn");
				//ЗаписьXML.ЗаписатьТекст(Строка(Рез.Номенклатура.УникальныйИдентификатор()));
				//ЗаписьXML.ЗаписатьКонецЭлемента();
				
				
				//
				//           |	ЦеныНоменклатурыСрезПоследних.ВалютаКод,
				//           |	ЦеныНоменклатурыСрезПоследних.Цена,
				//           |	ЦеныНоменклатурыСрезПоследних.НоменклатураВидНоменклатуры,
				//           |	ЦеныНоменклатурыСрезПоследних.НоменклатураСтранаПроисхождения,
				//           |	ЦеныНоменклатурыСрезПоследних.НоменклатураСезонность,
				//ЗаписьXML.ЗаписатьНачалоЭлемента("ВалютаКод");
				//ЗаписьXML.ЗаписатьТекст(Строка(Рез.ВалютаКод));
				//ЗаписьXML.ЗаписатьКонецЭлемента();
				
				//Попытка
				Если Рез.Поле1 <> Null  Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("Цена");
					ЗаписьXML.ЗаписатьТекст(Формат(Окр(Рез.Цена*Рез.Поле1,2),"ЧЦ=12; ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0; ЧГ=3,0"));
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЕсли;
				
								Если Рез.Поле1 <> Null и ЗначениеЗаполнено(Рез.Цена1) Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("ЦенаОПТ");
					ЗаписьXML.ЗаписатьТекст(Формат(Окр(Рез.Цена1*Рез.Поле1,2),"ЧЦ=12; ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0; ЧГ=3,0"));
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЕсли;

				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ПоставщикСклад");
				ЗаписьXML.ЗаписатьТекст(Строка(РЕз1.Поставщик)); 
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Остаток");
				ЗаписьXML.ЗаписатьТекст(Строка(Строка(Рез1.Остаток))); 
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Поставщик");
				ЗаписьXML.ЗаписатьТекст(Строка(Строка(Рез1.Поставщик1))); 
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
					ЗаписьXML.ЗаписатьНачалоЭлемента("Город");
				ЗаписьXML.ЗаписатьТекст(Строка(Строка(Рез1.МІСТО))); 
				ЗаписьXML.ЗаписатьКонецЭлемента();
			
				
									ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаПроизводства");
				ЗаписьXML.ЗаписатьТекст(Строка(Строка(Рез.ДатаПроизводства))); 
				ЗаписьXML.ЗаписатьКонецЭлемента();

				
									ЗаписьXML.ЗаписатьНачалоЭлемента("Страна");
				ЗаписьXML.ЗаписатьТекст(Строка(Строка(Рез.Страна))); 
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 
				
			КонецЕсли; 
			
			
			
		КонецЦикла; 
		
		
		
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 		
	ЗаписьXML.Закрыть();
	
	//ЗаписьXML.ОткрытьФайл( "c:\temp\return_"+ОбщегоНазначения.ПолучитьНомерНаПечать(Рез.Ссылка)+ДатаВ+".xml");
	
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");
	//Если Найти(ДатаВ,"PM") = 0 и Найти(ДатаВ,"AM") = 0 Тогда
	Сайт = Новый FTPСоединение(Адрессайта,,Логин,Пароль,,Истина,4000);
	Сайт.УстановитьТекущийКаталог(КаталогНаСервере);
	
	Сайт.Записать("c:\temp\goods2op.xml","_goods_"+ДатаВ+".xml"); 
	Сайт.Переместить("_goods_"+ДатаВ+".xml","goods_"+ДатаВ+".xml"); 
	//КонецЕслИ;
КонецПроцедуры

Процедура ВыгрузкаИзмененияНоменклатуры() Экспорт
		// Вставити вміст обробника.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Изменения.Ссылка
	|ИЗ
	|	Справочник.Номенклатура.Изменения КАК Изменения
	|ГДЕ
	|	Изменения.Узел = &Узел"
	;
	Запрос.УстановитьПараметр("Узел",планыОбмена.Сайт.НайтиПоКоду("Сайт"));
	Рез1 = Запрос.Выполнить().Выбрать();
	Спис1 = Новый списокЗначений;
	Пока Рез1.Следующий() Цикл
		Спис1.Добавить(Рез1.Ссылка);		
	КонецЦикла; 
Если сПИС1.Количество() = 0 Тогда
	вОЗВРАТ;
КонецЕсли; 
	
	
	//Вторая выгрузка 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Ссылка КАК Ссылка,
	               |	ЦеныНоменклатурыСрезПоследних.ВидНоменклатуры,
	               |	ЦеныНоменклатурыСрезПоследних.Код,
	               |	ЦеныНоменклатурыСрезПоследних.СтранаПроисхождения,
	               |	ЦеныНоменклатурыСрезПоследних.Сезонность,
	               |	ЦеныНоменклатурыСрезПоследних.Ширина,
	               |	ЦеныНоменклатурыСрезПоследних.ДиаметрДиска,
	               |	ЦеныНоменклатурыСрезПоследних.ВысотаПрофиля,
	               |	ЦеныНоменклатурыСрезПоследних.МежболтовоерасстояниеPCD1,
	               |	ЦеныНоменклатурыСрезПоследних.ВылетДисков,
	               |	ЦеныНоменклатурыСрезПоследних.Производитель,
	               |	ЦеныНоменклатурыСрезПоследних.Модель,
	               |	ЦеныНоменклатурыСрезПоследних.ИндексСкорости,
	               |	ЦеныНоменклатурыСрезПоследних.Покраска,
	               |	ЦеныНоменклатурыСрезПоследних.Тип,
	               |	ЦеныНоменклатурыСрезПоследних.СпециальныйИндекс,
	               |	ЦеныНоменклатурыСрезПоследних.ДополнительныеПараметры,
	               |	ЦеныНоменклатурыСрезПоследних.РисункиПротектора,
	               |	ЦеныНоменклатурыСрезПоследних.МежболтовоерасстояниеPCD2,
	               |	ЦеныНоменклатурыСрезПоследних.ИндексНагрузки,
	               |	ЦеныНоменклатурыСрезПоследних.Акция,
	               |	ЦеныНоменклатурыСрезПоследних.Ступица,
	               |	ЦеныНоменклатурыСрезПоследних.ЕстьЦена,
	               |	ЦеныНоменклатурыСрезПоследних.Шипы,
	               |	ЦеныНоменклатурыСрезПоследних.МаркаАвтомобиля,
	               |	ЦеныНоменклатурыСрезПоследних.МодельАвтомобиля,
	               |	ЦеныНоменклатурыСрезПоследних.Материал,
	               |	ЦеныНоменклатурыСрезПоследних.СалонБагажник,
	               |	ЦеныНоменклатурыСрезПоследних.Емкость,
	               |	ЦеныНоменклатурыСрезПоследних.ПусковойТок,
	               |	ЦеныНоменклатурыСрезПоследних.Полярность,
	               |	ЦеныНоменклатурыСрезПоследних.Длинна,
	               |	ЦеныНоменклатурыСрезПоследних.ШиринаАкумулятора,
	               |	ЦеныНоменклатурыСрезПоследних.Высота,
	               |	ЦеныНоменклатурыСрезПоследних.Крепеж,
	               |	ЦеныНоменклатурыСрезПоследних.Износ,
	               |	ЦеныНоменклатурыСрезПоследних.БУ,
	               |	ЦеныНоменклатурыСрезПоследних.ТипСекреток,
	               |	ЦеныНоменклатурыСрезПоследних.РезьбаСекретки,
	               |	ЦеныНоменклатурыСрезПоследних.ВысотаСекретки,
	               |	ЦеныНоменклатурыСрезПоследних.ВидСекретки,
	               |	ЦеныНоменклатурыСрезПоследних.ПрижимнаяПоверхность,
	               |	ЦеныНоменклатурыСрезПоследних.Покрытие,
	               |	ЦеныНоменклатурыСрезПоследних.Ключ,
	               |	ЦеныНоменклатурыСрезПоследних.ДопПараметрСекреток,
	               |	ЦеныНоменклатурыСрезПоследних.ТипПроставки,
	               |	ЦеныНоменклатурыСрезПоследних.Сверловка1,
	               |	ЦеныНоменклатурыСрезПоследних.Сверловка2,
	               |	ЦеныНоменклатурыСрезПоследних.Ступица1,
	               |	ЦеныНоменклатурыСрезПоследних.Ступица2,
	               |	ЦеныНоменклатурыСрезПоследних.ТолщинаПроставки,
	               |	ЦеныНоменклатурыСрезПоследних.КреплениеКДиску,
	               |	ЦеныНоменклатурыСрезПоследних.ДопПараметрПроставок,
	               |	ЦеныНоменклатурыСрезПоследних.МатериалЦентровочногоКольца,
	               |	ЦеныНоменклатурыСрезПоследних.ДопПараметрыЦентровочныхКолец,
	               |	ЦеныНоменклатурыСрезПоследних.ТипШпильки,
	               |	ЦеныНоменклатурыСрезПоследних.ДиаметрЗабивки,
	               |	ЦеныНоменклатурыСрезПоследних.ОбщаяДлина,
	               |	ЦеныНоменклатурыСрезПоследних.ДопПараметыШпильки,
	               |	ЦеныНоменклатурыСрезПоследних.Артикул КАК Артикул,
	               |	ЦеныНоменклатурыСрезПоследних.Наименование КАК НаименованиеПолное
	               |ИЗ
	               |	Справочник.Номенклатура КАК ЦеныНоменклатурыСрезПоследних
	               |ГДЕ
	               |	ЦеныНоменклатурыСрезПоследних.Ссылка В(&Спис)";
	Запрос.УстановитьПараметр("Спис",Спис1);
	Рез = Запрос.Выполнить().Выбрать();
	
	КаталогНаСервере = "Items"+"/";
	Адрессайта = СокрЛП("88.218.28.163");//СокрЛП("185.156.42.204");
	Логин = СокрЛП("ftp-garazh");
	Пароль = СокрЛП("t46KlF81m");
	//    Попытка
	
	ЗаписьXML = Новый ЗаписьXML;
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");
	
	ЗаписьXML.ОткрытьФайл( "c:\temp\goods3.xml");
	// Записать директиву
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	// Записать начало корневого элемента 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Start");
	// Записать атрибут корневого элеиента 
	ЗаписьXML.ЗаписатьАтрибут("Name", "goods");
	ЗаписьXML.ЗаписатьКомментарий("Export goods");
	
	пока Рез.Следующий() Цикл
		//Сообщить(Рез.Ссылка);
		
		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("item");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("id");
		ЗаписьXML.ЗаписатьТекст(Рез.Код); 
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("idvn");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.ССЫЛКА.УникальныйИдентификатор()));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВидНоменклатуры");
		ЗаписьXML.ЗаписатьТекст(Строка(Рез.ВидНоменклатуры));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		Если ЗначениеЗаполнено(Рез.СтранаПроисхождения) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСтранаПроисхождения");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.СтранаПроисхождения));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.Сезонность) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСезонность");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Сезонность));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		Если ЗначениеЗаполнено(Рез.Артикул) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("Артикул");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Артикул));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Ширина) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураШирина");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Ширина));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ДиаметрДиска) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДиаметрДиска");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ДиаметрДиска));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ВысотаПрофиля) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВысотаПрофиля");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ВысотаПрофиля));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.МежболтовоерасстояниеPCD1) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМежболтовоерасстояниеPCD1");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.МежболтовоерасстояниеPCD1));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ВылетДисков) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВылетДисков");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ВылетДисков));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.Производитель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПроизводитель");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Производитель));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Модель) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМодель");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Модель));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ИндексСкорости) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураИндексСкорости");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ИндексСкорости));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Покраска) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПокраска");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Покраска));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Тип) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТип");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Тип));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.СпециальныйИндекс) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСпециальныйИндекс");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.СпециальныйИндекс));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ДополнительныеПараметры) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДополнительныеПараметры");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ДополнительныеПараметры));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.РисункиПротектора) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураРисункиПротектора");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.РисункиПротектора));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.МежболтовоерасстояниеPCD2) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМежболтовоерасстояниеPCD2");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.МежболтовоерасстояниеPCD2));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ИндексНагрузки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураИндексНагрузки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ИндексНагрузки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Акция) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураАкция");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Акция));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Ступица) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСтупица");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Ступица));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Шипы) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураШипы");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Шипы));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.МаркаАвтомобиля) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМаркаАвтомобиля");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.МаркаАвтомобиля));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.МодельАвтомобиля) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМодельАвтомобиля");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.МодельАвтомобиля));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Материал) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМатериал");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Материал));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.СалонБагажник) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСалонБагажник");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.СалонБагажник));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Емкость) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураЕмкость");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Емкость));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ПусковойТок) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПусковойТок");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ПусковойТок));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Полярность) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПолярность");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Полярность));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Длинна) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДлинна");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Длинна));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ШиринаАкумулятора) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураШиринаАкумулятора");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ШиринаАкумулятора));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Высота) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВысота");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Высота));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Крепеж) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураКрепеж");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Крепеж));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Износ) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураИзнос");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Износ));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.БУ) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураБУ");
			Если Рез.БУ Тогда
				ЗаписьXML.ЗаписатьТекст("Да");
			Иначе
				ЗаписьXML.ЗаписатьТекст("Нет");
			КонецЕслИ;
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ТипСекреток) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТипСекреток");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ТипСекреток));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.РезьбаСекретки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураРезьбаСекретки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.РезьбаСекретки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ВысотаСекретки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВысотаСекретки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ВысотаСекретки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ВидСекретки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураВидСекретки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ВидСекретки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ПрижимнаяПоверхность) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПрижимнаяПоверхность");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ПрижимнаяПоверхность));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.Покрытие) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураПокрытие");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Покрытие));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.Ключ) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураКлюч");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Ключ));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ДопПараметрСекреток) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДопПараметрСекреток");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ДопПараметрСекреток));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ТипПроставки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТипПроставки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ТипПроставки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.Сверловка1) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСверловка1");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Сверловка1));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Сверловка2) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСверловка2");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Сверловка2));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Ступица1) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСтупица1");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Ступица1));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.Ступица2) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураСтупица2");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.Ступица2));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ТолщинаПроставки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТолщинаПроставки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ТолщинаПроставки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.КреплениеКДиску) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураКреплениеКДиску");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.КреплениеКДиску));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ДопПараметрПроставок) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДопПараметрПроставок");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ДопПараметрПроставок));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.МатериалЦентровочногоКольца) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураМатериалЦентровочногоКольца");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.МатериалЦентровочногоКольца));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		
		Если ЗначениеЗаполнено(Рез.ДопПараметрыЦентровочныхКолец) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДопПараметрыЦентровочныхКолец");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ДопПараметрыЦентровочныхКолец));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ТипШпильки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураТипШпильки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ТипШпильки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ДиаметрЗабивки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДиаметрЗабивки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ДиаметрЗабивки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ОбщаяДлина) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("ОбщаяДлина");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ОбщаяДлина));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.ДопПараметыШпильки) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураДопПараметыШпильки");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.ДопПараметыШпильки));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
		Если ЗначениеЗаполнено(Рез.НаименованиеПолное) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("НоменклатураНаименованиеПолное");
			ЗаписьXML.ЗаписатьТекст(Строка(Рез.НаименованиеПолное));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕслИ;
		
				
		
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 
		
		
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 		
	ЗаписьXML.Закрыть();
	
	//ЗаписьXML.ОткрытьФайл( "c:\temp\return_"+ОбщегоНазначения.ПолучитьНомерНаПечать(Рез.Ссылка)+ДатаВ+".xml");
	
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");
	//Если Найти(ДатаВ,"PM") = 0 и Найти(ДатаВ,"AM") = 0 Тогда
	Сайт = Новый FTPСоединение(Адрессайта,,Логин,Пароль,,Истина,4000);
	Сайт.УстановитьТекущийКаталог(КаталогНаСервере);
	
	Сайт.Записать("c:\temp\goods3.xml","_goods_"+ДатаВ+".xml"); 
	Сайт.Переместить("_goods_"+ДатаВ+".xml","goods_"+ДатаВ+".xml"); 
	
	Рез.Сбросить();
	Пока Рез.Следующий() Цикл
		ПланыОбмена.УдалитьРегистрациюИзменений(планыОбмена.Сайт.НайтиПоКоду("Сайт"),Рез.Ссылка);
		
	КонецЦикла; 

КонецПроцедуры

Процедура ВыгрузитьНоменклатуруГараж() Экспорт
	// Вставити вміст обробника.
	//  /opt sklad garazh
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	               |	КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Поле1,
	               |	ВложенныйЗапрос1.Номенклатура.Код КАК НоменклатураКод,
	               |	ДатыПроизводстваСрезПоследних.ДатаПроизводства КАК ДатаПроизводства,
	               |	ДатыПроизводстваСрезПоследних.Страна КАК Страна,
	               |	ВложенныйЗапрос.Цена КАК Цена1,
	               |	ВложенныйЗапрос1.Склад КАК Склад,
	               |	ВложенныйЗапрос1.КоличествоОстаток КАК КоличествоОстаток,
	               |	ЕСТЬNULL(ВложенныйЗапрос1.Резерв, 0) КАК Резерв,
	               |	ВложенныйЗапрос1.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТоварыНаСкладахОстатки.Склад КАК Склад,
	               |		ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |		СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	               |		СУММА(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК Резерв
	               |	ИЗ
	               |		РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеНаСкладахОстатки
	               |			ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	               |				И ТоварыНаСкладахОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ТоварыНаСкладахОстатки.Склад,
	               |		ТоварыНаСкладахОстатки.Номенклатура) КАК ВложенныйЗапрос1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &ТЦ) КАК ЦеныНоменклатурыСрезПоследних
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
	               |			ПО ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроизводства.СрезПоследних КАК ДатыПроизводстваСрезПоследних
	               |			ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ДатыПроизводстваСрезПоследних.Номенклатура
	               |				И ЦеныНоменклатурыСрезПоследних.Поставщик = ДатыПроизводстваСрезПоследних.Поставщик
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура1,
	               |				ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	               |				ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта
	               |			ИЗ
	               |				РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен.Код = ""000000006"") КАК ЦеныНоменклатурыСрезПоследних) КАК ВложенныйЗапрос
	               |			ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = ВложенныйЗапрос.Номенклатура1
	               |		ПО ВложенныйЗапрос1.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |ИТОГИ
	               |	МАКСИМУМ(Цена),
	               |	МАКСИМУМ(Поле1),
	               |	МАКСИМУМ(НоменклатураКод),
	               |	МАКСИМУМ(ДатаПроизводства),
	               |	МАКСИМУМ(Страна),
	               |	МАКСИМУМ(Цена1),
	               |	МАКСИМУМ(КоличествоОстаток),
	               |	МАКСИМУМ(Резерв)
	               |ПО
	               |	Склад,
	               |	Номенклатура";
	Запрос.УстановитьПараметр("ТЦ",Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001"));
	Рез = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	КаталогНаСервере = "opt sklad garazh"+"/";
	Адрессайта = СокрЛП("88.218.28.163");//СокрЛП("185.156.42.204");
	Логин = СокрЛП("ftp-garazh");
	Пароль = СокрЛП("t46KlF81m");
	//    Попытка
	
	ЗаписьXML = Новый ЗаписьXML;
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");
	
	ЗаписьXML.ОткрытьФайл( "c:\temp\goods2op1.xml");
	// Записать директиву
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	// Записать начало корневого элемента 
	ЗаписьXML.ЗаписатьНачалоЭлемента("Start");
	// Записать атрибут корневого элеиента 
	ЗаписьXML.ЗаписатьАтрибут("Name", "goods");
	ЗаписьXML.ЗаписатьКомментарий("Export goods");
	
	пока Рез.Следующий() Цикл
		//Сообщить(Рез.Ссылка);
		Если Не ЗначениеЗаполнено(Рез.Цена) Тогда
			Продолжить;
		КонецЕслИ;
		Если Не ЗначениеЗаполнено(Рез.КоличествоОстаток) Тогда
			Продолжить;
		КонецЕслИ;
		
		//		Если Не ЗначениеЗаполнено(Рез.Поставщик) Тогда
		//		Продолжить;
		//	КонецЕслИ;
		//
		
		
		
		
		Рез1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		н = 1;
		Пока РЕз1.Следующий() Цикл
			Если ЗначениеЗаполнено(Рез1.КоличествоОстаток)  Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента("item");
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("id");
				ЗаписьXML.ЗаписатьТекст(Строка(Рез1.НоменклатураКод)); 
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				//ЗаписьXML.ЗаписатьНачалоЭлемента("idvn");
				//ЗаписьXML.ЗаписатьТекст(Строка(Рез.Номенклатура.УникальныйИдентификатор()));
				//ЗаписьXML.ЗаписатьКонецЭлемента();
				
				
				//
				//           |	ЦеныНоменклатурыСрезПоследних.ВалютаКод,
				//           |	ЦеныНоменклатурыСрезПоследних.Цена,
				//           |	ЦеныНоменклатурыСрезПоследних.НоменклатураВидНоменклатуры,
				//           |	ЦеныНоменклатурыСрезПоследних.НоменклатураСтранаПроисхождения,
				//           |	ЦеныНоменклатурыСрезПоследних.НоменклатураСезонность,
				//ЗаписьXML.ЗаписатьНачалоЭлемента("ВалютаКод");
				//ЗаписьXML.ЗаписатьТекст(Строка(Рез.ВалютаКод));
				//ЗаписьXML.ЗаписатьКонецЭлемента();
				
				//Попытка
				Если Рез1.Поле1 <> Null и Рез1.Цена <> Null  Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("Цена");
					ЗаписьXML.ЗаписатьТекст(Формат(Окр(Рез1.Цена*Рез1.Поле1,2),"ЧЦ=12; ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0; ЧГ=3,0"));
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЕсли;
				
								Если Рез1.Поле1 <> Null и ЗначениеЗаполнено(Рез1.Цена1) Тогда
					ЗаписьXML.ЗаписатьНачалоЭлемента("ЦенаОПТ");
					ЗаписьXML.ЗаписатьТекст(Формат(Окр(Рез1.Цена1*Рез1.Поле1,2),"ЧЦ=12; ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=0; ЧГ=3,0"));
					ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЕсли;

				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ПоставщикСклад");
				ЗаписьXML.ЗаписатьТекст(Строка(РЕз1.Склад)); 
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Остаток");
				ЗаписьXML.ЗаписатьТекст(Строка(Строка(Рез1.КоличествоОстаток))); 
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Резерв");
				ЗаписьXML.ЗаписатьТекст(Строка(Строка(Рез1.Резерв))); 
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ВільнийЗалишок");
				ЗаписьXML.ЗаписатьТекст(Строка(Строка(Рез1.КоличествоОстаток-Рез1.Резерв))); 
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				
									ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаПроизводства");
				ЗаписьXML.ЗаписатьТекст(Строка(Строка(Рез1.ДатаПроизводства))); 
				ЗаписьXML.ЗаписатьКонецЭлемента();

				
									ЗаписьXML.ЗаписатьНачалоЭлемента("Страна");
				ЗаписьXML.ЗаписатьТекст(Строка(Строка(Рез1.Страна))); 
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 
				
			КонецЕсли; 
			
			
			
		КонецЦикла; 
		
		
		
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента(); //Относится к элементу "Корневой" 		
	ЗаписьXML.Закрыть();
	
	//ЗаписьXML.ОткрытьФайл( "c:\temp\return_"+ОбщегоНазначения.ПолучитьНомерНаПечать(Рез.Ссылка)+ДатаВ+".xml");
	
	ДатаВ = Формат(ТекущаяДата(),"ДФ=yyyyMMdd")+?(СтрДлина(СокрЛП(Формат(ТекущаяДата(),"ДЛФ=T")))=8,Формат(ТекущаяДата(),"ДЛФ=T"),"0"+Формат(ТекущаяДата(),"ДЛФ=T"));
	Если СтрДлина(Строка(ДатаВ)) = 18  Тогда
		ДатаВ = стрЗаменить(ДатаВ," "," 0");
	КонецЕслИ;
	ДатаВ = стрЗаменить(ДатаВ," ","");
	ДатаВ = стрЗаменить(ДатаВ,".","");
	ДатаВ = стрЗаменить(ДатаВ,":","");
	//Если Найти(ДатаВ,"PM") = 0 и Найти(ДатаВ,"AM") = 0 Тогда
	Сайт = Новый FTPСоединение(Адрессайта,,Логин,Пароль,,Истина,4000);
	Сайт.УстановитьТекущийКаталог(КаталогНаСервере);
	
	Сайт.Записать("c:\temp\goods2op1.xml","_goods_"+ДатаВ+".xml"); 
	Сайт.Переместить("_goods_"+ДатаВ+".xml","goods_"+ДатаВ+".xml"); 

	
КонецПроцедуры

Процедура ОбнулитьМенеджера() Экспорт
	Константы.ТекущийМенелдер.Установить(0);
	//с.д.(
	Константы.ТекущийМенеджерОПТ_СД.Установить(0);
	//с.д.)
КонецПроцедуры

 Функция СкачатьExcelНаСервер(СсылкаНаФайл) Экспорт
     
    // Создаем объект WinHttpRequest
    WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");

    // Открываем соединение
    WinHttp.Open("GET", СсылкаНаФайл, Ложь);

    // Отправляем запрос
    WinHttp.Send();

    // Проверяем статус
    Если WinHttp.Status = 200 Тогда
        // Создаем поток для записи файла
        Поток = Новый COMОбъект("ADODB.Stream");
        
        // Тип потока - бинарный (1)
        Поток.Type = 1;
        // Режим - чтение/запись (3)
        Поток.Mode = 3;

        Поток.Open();
        // Записываем полученные данные
        Поток.Write(WinHttp.ResponseBody);    
		
		//ИмяВременногоФайла = "c:\temp\Tayer6.xls";  

		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xls");  
		
		// Сохраняем файл на сервере
        Поток.SaveToFile(ИмяВременногоФайла, 2); // 2 = перезаписать если есть
        Поток.Close();
        Поток = Неопределено;
    Иначе
        Сообщить("Ошибка HTTP: " + Строка(WinHttp.Status) + " " + WinHttp.StatusText);
        Возврат Неопределено;
    КонецЕсли;
   Возврат ИмяВременногоФайла; 
	
КонецФункции


Процедура ЗапуститьУдалениеУстановокЦенПакетами()

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УстановкаЦенНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	|ГДЕ
	|	 УстановкаЦенНоменклатуры.Дата <= &ДатаГраница
	|
	|УПОРЯДОЧИТЬ ПО
	|	УстановкаЦенНоменклатуры.Дата";

	Запрос.УстановитьПараметр("ДатаГраница", ТекущаяДата() - 3 * 60 * 60 * 12);

	Выборка = Запрос.Выполнить().Выбрать();

	ВсегоВыбрано = 0;
	ВсегоУдалено = 0;

	Пока Выборка.Следующий() Цикл

		ВсегоВыбрано = ВсегоВыбрано + 1;

		Попытка
			
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Удалить();

			ВсегоУдалено = ВсегоУдалено + 1;

		Исключение
			
			ЗаписьЖурналаРегистрации(
				"УдалениеУстановокЦен",
				УровеньЖурналаРегистрации.Ошибка,
				,
				Выборка.Ссылка,
				"Ошибка удаления документа: " + ОписаниеОшибки()
			);
			
		КонецПопытки;

	КонецЦикла;

	ЗаписьЖурналаРегистрации(
		"УдалениеУстановокЦен",
		УровеньЖурналаРегистрации.Информация,
		,
		,
		"Удаление завершено. Выбрано: " + Строка(ВсегоВыбрано) 
		+ ", удалено: " + Строка(ВсегоУдалено)
	);

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ЗагрузитьТаер() Экспорт
	//шины------------------------------------------------------------------
	Если НачалоДня(ТекущаяДата()) + 13*60*60 > ТекущаяДата()  Тогда
		//файл1
		 СсылкаНаФайл = "https://opt.tyreclub.com.ua/api/Download/LastPriceListExportBySettings?code=246-770-c2d958d0a8f259efed4bcfeabae948d8a555932f";
	Иначе
		//ФАЙЛ2  
		СсылкаНаФайл = "https://opt.tyreclub.com.ua/api/Download/LastPriceListExportBySettings?code=246-5033-e77f75ae033aa0359f35c286b7ba6ac589eb8c9b";
	КонецЕсли; 
	
	
	//Если НачалоДня(ТекущаяДата()) + 13*60*60 > ТекущаяДата()  Тогда
	//	//файл1
	//	Файл = СкачатьФайл("http://gate-opt.tyreclub.com.ua/Download/LastPriceListExportBySettings?code=246-770-c2d958d0a8f259efed4bcfeabae948d8a555932f");
	//Иначе
	//	//ФАЙЛ2
	//	Файл = СкачатьФайл("http://gate-opt.tyreclub.com.ua/Download/LastPriceListExportBySettings?code=246-5033-e77f75ae033aa0359f35c286b7ba6ac589eb8c9b");
	//КонецЕсли; 
	
	//Старый метод
	//СсылкаНаФайл = СкачатьФайл(СсылкаНаФайл);

	//*************************************************************************************************
	Файл =  СкачатьExcelНаСервер(СсылкаНаФайл);
		
		//Заказ=Справочники.Таєр.ОсновнаяНастройка.ДокументПоШинам.ПолучитьОбъект();//Переделать на константу
	Заказ = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
	Заказ.Товары.Очистить();
	Заказ.ТипыЦен.Очистить();
	Заказ.Дата = (Текущаядата());
	Ст = Заказ.ТипыЦен.Добавить();
	Ст.ТипЦен = Справочники.ТипыЦенНоменклатурыКонтрагентов.НайтиПоКоду("Г00000087");
	Заказ.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Г00016623");
	Заказ.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Заказ.Комментарий = ТекущаяДата();
	ЗАказ.ВидНоменклутары = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000002");
	
	
	Заказ1 = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
	Заказ1.Товары.Очистить();
	Заказ1.ТипыЦен.Очистить();
	Заказ1.Дата = НачалоДня(Текущаядата());
	Ст = Заказ1.ТипыЦен.Добавить();
	Ст.ТипЦен = Справочники.ТипыЦенНоменклатурыКонтрагентов.НайтиПоКоду("Г00000087");
	Заказ1.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Г00016623");
	Заказ1.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Заказ1.Комментарий = "Пустий"+Строка(ТекущаяДата());
	ЗАказ1.ВидНоменклутары = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000002");
	
		
	ТабличныйДокумент = Новый ТабличныйДокумент();  
	Файл1с = Новый Файл(Файл); 
	РезультатПроверки = Файл1с.Существует();

	Попытка
		ТабличныйДокумент.Прочитать(Файл1с.ПолноеИмя, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		ЗаписьЖурналаРегистрации("ОшибкаЕксель",УровеньЖурналаРегистрации.Ошибка,,,""+РезультатПроверки+"\\\\\"+ Файл + "///"+ОписаниеОшибки());
	КонецПопытки;
	

	Запрос  = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗагрузкаПрайса.Номер,
	               |	ЗагрузкаПрайса.Колонка
	               |ИЗ
	               |	Справочник.ЗагрузкаПрайса КАК ЗагрузкаПрайса
	               |ГДЕ
	               |	ЗагрузкаПрайса.ПометкаУдаления = ЛОЖЬ
	               |	И ЗагрузкаПрайса.Владелец = &Владелец
	               |	И ЗагрузкаПрайса.ВидНоменклатуры = &Вид";
	Запрос.УстановитьПараметр("Владелец",Заказ.Контрагент);
	Запрос.УстановитьПараметр("Вид",Заказ.ВидНоменклутары);
	Рез = Запрос.Выполнить().Выбрать();
	КЦена = 0;
	КЦенаБН = 0;
	КПервая = 1;
	КДоп = 0;
	КОСтаток = 0;
	КМІСТО = 0;
	КПоставщик = 0;
	
	КВалюта = 0;
	КЦена = 0;	
	КРекОпт = 0;
	КРекОптБН = 0;
	КРекРозница = 0;
	КРекРозницаБН = 0;
	КДатаПроизводства = 0;
	КПроизводство = 0;
	КШирина = 0;
	КВысота = 0;
	Картикул = 0;
	КДиаметр = 0;
	КPCD1 = 0;
	КВылет = 0;
	
	ТНазва = Новый ТаблицаЗначений;
	ТНазва.Колонки.Добавить("Номер");
	ТНазва.Колонки.Добавить("НомерИмя");
	
	Пока Рез.Следующий() Цикл
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ПерваяСтрока Тогда
			Кпервая = Рез.Номер; 
		КонецЕслИ;	
	КонецЦикла;
	Рез.Сбросить();
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокумент.Область(?(КПервая > 1, КПервая - 1, КПервая),1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
	Построитель.Выполнить();
	
	ТаблицаЗначений = Построитель.Результат.Выгрузить();
	
	ВыбранныеПоля = Построитель.ВыбранныеПоля;

	Пока Рез.Следующий() Цикл
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Цена Тогда
			КЦена = Рез.Номер; 
			КЦенаИмя = ВыбранныеПоля[КЦена-1].Имя;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ПерваяСтрока Тогда
			Кпервая = Рез.Номер;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ДопПризнак Тогда
			КДоп = Рез.Номер;   
			КДопИмя = ВыбранныеПоля[КДоп-1].Имя;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.МІСТО Тогда
			КМІСТО = Рез.Номер;   
			КМІСТОИмя = ВыбранныеПоля[КМІСТО-1].Имя;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ПОСТАВЩИК Тогда
			КПоставщик = Рез.Номер;  
			КПоставщикИмя = ВыбранныеПоля[КПоставщик-1].Имя;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Остаток Тогда
			КОстаток = Рез.Номер; 
			КОстатокИмя = ВыбранныеПоля[КОстаток-1].Имя;
		КонецЕслИ;
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Валюта Тогда
			КВалюта = Рез.Номер;   
			КВалютаИмя = ВыбранныеПоля[КВалюта-1].Имя;
		КонецЕслИ;		
	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ЦенаБН Тогда
			КЦенаБН = Рез.Номер;  
			КЦенаБНИмя = ВыбранныеПоля[КЦенаБН-1].Имя;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекОпт Тогда
			КРекОпт = Рез.Номер;   
			КРекОптИмя = ВыбранныеПоля[КРекОпт-1].Имя;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекОптБН Тогда
			КРекОптБН = Рез.Номер; 
			КРекОптБНИмя = ВыбранныеПоля[КРекОптБН-1].Имя;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекРозница Тогда
			КРекРозница = Рез.Номер; 
			КРекРозницаИмя = ВыбранныеПоля[КРекРозница-1].Имя;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекРозницаБН Тогда
			КРекРозницаБН = Рез.Номер;
			КРекРозницаБНИмя = ВыбранныеПоля[КРекРозницаБН-1].Имя;
		КонецЕслИ;		
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ДатаПроизводства Тогда
			КДатаПроизводства = Рез.Номер;
			КДатаПроизводстваИмя = ВыбранныеПоля[КДатаПроизводства-1].Имя;
		КонецЕслИ;		
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Производство Тогда
			КПроизводство = Рез.Номер;
			КПроизводствоИмя = ВыбранныеПоля[КПроизводство-1].Имя;
		КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Ширина Тогда
			КШирина = Рез.Номер;
			КШиринаИмя = ВыбранныеПоля[КШирина-1].Имя;
		КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Высота Тогда
			КВысота = Рез.Номер; 
			КВысотаИмя = ВыбранныеПоля[КВысота-1].Имя;
		КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Диаметр Тогда
			КДиаметр = Рез.Номер; 
			КДиаметрИмя = ВыбранныеПоля[КДиаметр-1].Имя;
		КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.PCD1 Тогда
			КPCD1 = Рез.Номер;
			КPCD1Имя = ВыбранныеПоля[КPCD1-1].Имя;
		КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Вылет Тогда
			КВылет = Рез.Номер;
			КВылетИмя = ВыбранныеПоля[КВылет-1].Имя;
		КонецЕслИ;	
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Артикул Тогда
			КАртикул= Рез.Номер;  
			КАртикулИмя = ВыбранныеПоля[КАртикул-1].Имя;
		КонецЕслИ;	
		
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Название Тогда
			Если Рез.Номер>0 Тогда	
				Ст = ТНазва.Добавить();
				Ст.Номер = Рез.Номер; 
				Ст.НомерИмя = ВыбранныеПоля[Рез.Номер-1].Имя;
			КонецЕсли;
		КонецЕслИ;		
		
	КонецЦикла;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЧерныйСписокНоменклатуры.Контрагент,
	|	ЧерныйСписокНоменклатуры.Номенклатура
	|ИЗ
	|	РегистрСведений.ЧерныйСписокНоменклатуры КАК ЧерныйСписокНоменклатуры";
	Черный = Запрос.Выполнить().Выгрузить();
				ВысотаЗн = 0;				
				ШииринаЗн = 0;				
				ДиаметрЗн = 0;				
	
				PCD1Зн = 0;				
				ВылетЗн = 0;				

	//Попытка
		// Открытие файла Microsoft Excel 
		
		
		
	// 	Файл1с = Новый Файл(Файл); 
	// 	РезультатПроверки = Файл1с.Существует();
	//	Попытка
	//	ExcelФайл = ExcelПриложение.WorkBooks.Open(Файл);
	//Исключение
	//	 ЗаписьЖурналаРегистрации("ОшибкаЕксель",УровеньЖурналаРегистрации.Ошибка,,,""+РезультатПроверки+"\\\\\"+ Файл + "///"+ОписаниеОшибки());
	//	КонецПопытки;
		// Обработка файла Microsoft Excel
		//Попытка
		//	ExcelЛист = ExcelФайл.Sheets(1);
		//Исключение
		// ЗаписьЖурналаРегистрации("ОшибкаЕксель",УровеньЖурналаРегистрации.Ошибка,,,"Sheets     "+РезультатПроверки+"\\\\\"+ Файл + "///"+ОписаниеОшибки());
		//КонецПопытки;
		//xlCellTypeLastCell = 11;
		Док=Заказ;
		//ExcelПоследняяСтрока = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Row;
		//ExcelПоследняяКолонка = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Column;
		Строк=0;
		Док = Заказ;
		Док1 = Заказ1;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	НоменклатураПоставщика.Наименование,
		               |	НоменклатураПоставщика.Номенклатура,
		               |	НоменклатураПоставщика.Ссылка,
		               |	НоменклатураПоставщика.Артикул
		               |ИЗ
		               |	Справочник.НоменклатураПоставщика КАК НоменклатураПоставщика
		               |ГДЕ
		               |	НоменклатураПоставщика.ПометкаУдаления = ЛОЖЬ
		               |	И НоменклатураПоставщика.Владелец = &Контрагент
		               |	И НоменклатураПоставщика.ВидНоменклатуры = &Вид";
		Запрос.УстановитьПараметр("Контрагент",Заказ.Контрагент);
		Запрос.УстановитьПараметр("Вид",Заказ.ВидНоменклутары);
		Рез = Запрос.Выполнить().Выгрузить();
			КЦ = Заказ.ТипыЦен[0].ТипЦен;
		ТНазва.Сортировать("Номер");
		Артикул = ""; 
		НомерСтроки = 0;
		КолЗаписей = ТаблицаЗначений.Количество();

		Для каждого СтрокаТЗ из ТаблицаЗначений Цикл 
			НомерСтроки = НомерСтроки + 1;
			Назва = "";
			Для Каждого ст Из ТНазва Цикл
				Назва = Назва + СокрЛП(СтрокаТЗ[Ст.НомерИмя])+" ";

			КонецЦикла;
			Назва = СокрлП(Назва);
			Если СтрДлина(СокрЛП(Назва)) = 0 Тогда
				Продолжить;
			КонецЕслИ;
			Цена = СтрокаТЗ[КЦенаИмя];
			ЦенаБН = 0;
			РекОпт = 0;
			РекОптБН = 0;
			РекРозница = 0;
			РекРозницаБН = 0;
			Артикул = "";
			 МІСТО = "";
			 Поставщик = "";
			Попытка
				спЧисел="0123456789,."; 
				КвоСим=0;
				Содержание=Цена;
				Ост = "";
				Для ном=1 По СтрДлина(Содержание) Цикл    
					Если Найти(спЧисел,Сред(Содержание,ном,1))<>0 Тогда  
						Ост = Ост+Сред(Содержание,ном,1);
					иначе 
						//Прервать;
					КонецЕсли;				
				КонецЦикла;	    
				Попытка
					Цена = Число(Ост);				
				Исключение
					Цена = 0;
				КонецПопытки;
				
			Исключение
				Продолжить;
			Конецпопытки;
			Если Цена = 0 Тогда
				Продолжить;
			КонецЕсли;
			НомГ = 0;
			НомП = 0;
			Если КАртикул <> 0 Тогда
				Артикул = Артикул = СтрокаТЗ[КАртикулИмя];;					
			КонецЕслИ;
            НашлиН = Ложь;
			Проблема = Ложь;
			если Не НашлиН Тогда
			Струк = Новый Структура;
			
			Струк.Вставить("Наименование",Назва);
			СтрокиНашли = Рез.НайтиСтроки(Струк);
			Для каждого Ст11 Из СтрокиНашли Цикл
				НомГ = Ст11.Номенклатура;
				НомП = Ст11.Ссылка;
				НашлиН = Истина;
			КонецЦикла;
			КонецЕслИ;
			если Не НашлиН Тогда			
			Если ЗначениеЗаполнено(Артикул) Тогда
			Струк = Новый Структура;
			
			Струк.Вставить("Артикул",Артикул);
			СтрокиНашли = Рез.НайтиСтроки(Струк);
			Для каждого Ст11 Из СтрокиНашли Цикл
				НомГ = Ст11.Номенклатура;
				НомП = Ст11.Ссылка;
				Если НомП.Наименование <> Назва Тогда
					Проблема = Истина;
					
					КонецЕслИ;
				НашлиН = Истина;
			КонецЦикла;
		КонецЕсли;
		КонецЕслИ;
			Если НомП = 0 Тогда
				Н = Справочники.НоменклатураПоставщика.СоздатьЭлемент();
				Н.Владелец = Заказ.Контрагент;
				Н.Наименование = Назва;
				Если ЗначениеЗаполнено(Артикул) Тогда
				Н.Артикул = Артикул;
				КонецЕслИ;
				Н.Записать();
				НомП = Н.Ссылка;
			КонецЕслИ;
			Если КДОп <> 0 Тогда
				Доп = СтрокаТЗ[КДопИмя];				
			КонецЕслИ;
			Если КЦенаБН <> 0 Тогда
				ЦенаБН = СтрокаТЗ[КЦенаБНИмя];				
			КонецЕслИ;
			Если КРекОпт <> 0 Тогда
				РекОпт = СтрокаТЗ[КРекОптИмя];				
			КонецЕслИ;
			Если КРекОптБН <> 0 Тогда
				РекОптБН = СтрокаТЗ[КРекОптБНИмя];				
			КонецЕслИ;
			Если КРекРозница <> 0 Тогда
				РекРозница = СтрокаТЗ[КРекРозницаИмя];				
			КонецЕслИ;
			Если КДатаПроизводства <> 0 Тогда
				ДатаПроизводства = СтрокаТЗ[КДатаПроизводстваИмя];				
			КонецЕслИ;
			Если КПроизводство <> 0 Тогда
				Производство = СтрокаТЗ[КПроизводствоИмя];				
			КонецЕслИ;
			
			Если КМІСТО <> 0 Тогда
				МІСТО = СтрокаТЗ[КМІСТОИмя];				
			КонецЕслИ;
			Если КПоставщик <> 0 Тогда
				Поставщик = СтрокаТЗ[КПоставщикИмя];				
			КонецЕслИ;			
			
			Если КВысота <> 0 Тогда
				ВысотаЗн = СтрокаТЗ[КВысотаИмя]; 				
			КонецЕслИ;
			
			Если КШирина <> 0 Тогда
				ШиринаЗн = СтрокаТЗ[КШиринаИмя]; 	
			КонецЕслИ;
			
			Если КДиаметр <> 0 Тогда
				ДиаметрЗн =  СтрокаТЗ[КДиаметрИмя]; 			
			КонецЕслИ;
			
			Если КPCD1 <> 0 Тогда
				PCD1Зн = СтрокаТЗ[КPCD1Имя]; 		
			КонецЕслИ;
			Если КВылет <> 0 Тогда
				ВылетЗн = СтрокаТЗ[КВылетИмя]; 			
			КонецЕслИ;
			
			
			Если КРекРозницаБН <> 0 Тогда
				РекРозницаБН = СтрокаТЗ[КРекРозницаБНИмя]; 				
			КонецЕслИ;
			
			
			Если КОстаток <> 0 Тогда
				спЧисел="0123456789"; 
				КвоСим=0;
				Содержание=СтрокаТЗ[КОстатокИмя];
				Ост = "";
				Для ном=1 По СтрДлина(Содержание) Цикл    
					Если Найти(спЧисел,Сред(Содержание,ном,1))<>0 Тогда  
						Ост = Ост+Сред(Содержание,ном,1);
					иначе 
						//Прервать;
					КонецЕсли;				
				КонецЦикла;	    
				Попытка
					Остаток = Число(Ост);				
				Исключение
					Остаток = 0;
				КонецПопытки;
			КонецЕслИ;
			Если ЗначениеЗАполнено(НомГ) и ЗначениеЗаполнено(Цена) Тогда    //Если нашли 
				

			Ст = Док.Товары.Добавить();
			Ст.Номенклатура = НомГ;
			Ст.ВидНоменклатуры = Ст.Номенклатура.ВидНоменклатуры;
			Ст.Цена = Цена;
			Ст.Валюта = Док.Валюта;//КЦ.ВалютаЦены;
			Попытка
				Ст.ЕдиницаИзмерения = НомГ.ЕдиницаХраненияОстатков;
			Исключение
			КонецПопытки;
			Ст.ТипЦен = КЦ;
			Ст.Остаток = Остаток;
			Ст.Примечание = ДОп;
			Ст.НоменклатураПоставщика = НомП;
			Ст.ЦенаБН = ЦенаБН;
			Ст.РекОпт = РекОпт;
			Ст.РекОптБН = РекОптБН;
			Ст.Поставщик = Поставщик;
			Ст.МІСТО = МІСТО;
			Ст.РекРозница = РекРозница;
			Ст.ДатаПроизводства = ДатаПроизводства;
			Ст.Производитель = Производство;
			Если Проблема и Назва <> номП.Наименование Тогда
			Ст.Проблема = Проблема;
			Ст.Название = Назва;
			КонецеслИ;
			
			Ст.Ширина = Справочники.Ширина.НайтиПоНаименованию(СокрЛП(ШиринаЗн));
			Ст.Высота = Справочники.Профиль.НайтиПоНаименованию(СокрЛП(ВысотаЗн));
			Ст.Диаметр = Справочники.Диаметр.НайтиПоНаименованию(СокрЛП(ДиаметрЗН));
			
			Ст.PCD1 = Справочники.КрепежныеОтверствия.НайтиПоНаименованию(СокрЛП(PCD1ЗН));
			Если КВылет <> 0 Тогда
				Ст.Вылет = Справочники.ВылетДисков.НайтиПоНаименованию(СокрЛП(ВылетЗН));
			КонецЕслИ;
			Ст.РекРозницаБН = РекРозницаБН;
			
			Ст.ИндексСтрокиТаблицыЦен = 1;
			Ст.ЧерныйСписок = Ложь;
			
			Струк = Новый Структура;
			Струк.Вставить("Контрагент",Заказ.Контрагент);
			Струк.Вставить("Номенклатура",Ст.НоменклатураПоставщика);
			СтрокЧерный = Черный.НайтиСтроки(Струк);
			Для Каждого ст12 из СтрокЧерный Цикл
				Ст.ЧерныйСписок = Истина;
				прервать;
			КонецЦикла;
			
			Строк = Строк + 1;
		иначе
				Ст = Док1.Товары.Добавить();
			Ст.Номенклатура = НомГ;
			Ст.ВидНоменклатуры = Ст.Номенклатура.ВидНоменклатуры;
			Ст.Цена = Цена;
			Ст.Валюта = Док.Валюта;//КЦ.ВалютаЦены;
			Попытка
				Ст.ЕдиницаИзмерения = НомГ.ЕдиницаХраненияОстатков;
			Исключение
			КонецПопытки;
			Ст.ТипЦен = КЦ;
			Ст.Остаток = Остаток;
			Ст.Примечание = ДОп;
			Ст.НоменклатураПоставщика = НомП;
			Ст.ЦенаБН = ЦенаБН;
			Ст.РекОпт = РекОпт;
			Ст.РекОптБН = РекОптБН;
			Ст.Поставщик = Поставщик;
			Ст.МІСТО = МІСТО;
			Ст.РекРозница = РекРозница;
			Ст.ДатаПроизводства = ДатаПроизводства;
			Ст.Производитель = Производство;
			Если Проблема и Назва <> номП.Наименование Тогда
			Ст.Проблема = Проблема;
			Ст.Название = Назва;
			КонецеслИ;
			
			Ст.Ширина = Справочники.Ширина.НайтиПоНаименованию(СокрЛП(ШиринаЗн));
			Ст.Высота = Справочники.Профиль.НайтиПоНаименованию(СокрЛП(ВысотаЗн));
			Ст.Диаметр = Справочники.Диаметр.НайтиПоНаименованию(СокрЛП(ДиаметрЗН));
			
			Ст.PCD1 = Справочники.КрепежныеОтверствия.НайтиПоНаименованию(СокрЛП(PCD1ЗН));
			Если КВылет <> 0 Тогда
				Ст.Вылет = Справочники.ВылетДисков.НайтиПоНаименованию(СокрЛП(ВылетЗН));
			КонецЕслИ;
			Ст.РекРозницаБН = РекРозницаБН;
			
			Ст.ИндексСтрокиТаблицыЦен = 1;
			Ст.ЧерныйСписок = Ложь;
			
			Струк = Новый Структура;
			Струк.Вставить("Контрагент",Заказ.Контрагент);
			Струк.Вставить("Номенклатура",Ст.НоменклатураПоставщика);
			СтрокЧерный = Черный.НайтиСтроки(Струк);
			Для Каждого ст12 из СтрокЧерный Цикл
				Ст.ЧерныйСписок = Истина;
				прервать;
			КонецЦикла;
			
//			Строк = Строк + 1;

			//Пустий---------------
			КонецЕсли; 			
		КонецЦикла;
		//ExcelПриложение.Quit();
		Док1.Записать();
		
		Док.Записать();
		Док.Товары.Сортировать("Номенклатура Возр, Цена Возр");
		ном = "";
		н = 0;
		Пока Н < Док.Товары.Количество() Цикл
			Стр = Док.Товары[н];
			  Если стр.Номенклатура = ном Тогда
			  	н = н -1;
				Док.Товары.Удалить(Стр);
			Иначе
			ном  = Стр.Номенклатура;	
			  КонецЕсли; 
			  
			  н = н + 1;
		КонецЦикла; 
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			//с.д.(
		//	ПересчитатьЦены(Док); 
			//с.д.)
			Если Док.Проведен и док.Товары.Количество() > 1000 Тогда
				//с.д.(
				//Цены = Документы.УстановкаЦенНоменклатурыКонтрагентов.Выбрать();
				//Пока Цены.Следующий() Цикл
				//	Если Цены.Контрагент = Док.Контрагент и Цены.Ссылка <> Док.Ссылка и ЦЕНЫ.ВидНоменклутары = дОК.ВидНоменклутары Тогда
				//		Ц = Цены.ПолучитьОбъект();
				//		Ц.УстановитьПометкуУдаления(ИСтина);
				//		Ц.Записать();
				//	КонецЕсли; 	
				//КонецЦикла;
				
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	УстановкаЦенНоменклатурыКонтрагентов.Ссылка
				|ИЗ
				|	Документ.УстановкаЦенНоменклатурыКонтрагентов КАК УстановкаЦенНоменклатурыКонтрагентов
				|ГДЕ
				|	НЕ УстановкаЦенНоменклатурыКонтрагентов.ПометкаУдаления
				|	И УстановкаЦенНоменклатурыКонтрагентов.ВидНоменклутары = &ВидНоменклутары
				|	И УстановкаЦенНоменклатурыКонтрагентов.Контрагент = &Контрагент
				|	И УстановкаЦенНоменклатурыКонтрагентов.Ссылка <> &Ссылка"; 
				
				Запрос.УстановитьПараметр("ВидНоменклутары",дОК.ВидНоменклутары);
				Запрос.УстановитьПараметр("Ссылка",Док.Ссылка);
				Запрос.УстановитьПараметр("Контрагент",Док.Контрагент);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Ц = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
					//Ц.Удалить();
					Ц.УстановитьПометкуУдаления(ИСтина);
					Ц.Записать(); 
				КонецЦикла;
				//с.д.)
				
			КонецЕсли; 
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки;
		
	//Исключение
		
		
	//КонецПопытки;
	
	Попытка
		
		Обработки.СозданиеУЦ_По_ПравиламРасчета_СД.выполнитьвсеУстановкаЦенНоменклатурыКонтрагентовСОтбором(Док.Ссылка);

	Исключение
		ЗаписьЖурналаРегистрации("СозданиеУЦ_По_ПравиламРасчета_СД.ЗагрузитьТаер",УровеньЖурналаРегистрации.Ошибка,Метаданные.РегламентныеЗадания.ЗагрузитьТаер,Док,ОписаниеОшибки());
	КонецПопытки;	
	
	Попытка
		
		Обработки.СозданиеУЦ_По_ПравиламРасчета_СД.выполнитьвсеУстановкаЦенНоменклатурыКонтрагентовСОтбором(Док1.Ссылка);

	Исключение    
		
		ЗаписьЖурналаРегистрации("СозданиеУЦ_По_ПравиламРасчета_СД.ЗагрузитьТаер",УровеньЖурналаРегистрации.Ошибка,Метаданные.РегламентныеЗадания.ЗагрузитьТаер,Док1,ОписаниеОшибки());
	
	КонецПопытки;	

	//КонецПопытки;
	Попытка 	
		УдалитьФайлы(Файл);
	Исключение   
			ЗаписьЖурналаРегистрации("СозданиеУЦ_По_ПравиламРасчета_СД.ЗагрузитьТаер",УровеньЖурналаРегистрации.Ошибка,Метаданные.РегламентныеЗадания.ЗагрузитьТаер,Док1,ОписаниеОшибки());	
	КонецПопытки;
		
	//*********************************************************************************************
	
	
//диски------------------------------------------------------------------
	Если НачалоДня(ТекущаяДата()) + 13*60*60 > ТекущаяДата()  Тогда
		//файл1
		СсылкаНаФайл = "https://opt.tyreclub.com.ua/api/Download/LastPriceListExportBySettings?code=246-772-6d8445e818a68e29a47ffb48d97f5e27a32e9f84";
	Иначе
		//ФАЙЛ2
		СсылкаНаФайл = "https://opt.tyreclub.com.ua/api/Download/LastPriceListExportBySettings?code=246-5035-beca14549155f689d63b794177e48c5e21e73e23";
	КонецЕсли; 
	
	//Если НачалоДня(ТекущаяДата()) + 13*60*60 > ТекущаяДата()  Тогда
	//	//файл1
	//	Файл = СкачатьФайл("http://gate-opt.tyreclub.com.ua/Download/LastPriceListExportBySettings?code=246-772-6d8445e818a68e29a47ffb48d97f5e27a32e9f84");
	//Иначе
	//	//ФАЙЛ2
	//	Файл = СкачатьФайл("http://gate-opt.tyreclub.com.ua/Download/LastPriceListExportBySettings?code=246-5035-beca14549155f689d63b794177e48c5e21e73e23");
	//КонецЕсли; 
	
	
	//Старый метод
	//СсылкаНаФайл = СкачатьФайл(СсылкаНаФайл);

	//*************************************************************************************************
	Файл =  СкачатьExcelНаСервер(СсылкаНаФайл);
	
	Производство = "";
	
	//Заказ=Справочники.Таєр.ОсновнаяНастройка.ДокументПоШинам.ПолучитьОбъект();//Переделать на константу
	Заказ = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
	Заказ.Товары.Очистить();
	Заказ.ТипыЦен.Очистить();
	Заказ.Дата = (Текущаядата());
	Ст = Заказ.ТипыЦен.Добавить();
	Ст.ТипЦен = Справочники.ТипыЦенНоменклатурыКонтрагентов.НайтиПоКоду("Г00000087");
	Заказ.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Г00016623");
	Заказ.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Заказ.Комментарий = "ДИСКИ "+Строка(ТекущаяДата());
	ЗАказ.ВидНоменклутары = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000001");
	
	
	Заказ1 = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
	Заказ1.Товары.Очистить();
	Заказ1.ТипыЦен.Очистить();
	Заказ1.Дата = НачалоДня(Текущаядата());
	Ст = Заказ1.ТипыЦен.Добавить();
	Ст.ТипЦен = Справочники.ТипыЦенНоменклатурыКонтрагентов.НайтиПоКоду("Г00000087");
	Заказ1.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Г00016623");
	Заказ1.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Заказ1.Комментарий = "Пустий ДИСКИ "+Строка(ТекущаяДата());
	ЗАказ1.ВидНоменклутары = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000001");
	
	
	
	//Попытка
	//	ExcelПриложение = Новый COMОбъект("Excel.Application");
	//Исключение
	//КонецПопытки;   
	
	ТабличныйДокумент = Новый ТабличныйДокумент();  
	Файл1с = Новый Файл(Файл); 
	РезультатПроверки = Файл1с.Существует();

	Попытка
		ТабличныйДокумент.Прочитать(Файл1с.ПолноеИмя, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		ЗаписьЖурналаРегистрации("ОшибкаЕксель",УровеньЖурналаРегистрации.Ошибка,,,""+РезультатПроверки+"\\\\\"+ Файл + "///"+ОписаниеОшибки());
	КонецПопытки;

	Запрос  = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗагрузкаПрайса.Номер,
	               |	ЗагрузкаПрайса.Колонка
	               |ИЗ
	               |	Справочник.ЗагрузкаПрайса КАК ЗагрузкаПрайса
	               |ГДЕ
	               |	ЗагрузкаПрайса.ПометкаУдаления = ЛОЖЬ
	               |	И ЗагрузкаПрайса.Владелец = &Владелец
	               |	И ЗагрузкаПрайса.ВидНоменклатуры = &Вид";
	Запрос.УстановитьПараметр("Владелец",Заказ.Контрагент);
	Запрос.УстановитьПараметр("Вид",Заказ.ВидНоменклутары);     
	

	Рез = Запрос.Выполнить().Выбрать();
	КЦена = 0;
	КЦенаБН = 0;
	КПервая = 1;
	КДоп = 0;
	КОСтаток = 0;
	КМІСТО = 0;
	КПоставщик = 0;
	
	КВалюта = 0;
	КЦена = 0;	
	КРекОпт = 0;
	КРекОптБН = 0;
	КРекРозница = 0;
	КРекРозницаБН = 0;
	КДатаПроизводства = 0;
	КПроизводство = 0;
	КШирина = 0;
	КВысота = 0;
	Картикул = 0;
	КДиаметр = 0;
	КPCD1 = 0;
	КВылет = 0;   
	

	
	ТНазва = Новый ТаблицаЗначений;
	ТНазва.Колонки.Добавить("Номер");
	ТНазва.Колонки.Добавить("НомерИмя");
	
	Пока Рез.Следующий() Цикл
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ПерваяСтрока Тогда
			Кпервая = Рез.Номер; 
		КонецЕслИ;	
	КонецЦикла;
	Рез.Сбросить();
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокумент.Область(?(КПервая > 1, КПервая - 1, КПервая),1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
	Построитель.Выполнить();
	
	ТаблицаЗначений = Построитель.Результат.Выгрузить();
	
	ВыбранныеПоля = Построитель.ВыбранныеПоля;

	Пока Рез.Следующий() Цикл
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Цена Тогда
			КЦена = Рез.Номер; 
			КЦенаИмя = ВыбранныеПоля[КЦена-1].Имя;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ПерваяСтрока Тогда
			Кпервая = Рез.Номер;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ДопПризнак Тогда
			КДоп = Рез.Номер;   
			КДопИмя = ВыбранныеПоля[КДоп-1].Имя;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.МІСТО Тогда
			КМІСТО = Рез.Номер;   
			КМІСТОИмя = ВыбранныеПоля[КМІСТО-1].Имя;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ПОСТАВЩИК Тогда
			КПоставщик = Рез.Номер;  
			КПоставщикИмя = ВыбранныеПоля[КПоставщик-1].Имя;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Остаток Тогда
			КОстаток = Рез.Номер; 
			КОстатокИмя = ВыбранныеПоля[КОстаток-1].Имя;
		КонецЕслИ;
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Валюта Тогда
			КВалюта = Рез.Номер;   
			КВалютаИмя = ВыбранныеПоля[КВалюта-1].Имя;
		КонецЕслИ;		
	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ЦенаБН Тогда
			КЦенаБН = Рез.Номер;  
			КЦенаБНИмя = ВыбранныеПоля[КЦенаБН-1].Имя;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекОпт Тогда
			КРекОпт = Рез.Номер;   
			КРекОптИмя = ВыбранныеПоля[КРекОпт-1].Имя;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекОптБН Тогда
			КРекОптБН = Рез.Номер; 
			КРекОптБНИмя = ВыбранныеПоля[КРекОптБН-1].Имя;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекРозница Тогда
			КРекРозница = Рез.Номер; 
			КРекРозницаИмя = ВыбранныеПоля[КРекРозница-1].Имя;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекРозницаБН Тогда
			КРекРозницаБН = Рез.Номер;
			КРекРозницаБНИмя = ВыбранныеПоля[КРекРозницаБН-1].Имя;
		КонецЕслИ;		
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ДатаПроизводства Тогда
			КДатаПроизводства = Рез.Номер;
			КДатаПроизводстваИмя = ВыбранныеПоля[КДатаПроизводства-1].Имя;
		КонецЕслИ;		
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Производство Тогда
			КПроизводство = Рез.Номер;
			КПроизводствоИмя = ВыбранныеПоля[КПроизводство-1].Имя;
		КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Ширина Тогда
			КШирина = Рез.Номер;
			КШиринаИмя = ВыбранныеПоля[КШирина-1].Имя;
		КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Высота Тогда
			КВысота = Рез.Номер; 
			КВысотаИмя = ВыбранныеПоля[КВысота-1].Имя;
		КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Диаметр Тогда
			КДиаметр = Рез.Номер; 
			КДиаметрИмя = ВыбранныеПоля[КДиаметр-1].Имя;
		КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.PCD1 Тогда
			КPCD1 = Рез.Номер;
			КPCD1Имя = ВыбранныеПоля[КPCD1-1].Имя;
		КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Вылет Тогда
			КВылет = Рез.Номер;
			КВылетИмя = ВыбранныеПоля[КВылет-1].Имя;
		КонецЕслИ;	
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Артикул Тогда
			КАртикул= Рез.Номер;  
			КАртикулИмя = ВыбранныеПоля[КАртикул-1].Имя;
		КонецЕслИ;	
		
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Название Тогда
			Если Рез.Номер>0 Тогда	
				Ст = ТНазва.Добавить();
				Ст.Номер = Рез.Номер; 
				Ст.НомерИмя = ВыбранныеПоля[Рез.Номер-1].Имя;
			КонецЕсли;
		КонецЕслИ;		
		
	КонецЦикла; 
	КДатаПроизводства = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЧерныйСписокНоменклатуры.Контрагент,
	|	ЧерныйСписокНоменклатуры.Номенклатура
	|ИЗ
	|	РегистрСведений.ЧерныйСписокНоменклатуры КАК ЧерныйСписокНоменклатуры";
	Черный = Запрос.Выполнить().Выгрузить();
				ВысотаЗн = 0;				
				ШииринаЗн = 0;				
				ДиаметрЗн = 0;				
	
				PCD1Зн = 0;				
				ВылетЗн = 0;				

	//Попытка
		// Открытие файла Microsoft Excel 
		//ExcelФайл = ExcelПриложение.WorkBooks.Open(Файл);
		//// Обработка файла Microsoft Excel 
		//ExcelЛист = ExcelФайл.Sheets(1);
		//xlCellTypeLastCell = 11;
		Док=Заказ;
		//ExcelПоследняяСтрока = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Row;
		//ExcelПоследняяКолонка = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Column;
		Строк=0;
		Док = Заказ;
		Док1 = Заказ1;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	НоменклатураПоставщика.Наименование,
		               |	НоменклатураПоставщика.Номенклатура,
		               |	НоменклатураПоставщика.Ссылка,
		               |	НоменклатураПоставщика.Артикул
		               |ИЗ
		               |	Справочник.НоменклатураПоставщика КАК НоменклатураПоставщика
		               |ГДЕ
		               |	НоменклатураПоставщика.ПометкаУдаления = ЛОЖЬ
		               |	И НоменклатураПоставщика.Владелец = &Контрагент
		               |	И НоменклатураПоставщика.ВидНоменклатуры = &Вид";
		Запрос.УстановитьПараметр("Контрагент",Заказ.Контрагент);
		Запрос.УстановитьПараметр("Вид",Заказ.ВидНоменклутары);
		Рез = Запрос.Выполнить().Выгрузить();
			КЦ = Заказ.ТипыЦен[0].ТипЦен;
		ТНазва.Сортировать("Номер");
		Артикул = "";
		ДатаПроизводства = "";
		НомерСтроки = 0;
		КолЗаписей = ТаблицаЗначений.Количество();

		Для каждого СтрокаТЗ из ТаблицаЗначений Цикл 

			Назва = "";
			Для Каждого ст Из ТНазва Цикл
				Назва = Назва + СокрЛП(СтрокаТЗ[Ст.НомерИмя])+" ";;
			КонецЦикла;
			Назва = СокрлП(Назва);
			Если СтрДлина(СокрЛП(Назва)) = 0 Тогда
				Продолжить;
			КонецЕслИ;
			Цена = СтрокаТЗ[КЦенаИмя];
			ЦенаБН = 0;
			РекОпт = 0;
			РекОптБН = 0;
			РекРозница = 0;
			РекРозницаБН = 0;
			Артикул = "";
			 МІСТО = "";
			 Поставщик = "";
			Попытка
				спЧисел="0123456789,."; 
				КвоСим=0;
				Содержание=Цена;
				Ост = "";
				Для ном=1 По СтрДлина(Содержание) Цикл    
					Если Найти(спЧисел,Сред(Содержание,ном,1))<>0 Тогда  
						Ост = Ост+Сред(Содержание,ном,1);
					иначе 
						//Прервать;
					КонецЕсли;				
				КонецЦикла;	    
				Попытка
					Цена = Число(Ост);				
				Исключение
					Цена = 0;
				КонецПопытки;
				
			Исключение
				Продолжить;
			Конецпопытки;
			Если Цена = 0 Тогда
				Продолжить;
			КонецЕсли;
			НомГ = 0;
			НомП = 0;
			Если КАртикул <> 0 Тогда
				Артикул = СтрокаТЗ[КАртикулИмя];				
			КонецЕслИ;
            НашлиН = Ложь;
			Проблема = Ложь;
			если Не НашлиН Тогда
			Струк = Новый Структура;
			
			Струк.Вставить("Наименование",Назва);
			СтрокиНашли = Рез.НайтиСтроки(Струк);
			Для каждого Ст11 Из СтрокиНашли Цикл
				НомГ = Ст11.Номенклатура;
				НомП = Ст11.Ссылка;
				НашлиН = Истина;
			КонецЦикла;
			КонецЕслИ;
			если Не НашлиН Тогда			
			Если ЗначениеЗаполнено(Артикул) Тогда
			Струк = Новый Структура;
			
			Струк.Вставить("Артикул",Артикул);
			СтрокиНашли = Рез.НайтиСтроки(Струк);
			Для каждого Ст11 Из СтрокиНашли Цикл
				НомГ = Ст11.Номенклатура;
				НомП = Ст11.Ссылка;
				Если НомП.Наименование <> Назва Тогда
					Проблема = Истина;
					
					КонецЕслИ;
				НашлиН = Истина;
			КонецЦикла;
		КонецЕсли;
		КонецЕслИ;
			Если НомП = 0 Тогда
				Н = Справочники.НоменклатураПоставщика.СоздатьЭлемент();
				Н.Владелец = Заказ.Контрагент;
				Н.Наименование = Назва;
				Если ЗначениеЗаполнено(Артикул) Тогда
				Н.Артикул = Артикул;
				КонецЕслИ;
				Н.Записать();
				НомП = Н.Ссылка;
			КонецЕслИ;
			Если КДОп <> 0 Тогда
				Доп = СтрокаТЗ[КДопИмя];				
			КонецЕслИ;
			Если КЦенаБН <> 0 Тогда
				ЦенаБН = СтрокаТЗ[КЦенаБНИмя];				
			КонецЕслИ;
			Если КРекОпт <> 0 Тогда
				РекОпт = СтрокаТЗ[КРекОптИмя];				
			КонецЕслИ;
			Если КРекОптБН <> 0 Тогда
				РекОптБН = СтрокаТЗ[КРекОптБНИмя];				
			КонецЕслИ;
			Если КРекРозница <> 0 Тогда
				РекРозница = СтрокаТЗ[КРекРозницаИмя];				
			КонецЕслИ;
			Если КДатаПроизводства <> 0 Тогда
				ДатаПроизводства = СтрокаТЗ[КДатаПроизводстваИмя];				
			КонецЕслИ;
			Если КПроизводство <> 0 Тогда
				Производство = СтрокаТЗ[КПроизводствоИмя];				
			КонецЕслИ;
			
			Если КМІСТО <> 0 Тогда
				МІСТО = СтрокаТЗ[КМІСТОИмя];				
			КонецЕслИ;
			Если КПоставщик <> 0 Тогда
				Поставщик = СтрокаТЗ[КПоставщикИмя];				
			КонецЕслИ;			
			
			Если КВысота <> 0 Тогда
				ВысотаЗн = СтрокаТЗ[КВысотаИмя]; 				
			КонецЕслИ;
			
			Если КШирина <> 0 Тогда
				ШиринаЗн = СтрокаТЗ[КШиринаИмя]; 	
			КонецЕслИ;
			
			Если КДиаметр <> 0 Тогда
				ДиаметрЗн =  СтрокаТЗ[КДиаметрИмя]; 			
			КонецЕслИ;
			
			Если КPCD1 <> 0 Тогда
				PCD1Зн = СтрокаТЗ[КPCD1Имя]; 		
			КонецЕслИ;
			Если КВылет <> 0 Тогда
				ВылетЗн = СтрокаТЗ[КВылетИмя]; 			
			КонецЕслИ;
			
			
			Если КРекРозницаБН <> 0 Тогда
				РекРозницаБН = СтрокаТЗ[КРекРозницаБНИмя]; 				
			КонецЕслИ;
			
			Если КОстаток <> 0 Тогда
				спЧисел="0123456789"; 
				КвоСим=0;
				Содержание=СтрокаТЗ[КОстатокИмя];
				Ост = "";
				Для ном=1 По СтрДлина(Содержание) Цикл    
					Если Найти(спЧисел,Сред(Содержание,ном,1))<>0 Тогда  
						Ост = Ост+Сред(Содержание,ном,1);
					иначе 
						//Прервать;
					КонецЕсли;				
				КонецЦикла;	    
				Попытка
					Остаток = Число(Ост);				
				Исключение
					Остаток = 0;
				КонецПопытки;
			КонецЕслИ;
			Если ЗначениеЗАполнено(НомГ) и ЗначениеЗаполнено(Цена) Тогда    //Если нашли 
				

			Ст = Док.Товары.Добавить();
			Ст.Номенклатура = НомГ;
			Ст.ВидНоменклатуры = Ст.Номенклатура.ВидНоменклатуры;
			Ст.Цена = Цена;
			Ст.Валюта = Док.Валюта;//КЦ.ВалютаЦены;
			Попытка
				Ст.ЕдиницаИзмерения = НомГ.ЕдиницаХраненияОстатков;
			Исключение
			КонецПопытки;
			Ст.ТипЦен = КЦ;
			Ст.Остаток = Остаток;
			Ст.Примечание = ДОп;
			Ст.НоменклатураПоставщика = НомП;
			Ст.ЦенаБН = ЦенаБН;
			Ст.РекОпт = РекОпт;
			Ст.РекОптБН = РекОптБН;
			Ст.Поставщик = Поставщик;
			Ст.МІСТО = МІСТО;
			Ст.РекРозница = РекРозница;
			Ст.ДатаПроизводства = ДатаПроизводства;
			Ст.Производитель = Производство;
			Если Проблема и Назва <> номП.Наименование Тогда
			Ст.Проблема = Проблема;
			Ст.Название = Назва;
			КонецеслИ;
			
			Ст.Ширина = Справочники.Ширина.НайтиПоНаименованию(СокрЛП(ШиринаЗн));
			Ст.Высота = Справочники.Профиль.НайтиПоНаименованию(СокрЛП(ВысотаЗн));
			Ст.Диаметр = Справочники.Диаметр.НайтиПоНаименованию(СокрЛП(ДиаметрЗН));
			
			Ст.PCD1 = Справочники.КрепежныеОтверствия.НайтиПоНаименованию(СокрЛП(PCD1ЗН));
			Если КВылет <> 0 Тогда
				Ст.Вылет = Справочники.ВылетДисков.НайтиПоНаименованию(СокрЛП(ВылетЗН));
			КонецЕслИ;
			Ст.РекРозницаБН = РекРозницаБН;
			
			Ст.ИндексСтрокиТаблицыЦен = 1;
			Ст.ЧерныйСписок = Ложь;
			
			Струк = Новый Структура;
			Струк.Вставить("Контрагент",Заказ.Контрагент);
			Струк.Вставить("Номенклатура",Ст.НоменклатураПоставщика);
			СтрокЧерный = Черный.НайтиСтроки(Струк);
			Для Каждого ст12 из СтрокЧерный Цикл
				Ст.ЧерныйСписок = Истина;
				прервать;
			КонецЦикла;
			
			Строк = Строк + 1;
		иначе
				Ст = Док1.Товары.Добавить();
			Ст.Номенклатура = НомГ;
			Ст.ВидНоменклатуры = Ст.Номенклатура.ВидНоменклатуры;
			Ст.Цена = Цена;
			Ст.Валюта = Док.Валюта;//КЦ.ВалютаЦены;
			Попытка
				Ст.ЕдиницаИзмерения = НомГ.ЕдиницаХраненияОстатков;
			Исключение
			КонецПопытки;
			Ст.ТипЦен = КЦ;
			Ст.Остаток = Остаток;
			Ст.Примечание = ДОп;
			Ст.НоменклатураПоставщика = НомП;
			Ст.ЦенаБН = ЦенаБН;
			Ст.РекОпт = РекОпт;
			Ст.РекОптБН = РекОптБН;
			Ст.Поставщик = Поставщик;
			Ст.МІСТО = МІСТО;
			Ст.РекРозница = РекРозница;
			Ст.ДатаПроизводства = ДатаПроизводства;
			Ст.Производитель = Производство;
			Если Проблема и Назва <> номП.Наименование Тогда
			Ст.Проблема = Проблема;
			Ст.Название = Назва;
			КонецеслИ;
			
			Ст.Ширина = Справочники.Ширина.НайтиПоНаименованию(СокрЛП(ШиринаЗн));
			Ст.Высота = Справочники.Профиль.НайтиПоНаименованию(СокрЛП(ВысотаЗн));
			Ст.Диаметр = Справочники.Диаметр.НайтиПоНаименованию(СокрЛП(ДиаметрЗН));
			
			Ст.PCD1 = Справочники.КрепежныеОтверствия.НайтиПоНаименованию(СокрЛП(PCD1ЗН));
			Если КВылет <> 0 Тогда
				Ст.Вылет = Справочники.ВылетДисков.НайтиПоНаименованию(СокрЛП(ВылетЗН));
			КонецЕслИ;
			Ст.РекРозницаБН = РекРозницаБН;
			
			Ст.ИндексСтрокиТаблицыЦен = 1;
			Ст.ЧерныйСписок = Ложь;
			
			Струк = Новый Структура;
			Струк.Вставить("Контрагент",Заказ.Контрагент);
			Струк.Вставить("Номенклатура",Ст.НоменклатураПоставщика);
			СтрокЧерный = Черный.НайтиСтроки(Струк);
			Для Каждого ст12 из СтрокЧерный Цикл
				Ст.ЧерныйСписок = Истина;
				прервать;
			КонецЦикла;
			
//			Строк = Строк + 1;

			//Пустий---------------
			КонецЕсли; 			
		КонецЦикла;
		//ExcelПриложение.Quit();
		Док1.Записать();
		
		Док.Записать();
		Док.Товары.Сортировать("Номенклатура Возр, Цена Возр");
		ном = "";
		н = 0;
		Пока Н < Док.Товары.Количество() Цикл
			Стр = Док.Товары[н]; 
			
			Если стр.Номенклатура = ном Тогда
			  	н = н -1;
				Док.Товары.Удалить(Стр);
			Иначе
			ном  = Стр.Номенклатура;	
			  КонецЕсли; 
			  
			  н = н + 1;
		КонецЦикла; 
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			//с.д.(
			//ПересчитатьЦены(Док); 
			//с.д.)
		Если Док.Проведен и док.Товары.Количество() > 1000 Тогда
			//с.д.(
			//Цены = Документы.УстановкаЦенНоменклатурыКонтрагентов.Выбрать();
			//	Пока Цены.Следующий() Цикл
			//							Если Цены.Контрагент = Док.Контрагент и Цены.Ссылка <> Док.Ссылка и ЦЕНЫ.ВидНоменклутары = дОК.ВидНоменклутары Тогда
			//			Ц = Цены.ПолучитьОбъект();         //вернутььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььь
			//			Ц.УстановитьПометкуУдаления(ИСтина);
			//			Ц.Записать();
			//		КонецЕсли; 	
			//	КонецЦикла;  
				
			Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	УстановкаЦенНоменклатурыКонтрагентов.Ссылка
				|ИЗ
				|	Документ.УстановкаЦенНоменклатурыКонтрагентов КАК УстановкаЦенНоменклатурыКонтрагентов
				|ГДЕ
				|	НЕ УстановкаЦенНоменклатурыКонтрагентов.ПометкаУдаления
				|	И УстановкаЦенНоменклатурыКонтрагентов.ВидНоменклутары = &ВидНоменклутары
				|	И УстановкаЦенНоменклатурыКонтрагентов.Контрагент = &Контрагент
				|	И УстановкаЦенНоменклатурыКонтрагентов.Ссылка <> &Ссылка"; 
				
				Запрос.УстановитьПараметр("ВидНоменклутары",дОК.ВидНоменклутары);
				Запрос.УстановитьПараметр("Ссылка",Док.Ссылка);
				Запрос.УстановитьПараметр("Контрагент",Док.Контрагент);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Ц = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
					Ц.УстановитьПометкуУдаления(ИСтина);
					Ц.Записать(); 
				КонецЦикла;
				//с.д.)

				
			КонецЕсли; 
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки;
		
	//Исключение
		
		
	//КонецПопытки;
	Попытка 	
		УдалитьФайлы(Файл);
	Исключение   
			
		ЗаписьЖурналаРегистрации("СозданиеУЦ_По_ПравиламРасчета_СД.ЗагрузитьТаер",УровеньЖурналаРегистрации.Ошибка,Метаданные.РегламентныеЗадания.ЗагрузитьТаер,Док1,ОписаниеОшибки());
	
	КонецПопытки;
		
	//ЗапуститьУдалениеУстановокЦенПакетами();
	
КонецПроцедуры   

Процедура ЗагрузитьТаер2() Экспорт
	//шины------------------------------------------------------------------
	Если НачалоДня(ТекущаяДата()) + 13*60*60 > ТекущаяДата()  Тогда
		//файл1
		Файл = СкачатьФайл("https://opt.tyreclub.com.ua/api/Download/LastPriceListExportBySettings?code=246-770-c2d958d0a8f259efed4bcfeabae948d8a555932f");
	Иначе
		//ФАЙЛ2
		Файл = СкачатьФайл("https://opt.tyreclub.com.ua/api/Download/LastPriceListExportBySettings?code=246-5033-e77f75ae033aa0359f35c286b7ba6ac589eb8c9b");
	КонецЕсли; 
	
	
	
	//*************************************************************************************************
	
	
	
	//Заказ=Справочники.Таєр.ОсновнаяНастройка.ДокументПоШинам.ПолучитьОбъект();//Переделать на константу
	Заказ = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
	Заказ.Товары.Очистить();
	Заказ.ТипыЦен.Очистить();
	Заказ.Дата = (Текущаядата());
	Ст = Заказ.ТипыЦен.Добавить();
	Ст.ТипЦен = Справочники.ТипыЦенНоменклатурыКонтрагентов.НайтиПоКоду("Г00000087");
	Заказ.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Г00016623");
	Заказ.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Заказ.Комментарий = ТекущаяДата();
	ЗАказ.ВидНоменклутары = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000002");
	
	
	Заказ1 = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
	Заказ1.Товары.Очистить();
	Заказ1.ТипыЦен.Очистить();
	Заказ1.Дата = НачалоДня(Текущаядата());
	Ст = Заказ1.ТипыЦен.Добавить();
	Ст.ТипЦен = Справочники.ТипыЦенНоменклатурыКонтрагентов.НайтиПоКоду("Г00000087");
	Заказ1.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Г00016623");
	Заказ1.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Заказ1.Комментарий = "Пустий"+Строка(ТекущаяДата());
	ЗАказ1.ВидНоменклутары = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000002");
	
	
	
	//Попытка
		ExcelПриложение = Новый COMОбъект("Excel.Application");
		ExcelПриложение.Application.DisplayAlerts = False;// = 0;
	//Исключение
	//	Сообщить(""+ ОписаниеОшибки());
	//КонецПопытки;
	Запрос  = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗагрузкаПрайса.Номер,
	               |	ЗагрузкаПрайса.Колонка
	               |ИЗ
	               |	Справочник.ЗагрузкаПрайса КАК ЗагрузкаПрайса
	               |ГДЕ
	               |	ЗагрузкаПрайса.ПометкаУдаления = ЛОЖЬ
	               |	И ЗагрузкаПрайса.Владелец = &Владелец
	               |	И ЗагрузкаПрайса.ВидНоменклатуры = &Вид";
	Запрос.УстановитьПараметр("Владелец",Заказ.Контрагент);
	Запрос.УстановитьПараметр("Вид",Заказ.ВидНоменклутары);
	Рез = Запрос.Выполнить().Выбрать();
	КЦена = 0;
	КЦенаБН = 0;
	КПервая = 1;
	КДоп = 0;
	КОСтаток = 0;
	КМІСТО = 0;
	КПоставщик = 0;
	
	КВалюта = 0;
	КЦена = 0;	
	КРекОпт = 0;
	КРекОптБН = 0;
	КРекРозница = 0;
	КРекРозницаБН = 0;
	КДатаПроизводства = 0;
	КПроизводство = 0;
	КШирина = 0;
	КВысота = 0;
	Картикул = 0;
	КДиаметр = 0;
	КPCD1 = 0;
	КВылет = 0;
	
	ТНазва = Новый ТаблицаЗначений;
	ТНазва.Колонки.Добавить("Номер");
	Пока Рез.Следующий() Цикл
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Цена Тогда
			КЦена = Рез.Номер;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ПерваяСтрока Тогда
				Кпервая = Рез.Номер;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ДопПризнак Тогда
				КДоп = Рез.Номер;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.МІСТО Тогда
				КМІСТО = Рез.Номер;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ПОСТАВЩИК Тогда
				КПоставщик = Рез.Номер;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Остаток Тогда
				КОстаток = Рез.Номер;
		КонецЕслИ;
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Валюта Тогда
				КВалюта = Рез.Номер;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Цена Тогда
				КЦена = Рез.Номер;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ЦенаБН Тогда
				КЦенаБН = Рез.Номер;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекОпт Тогда
				КРекОпт = Рез.Номер;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекОптБН Тогда
				КРекОптБН = Рез.Номер;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекРозница Тогда
				КРекРозница = Рез.Номер;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекРозницаБН Тогда
				КРекРозницаБН = Рез.Номер;
		КонецЕслИ;		
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ДатаПроизводства Тогда
				КДатаПроизводства = Рез.Номер;
		КонецЕслИ;		
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Производство Тогда
				КПроизводство = Рез.Номер;
			КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Ширина Тогда
				КШирина = Рез.Номер;
			КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Высота Тогда
				КВысота = Рез.Номер;
			КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Диаметр Тогда
				КДиаметр = Рез.Номер;
			КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.PCD1 Тогда
				КPCD1 = Рез.Номер;
			КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Вылет Тогда
				КВылет = Рез.Номер;
			КонецЕслИ;	
			
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Артикул Тогда
				КАртикул= Рез.Номер;
			КонецЕслИ;	
	
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Название Тогда
				Если Рез.Номер>0 Тогда	
					Ст = ТНазва.Добавить();
					Ст.Номер = Рез.Номер;
				КонецЕсли;
		КонецЕслИ;		
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЧерныйСписокНоменклатуры.Контрагент,
	|	ЧерныйСписокНоменклатуры.Номенклатура
	|ИЗ
	|	РегистрСведений.ЧерныйСписокНоменклатуры КАК ЧерныйСписокНоменклатуры";
	Черный = Запрос.Выполнить().Выгрузить();
				ВысотаЗн = 0;				
				ШииринаЗн = 0;				
				ДиаметрЗн = 0;				
	
				PCD1Зн = 0;				
				ВылетЗн = 0;				

	//Попытка
		// Открытие файла Microsoft Excel 
		
		
		
     	Файл1с = Новый Файл(Файл); 
     	РезультатПроверки = Файл1с.Существует();
		Попытка
		ExcelФайл = ExcelПриложение.WorkBooks.Open(Файл);
	Исключение
		 ЗаписьЖурналаРегистрации("ОшибкаЕксель",УровеньЖурналаРегистрации.Ошибка,,,""+РезультатПроверки+"\\\\\"+ Файл + "///"+ОписаниеОшибки());
		КонецПопытки;
		// Обработка файла Microsoft Excel
		Попытка
			ExcelЛист = ExcelФайл.Sheets(1);
		Исключение
		 ЗаписьЖурналаРегистрации("ОшибкаЕксель",УровеньЖурналаРегистрации.Ошибка,,,"Sheets     "+РезультатПроверки+"\\\\\"+ Файл + "///"+ОписаниеОшибки());
		КонецПопытки;
		xlCellTypeLastCell = 11;
		Док=Заказ;
		ExcelПоследняяСтрока = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Row;
		ExcelПоследняяКолонка = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Column;
		Строк=0;
		Док = Заказ;
		Док1 = Заказ1;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	НоменклатураПоставщика.Наименование,
		               |	НоменклатураПоставщика.Номенклатура,
		               |	НоменклатураПоставщика.Ссылка,
		               |	НоменклатураПоставщика.Артикул
		               |ИЗ
		               |	Справочник.НоменклатураПоставщика КАК НоменклатураПоставщика
		               |ГДЕ
		               |	НоменклатураПоставщика.ПометкаУдаления = ЛОЖЬ
		               |	И НоменклатураПоставщика.Владелец = &Контрагент
		               |	И НоменклатураПоставщика.ВидНоменклатуры = &Вид";
		Запрос.УстановитьПараметр("Контрагент",Заказ.Контрагент);
		Запрос.УстановитьПараметр("Вид",Заказ.ВидНоменклутары);
		Рез = Запрос.Выполнить().Выгрузить();
			КЦ = Заказ.ТипыЦен[0].ТипЦен;
		ТНазва.Сортировать("Номер");
		Артикул = "";
		Для Строка = КПервая По ExcelПоследняяСтрока Цикл
			Назва = "";
			Для Каждого ст Из ТНазва Цикл
				Назва = Назва + СокрЛП((ExcelЛист.Cells(Строка, Ст.Номер).Value))+" ";
			КонецЦикла;
			Назва = СокрлП(Назва);
			Если СтрДлина(СокрЛП(Назва)) = 0 Тогда
				Продолжить;
			КонецЕслИ;
			Цена = (ExcelЛист.Cells(Строка, КЦена).Value);
			ЦенаБН = 0;
			РекОпт = 0;
			РекОптБН = 0;
			РекРозница = 0;
			РекРозницаБН = 0;
			Артикул = "";
			 МІСТО = "";
			 Поставщик = "";
			Попытка
				спЧисел="0123456789,."; 
				КвоСим=0;
				Содержание=Цена;
				Ост = "";
				Для ном=1 По СтрДлина(Содержание) Цикл    
					Если Найти(спЧисел,Сред(Содержание,ном,1))<>0 Тогда  
						Ост = Ост+Сред(Содержание,ном,1);
					иначе 
						//Прервать;
					КонецЕсли;				
				КонецЦикла;	    
				Попытка
					Цена = Число(Ост);				
				Исключение
					Цена = 0;
				КонецПопытки;
				
			Исключение
				Продолжить;
			Конецпопытки;
			Если Цена = 0 Тогда
				Продолжить;
			КонецЕсли;
			НомГ = 0;
			НомП = 0;
			Если КАртикул <> 0 Тогда
				Артикул = (ExcelЛист.Cells(Строка, КАртикул).Value);				
			КонецЕслИ;
            НашлиН = Ложь;
			Проблема = Ложь;
			если Не НашлиН Тогда
			Струк = Новый Структура;
			
			Струк.Вставить("Наименование",Назва);
			СтрокиНашли = Рез.НайтиСтроки(Струк);
			Для каждого Ст11 Из СтрокиНашли Цикл
				НомГ = Ст11.Номенклатура;
				НомП = Ст11.Ссылка;
				НашлиН = Истина;
			КонецЦикла;
			КонецЕслИ;
			если Не НашлиН Тогда			
			Если ЗначениеЗаполнено(Артикул) Тогда
			Струк = Новый Структура;
			
			Струк.Вставить("Артикул",Артикул);
			СтрокиНашли = Рез.НайтиСтроки(Струк);
			Для каждого Ст11 Из СтрокиНашли Цикл
				НомГ = Ст11.Номенклатура;
				НомП = Ст11.Ссылка;
				Если НомП.Наименование <> Назва Тогда
					Проблема = Истина;
					
					КонецЕслИ;
				НашлиН = Истина;
			КонецЦикла;
		КонецЕсли;
		КонецЕслИ;
			Если НомП = 0 Тогда
				Н = Справочники.НоменклатураПоставщика.СоздатьЭлемент();
				Н.Владелец = Заказ.Контрагент;
				Н.Наименование = Назва;
				Если ЗначениеЗаполнено(Артикул) Тогда
				Н.Артикул = Артикул;
				КонецЕслИ;
				Н.Записать();
				НомП = Н.Ссылка;
			КонецЕслИ;
			Если КДОп <> 0 Тогда
				Доп = Число(ExcelЛист.Cells(Строка, КДоп).Value);				
			КонецЕслИ;
			Если КЦенаБН <> 0 Тогда
				ЦенаБН = Число(ExcelЛист.Cells(Строка, КЦенаБН).Value);				
			КонецЕслИ;
			Если КРекОпт <> 0 Тогда
				РекОпт = Число(ExcelЛист.Cells(Строка, КРекОпт).Value);				
			КонецЕслИ;
			Если КРекОптБН <> 0 Тогда
				РекОптБН = Число(ExcelЛист.Cells(Строка, КРекОптБН).Value);				
			КонецЕслИ;
			Если КРекРозница <> 0 Тогда
				РекРозница = Число(ExcelЛист.Cells(Строка, КРекРозница).Value);				
			КонецЕслИ;
			Если КДатаПроизводства <> 0 Тогда
				ДатаПроизводства = (ExcelЛист.Cells(Строка, КДатаПроизводства).Value);				
			КонецЕслИ;
			Если КПроизводство <> 0 Тогда
				Производство = (ExcelЛист.Cells(Строка, КПроизводство).Value);				
			КонецЕслИ;
			
			Если КМІСТО <> 0 Тогда
				МІСТО = (ExcelЛист.Cells(Строка, КМІСТО).Value);				
			КонецЕслИ;
			Если КПоставщик <> 0 Тогда
				Поставщик = (ExcelЛист.Cells(Строка, КПоставщик).Value);				
			КонецЕслИ;
			
			
			
			Если КВысота <> 0 Тогда
				ВысотаЗн = (ExcelЛист.Cells(Строка, КВысота).Value);				
			КонецЕслИ;
			
						Если КШирина <> 0 Тогда
				ШиринаЗн = (ExcelЛист.Cells(Строка, КШирина).Value);				
			КонецЕслИ;

			Если КДиаметр <> 0 Тогда
				ДиаметрЗн = (ExcelЛист.Cells(Строка, КДиаметр).Value);				
			КонецЕслИ;
			
			Если КPCD1 <> 0 Тогда
				PCD1Зн = (ExcelЛист.Cells(Строка, КPCD1).Value);				
			КонецЕслИ;
			Если КВылет <> 0 Тогда
				ВылетЗн = (ExcelЛист.Cells(Строка, КВылет).Value);				
			КонецЕслИ;
			
			
			Если КРекРозницаБН <> 0 Тогда
				РекРозницаБН = Число(ExcelЛист.Cells(Строка, КРекРозницаБН).Value);				
			КонецЕслИ;
			
			Если КОстаток <> 0 Тогда
				спЧисел="0123456789"; 
				КвоСим=0;
				Содержание=СокрЛП(ExcelЛист.Cells(Строка, КОстаток).Value);
				Ост = "";
				Для ном=1 По СтрДлина(Содержание) Цикл    
					Если Найти(спЧисел,Сред(Содержание,ном,1))<>0 Тогда  
						Ост = Ост+Сред(Содержание,ном,1);
					иначе 
						//Прервать;
					КонецЕсли;				
				КонецЦикла;	    
				Попытка
					Остаток = Число(Ост);				
				Исключение
					Остаток = 0;
				КонецПопытки;
			КонецЕслИ;
			Если ЗначениеЗАполнено(НомГ) и ЗначениеЗаполнено(Цена) Тогда    //Если нашли 
				

			Ст = Док.Товары.Добавить();
			Ст.Номенклатура = НомГ;
			Ст.ВидНоменклатуры = Ст.Номенклатура.ВидНоменклатуры;
			Ст.Цена = Цена;
			Ст.Валюта = Док.Валюта;//КЦ.ВалютаЦены;
			Попытка
				Ст.ЕдиницаИзмерения = НомГ.ЕдиницаХраненияОстатков;
			Исключение
			КонецПопытки;
			Ст.ТипЦен = КЦ;
			Ст.Остаток = Остаток;
			Ст.Примечание = ДОп;
			Ст.НоменклатураПоставщика = НомП;
			Ст.ЦенаБН = ЦенаБН;
			Ст.РекОпт = РекОпт;
			Ст.РекОптБН = РекОптБН;
			Ст.Поставщик = Поставщик;
			Ст.МІСТО = МІСТО;
			Ст.РекРозница = РекРозница;
			Ст.ДатаПроизводства = ДатаПроизводства;
			Ст.Производитель = Производство;
			Если Проблема и Назва <> номП.Наименование Тогда
			Ст.Проблема = Проблема;
			Ст.Название = Назва;
			КонецеслИ;
			
			Ст.Ширина = Справочники.Ширина.НайтиПоНаименованию(СокрЛП(ШиринаЗн));
			Ст.Высота = Справочники.Профиль.НайтиПоНаименованию(СокрЛП(ВысотаЗн));
			Ст.Диаметр = Справочники.Диаметр.НайтиПоНаименованию(СокрЛП(ДиаметрЗН));
			
			Ст.PCD1 = Справочники.КрепежныеОтверствия.НайтиПоНаименованию(СокрЛП(PCD1ЗН));
			Если КВылет <> 0 Тогда
				Ст.Вылет = Справочники.ВылетДисков.НайтиПоНаименованию(СокрЛП(ВылетЗН));
			КонецЕслИ;
			Ст.РекРозницаБН = РекРозницаБН;
			
			Ст.ИндексСтрокиТаблицыЦен = 1;
			Ст.ЧерныйСписок = Ложь;
			
			Струк = Новый Структура;
			Струк.Вставить("Контрагент",Заказ.Контрагент);
			Струк.Вставить("Номенклатура",Ст.НоменклатураПоставщика);
			СтрокЧерный = Черный.НайтиСтроки(Струк);
			Для Каждого ст12 из СтрокЧерный Цикл
				Ст.ЧерныйСписок = Истина;
				прервать;
			КонецЦикла;
			
			Строк = Строк + 1;
		иначе
				Ст = Док1.Товары.Добавить();
			Ст.Номенклатура = НомГ;
			Ст.ВидНоменклатуры = Ст.Номенклатура.ВидНоменклатуры;
			Ст.Цена = Цена;
			Ст.Валюта = Док.Валюта;//КЦ.ВалютаЦены;
			Попытка
				Ст.ЕдиницаИзмерения = НомГ.ЕдиницаХраненияОстатков;
			Исключение
			КонецПопытки;
			Ст.ТипЦен = КЦ;
			Ст.Остаток = Остаток;
			Ст.Примечание = ДОп;
			Ст.НоменклатураПоставщика = НомП;
			Ст.ЦенаБН = ЦенаБН;
			Ст.РекОпт = РекОпт;
			Ст.РекОптБН = РекОптБН;
			Ст.Поставщик = Поставщик;
			Ст.МІСТО = МІСТО;
			Ст.РекРозница = РекРозница;
			Ст.ДатаПроизводства = ДатаПроизводства;
			Ст.Производитель = Производство;
			Если Проблема и Назва <> номП.Наименование Тогда
			Ст.Проблема = Проблема;
			Ст.Название = Назва;
			КонецеслИ;
			
			Ст.Ширина = Справочники.Ширина.НайтиПоНаименованию(СокрЛП(ШиринаЗн));
			Ст.Высота = Справочники.Профиль.НайтиПоНаименованию(СокрЛП(ВысотаЗн));
			Ст.Диаметр = Справочники.Диаметр.НайтиПоНаименованию(СокрЛП(ДиаметрЗН));
			
			Ст.PCD1 = Справочники.КрепежныеОтверствия.НайтиПоНаименованию(СокрЛП(PCD1ЗН));
			Если КВылет <> 0 Тогда
				Ст.Вылет = Справочники.ВылетДисков.НайтиПоНаименованию(СокрЛП(ВылетЗН));
			КонецЕслИ;
			Ст.РекРозницаБН = РекРозницаБН;
			
			Ст.ИндексСтрокиТаблицыЦен = 1;
			Ст.ЧерныйСписок = Ложь;
			
			Струк = Новый Структура;
			Струк.Вставить("Контрагент",Заказ.Контрагент);
			Струк.Вставить("Номенклатура",Ст.НоменклатураПоставщика);
			СтрокЧерный = Черный.НайтиСтроки(Струк);
			Для Каждого ст12 из СтрокЧерный Цикл
				Ст.ЧерныйСписок = Истина;
				прервать;
			КонецЦикла;
			
//			Строк = Строк + 1;

			//Пустий---------------
			КонецЕсли; 			
		КонецЦикла;
		ExcelПриложение.Quit();
		Док1.Записать();
		
		Док.Записать();
		Док.Товары.Сортировать("Номенклатура Возр, Цена Возр");
		ном = "";
		н = 0;
		Пока Н < Док.Товары.Количество() Цикл
			Стр = Док.Товары[н];
			  Если стр.Номенклатура = ном Тогда
			  	н = н -1;
				Док.Товары.Удалить(Стр);
			Иначе
			ном  = Стр.Номенклатура;	
			  КонецЕсли; 
			  
			  н = н + 1;
		КонецЦикла; 
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			//с.д.(
		//	ПересчитатьЦены(Док); 
			//с.д.)
			Если Док.Проведен и док.Товары.Количество() > 1000 Тогда
				//с.д.(
				//Цены = Документы.УстановкаЦенНоменклатурыКонтрагентов.Выбрать();
				//Пока Цены.Следующий() Цикл
				//	Если Цены.Контрагент = Док.Контрагент и Цены.Ссылка <> Док.Ссылка и ЦЕНЫ.ВидНоменклутары = дОК.ВидНоменклутары Тогда
				//		Ц = Цены.ПолучитьОбъект();
				//		Ц.УстановитьПометкуУдаления(ИСтина);
				//		Ц.Записать();
				//	КонецЕсли; 	
				//КонецЦикла;
				
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	УстановкаЦенНоменклатурыКонтрагентов.Ссылка
				|ИЗ
				|	Документ.УстановкаЦенНоменклатурыКонтрагентов КАК УстановкаЦенНоменклатурыКонтрагентов
				|ГДЕ
				|	НЕ УстановкаЦенНоменклатурыКонтрагентов.ПометкаУдаления
				|	И УстановкаЦенНоменклатурыКонтрагентов.ВидНоменклутары = &ВидНоменклутары
				|	И УстановкаЦенНоменклатурыКонтрагентов.Контрагент = &Контрагент
				|	И УстановкаЦенНоменклатурыКонтрагентов.Ссылка <> &Ссылка"; 
				
				Запрос.УстановитьПараметр("ВидНоменклутары",дОК.ВидНоменклутары);
				Запрос.УстановитьПараметр("Ссылка",Док.Ссылка);
				Запрос.УстановитьПараметр("Контрагент",Док.Контрагент);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Ц = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
					Ц.УстановитьПометкуУдаления(ИСтина);
					Ц.Записать(); 
				КонецЦикла;
				//с.д.)
				
			КонецЕсли; 
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки;
		
	//Исключение
		
		
	//КонецПопытки;
	
	Попытка
		
		Обработки.СозданиеУЦ_По_ПравиламРасчета_СД.выполнитьвсеУстановкаЦенНоменклатурыКонтрагентовСОтбором(Док.Ссылка);

	Исключение
		ЗаписьЖурналаРегистрации("СозданиеУЦ_По_ПравиламРасчета_СД.ЗагрузитьТаер",УровеньЖурналаРегистрации.Ошибка,Метаданные.РегламентныеЗадания.ЗагрузитьТаер,Док,ОписаниеОшибки());
	КонецПопытки;	
	
	Попытка
		
		Обработки.СозданиеУЦ_По_ПравиламРасчета_СД.выполнитьвсеУстановкаЦенНоменклатурыКонтрагентовСОтбором(Док1.Ссылка);

	Исключение    
		
		ЗаписьЖурналаРегистрации("СозданиеУЦ_По_ПравиламРасчета_СД.ЗагрузитьТаер",УровеньЖурналаРегистрации.Ошибка,Метаданные.РегламентныеЗадания.ЗагрузитьТаер,Док1,ОписаниеОшибки());
	
	КонецПопытки;	
	
	//*********************************************************************************************
	
	
//диски------------------------------------------------------------------
	Если НачалоДня(ТекущаяДата()) + 13*60*60 > ТекущаяДата()  Тогда
		//файл1
		Файл = СкачатьФайл("https://opt.tyreclub.com.ua/api/Download/LastPriceListExportBySettings?code=246-772-6d8445e818a68e29a47ffb48d97f5e27a32e9f84");
	Иначе
		//ФАЙЛ2
		Файл = СкачатьФайл("https://opt.tyreclub.com.ua/api/Download/LastPriceListExportBySettings?code=246-5035-beca14549155f689d63b794177e48c5e21e73e23");
	КонецЕсли; 
	
	
	
	//*************************************************************************************************
	
	 Производство = "";
	
	//Заказ=Справочники.Таєр.ОсновнаяНастройка.ДокументПоШинам.ПолучитьОбъект();//Переделать на константу
	Заказ = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
	Заказ.Товары.Очистить();
	Заказ.ТипыЦен.Очистить();
	Заказ.Дата = (Текущаядата());
	Ст = Заказ.ТипыЦен.Добавить();
	Ст.ТипЦен = Справочники.ТипыЦенНоменклатурыКонтрагентов.НайтиПоКоду("Г00000087");
	Заказ.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Г00016623");
	Заказ.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Заказ.Комментарий = "ДИСКИ "+Строка(ТекущаяДата());
	ЗАказ.ВидНоменклутары = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000001");
	
	
	Заказ1 = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
	Заказ1.Товары.Очистить();
	Заказ1.ТипыЦен.Очистить();
	Заказ1.Дата = НачалоДня(Текущаядата());
	Ст = Заказ1.ТипыЦен.Добавить();
	Ст.ТипЦен = Справочники.ТипыЦенНоменклатурыКонтрагентов.НайтиПоКоду("Г00000087");
	Заказ1.Контрагент = Справочники.Контрагенты.НайтиПоКоду("Г00016623");
	Заказ1.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Заказ1.Комментарий = "Пустий ДИСКИ "+Строка(ТекущаяДата());
	ЗАказ1.ВидНоменклутары = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000001");
	
	
	
	Попытка
		ExcelПриложение = Новый COMОбъект("Excel.Application");
	Исключение
	КонецПопытки;
	Запрос  = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗагрузкаПрайса.Номер,
	               |	ЗагрузкаПрайса.Колонка
	               |ИЗ
	               |	Справочник.ЗагрузкаПрайса КАК ЗагрузкаПрайса
	               |ГДЕ
	               |	ЗагрузкаПрайса.ПометкаУдаления = ЛОЖЬ
	               |	И ЗагрузкаПрайса.Владелец = &Владелец
	               |	И ЗагрузкаПрайса.ВидНоменклатуры = &Вид";
	Запрос.УстановитьПараметр("Владелец",Заказ.Контрагент);
	Запрос.УстановитьПараметр("Вид",Заказ.ВидНоменклутары);
	Рез = Запрос.Выполнить().Выбрать();
	КЦена = 0;
	КЦенаБН = 0;
	КПервая = 1;
	КДоп = 0;
	КОСтаток = 0;
	КМІСТО = 0;
	КПоставщик = 0;
	
	КВалюта = 0;
	КЦена = 0;	
	КРекОпт = 0;
	КРекОптБН = 0;
	КРекРозница = 0;
	КРекРозницаБН = 0;
	КДатаПроизводства = 0;
	КПроизводство = 0;
	КШирина = 0;
	КВысота = 0;
	Картикул = 0;
	КДиаметр = 0;
	КPCD1 = 0;
	КВылет = 0;
	
	ТНазва = Новый ТаблицаЗначений;
	ТНазва.Колонки.Добавить("Номер");
	Пока Рез.Следующий() Цикл
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Цена Тогда
			КЦена = Рез.Номер;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ПерваяСтрока Тогда
				Кпервая = Рез.Номер;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ДопПризнак Тогда
				КДоп = Рез.Номер;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.МІСТО Тогда
				КМІСТО = Рез.Номер;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ПОСТАВЩИК Тогда
				КПоставщик = Рез.Номер;
		КонецЕслИ;
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Остаток Тогда
				КОстаток = Рез.Номер;
		КонецЕслИ;
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Валюта Тогда
				КВалюта = Рез.Номер;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Цена Тогда
				КЦена = Рез.Номер;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ЦенаБН Тогда
				КЦенаБН = Рез.Номер;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекОпт Тогда
				КРекОпт = Рез.Номер;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекОптБН Тогда
				КРекОптБН = Рез.Номер;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекРозница Тогда
				КРекРозница = Рез.Номер;
		КонецЕслИ;		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.РекРозницаБН Тогда
				КРекРозницаБН = Рез.Номер;
		КонецЕслИ;		
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.ДатаПроизводства Тогда
				КДатаПроизводства = Рез.Номер;
		КонецЕслИ;		
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Производство Тогда
				КПроизводство = Рез.Номер;
			КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Ширина Тогда
				КШирина = Рез.Номер;
			КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Высота Тогда
				КВысота = Рез.Номер;
			КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Диаметр Тогда
				КДиаметр = Рез.Номер;
			КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.PCD1 Тогда
				КPCD1 = Рез.Номер;
			КонецЕслИ;	
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Вылет Тогда
				КВылет = Рез.Номер;
			КонецЕслИ;	
			
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Артикул Тогда
				КАртикул= Рез.Номер;
			КонецЕслИ;	
	
		
		Если Рез.Колонка = Перечисления.КолонкаПрайса.Название Тогда
				Если Рез.Номер>0 Тогда	
					Ст = ТНазва.Добавить();
					Ст.Номер = Рез.Номер;
				КонецЕсли;
		КонецЕслИ;		
		
	КонецЦикла;
	КДатаПроизводства = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЧерныйСписокНоменклатуры.Контрагент,
	|	ЧерныйСписокНоменклатуры.Номенклатура
	|ИЗ
	|	РегистрСведений.ЧерныйСписокНоменклатуры КАК ЧерныйСписокНоменклатуры";
	Черный = Запрос.Выполнить().Выгрузить();
				ВысотаЗн = 0;				
				ШииринаЗн = 0;				
				ДиаметрЗн = 0;				
	
				PCD1Зн = 0;				
				ВылетЗн = 0;				

	//Попытка
		// Открытие файла Microsoft Excel 
		ExcelФайл = ExcelПриложение.WorkBooks.Open(Файл);
		// Обработка файла Microsoft Excel 
		ExcelЛист = ExcelФайл.Sheets(1);
		xlCellTypeLastCell = 11;
		Док=Заказ;
		ExcelПоследняяСтрока = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Row;
		ExcelПоследняяКолонка = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Column;
		Строк=0;
		Док = Заказ;
		Док1 = Заказ1;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	НоменклатураПоставщика.Наименование,
		               |	НоменклатураПоставщика.Номенклатура,
		               |	НоменклатураПоставщика.Ссылка,
		               |	НоменклатураПоставщика.Артикул
		               |ИЗ
		               |	Справочник.НоменклатураПоставщика КАК НоменклатураПоставщика
		               |ГДЕ
		               |	НоменклатураПоставщика.ПометкаУдаления = ЛОЖЬ
		               |	И НоменклатураПоставщика.Владелец = &Контрагент
		               |	И НоменклатураПоставщика.ВидНоменклатуры = &Вид";
		Запрос.УстановитьПараметр("Контрагент",Заказ.Контрагент);
		Запрос.УстановитьПараметр("Вид",Заказ.ВидНоменклутары);
		Рез = Запрос.Выполнить().Выгрузить();
			КЦ = Заказ.ТипыЦен[0].ТипЦен;
		ТНазва.Сортировать("Номер");
		Артикул = "";
		ДатаПроизводства = "";
		Для Строка = КПервая По ExcelПоследняяСтрока Цикл
			Назва = "";
			Для Каждого ст Из ТНазва Цикл
				Назва = Назва + СокрЛП((ExcelЛист.Cells(Строка, Ст.Номер).Value))+" ";
			КонецЦикла;
			Назва = СокрлП(Назва);
			Если СтрДлина(СокрЛП(Назва)) = 0 Тогда
				Продолжить;
			КонецЕслИ;
			Цена = (ExcelЛист.Cells(Строка, КЦена).Value);
			ЦенаБН = 0;
			РекОпт = 0;
			РекОптБН = 0;
			РекРозница = 0;
			РекРозницаБН = 0;
			Артикул = "";
			 МІСТО = "";
			 Поставщик = "";
			Попытка
				спЧисел="0123456789,."; 
				КвоСим=0;
				Содержание=Цена;
				Ост = "";
				Для ном=1 По СтрДлина(Содержание) Цикл    
					Если Найти(спЧисел,Сред(Содержание,ном,1))<>0 Тогда  
						Ост = Ост+Сред(Содержание,ном,1);
					иначе 
						//Прервать;
					КонецЕсли;				
				КонецЦикла;	    
				Попытка
					Цена = Число(Ост);				
				Исключение
					Цена = 0;
				КонецПопытки;
				
			Исключение
				Продолжить;
			Конецпопытки;
			Если Цена = 0 Тогда
				Продолжить;
			КонецЕсли;
			НомГ = 0;
			НомП = 0;
			Если КАртикул <> 0 Тогда
				Артикул = (ExcelЛист.Cells(Строка, КАртикул).Value);				
			КонецЕслИ;
            НашлиН = Ложь;
			Проблема = Ложь;
			если Не НашлиН Тогда
			Струк = Новый Структура;
			
			Струк.Вставить("Наименование",Назва);
			СтрокиНашли = Рез.НайтиСтроки(Струк);
			Для каждого Ст11 Из СтрокиНашли Цикл
				НомГ = Ст11.Номенклатура;
				НомП = Ст11.Ссылка;
				НашлиН = Истина;
			КонецЦикла;
			КонецЕслИ;
			если Не НашлиН Тогда			
			Если ЗначениеЗаполнено(Артикул) Тогда
			Струк = Новый Структура;
			
			Струк.Вставить("Артикул",Артикул);
			СтрокиНашли = Рез.НайтиСтроки(Струк);
			Для каждого Ст11 Из СтрокиНашли Цикл
				НомГ = Ст11.Номенклатура;
				НомП = Ст11.Ссылка;
				Если НомП.Наименование <> Назва Тогда
					Проблема = Истина;
					
					КонецЕслИ;
				НашлиН = Истина;
			КонецЦикла;
		КонецЕсли;
		КонецЕслИ;
			Если НомП = 0 Тогда
				Н = Справочники.НоменклатураПоставщика.СоздатьЭлемент();
				Н.Владелец = Заказ.Контрагент;
				Н.Наименование = Назва;
				Если ЗначениеЗаполнено(Артикул) Тогда
				Н.Артикул = Артикул;
				КонецЕслИ;
				Н.Записать();
				НомП = Н.Ссылка;
			КонецЕслИ;
			Если КДОп <> 0 Тогда
				Доп = Число(ExcelЛист.Cells(Строка, КДоп).Value);				
			КонецЕслИ;
			Если КЦенаБН <> 0 Тогда
				ЦенаБН = (ExcelЛист.Cells(Строка, КЦенаБН).Value);				
			КонецЕслИ;
			Если КРекОпт <> 0 Тогда
				РекОпт = (ExcelЛист.Cells(Строка, КРекОпт).Value);				
			КонецЕслИ;
			Если КРекОптБН <> 0 Тогда
				РекОптБН = (ExcelЛист.Cells(Строка, КРекОптБН).Value);				
			КонецЕслИ;
			Если КРекРозница <> 0 Тогда
				РекРозница = (ExcelЛист.Cells(Строка, КРекРозница).Value);				
			КонецЕслИ;
			Если КДатаПроизводства <> 0 Тогда
				ДатаПроизводства = (ExcelЛист.Cells(Строка, КДатаПроизводства).Value);				
			КонецЕслИ;
			Если КПроизводство <> 0 Тогда
				Производство = (ExcelЛист.Cells(Строка, КПроизводство).Value);				
			КонецЕслИ;
			
			Если КМІСТО <> 0 Тогда
				МІСТО = (ExcelЛист.Cells(Строка, КМІСТО).Value);				
			КонецЕслИ;
			Если КПоставщик <> 0 Тогда
				Поставщик = (ExcelЛист.Cells(Строка, КПоставщик).Value);				
			КонецЕслИ;
			
			
			
			Если КВысота <> 0 Тогда
				ВысотаЗн = (ExcelЛист.Cells(Строка, КВысота).Value);				
			КонецЕслИ;
			
						Если КШирина <> 0 Тогда
				ШиринаЗн = (ExcelЛист.Cells(Строка, КШирина).Value);				
			КонецЕслИ;

			Если КДиаметр <> 0 Тогда
				ДиаметрЗн = (ExcelЛист.Cells(Строка, КДиаметр).Value);				
			КонецЕслИ;
			
			Если КPCD1 <> 0 Тогда
				PCD1Зн = (ExcelЛист.Cells(Строка, КPCD1).Value);				
			КонецЕслИ;
			Если КВылет <> 0 Тогда
				ВылетЗн = (ExcelЛист.Cells(Строка, КВылет).Value);				
			КонецЕслИ;
			
			
			Если КРекРозницаБН <> 0 Тогда
				РекРозницаБН = Число(ExcelЛист.Cells(Строка, КРекРозницаБН).Value);				
			КонецЕслИ;
			
			Если КОстаток <> 0 Тогда
				спЧисел="0123456789"; 
				КвоСим=0;
				Содержание=СокрЛП(ExcelЛист.Cells(Строка, КОстаток).Value);
				Ост = "";
				Для ном=1 По СтрДлина(Содержание) Цикл    
					Если Найти(спЧисел,Сред(Содержание,ном,1))<>0 Тогда  
						Ост = Ост+Сред(Содержание,ном,1);
					иначе 
						//Прервать;
					КонецЕсли;				
				КонецЦикла;	    
				Попытка
					Остаток = Число(Ост);				
				Исключение
					Остаток = 0;
				КонецПопытки;
			КонецЕслИ;
			Если ЗначениеЗАполнено(НомГ) и ЗначениеЗаполнено(Цена) Тогда    //Если нашли 
				

			Ст = Док.Товары.Добавить();
			Ст.Номенклатура = НомГ;
			Ст.ВидНоменклатуры = Ст.Номенклатура.ВидНоменклатуры;
			Ст.Цена = Цена;
			Ст.Валюта = Док.Валюта;//КЦ.ВалютаЦены;
			Попытка
				Ст.ЕдиницаИзмерения = НомГ.ЕдиницаХраненияОстатков;
			Исключение
			КонецПопытки;
			Ст.ТипЦен = КЦ;
			Ст.Остаток = Остаток;
			Ст.Примечание = ДОп;
			Ст.НоменклатураПоставщика = НомП;
			Ст.ЦенаБН = ЦенаБН;
			Ст.РекОпт = РекОпт;
			Ст.РекОптБН = РекОптБН;
			Ст.Поставщик = Поставщик;
			Ст.МІСТО = МІСТО;
			Ст.РекРозница = РекРозница;
			Ст.ДатаПроизводства = ДатаПроизводства;
			Ст.Производитель = Производство;
			Если Проблема и Назва <> номП.Наименование Тогда
			Ст.Проблема = Проблема;
			Ст.Название = Назва;
			КонецеслИ;
			
			Ст.Ширина = Справочники.Ширина.НайтиПоНаименованию(СокрЛП(ШиринаЗн));
			Ст.Высота = Справочники.Профиль.НайтиПоНаименованию(СокрЛП(ВысотаЗн));
			Ст.Диаметр = Справочники.Диаметр.НайтиПоНаименованию(СокрЛП(ДиаметрЗН));
			
			Ст.PCD1 = Справочники.КрепежныеОтверствия.НайтиПоНаименованию(СокрЛП(PCD1ЗН));
			Если КВылет <> 0 Тогда
				Ст.Вылет = Справочники.ВылетДисков.НайтиПоНаименованию(СокрЛП(ВылетЗН));
			КонецЕслИ;
			Ст.РекРозницаБН = РекРозницаБН;
			
			Ст.ИндексСтрокиТаблицыЦен = 1;
			Ст.ЧерныйСписок = Ложь;
			
			Струк = Новый Структура;
			Струк.Вставить("Контрагент",Заказ.Контрагент);
			Струк.Вставить("Номенклатура",Ст.НоменклатураПоставщика);
			СтрокЧерный = Черный.НайтиСтроки(Струк);
			Для Каждого ст12 из СтрокЧерный Цикл
				Ст.ЧерныйСписок = Истина;
				прервать;
			КонецЦикла;
			
			Строк = Строк + 1;
		иначе
				Ст = Док1.Товары.Добавить();
			Ст.Номенклатура = НомГ;
			Ст.ВидНоменклатуры = Ст.Номенклатура.ВидНоменклатуры;
			Ст.Цена = Цена;
			Ст.Валюта = Док.Валюта;//КЦ.ВалютаЦены;
			Попытка
				Ст.ЕдиницаИзмерения = НомГ.ЕдиницаХраненияОстатков;
			Исключение
			КонецПопытки;
			Ст.ТипЦен = КЦ;
			Ст.Остаток = Остаток;
			Ст.Примечание = ДОп;
			Ст.НоменклатураПоставщика = НомП;
			Ст.ЦенаБН = ЦенаБН;
			Ст.РекОпт = РекОпт;
			Ст.РекОптБН = РекОптБН;
			Ст.Поставщик = Поставщик;
			Ст.МІСТО = МІСТО;
			Ст.РекРозница = РекРозница;
			Ст.ДатаПроизводства = ДатаПроизводства;
			Ст.Производитель = Производство;
			Если Проблема и Назва <> номП.Наименование Тогда
			Ст.Проблема = Проблема;
			Ст.Название = Назва;
			КонецеслИ;
			
			Ст.Ширина = Справочники.Ширина.НайтиПоНаименованию(СокрЛП(ШиринаЗн));
			Ст.Высота = Справочники.Профиль.НайтиПоНаименованию(СокрЛП(ВысотаЗн));
			Ст.Диаметр = Справочники.Диаметр.НайтиПоНаименованию(СокрЛП(ДиаметрЗН));
			
			Ст.PCD1 = Справочники.КрепежныеОтверствия.НайтиПоНаименованию(СокрЛП(PCD1ЗН));
			Если КВылет <> 0 Тогда
				Ст.Вылет = Справочники.ВылетДисков.НайтиПоНаименованию(СокрЛП(ВылетЗН));
			КонецЕслИ;
			Ст.РекРозницаБН = РекРозницаБН;
			
			Ст.ИндексСтрокиТаблицыЦен = 1;
			Ст.ЧерныйСписок = Ложь;
			
			Струк = Новый Структура;
			Струк.Вставить("Контрагент",Заказ.Контрагент);
			Струк.Вставить("Номенклатура",Ст.НоменклатураПоставщика);
			СтрокЧерный = Черный.НайтиСтроки(Струк);
			Для Каждого ст12 из СтрокЧерный Цикл
				Ст.ЧерныйСписок = Истина;
				прервать;
			КонецЦикла;
			
//			Строк = Строк + 1;

			//Пустий---------------
			КонецЕсли; 			
		КонецЦикла;
		ExcelПриложение.Quit();
		Док1.Записать();
		
		Док.Записать();
		Док.Товары.Сортировать("Номенклатура Возр, Цена Возр");
		ном = "";
		н = 0;
		Пока Н < Док.Товары.Количество() Цикл
			Стр = Док.Товары[н];
			  Если стр.Номенклатура = ном Тогда
			  	н = н -1;
				Док.Товары.Удалить(Стр);
			Иначе
			ном  = Стр.Номенклатура;	
			  КонецЕсли; 
			  
			  н = н + 1;
		КонецЦикла; 
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
			//с.д.(
			//ПересчитатьЦены(Док); 
			//с.д.)
		Если Док.Проведен и док.Товары.Количество() > 1000 Тогда
			//с.д.(
			//Цены = Документы.УстановкаЦенНоменклатурыКонтрагентов.Выбрать();
			//	Пока Цены.Следующий() Цикл
			//							Если Цены.Контрагент = Док.Контрагент и Цены.Ссылка <> Док.Ссылка и ЦЕНЫ.ВидНоменклутары = дОК.ВидНоменклутары Тогда
			//			Ц = Цены.ПолучитьОбъект();         //вернутььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььььь
			//			Ц.УстановитьПометкуУдаления(ИСтина);
			//			Ц.Записать();
			//		КонецЕсли; 	
			//	КонецЦикла;  
				
			Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	УстановкаЦенНоменклатурыКонтрагентов.Ссылка
				|ИЗ
				|	Документ.УстановкаЦенНоменклатурыКонтрагентов КАК УстановкаЦенНоменклатурыКонтрагентов
				|ГДЕ
				|	НЕ УстановкаЦенНоменклатурыКонтрагентов.ПометкаУдаления
				|	И УстановкаЦенНоменклатурыКонтрагентов.ВидНоменклутары = &ВидНоменклутары
				|	И УстановкаЦенНоменклатурыКонтрагентов.Контрагент = &Контрагент
				|	И УстановкаЦенНоменклатурыКонтрагентов.Ссылка <> &Ссылка"; 
				
				Запрос.УстановитьПараметр("ВидНоменклутары",дОК.ВидНоменклутары);
				Запрос.УстановитьПараметр("Ссылка",Док.Ссылка);
				Запрос.УстановитьПараметр("Контрагент",Док.Контрагент);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Ц = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект(); 
					//Ц.Удалить();
					Ц.УстановитьПометкуУдаления(ИСтина);
					Ц.Записать(); 
				КонецЦикла;
				//с.д.)

				
			КонецЕсли; 
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки;
		
	//Исключение
		
		
	//КонецПопытки;
	
	
		
	
КонецПроцедуры  


//с.д.(
Процедура ПересчитатьЦены(ДокУстановкиЦенКонтрагентов)
//	//Пересчитаем цены
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	УстановкаЦенНоменклатуры.Ссылка
//	|ИЗ
//	|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
//	|ГДЕ
//	|	УстановкаЦенНоменклатуры.ПометкаУдаления = Ложь
//	|	И УстановкаЦенНоменклатуры.УстановкаЦенПоставщика = &УЦ";
//	Запрос.УстановитьПараметр("Уц",ДокУстановкиЦенКонтрагентов.Ссылка);
//	Рез = Запрос.Выполнить().Выбрать();
//	Цены = 0;
//	пока Рез.Следующий() Цикл
//		Цены = Рез.ссылка.ПолучитьОбъект();
//	КонецЦикла;
//	Если Цены = 0 Тогда
//		Цены = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
//	КонецЕслИ;
//	Цены.Дата = ДокУстановкиЦенКонтрагентов.Ссылка.Дата+1;
//	Цены.ВидНоменклатуры = ДокУстановкиЦенКонтрагентов.Ссылка.ВидНоменклутары;
//	Цены.Комментарий = ДокУстановкиЦенКонтрагентов.Ссылка.ВидНоменклутары.Наименование+"@";
//	Цены.Ответственный = ПараметрыСеанса.ТекущийПользователь;
//	Цены.УстановкаЦенПоставщика = ДокУстановкиЦенКонтрагентов.Ссылка;
//	Цены.КонтрагентРасчета = ДокУстановкиЦенКонтрагентов.Ссылка.Контрагент;
//	Цены.НеПроводитьНулевыеЗначения = Истина;
//	Цены.ТипыЦен.Очистить();
//	Цены.Товары.Очистить();
//	ТЦ = Цены.ТипыЦен.Добавить();
//	Тц.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000006").Ссылка;
//	ТЦ = Цены.ТипыЦен.Добавить();
//	Тц.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000009").Ссылка;
//	ТЦ = Цены.ТипыЦен.Добавить();
//	Тц.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001").Ссылка;
//	ТЦ = Цены.ТипыЦен.Добавить();
//	Тц.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000007").Ссылка;
//	//ТЦ = Цены.ТипыЦен.Добавить();
//	//Тц.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000012").Ссылка;
////	ТЦ = Цены.ТипыЦен.Добавить();
//	//Тц.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000013").Ссылка;
//	//Цены.Записать(РежимзаписиДокумента.ОтменаПроведения);
//	//Форма = Цены.ПолучитьФорму();
//	//Форма.Открыть();  
//	Цены.Записать(РежимзаписиДокумента.Проведение);
КонецПроцедуры
//с.д.)

Функция СкачатьФайл(location)
	
	////WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	////WinHttp.Open("POST",location);
	////WinHttp.Send(location);
	////Ответ = WinHttp.ResponseText();
	ИмяФайлаПриемника = "c:\temp\Tayer6.xls";  
	КопироватьФайл(location, ИмяФайлаПриемника); 
	    
	
	Возврат ИмяФайлаПриемника;
КонецФункции


Процедура СозданиеУЦ_По_ПравиламРасчета_СД() Экспорт
	// Вставити вміст обробника.
	Обработки.СозданиеУЦ_По_ПравиламРасчета_СД.выполнитьвсе(ТекущаяДата());
	
	
КонецПроцедуры


Процедура ЗагрузкаГараж_сд() Экспорт
	// Вставити вміст обробника.     
	Обработки.ЗаполнениеНоменклатурыИзXML_С_Сайта_СД.Создать().ЗаполнитьUrlСайта();
КонецПроцедуры


Процедура ЗагрузкаХотлайн_сд() Экспорт
	// Вставити вміст обробника.
		Обработки.ЗаполнениеНоменклатурыИзXML_С_Сайта_СД.Создать().ЗагрузитьИзХотлайна();
КонецПроцедуры
 
