Функция ПолучитьСписокКонтактныхЛиц(Получатель = Неопределено, Контрагент, НП_APIКлюч) Экспорт   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НП_КонтактныеЛица.Ссылка КАК КонтактныеЛица
	|ИЗ
	|	Справочник.НП_КонтактныеЛица КАК НП_КонтактныеЛица
	|ГДЕ
	|	НП_КонтактныеЛица.КонтрагентСсылка = &КонтрагентСсылка
	|	И (&Контрагент ЕСТЬ NULL
	|			ИЛИ НП_КонтактныеЛица.Контрагент = &Контрагент)
	|	И НП_КонтактныеЛица.API_ключ = &API_ключ";
	
	КонтрагентПолучатель = Null;
	Если Получатель <> Неопределено Тогда
		КонтрагентПолучатель = Получатель.Идентификатор;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Контрагент", КонтрагентПолучатель);
	Запрос.УстановитьПараметр("КонтрагентСсылка", Контрагент); 
	Запрос.УстановитьПараметр("API_ключ", НП_APIКлюч);

	
	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции