
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПредЗаказ") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		ПредЗаказ = ДанныеЗаполнения.Ссылка;
		НомерТелефона = ДанныеЗаполнения.Телефон;
		Для Каждого ТекСтрокаКассовыеШины_СД Из ДанныеЗаполнения.КассовыеШины_СД Цикл
			НоваяСтрока = КассовыеШины_СД.Добавить();
			НоваяСтрока.Год = ТекСтрокаКассовыеШины_СД.Год;
			НоваяСтрока.Комментарий = ТекСтрокаКассовыеШины_СД.Комментарий;
			НоваяСтрока.Модель = ТекСтрокаКассовыеШины_СД.Модель;
			НоваяСтрока.Производитель = ТекСтрокаКассовыеШины_СД.Производитель;
			НоваяСтрока.Размер = ТекСтрокаКассовыеШины_СД.Размер;
			НоваяСтрока.СтранаПроизводитель = ТекСтрокаКассовыеШины_СД.СтранаПроизводитель;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
