Функция ПолучитьСебестоимостьТовара(Реализация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ПартииТоваровНаСкладах.Стоимость
	              |ИЗ
	              |	РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	              |ГДЕ
	              |ПартииТоваровНаСкладах.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор",Реализация);
	//Запрос.УстановитьПараметр("НомерСтроки",НомерСтроки); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка.Стоимость;
	КонецЦикла;
	Возврат 0;
КонецФункции  