Функция ПолучитьПодразделениеПоНомеру(Номер) Экспорт 
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить("garazh", Справочники.Подразделения.НайтиПоКоду("Г00000020"));  //1. Відділ продажу (Garazh.UA)
	Соответствие.Вставить("ionity.tires", Справочники.Подразделения.НайтиПоКоду("Г00000033")); //7. Відділ продажу (ionity.tires)

	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НомерСтрокой = НРег(Строка(Номер)); 

	Для Каждого Соотв Из Соответствие Цикл
		
		Если Найти(НомерСтрокой, НРег(Соотв.Ключ)) > 0 Тогда
			Возврат Соответствие[Соотв.Ключ];
		КонецЕсли;
		
	КонецЦикла;

	Возврат Неопределено;

КонецФункции