Перем мСписокВозможныхРеквизитов Экспорт;
Перем мРеквизитыКонтрольУникальности Экспорт;

Перем мЭтоНеНовый;

// Обработчик события элемента ПриКопировании.
//
Процедура ПриКопировании(ОбъектКопирования)

	Если Не ЭтоГруппа Тогда
		ЕдиницаХраненияОстатков = Неопределено;
		ЕдиницаДляОтчетов       = Неопределено;
		ЕдиницаИзмеренияМест    = Неопределено;
		Родитель                = Неопределено;	
		НеВыгружатьНаСайт       = УправлениеПользователями.ПолучитьНастройкуПользователя("Г00000002", Ложь);
		ОсновноеИзображение     = Неопределено;
		НазначениеИспользования = Неопределено;  
		ЗаполнитьВыгрузкуНоменклатурыНаСайт(); 
		
		
		id = Неопределено;
		id1 = Неопределено;
		Url = Неопределено;
		ДатаОбновлениеГараж_сд  = Неопределено;
		avg_price   = Неопределено;
		min_price    = Неопределено;
		max_price	 = Неопределено;
		count_stores	  = Неопределено;
		min_price_compared	   = Неопределено;
		avg_price_compared	    = Неопределено;
		max_price_compared		 = Неопределено;
		url_path		  = Неопределено;
		ДатаОбновлениеХотлайн_сд		   = Неопределено;
		card_popularity		    = Неопределено;  
		
		
	КонецЕсли;                               
	
	MagentoID = "";
	
КонецПроцедуры // ПриКопировании()

&НаСервере
Процедура ЗаписатьНоменклатуруПривилегированно(Ссылка)Экспорт
	
	Объект = Ссылка.ПолучитьОбъект();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Объект.Записать();
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры



// Обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписью(Отказ)
	
	//РазрешенаРедакитрованиеНоменклатуры = УправлениеПользователями.ПолучитьНастройкуПользователя("Г00000003", Ложь);
	//
	//ЭтоСлужебнаяЗапись = ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоСлужебнаяЗапись"); 	
	//
	//Если не РазрешенаРедакитрованиеНоменклатуры И Не ЭтоСлужебнаяЗапись Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке("Пользователю не разрешено изменять или создавать номенклаутру", Отказ);
	//КонецЕсли;
	
	//с.д.(
	Если ЭтоНовый() и Не ЭтоГруппа Тогда
		Активная_СайтХорошоп_СД = Истина;
	КонецЕсли;
	//с.д.)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если мЭтоНеНовый = Неопределено Тогда
		мЭтоНеНовый = Не ЭтоНовый();
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		Род = Справочники.Номенклатура.НайтиПоНаименованию(ВидНоменклатуры.Наименование,Истина);//fofa
		Если Род =  Справочники.Номенклатура.ПустаяСсылка() Тогда
			Р = Справочники.Номенклатура.СоздатьГруппу();
			Р.Наименование = ВидНоменклатуры.Наименование;
			Р.ВидНоменклатуры = ВидНоменклатуры;
			Р.Записать();
			Род = Р.Ссылка;
		конецЕсли;
		Родитель = Род.Ссылка;
	КонецЕслИ;
	
	Если Не ОбменДанными.Загрузка И Не ЭтоГруппа Тогда
		Если Не Услуга И НЕ ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) Тогда
			#Если Клиент Тогда
			РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "базовая единица");
			#КонецЕсли
			Отказ = Истина;
		Иначе
			// Надо проверить владельца единицы хранения остатков.
			Если ЗначениеЗаполнено(ЕдиницаХраненияОстатков)
			   И ЕдиницаХраненияОстатков.Владелец <> Ссылка Тогда
				ТекстСообщения = "У единицы хранения остатков номенклатуры """ + СокрЛП(Ссылка) + """ неверно указан владелец!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ЕдиницаДляОтчетов) Тогда
			ЕдиницаДляОтчетов = ЕдиницаХраненияОстатков;
		КонецЕсли;

		// Надо проверить владельца единицы для отчетов.
		Если ЗначениеЗаполнено(ЕдиницаДляОтчетов)
		   И ЕдиницаДляОтчетов.Владелец <> Ссылка Тогда
			ТекстСообщения = "У единицы для отчетов номенклатуры """ + СокрЛП(Ссылка) + """ неверно указан владелец!";
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;

		Если мЭтоНеНовый Тогда
			СуществуютСсылки = Неопределено;

			Если Не Услуга И Ссылка.ЕдиницаХраненияОстатков <> ЕдиницаХраненияОстатков И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
				ТекстСообщения = "Единица """ + СокрЛП(Ссылка.ЕдиницаХраненияОстатков) + """ является единицей хранения остатков для """ + Наименование + """
				|и уже участвует в товародвижении. 
				|Изменить эту единицу уже нельзя!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;

			Если (Услуга <> Ссылка.Услуга Или Комплект <> Ссылка.Комплект Или Набор <> Ссылка.Набор)
			   И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
				ТекстСообщения = "Номенклатура """ + СокрЛП(Ссылка) + """ участвует в товародвижении.
				|Нельзя изменить тип номенклатуры (Услуга, товар, набор-комплект), если позиция номенклатуры участвует в товародвижении!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;

			Если Не ВестиУчетПоСериям И Ссылка.ВестиУчетПоСериям И ПолныеПрава.Номенклатура_СуществуютСсылкиНаСерииВРегистрахНакопления(Ссылка) Тогда
				ТекстСообщения = "Номенклатура """ + СокрЛП(Ссылка) + """ участвует в товародвижении.
				|признак учета по сериям не может быть изменен!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
			#Если Клиент Тогда
			РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "вид номенклатуры");
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;
	ИначеЕсли Не ОбменДанными.Загрузка И ЭтоГруппа Тогда
		ПрошлыйИзмененныйРодительОбъектаДоступа = ?(Не ЭтоНовый() и Не Ссылка.Родитель = Родитель, Ссылка.Родитель, Неопределено);
		НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель);
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		Родитель    = Неопределено;	
		ЕдиницаИзмеренияМест = Неопределено;
	КонецЕсли; 
	
	////+БП: d.matyash (25.08.2025) <>
	Если ЭтоНовый() И НЕ БП_РучнаяКоректировкаНаименования Тогда
		
		ИдентНаименования = (Наименование = НаименованиеПолное);
		
		БП_НаименованиеРу = Наименование;
		БП_НаименованиеПолноеРу = НаименованиеПолное;
		
		Наименование = Справочники.Номенклатура.ПеревестиНаименованиеЧерезСоответствия(
		Наименование, ВидНоменклатуры, Истина);
		
		Если ИдентНаименования ИЛИ НЕ ЗначениеЗаполнено(НаименованиеПолное) Тогда
			НаименованиеПолное = Наименование;
		Иначе
			НаименованиеПолное = Справочники.Номенклатура.ПеревестиНаименованиеЧерезСоответствия(
			НаименованиеПолное, ВидНоменклатуры, Истина);
		КонецЕсли;
		
		БП_НаименованиеРу = Справочники.Номенклатура.ПеревестиНаименованиеЧерезСоответствия(
		БП_НаименованиеРу, ВидНоменклатуры, Ложь);
		
		Если ИдентНаименования ИЛИ НЕ ЗначениеЗаполнено(БП_НаименованиеПолноеРу) Тогда
			БП_НаименованиеПолноеРу = БП_НаименованиеРу;
		Иначе
			БП_НаименованиеПолноеРу = Справочники.Номенклатура.ПеревестиНаименованиеЧерезСоответствия(
			БП_НаименованиеПолноеРу, ВидНоменклатуры, Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	НоваяСтрока = ИсторияЗаписиДокумента.Добавить(); 
	НоваяСтрока.ДатаЗаписи = ТекущаяДата();
	НоваяСтрока.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	////-БП: d.matyash (25.08.2025) <>


КонецПроцедуры // ПередЗаписью()


Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ и Не ЭтоГруппа  Тогда
		СсылкаНаУзел = ПланыОбмена.Сайт.НайтиПоКоду("Сайт").Ссылка;
		Если ЗначениеЗаполнено(СсылкаНаУзел) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(СсылкаНаУзел, Ссылка);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВыгрузкуНоменклатурыНаСайт() Экспорт 
	
	НеВыгружатьНаСайт = УправлениеПользователями.ПолучитьНастройкуПользователя("Г00000002", Ложь);
	
КонецПроцедуры