Функция ПолучитьПодразделение(БазаИсточник, Знач Источник)
	УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 
	Приемник = Справочники.Подразделения;
	ИсточникКод = СокрЛП(Источник.Код);
	ИсточникНаименование = СокрЛП(Источник.Наименование);

	РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		//РезПоискаРеквизит = Приемник.НайтиПоКоду(ИсточникКод);
		РезПоискаРеквизит = Приемник.НайтиПоНаименованию(ИсточникНаименование, Истина);
		Если РезПоискаРеквизит.Пустая() Тогда
			Если Источник.ЭтоГруппа Тогда
				НовыйЭлемент = Приемник.СоздатьГруппу();
			иначе	
				НовыйЭлемент = Приемник.СоздатьЭлемент();
			КонецЕсли; 
			
			НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
			НовыйЭлемент.Код                     = ИсточникКод;
			НовыйЭлемент.Наименование            = ИсточникНаименование;
			
			
			//***************************************************************************
			// проверяем на наличие всех родителей и если их нет то создаем
			//***************************************************************************
			ТаблицаРодителей = Новый ТаблицаЗначений;
			ТаблицаРодителей.Колонки.Добавить("НомерПП");
			ТаблицаРодителей.Колонки.Добавить("Род");
			Уров = Источник.Уровень();
			ТекРодитель = Источник;
			Для ии = 1 По Уров-1 Цикл
				СтрТаблицы = ТаблицаРодителей.Добавить();
				СтрТаблицы.НомерПП = ии;
				СтрТаблицы.Род = ТекРодитель.Родитель;
				ТекРодитель = СтрТаблицы.Род;
			КонецЦикла;
			ТаблицаРодителей.Сортировать("НомерПП убыв");
			ТекРодитель = Приемник.ПустаяСсылка();
			Для Каждого Стр Из ТаблицаРодителей Цикл
	
				ИскомыйРодитель = ПолучитьПодразделение(БазаИсточник, Стр.Род); //Приемник.НайтиПоКоду(Стр.Род.Код);
					
				//Если ИскомыйРодитель.Пустая() Тогда
				//	ИскомыйРодитель = Приемник.СоздатьГруппу();		
				//	ИскомыйРодитель.Код          = Стр.Род.Код;
				//	ИскомыйРодитель.Наименование = Стр.Род.Наименование;
				//	ИскомыйРодитель.Родитель     = ТекРодитель.Ссылка;
				//	ИскомыйРодитель.Записать();
				//КонецЕсли;
				ТекРодитель = ИскомыйРодитель;
			КонецЦикла;				
			
			НовыйЭлемент.Родитель = ТекРодитель;
			
			
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
		Иначе	
			Возврат РезПоискаРеквизит.Ссылка;	
		КонецЕсли; 
	Иначе
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;

КонецФункции


Функция ПолучитьБанковскийСчет(БазаИсточник, Владелец, Источник)
	УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 
	Приемник = Справочники.БанковскиеСчета;
	
	РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		РезПоискаРеквизит = Приемник.НайтиПоКоду(Источник.Код,,,Владелец);
		Если РезПоискаРеквизит.Пустая() Тогда
			НовыйЭлемент = Приемник.СоздатьЭлемент();
			НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
			НовыйЭлемент.Код                     = СокрЛП(Источник.Код);
			НовыйЭлемент.Наименование            = СокрЛП(Источник.Наименование);
			НовыйЭлемент.Владелец            = Владелец;
			
			НовыйЭлемент.НомерСчета = Источник.НомерСчета;
			НовыйЭлемент.ВалютаДенежныхСредств   = ПолучитьВалюту(Источник.ВалютаДенежныхСредств);
			НовыйЭлемент.ДатаОткрытия   = Источник.ДатаОткрытия;
			НовыйЭлемент.ДатаЗакрытия   = Источник.ДатаЗакрытия;
			НовыйЭлемент.СуммаБезКопеек   = Источник.СуммаБезКопеек;
			
			
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
		Иначе	
			Возврат РезПоискаРеквизит.Ссылка;	
		КонецЕсли; 
	Иначе
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;
КонецФункции

Процедура КонвДокПоступлениеТоваровУслуг(БазаИсточник, СоответствиеДанныхВКеше)
	
	//ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ПродажаКомиссия;
	
	СтатусСоздан = Справочники.Статусы.Создан;
	
	ИсЗапрос = БазаИсточник.NewObject("Запрос");
	ИсЗапрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Ссылка,
		|	Док.ВерсияДанных,
		|	Док.ПометкаУдаления,
		|	Док.Номер,
		|	Док.Дата,
		|	Док.СкладОрдер,
		|	Док.Проведен,
		|	Док.ВалютаДокумента,
		|	Док.ДоговорКонтрагента,
		|	Док.Комментарий,
		|	Док.Контрагент,
		|	Док.КратностьВзаиморасчетов,
		|	Док.КурсВзаиморасчетов,
		|	Док.Организация,
		|	Док.Ответственный,
		|	Док.СуммаВключаетНДС,
		|	Док.СуммаДокумента,
		|	Док.ТипЦен,
		|	Док.УчитыватьНДС,
		|	Док.Представление,
		|	Док.Товары.(
		|		Ссылка,
		|		НомерСтроки,
		|		Номенклатура,
		|		ЕдиницаИзмеренияМест,
		|		Цена,
		|		Сумма,
		|		СтавкаНДС,
		|		СуммаНДС,
		|		ХарактеристикаНоменклатуры,
		|		Коэффициент,
		|		Количество,
		|		КоличествоМест,
		|		ЕдиницаИзмерения,
		|		Склад,
		|		ЗаказПоставщику,
		|		Заказ
		|	),
		|	Док.ВозвратнаяТара.(
		|		Ссылка,
		|		НомерСтроки,
		|		Номенклатура,
		|		Количество,
		|		Цена,
		|		Сумма
		|	),
		|	Док.Услуги.(
		|		Ссылка,
		|		НомерСтроки,
		|		Содержание,
		|		Количество,
		|		Цена,
		|		Сумма,
		|		СтавкаНДС,
		|		СуммаНДС,
		|		Номенклатура
		|	),
		|	Док.Сделка,
		|	Док.ОтражатьВУправленческомУчете,
		|	Док.ОтражатьВБухгалтерскомУчете,
		|	Док.Подразделение,
		|	Док.НомерВходящегоДокумента,
		|	Док.ДатаВходящегоДокумента
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК Док
		|ГДЕ
		|	Док.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Док.Организация В(&ОрганизацииДляОбмена)
		|	И ВЫБОР
		|			КОГДА &ФильтрПоКонтрагенту
		|				ТОГДА Док.Контрагент = &Контрагент
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Док.Дата";

	
	ОрганизацииДляОбмена = БазаИсточник.NewObject("Массив");
	
	Для каждого Организация из СпОрганизаций Цикл
		ОрганизацииДляОбмена.Добавить(БазаИсточник.Справочники.Организации.НайтиПоНаименованию(Организация.Значение.Наименование, Истина));
		//_Сообщения.ДобавитьСтроку("Организация базы -  " + Организация.Значение.Наименование);
	КонецЦикла;
	
	ИсЗапрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	ИсЗапрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	ИсЗапрос.УстановитьПараметр("ОрганизацииДляОбмена", ОрганизацииДляОбмена);
	
	Если Не Объект.КонтрагентыИсточник.Количество() = 0 Тогда
		ИсЗапрос.УстановитьПараметр("ФильтрПоКонтрагенту", Истина);
		УИДТам = БазаИсточник.NewObject("УникальныйИдентификатор",Строка(Объект.КонтрагентыИсточник[0].УИД));
		ИсЗапрос.УстановитьПараметр("Контрагент", БазаИсточник.Справочники.Контрагенты.GetRef(УИДТам));
	Иначе
		ИсЗапрос.УстановитьПараметр("ФильтрПоКонтрагенту", Ложь);
		ИсЗапрос.УстановитьПараметр("Контрагент", БазаИсточник.Справочники.Контрагенты.ПустаяСсылка());
	КонецЕсли; 
	
	
	Результат = ИсЗапрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		
		УИД = БазаИсточник.String(Выборка.Ссылка.УникальныйИдентификатор()); //Выборка.Ссылка.УникальныйИдентификатор();
		
		РезПоиска = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
		Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
			Документ = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
			Документ.УстановитьСсылкуНового(РезПоиска);
		Иначе
			Если Не ОбновлятьСуществующиеДокументы Тогда
				Продолжить;
			КонецЕсли; 
			Документ = РезПоиска.Получитьобъект();	
			Документ.Товары.Очистить();
			Документ.Услуги.Очистить();
			Документ.ВозвратнаяТара.Очистить();
		КонецЕсли;
		
		//Если Не ЗначениеЗаполнено(Документ.Статус) Тогда
		//    Документ.Статус = СтатусСоздан;
		//КонецЕсли; 
		
		Документ.Номер                   = Выборка.Номер;
		Документ.Дата                    = Выборка.Дата;
		Документ.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
		
		Документ.ДатаВходящегоДокумента  = Выборка.ДатаВходящегоДокумента;
		Документ.НомерВходящегоДокумента  = Выборка.НомерВходящегоДокумента;
		
		Документ.Организация             = ПолучитьОрганизацию(Выборка.Организация, СоответствиеДанныхВКеше);
		Документ.Контрагент              = ПолучитьКонтрагента(БазаИсточник, Выборка.Контрагент);
		
		Документ.ДоговорКонтрагента      = ПолучитьДоговорКонтрагента(БазаИсточник, СоответствиеДанныхВКеше, Документ.Контрагент, Выборка.ДоговорКонтрагента);

		Документ.Ответственный           = ПолучитьПользователя(БазаИсточник, Выборка.Ответственный);			
		//Документ.СтруктурнаяЕдиница      = ПолучитьСтруктурнуюЕдиницу(Выборка.СтруктурнаяЕдиница);
		//Если НЕ ЗначениеЗаполнено(Документ.СтруктурнаяЕдиница) Тогда
		//	Документ.СтруктурнаяЕдиница  = Документ.Организация.ОсновнойБанковскийСчет;
		//КонецЕсли;	
		Документ.ВалютаДокумента         = ПолучитьВалюту(Выборка.ВалютаДокумента);
		Документ.КратностьВзаиморасчетов = Выборка.КратностьВзаиморасчетов;
		Документ.КурсВзаиморасчетов      = Выборка.КурсВзаиморасчетов;
		//Документ.АдресДоставки           = Выборка.АдресДоставки;
		Документ.Комментарий             = Выборка.Комментарий;
		Документ.СкладОрдер             = ПолучитьСклад(Выборка.СкладОрдер);
		Документ.СуммаВключаетНДС        = Выборка.СуммаВключаетНДС;
		Документ.СуммаДокумента          = Выборка.СуммаДокумента;
		Документ.ТипЦен                  = ПолучитьТипЦен(БазаИсточник, Выборка.ТипЦен);
		Документ.УчитыватьНДС            = Выборка.УчитыватьНДС;
		
		Документ.ОтражатьВБухгалтерскомУчете            = Выборка.ОтражатьВБухгалтерскомУчете;
		Документ.ОтражатьВУправленческомУчете            = Выборка.ОтражатьВУправленческомУчете;
		
		Документ.Подразделение           = ПолучитьПодразделение(БазаИсточник, Выборка.Подразделение);
		Документ.Сделка           = ПолучитьДокумент(БазаИсточник, Выборка.Сделка);
		
		Для Каждого ИсТовар Из Выборка.Товары.Unload() Цикл
			СтрокаТовары = Документ.Товары.Добавить();
			СтрокаТовары.Номенклатура     = ПолучитьНоменклатуру(БазаИсточник, ИсТовар.Номенклатура);
			СтрокаТовары.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(БазаИсточник, СтрокаТовары.Номенклатура.Ссылка, ИсТовар.ЕдиницаИзмерения);
			СтрокаТовары.Коэффициент      = ИсТовар.Коэффициент;
			СтрокаТовары.Количество       = ИсТовар.Количество;
			СтрокаТовары.Цена             = ИсТовар.Цена;
			СтрокаТовары.СтавкаНДС        = ПолучитьСтавкуНДС(БазаИсточник, ИсТовар.СтавкаНДС);
			СтрокаТовары.СуммаНДС         = ИсТовар.СуммаНДС;
			СтрокаТовары.Сумма            = ИсТовар.Сумма;
			СтрокаТовары.Заказ            = ПолучитьДокумент(БазаИсточник, ИсТовар.Заказ);
			СтрокаТовары.Склад            = ПолучитьСклад(ИсТовар.Склад);
			СтрокаТовары.ЗаказПоставщику  = ПолучитьДокумент(БазаИсточник, ИсТовар.ЗаказПоставщику);
		КонецЦикла;
		
		Для Каждого ИсУслуга Из Выборка.Услуги.Unload() Цикл
			СтрокаТовары = Документ.Услуги.Добавить();
			СтрокаТовары.Номенклатура     = ПолучитьНоменклатуру(БазаИсточник, ИсУслуга.Номенклатура);
			СтрокаТовары.Содержание       = ИсУслуга.Содержание;
			СтрокаТовары.Количество       = ИсУслуга.Количество;
			СтрокаТовары.Цена             = ИсУслуга.Цена;
			СтрокаТовары.СтавкаНДС        = ПолучитьСтавкуНДС(БазаИсточник, ИсУслуга.СтавкаНДС);
			СтрокаТовары.СуммаНДС         = ИсУслуга.СуммаНДС;
			СтрокаТовары.Сумма            = ИсУслуга.Сумма;
		КонецЦикла;
		
		Для Каждого ИсТара Из Выборка.ВозвратнаяТара.Unload() Цикл
			СтрокаТовары = Документ.ВозвратнаяТара.Добавить();
			СтрокаТовары.Номенклатура     = ПолучитьНоменклатуру(БазаИсточник, ИсТара.Номенклатура);
			СтрокаТовары.Количество       = ИсТара.Количество;
			СтрокаТовары.Цена             = ИсТара.Цена;
			СтрокаТовары.Сумма            = ИсТара.Сумма;
		КонецЦикла;
		
		Документ.ПометкаУдаления       = Выборка.ПометкаУдаления;
		//Документ.Проведен              = Выборка.Проведен;
		Документ.обменДанными.Загрузка = Истина;
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Запись);
			Если Выборка.Проведен Тогда
				Документ.обменДанными.Загрузка = Ложь;
				Документ.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли; 
		Исключение
			//Документ.ПолучитьФорму().Открыть();
		КонецПопытки;
		_Сообщения.ДобавитьСтроку("Обработали: " + Документ);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьВидОперацийВидыОперацийППИсходящее(ЗначениеТекст)
	Возврат Перечисления.ВидыОперацийППИсходящее[ЗначениеТекст];
КонецФункции

Функция ПолучитьДокумент(БазаИсточник, Источник, ДокументИмя = "")
	
	Если Не Источник = Неопределено Тогда
		УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 

		МетаданныеПолноеИмя = Источник.Метаданные().ПолноеИмя();
		Если Не Найти(МетаданныеПолноеИмя,"Документ") = 0 Тогда
			ТипДокумента = СтрЗаменить(МетаданныеПолноеИмя,"Документ.","");
		КонецЕсли; 
		
		Приемник = Документы[ТипДокумента];
		ИсточникДата = Источник.Дата;
		ИсточникНомер = Источник.Номер;
		
		РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
		
		Если Найти(Строка(РезПоиска),"<") <> 0 Тогда

			НовыйЭлемент = Приемник.СоздатьДокумент();
			НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
			НовыйЭлемент.Дата = ИсточникДата;
			НовыйЭлемент.Номер = ИсточникНомер;
			
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
		Иначе
			Возврат РезПоиска.Ссылка;	
		КонецЕсли;
		
	КонецЕсли; 
	
КонецФункции

Функция ПолучитьСтатьюДДС(БазаИсточник, Источник)
	УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 
	Приемник = Справочники.СтатьиДвиженияДенежныхСредств;
	ИсточникКод = СокрЛП(Источник.Код);
	ИсточникНаименование = СокрЛП(Источник.Наименование);

	РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		//РезПоискаРеквизит = Приемник.НайтиПоКоду(ИсточникКод);
		РезПоискаРеквизит = Приемник.НайтиПоНаименованию(ИсточникНаименование, Истина);
		Если РезПоискаРеквизит.Пустая() Тогда
			НовыйЭлемент = Приемник.СоздатьЭлемент();
			НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
			НовыйЭлемент.Код                     = ИсточникКод;
			НовыйЭлемент.Наименование            = ИсточникНаименование;
			
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
		Иначе	
			Возврат РезПоискаРеквизит.Ссылка;	
		КонецЕсли; 
	Иначе
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;

КонецФункции

Процедура КонвДокПлатежноеПоручениеИсходящее(БазаИсточник, СоответствиеДанныхВКеше)
	ВидОперацииДокументаОплатаПоставщику = БазаИсточник.Перечисления.ВидыОперацийППИсходящее.ОплатаПоставщику;
	ВидОперацииВозвратВозвратДенежныхСредствПокупателю = БазаИсточник.Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю;
	
	ВидыОперацийДокумента = БазаИсточник.NewObject("Массив");
	ВидыОперацийДокумента.Добавить(ВидОперацииДокументаОплатаПоставщику);
	ВидыОперацийДокумента.Добавить(ВидОперацииВозвратВозвратДенежныхСредствПокупателю);
	
	ИсЗапрос = БазаИсточник.NewObject("Запрос");
	ИсЗапрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Ссылка,
	|	Док.ПометкаУдаления,
	|	Док.Номер,	
	|	Док.НомерПоручения,
	|	Док.Дата,
	|	Док.Проведен,
	|	Док.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Док.ВидОперации = &ВидОперацииДокументаОплатаПоставщику
	|			ТОГДА ""ОплатаПоставщику""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Док.ВидОперации = &ВидОперацииВозвратВозвратДенежныхСредствПокупателю
	|					ТОГДА ""ВозвратДенежныхСредствПокупателю""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидОперацииЗначение,
	|	Док.ДоговорКонтрагента,
	|	Док.ДокументОснование,
	|	Док.Комментарий,
	|	Док.Контрагент,
	|	Док.Оплачено,
	|	Док.Организация,
	|	Док.Ответственный,
	|	Док.СтатьяДвиженияДенежныхСредств,
	|	Док.СуммаДокумента,
	|	Док.СчетКонтрагента,
	|	Док.СчетОрганизации,
	|	Док.Дата КАК ДатаВыписки,
	|	Док.НазначениеПлатежа,
	|	Док.Представление,
	|	Док.РасшифровкаПлатежа.(
	|		Ссылка,
	|		НомерСтроки,
	|		ДоговорКонтрагента,
	|		Сделка,
	|		КурсВзаиморасчетов,
	|		СуммаПлатежа,
	|		КратностьВзаиморасчетов,
	|		СуммаВзаиморасчетов,
	|		СтавкаНДС,
	|		СуммаНДС,
	|		СтатьяДвиженияДенежныхСредств,
	|		ДокументПланированияПлатежа,
	|		Проект,
	|		КурсВзаиморасчетовПлан,
	|		СуммаПлатежаПлан,
	|		ЗаТару,
	|		СтатьяДекларацииПоЕдиномуНалогу,
	|		ДокументРасчетовСКонтрагентом
	|	),
	|	Док.РеквизитыКонтрагента.(
	|		Ссылка,
	|		НомерСтроки,
	|		Реквизит,
	|		Значение,
	|		Представление,
	|		ТипКонтрагента
	|	),
	|	Док.ОтражатьВБухгалтерскомУчете
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее КАК Док
	|ГДЕ
	|	Док.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Док.ВидОперации В(&ВидыОперацийДокумента)
	|	И Док.Проведен";
	
	ИсЗапрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	ИсЗапрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	ИсЗапрос.УстановитьПараметр("ВидыОперацийДокумента", ВидыОперацийДокумента);
	ИсЗапрос.УстановитьПараметр("ВидОперацииДокументаОплатаПоставщику", ВидОперацииДокументаОплатаПоставщику);
	ИсЗапрос.УстановитьПараметр("ВидОперацииВозвратВозвратДенежныхСредствПокупателю", ВидОперацииВозвратВозвратДенежныхСредствПокупателю);
	
	Результат = ИсЗапрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		УИД = БазаИсточник.String(Выборка.Ссылка.УникальныйИдентификатор());
		
		РезПоиска = Документы.ПлатежноеПоручениеИсходящее.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
		Если Найти(Строка(РезПоиска),"<") = 0 Тогда
			Если Не ОбновлятьСуществующиеДокументы Тогда
				Продолжить;
			КонецЕсли; 
			Документ = РезПоиска.ПолучитьОбъект();
			Документ.РасшифровкаПлатежа.Очистить();
			Документ.РеквизитыКонтрагента.Очистить();
		Иначе
			Документ = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();
			Документ.УстановитьСсылкуНового(РезПоиска);
		КонецЕсли;
		
		Документ.ОтражатьВБухгалтерскомУчете    = Выборка.ОтражатьВБухгалтерскомУчете;
		Документ.ОтраженоВОперУчете             = Выборка.Ссылка.ОтражатьВУправленческомУчете;
		
		Документ.Оплачено                       = Выборка.Оплачено;
		Документ.Номер                          = Выборка.Номер;
		Документ.Дата                           = Выборка.Дата;
		Документ.ДатаОплаты                     = Выборка.Дата;
		Документ.НомерПоручения        = Выборка.НомерПоручения;
		Документ.Организация                    = ПолучитьОрганизацию(Выборка.Организация, СоответствиеДанныхВКеше);
		Документ.СчетОрганизации                = ПолучитьБанковскийСчет(БазаИсточник, Документ.Организация, Выборка.СчетОрганизации);
		Документ.ВидОперации                    = ПолучитьВидОперацийВидыОперацийППИсходящее(Выборка.ВидОперацииЗначение);
		Документ.Комментарий                    = Выборка.Комментарий;
		Документ.Ответственный                  = ПолучитьПользователя(БазаИсточник, Выборка.Ответственный);
		Документ.ВалютаДокумента                = ПолучитьВалюту(Выборка.ВалютаДокумента);
		Документ.Контрагент                     = ПолучитьКонтрагента(БазаИсточник, Выборка.Контрагент);
		Документ.ДоговорКонтрагента             = ПолучитьДоговорКонтрагента(БазаИсточник, СоответствиеДанныхВКеше, Документ.Контрагент, Выборка.ДоговорКонтрагента);
		Документ.ДокументОснование              = ПолучитьДокумент(БазаИсточник, Выборка.ДокументОснование);
		Документ.СтатьяДвиженияДенежныхСредств  = ПолучитьСтатьюДДС(БазаИсточник, Выборка.СтатьяДвиженияДенежныхСредств);
		Документ.СуммаДокумента                 = Выборка.СуммаДокумента;
		Документ.НазначениеПлатежа              = Выборка.НазначениеПлатежа;
		
		Для Каждого СтрокаРасшифровки Из Выборка.РасшифровкаПлатежа.Unload() Цикл
			НоваяРасшифровкаПлатежа = Документ.РасшифровкаПлатежа.Добавить();
			НоваяРасшифровкаПлатежа.ДоговорКонтрагента              = ПолучитьДоговорКонтрагента(БазаИсточник, СоответствиеДанныхВКеше, Документ.Контрагент, СтрокаРасшифровки.ДоговорКонтрагента);
			НоваяРасшифровкаПлатежа.Сделка                          = ПолучитьДокумент(БазаИсточник, СтрокаРасшифровки.Сделка);
			НоваяРасшифровкаПлатежа.КурсВзаиморасчетов              = СтрокаРасшифровки.КурсВзаиморасчетов;
			НоваяРасшифровкаПлатежа.СуммаПлатежа                    = СтрокаРасшифровки.СуммаПлатежа;
			НоваяРасшифровкаПлатежа.КратностьВзаиморасчетов         = СтрокаРасшифровки.КратностьВзаиморасчетов;
			НоваяРасшифровкаПлатежа.СуммаВзаиморасчетов             = СтрокаРасшифровки.СуммаВзаиморасчетов;
			НоваяРасшифровкаПлатежа.СтавкаНДС                       = ПолучитьСтавкуНДС(БазаИсточник, СтрокаРасшифровки.СтавкаНДС);
			НоваяРасшифровкаПлатежа.СуммаНДС                        = СтрокаРасшифровки.СуммаНДС;
			НоваяРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств   = ПолучитьСтатьюДДС(БазаИсточник, СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств);
		КонецЦикла;
	
		Для Каждого ИсРекв Из Выборка.РеквизитыКонтрагента.Unload() Цикл
			СтрокаРекв = Документ.РеквизитыКонтрагента.Добавить();
			СтрокаРекв.Реквизит       = ИсРекв.Реквизит;
			СтрокаРекв.Значение       = ИсРекв.Значение;
			СтрокаРекв.Представление  = ИсРекв.Представление;
			СтрокаРекв.ТипКонтрагента = ИсРекв.ТипКонтрагента;
		КонецЦикла;
		
		Документ.ПометкаУдаления       = Выборка.ПометкаУдаления;
		//Документ.Проведен              = Выборка.Проведен;
		Документ.ОбменДанными.Загрузка = Истина;
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Запись);
			Если Выборка.Проведен Тогда
				Документ.ОбменДанными.Загрузка = Ложь;
				Документ.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли; 
		Исключение
			//Документ.ПолучитьФорму().Открыть();
		КонецПопытки;
		_Сообщения.ДобавитьСтроку("Обработали: " + Документ);

			
	КонецЦикла;

КонецПроцедуры

Процедура КонвДокПлатежноеПоручениеВходящее(БазаИсточник, СоответствиеДанныхВКеше)
	ВидОперацииДокументаОплатаПокупателя = БазаИсточник.Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
	ВидОперацииВозвратДенежныхСредствПоставщиком = БазаИсточник.Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком;
	
	ВидыОперацийДокумента = БазаИсточник.NewObject("Массив");
	ВидыОперацийДокумента.Добавить(ВидОперацииДокументаОплатаПокупателя);
	ВидыОперацийДокумента.Добавить(ВидОперацииВозвратДенежныхСредствПоставщиком);
	
	ИсЗапрос = БазаИсточник.NewObject("Запрос");
	ИсЗапрос.Текст = 
	"ВЫБРАТЬ
	|	Док.Ссылка,
	|	Док.ПометкаУдаления,
	|	Док.Номер,
	|	Док.Дата,
	|	Док.Проведен,
	|	Док.ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Док.ВидОперации = &ВидОперацииДокументаОплатаПокупателя
	|			ТОГДА ""ОплатаПокупателя""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Док.ВидОперации = &ВидОперацииВозвратДенежныхСредствПоставщиком
	|					ТОГДА ""ВозвратДенежныхСредствПоставщиком""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ВидОперацииЗначение,
	|	Док.ДоговорКонтрагента,
	|	Док.ДокументОснование,
	|	Док.Комментарий,
	|	Док.Контрагент,
	|	Док.НомерВходящегоДокумента,
	|	Док.ДатаВходящегоДокумента,
	|	Док.Оплачено,
	|	Док.Организация,
	|	Док.Ответственный,
	|	Док.СтатьяДвиженияДенежныхСредств,
	|	Док.СуммаДокумента,
	|	Док.СчетКонтрагента,
	|	Док.СчетОрганизации,
	|	Док.Дата КАК ДатаВыписки,
	|	Док.НазначениеПлатежа,
	|	Док.СуммаУслуг,
	|	Док.Представление,
	|	Док.РасшифровкаПлатежа.(
	|		Ссылка,
	|		НомерСтроки,
	|		ДоговорКонтрагента,
	|		Сделка,
	|		КурсВзаиморасчетов,
	|		СуммаПлатежа,
	|		КратностьВзаиморасчетов,
	|		СуммаВзаиморасчетов,
	|		СтавкаНДС,
	|		СуммаНДС,
	|		СтатьяДвиженияДенежныхСредств,
	|		ДокументПланированияПлатежа,
	|		Проект,
	|		КурсВзаиморасчетовПлан,
	|		СуммаПлатежаПлан,
	|		ЗаТару,
	|		СтатьяДекларацииПоЕдиномуНалогу,
	|		ДокументРасчетовСКонтрагентом
	|	),
	|	Док.РеквизитыКонтрагента.(
	|		Ссылка,
	|		НомерСтроки,
	|		Реквизит,
	|		Значение,
	|		Представление,
	|		ТипКонтрагента
	|	),
	|	Док.ОтражатьВБухгалтерскомУчете
	|ИЗ
	|	Документ.ПлатежноеПоручениеВходящее КАК Док
	|ГДЕ
	|	Док.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Док.Проведен
	|	И Док.ВидОперации В(&ВидыОперацийДокумента)";

	
	ИсЗапрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	ИсЗапрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	ИсЗапрос.УстановитьПараметр("ВидыОперацийДокумента", ВидыОперацийДокумента);
	ИсЗапрос.УстановитьПараметр("ВидОперацииДокументаОплатаПокупателя", ВидОперацииДокументаОплатаПокупателя);
	ИсЗапрос.УстановитьПараметр("ВидОперацииВозвратДенежныхСредствПоставщиком", ВидОперацииВозвратДенежныхСредствПоставщиком);
	
	Результат = ИсЗапрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		УИД = БазаИсточник.String(Выборка.Ссылка.УникальныйИдентификатор());
		
		РезПоиска = Документы.ПлатежноеПоручениеВходящее.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
		Если Найти(Строка(РезПоиска),"<") = 0 Тогда
			Если Не ОбновлятьСуществующиеДокументы Тогда
				Продолжить;
			КонецЕсли; 
			Документ = РезПоиска.ПолучитьОбъект();
			Документ.РасшифровкаПлатежа.Очистить();
			Документ.РеквизитыКонтрагента.Очистить();
		Иначе
			Документ = Документы.ПлатежноеПоручениеВходящее.СоздатьДокумент();
			Документ.УстановитьСсылкуНового(РезПоиска);
		КонецЕсли;
		
		Документ.ОтражатьВБухгалтерскомУчете    = Выборка.ОтражатьВБухгалтерскомУчете;
		Документ.ОтраженоВОперУчете             = Выборка.Ссылка.ОтражатьВУправленческомУчете;
		
		Документ.Оплачено                       = Выборка.Оплачено;
		Документ.Номер                          = Выборка.Номер;
		Документ.ДатаВходящегоДокумента         = Выборка.Дата;
		Документ.Дата                           = Выборка.Дата;
		Документ.ДатаОплаты                     = Выборка.Дата;
		Документ.НомерВходящегоДокумента        = Выборка.НомерВходящегоДокумента;
		Документ.Организация                    = ПолучитьОрганизацию(Выборка.Организация, СоответствиеДанныхВКеше);
		Документ.СчетОрганизации                = ПолучитьБанковскийСчет(БазаИсточник, Документ.Организация, Выборка.СчетОрганизации);
		Документ.ВидОперации                    = ПолучитьВидОперацийПоступлениеБезналичныхДенежныхСредств(Выборка.ВидОперацииЗначение);
		Документ.Комментарий                    = Выборка.Комментарий;
		Документ.Ответственный                  = ПолучитьПользователя(БазаИсточник, Выборка.Ответственный);
		Документ.ВалютаДокумента                = ПолучитьВалюту(Выборка.ВалютаДокумента);
		Документ.Контрагент                     = ПолучитьКонтрагента(БазаИсточник, Выборка.Контрагент);
		Документ.ДоговорКонтрагента             = ПолучитьДоговорКонтрагента(БазаИсточник, СоответствиеДанныхВКеше, Документ.Контрагент, Выборка.ДоговорКонтрагента);
		Документ.ДокументОснование              = ПолучитьДокумент(БазаИсточник, Выборка.ДокументОснование);
		Документ.НомерВходящегоДокумента        = Выборка.НомерВходящегоДокумента;
		Документ.СтатьяДвиженияДенежныхСредств  = ПолучитьСтатьюДДС(БазаИсточник, Выборка.СтатьяДвиженияДенежныхСредств);
		Документ.СуммаДокумента                 = Выборка.СуммаДокумента;
		Документ.СуммаУслуг                     = Выборка.СуммаУслуг;
		Документ.НазначениеПлатежа              = Выборка.НазначениеПлатежа;
		
		Для Каждого СтрокаРасшифровки Из Выборка.РасшифровкаПлатежа.Unload() Цикл
			НоваяРасшифровкаПлатежа = Документ.РасшифровкаПлатежа.Добавить();
			НоваяРасшифровкаПлатежа.ДоговорКонтрагента              = ПолучитьДоговорКонтрагента(БазаИсточник, СоответствиеДанныхВКеше, Документ.Контрагент, СтрокаРасшифровки.ДоговорКонтрагента);
			НоваяРасшифровкаПлатежа.Сделка                          = ПолучитьДокумент(БазаИсточник, СтрокаРасшифровки.Сделка);
			НоваяРасшифровкаПлатежа.КурсВзаиморасчетов              = СтрокаРасшифровки.КурсВзаиморасчетов;
			НоваяРасшифровкаПлатежа.СуммаПлатежа                    = СтрокаРасшифровки.СуммаПлатежа;
			НоваяРасшифровкаПлатежа.КратностьВзаиморасчетов         = СтрокаРасшифровки.КратностьВзаиморасчетов;
			НоваяРасшифровкаПлатежа.СуммаВзаиморасчетов             = СтрокаРасшифровки.СуммаВзаиморасчетов;
			НоваяРасшифровкаПлатежа.СтавкаНДС                       = ПолучитьСтавкуНДС(БазаИсточник, СтрокаРасшифровки.СтавкаНДС);
			НоваяРасшифровкаПлатежа.СуммаНДС                        = СтрокаРасшифровки.СуммаНДС;
			НоваяРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств   = ПолучитьСтатьюДДС(БазаИсточник, СтрокаРасшифровки.СтатьяДвиженияДенежныхСредств);
		КонецЦикла;
	
		Для Каждого ИсРекв Из Выборка.РеквизитыКонтрагента.Unload() Цикл
			СтрокаРекв = Документ.РеквизитыКонтрагента.Добавить();
			СтрокаРекв.Реквизит       = ИсРекв.Реквизит;
			СтрокаРекв.Значение       = ИсРекв.Значение;
			СтрокаРекв.Представление  = ИсРекв.Представление;
			СтрокаРекв.ТипКонтрагента = ИсРекв.ТипКонтрагента;
		КонецЦикла;
		
		Документ.ПометкаУдаления       = Выборка.ПометкаУдаления;
		//Документ.Проведен              = Выборка.Проведен;
		Документ.ОбменДанными.Загрузка = Истина;
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Запись);
			Если Выборка.Проведен Тогда
				Документ.ОбменДанными.Загрузка = Ложь;
				Документ.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли; 
		Исключение
			//Документ.ПолучитьФорму().Открыть();
		КонецПопытки;
		_Сообщения.ДобавитьСтроку("Обработали: " + Документ);

			
	КонецЦикла;

КонецПроцедуры

//report UT - UTP 11.09.2021

Функция ПолучитьВалюту(Валюта)
	Возврат Справочники.Валюты.НайтиПоКоду(СокрЛП(Валюта.Код));
КонецФункции

Функция ПолучитьСклад(Склад)
	Возврат Справочники.Склады.НайтиПоНаименованию("ОСНОВНОЙ", Истина);
КонецФункции

Функция ПолучитьВидОперацийПоступлениеБезналичныхДенежныхСредств(ЗначениеТекст)
	Возврат Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств[ЗначениеТекст];
КонецФункции

Функция ПолучитьСтавкуНДС(БазаИсточник, Источник)
	Попытка   
		НомОбор = БазаИсточник.Перечисления.СтавкиНДС.Индекс(Источник);
		ИмяОбор = БазаИсточник.Метаданные.Перечисления.СтавкиНДС.EnumValues.Get(НомОбор).Name;
		Возврат Перечисления.СтавкиНДС[ИмяОбор];

		
		//ИсточникИндекс = БазаИсточник.Перечисления.СтавкиНДС.Индекс(Источник);
		//ВозможныеЗначения = Источник.Метаданные().ЗначенияПеречисления;
		//ЗначениеТекст = ""; //ВозможныеЗначения.Индекс(ВозможныеЗначения.Найти(БазаИсточник.XMLString(ЭлементПеречисления)))  не работает;
		//ЗначениеИндекс = 0;
		//Для каждого Значения Из ВозможныеЗначения Цикл
		//	Если ЗначениеИндекс = ИсточникИндекс Тогда
		//		ЗначениеТекст = Значения.Name;
		//		Прервать;
		//	КонецЕсли;
		//ЗначениеИндекс = ЗначениеИндекс + 1;
		//КонецЦикла;

		//Если Не ЗначениеТекст = "" Тогда
		//	//Если ЗначениеТекст = "НеРассчитывается" Тогда // "НеРассчитывается" 
		//	//	ЗначениеПоиска = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается;
		//	//ИначеЕсли ЗначениеТекст = "ПроцентОтРазностиСуммПродажиИПоступления" Тогда // "ПроцентОтРазностиСуммПродажиИПоступления"
		//	//	ЗначениеПоиска = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтПрибыли;
		//	//ИначеЕсли ЗначениеТекст = "ПроцентОтСуммыПродажи" Тогда                            // "ПроцентОтСуммыПродажи"
		//	//	ЗначениеПоиска = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи;
		//	//КонецЕсли;	
		//	//
		//	//Возврат ЗначениеПоиска;
		//	Возврат Перечисления.СтавкиНДС[ЗначениеТекст];
		//КонецЕсли;	
		
	Исключение
		
	КонецПопытки;
	
КонецФункции

Функция ПолучитьСхемуНалоговогоУчетаПоДоговорамКонтрагентов(Схема)
	//Если СсылкаНеПустая(Схема) Тогда
		Возврат Справочники.СхемыНалоговогоУчетаПоДоговорамКонтрагентов.НайтиПоКоду(СокрЛП(Схема.код));
	//КонецЕсли;
КонецФункции

Функция ПолучитьЮрФизЛицо(БазаИсточник, ЮрФизЛицо)
	//Если СсылкаНеПустая(ЮрФизЛицо) Тогда
		Возврат Перечисления.ЮрФизЛицо.Получить(БазаИсточник.Перечисления.ЮрФизЛицо.Индекс(ЮрФизЛицо));
	//КонецЕсли;	
КонецФункции

Функция ПолучитьВидыОперацийЗаказПокупателя(БазаИсточник , Источник)
	 ВозможныеЗначения = Источник.Метаданные().ЗначенияПеречисления;
	 ЗначениеТекст = "";//ВозможныеЗначения.Индекс(ВозможныеЗначения.Найти(БазаИсточник.XMLString(ЭлементПеречисления)))  не работает;
	 Для каждого Значения Из ВозможныеЗначения Цикл
	 	Если Значения = Источник Тогда
			ЗначениеТекст = Значения.Name;
			Прервать;
		КонецЕсли;  
	 КонецЦикла;
	 //Если НомерЭлементаПеречисления = 0 Тогда
	 //  Сообщить("ЗначениеПеречисления1");
	 //ИначеЕсли НомерЭлементаПеречисления = 1 Тогда
	 //  Сообщить("ЗначениеПеречисления2");
	 //КонецЕсли;	
		
		
	Если Не ЗначениеТекст = "" Тогда
		//ИндексПоиска = БазаИсточник.Перечисления.СпособыРасчетаКомиссионногоВознаграждения.Индекс(СпособРасчета);
		
		Если ЗначениеТекст = "НеРассчитывается" Тогда // "НеРассчитывается" 
			ЗначениеПоиска = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается;
		ИначеЕсли ЗначениеТекст = "ПроцентОтРазностиСуммПродажиИПоступления" Тогда // "ПроцентОтРазностиСуммПродажиИПоступления"
			ЗначениеПоиска = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтПрибыли;
		ИначеЕсли ЗначениеТекст = "ПроцентОтСуммыПродажи" Тогда                            // "ПроцентОтСуммыПродажи"
			ЗначениеПоиска = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи;
		КонецЕсли;	
		
		Возврат ЗначениеПоиска;
	КонецЕсли;	
КонецФункции

Функция ПолучитьВидДеятельностиДляДДС(БазаИсточник, ВидДеятельности)
	Возврат Перечисления.ВидыДеятельностиДляДДС.Получить(БазаИсточник.Перечисления.ВидыДеятельностиДляДДС.Индекс(ВидДеятельности));
КонецФункции

Функция ПолучитьВедениеВзаиморасчетовПоДоговорам(БазаИсточник, Источник)
	Возврат Перечисления.ВедениеВзаиморасчетовПоДоговорам.Получить(БазаИсточник.Перечисления.ВедениеВзаиморасчетовПоДоговорам.Индекс(Источник));
КонецФункции

Функция ПолучитьВидВзаиморасчетов(ВидВзаиморасчетов)
	//Если СсылкаНеПустая(ВидВзаиморасчетов) Тогда
		Возврат Справочники.ВидыВзаиморасчетов.НайтиПоКоду(СокрЛП(ВидВзаиморасчетов.Код));
	//КонецЕсли;
КонецФункции

Функция ПолучитьСпособРасчетаКомиссионногоВознаграждения(БазаИсточник , Источник)
	
	
//ЭлементПеречисления = СпособРасчета;//Подключение.Справочники.Справочник1.НайтиПоКоду(1).Реквизит1;
 ВозможныеЗначения = Источник.Метаданные().ЗначенияПеречисления;
 ЗначениеТекст = "";//ВозможныеЗначения.Индекс(ВозможныеЗначения.Найти(БазаИсточник.XMLString(ЭлементПеречисления)));
 Для каждого Значения Из ВозможныеЗначения Цикл
 	Если Значения = Источник Тогда
		ЗначениеТекст = Значения.Name;
		Прервать;
	КонецЕсли;  
 КонецЦикла;
 //Если НомерЭлементаПеречисления = 0 Тогда
 //  Сообщить("ЗначениеПеречисления1");
 //ИначеЕсли НомерЭлементаПеречисления = 1 Тогда
 //  Сообщить("ЗначениеПеречисления2");
 //КонецЕсли;	
	
	
Если Не ЗначениеТекст = "" Тогда
	//ИндексПоиска = БазаИсточник.Перечисления.СпособыРасчетаКомиссионногоВознаграждения.Индекс(СпособРасчета);
	
	Если ЗначениеТекст = "НеРассчитывается" Тогда // "НеРассчитывается" 
		ЗначениеПоиска = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается;
	ИначеЕсли ЗначениеТекст = "ПроцентОтРазностиСуммПродажиИПоступления" Тогда // "ПроцентОтРазностиСуммПродажиИПоступления"
		ЗначениеПоиска = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтПрибыли;
	ИначеЕсли ЗначениеТекст = "ПроцентОтСуммыПродажи" Тогда                            // "ПроцентОтСуммыПродажи"
		ЗначениеПоиска = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи;
	КонецЕсли;	
	
	Возврат ЗначениеПоиска;
КонецЕсли;	
КонецФункции

Функция ПолучитьОрганизацию(ИстОрганизация, СоответствиеДанныхВКеше)
	ОбъктИсточникКод = ИстОрганизация.Наименование;
	
	//_Сообщения.ДобавитьСтроку("ИстОрганизация -  " + ИстОрганизация.Наименование);
	
	Организации = СоответствиеДанныхВКеше.Получить("Организации");
	
	Организация = Организации.Получить(ОбъктИсточникКод);
	
	Если Организация = Неопределено Тогда
		Организация = Справочники.Организации.НайтиПоНаименованию(ОбъктИсточникКод, Истина);
		Если Не ЗначениеЗаполнено(Организация) Тогда
			_Сообщения.ДобавитьСтроку("    *** Не найдена по наименованию Организация -  " + ОбъктИсточникКод);
		КонецЕсли; 
		Организации.Вставить(ОбъктИсточникКод, Организация);
		
		
		СоответствиеДанныхВКеше.Вставить("Организации",Организации);
	КонецЕсли;
	Возврат Организация;
КонецФункции

Функция ПолучитьВидДоговора(БазаИсточник, ВидДоговора)
	//Если СсылкаНеПустая(ВидДоговора) Тогда
		Возврат Перечисления.ВидыДоговоровКонтрагентов.Получить(БазаИсточник.Перечисления.ВидыДоговоровКонтрагентов.Индекс(ВидДоговора));
	//КонецЕсли;
КонецФункции

Функция ПолучитьПользователя(БазаИсточник, Источник)
	УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 
	Приемник = Справочники.Пользователи;
	
	РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		РезПоискаРеквизит = Приемник.НайтиПоНаименованию(Источник.Наименование, Истина);
		Если РезПоискаРеквизит.Пустая() Тогда
			НовыйЭлемент = Приемник.СоздатьЭлемент();
			НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
			НовыйЭлемент.Код                     = СокрЛП(Источник.Код);
			НовыйЭлемент.Наименование            = СокрЛП(Источник.Наименование);
			
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
		Иначе	
			Возврат РезПоискаРеквизит.Ссылка;	
		КонецЕсли; 
	Иначе
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;
КонецФункции

Функция ПолучитьКлассификаторУКТВЭД(БазаИсточник, Источник)
	УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 
	Приемник = Справочники.КлассификаторУКТВЭД;
	
	РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		РезПоискаРеквизит = Приемник.НайтиПоКоду(Источник.Код);
		Если РезПоискаРеквизит.Пустая() Тогда
			НовыйЭлемент = Приемник.СоздатьЭлемент();
			НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
			НовыйЭлемент.Код                     = СокрЛП(Источник.Код);
			НовыйЭлемент.Наименование            = СокрЛП(Источник.Наименование);
			
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
		Иначе	
			Возврат РезПоискаРеквизит.Ссылка;	
		КонецЕсли; 
	Иначе
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;

КонецФункции

Функция ПолучитьНоменклатураГТД(БазаИсточник, Источник)
	УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 
	Приемник = Справочники.НоменклатураГТД;
	
	РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		РезПоискаРеквизит = Приемник.НайтиПоКоду(Источник.Код);
		Если РезПоискаРеквизит.Пустая() Тогда
			НовыйЭлемент = Приемник.СоздатьЭлемент();
			НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
			НовыйЭлемент.Код                     = СокрЛП(Источник.Код);
			НовыйЭлемент.Наименование            = СокрЛП(Источник.Наименование);
			
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
		Иначе	
			Возврат РезПоискаРеквизит.Ссылка;	
		КонецЕсли; 
	Иначе
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;

КонецФункции

Функция ПолучитьНоменклатураГТДРеквизит(БазаИсточник, Источник)
	Попытка
		Если Не Источник.Код = "" Тогда
			Если БазаИсточник.метаданные().стандартныереквизиты.ссылка.тип.типы().получить(0) = "НоменклатураГТД" Тогда
				Возврат  ПолучитьНоменклатураГТД(БазаИсточник, Источник);
			ИначеЕсли БазаИсточник.метаданные().стандартныереквизиты.ссылка.тип.типы().получить(0) = "КлассификаторУКТВЭД" Тогда
				Возврат  ПолучитьКлассификаторУКТВЭД(БазаИсточник, Источник);
			КонецЕсли;
		КонецЕсли; 
	Исключение
	
	КонецПопытки;
КонецФункции

Функция ПолучитьНоменклатурнуюГруппу(БазаИсточник, Источник)
	УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 
	Приемник = Справочники.НоменклатурныеГруппы;
	
	РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		РезПоискаРеквизит = Приемник.НайтиПоКоду(Источник.Код);
		Если РезПоискаРеквизит.Пустая() Тогда
			НовыйЭлемент = Приемник.СоздатьЭлемент();
			НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
			НовыйЭлемент.Код                     = СокрЛП(Источник.Код);
			НовыйЭлемент.Наименование            = СокрЛП(Источник.Наименование);
			
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
		Иначе	
			Возврат РезПоискаРеквизит.Ссылка;	
		КонецЕсли; 
	Иначе
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;

КонецФункции

Функция ПолучитьКлассификаторЕдиницИзмерения(БазаИсточник, Источник)
	УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 
	Приемник = Справочники.КлассификаторЕдиницИзмерения;
	
	РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		РезПоискаРеквизит = Приемник.НайтиПоКоду(Источник.Код);
		Если РезПоискаРеквизит.Пустая() Тогда
			НовыйЭлемент = Приемник.СоздатьЭлемент();
			НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
			//ЗаполнитьЗначенияСвойств(Приемник, Источник);
			НовыйЭлемент.Код                     = СокрЛП(Источник.Код);
			НовыйЭлемент.Наименование            = СокрЛП(Источник.Наименование);
			НовыйЭлемент.НаименованиеПолное            = СокрЛП(Источник.НаименованиеПолное);
			НовыйЭлемент.МеждународноеСокращение            = СокрЛП(Источник.МеждународноеСокращение);
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
		Иначе	
			Возврат РезПоискаРеквизит.Ссылка;	
		КонецЕсли; 
	Иначе
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;

КонецФункции

Функция ПолучитьВидНоменклатуры(БазаИсточник, Источник)
	УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 
	Приемник = Справочники.ВидыНоменклатуры;
	
	РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		РезПоискаРеквизит = Приемник.НайтиПоНаименованию(Источник.Наименование, Истина);
		Если РезПоискаРеквизит.Пустая() Тогда
			НовыйЭлемент = Приемник.СоздатьЭлемент();
			НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
			НовыйЭлемент.Код                     = СокрЛП(Источник.Код);
			НовыйЭлемент.Наименование            = СокрЛП(Источник.Наименование);
			
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
		Иначе	
			Возврат РезПоискаРеквизит.Ссылка;	
		КонецЕсли; 
	Иначе
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;
КонецФункции

Функция ПолучитьЕдиницуИзмерения(БазаИсточник, Владелец, Источник)
	УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 
	Приемник = Справочники.ЕдиницыИзмерения;
	
	РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		РезПоискаРеквизит = Приемник.НайтиПоКоду(Источник.Код,,,Владелец);
		Если РезПоискаРеквизит.Пустая() Тогда
			НовыйЭлемент = Приемник.СоздатьЭлемент();
			НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
			НовыйЭлемент.Код                     = СокрЛП(Источник.Код);
			НовыйЭлемент.Наименование            = СокрЛП(Источник.Наименование);
			НовыйЭлемент.Владелец            = Владелец;
			
			НовыйЭлемент.Объем = Источник.Объем;
			НовыйЭлемент.Вес   = Источник.Вес;
			НовыйЭлемент.Коэффициент   = Источник.Коэффициент;
			
			НовыйЭлемент.ЕдиницаПоКлассификатору = ПолучитьКлассификаторЕдиницИзмерения(БазаИсточник, Источник.ЕдиницаПоКлассификатору);
			
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
		Иначе	
			Возврат РезПоискаРеквизит.Ссылка;	
		КонецЕсли; 
	Иначе
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;
КонецФункции

Функция ПолучитьТипЦен(БазаИсточник, Источник)
	Попытка
		УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 
		Приемник = Справочники.ТипыЦенНоменклатуры;
		
		РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
		Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
			//РезПоискаРеквизит = Приемник.НайтиПоНаименованию(Источник.Наименование, Истина);
			//Если РезПоискаРеквизит.Пустая() Тогда
				НовыйЭлемент = Приемник.СоздатьЭлемент();
				НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
				НовыйЭлемент.Код                     = СокрЛП(Источник.Код);
				НовыйЭлемент.Наименование            = СокрЛП(Источник.Наименование);
				
				НовыйЭлемент.ОбменДанными.Загрузка = Истина;
				НовыйЭлемент.Записать();
				
				Возврат НовыйЭлемент.Ссылка; 
			//Иначе	
			//	Возврат РезПоискаРеквизит.Ссылка;	
			//КонецЕсли; 
		Иначе
			Возврат РезПоиска.Ссылка;	
		КонецЕсли;
	Исключение КонецПопытки;
КонецФункции

Функция ПолучитьДоговорКонтрагента(БазаИсточник, СоответствиеДанныхВКеше, Контрагент, Источник)
	
	ИсточникКод = СокрЛП(Источник.Код);
	ИсточникНаименование = СокрЛП(Источник.Наименование);
	Приемник = Справочники.ДоговорыКонтрагентов;
	
	Если ИсточникКод = "" Тогда
		Возврат Приемник.ПустаяСсылка();
	КонецЕсли;
	
	УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 
	Приемник = Справочники.ДоговорыКонтрагентов;
	
	РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		//РезПоискаРеквизит = Приемник.НайтиПоНаименованию(Источник.Наименование, Истина);
		//Если РезПоискаРеквизит.Пустая() Тогда
			НовыйЭлемент = Приемник.СоздатьЭлемент();
			НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
			НовыйЭлемент.Код                     = ИсточникКод;
			НовыйЭлемент.Наименование            = ИсточникНаименование;
			
			НовыйЭлемент.Владелец              = Контрагент;
			НовыйЭлемент.НаименованиеДляПечати = СокрЛП(Источник.НаименованиеДляПечати);
			
			НовыйЭлемент.ВедениеВзаиморасчетов   = ПолучитьВедениеВзаиморасчетовПоДоговорам(БазаИсточник, Источник.ВедениеВзаиморасчетов);
			НовыйЭлемент.Организация             = ПолучитьОрганизацию(Источник.Организация, СоответствиеДанныхВКеше);
			НовыйЭлемент.Дата                    = Источник.Дата;
			НовыйЭлемент.Номер                   = СокрЛП(Источник.Номер);
			НовыйЭлемент.ВидДоговора             = ПолучитьВидДоговора(БазаИсточник, Источник.ВидДоговора);
			НовыйЭлемент.ВалютаВзаиморасчетов    = ПолучитьВалюту(Источник.ВалютаВзаиморасчетов);
			НовыйЭлемент.Комментарий             = Источник.Комментарий;
			//НовыйЭлемент.СложныйНалоговыйУчет    = Источник.СложныйНалоговыйУчет;
			//НовыйЭлемент.НеОтноситьНаЗатратыПоНУ = Источник.НеОтноситьНаЗатратыПоНУ;
			НовыйЭлемент.ПроцентКомиссионногоВознаграждения = Источник.ПроцентКомиссионногоВознаграждения;
			НовыйЭлемент.ВидВзаиморасчетов       = ПолучитьВидВзаиморасчетов(Источник.ВидВзаиморасчетов);
			НовыйЭлемент.СпособРасчетаКомиссионногоВознаграждения = ПолучитьСпособРасчетаКомиссионногоВознаграждения(БазаИсточник, Источник.СпособРасчетаКомиссионногоВознаграждения);
			НовыйЭлемент.ТипЦен                  = ПолучитьТипЦен(БазаИсточник, Источник.ТипЦен);
			//НовыйЭлемент.ВидДеятельностиДляДДС   = ПолучитьВидДеятельностиДляДДС(БазаИсточник, Источник.ВидДеятельностиДляДДС);
			НовыйЭлемент.СхемаНалоговогоУчета                       = ПолучитьСхемуНалоговогоУчетаПоДоговорамКонтрагентов(Источник.СхемаНалоговогоУчета);
			НовыйЭлемент.СхемаНалоговогоУчетаПоТаре                 = ПолучитьСхемуНалоговогоУчетаПоДоговорамКонтрагентов(Источник.СхемаНалоговогоУчетаПоТаре);;
			
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
		//Иначе	
		//	Возврат РезПоискаРеквизит.Ссылка;	
		//КонецЕсли; 
	Иначе
		
		Если Не ЗначениеЗаполнено(РезПоиска.Организация) 
			или РезПоиска.Организация <> ПолучитьОрганизацию(Источник.Организация, СоответствиеДанныхВКеше) Тогда
		    СпрОбъект = РезПоиска.ПолучитьОбъект();
			СпрОбъект.Организация             = ПолучитьОрганизацию(Источник.Организация, СоответствиеДанныхВКеше);
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.Записать();
		КонецЕсли; 
		
		Если НЕ РезПоиска.Владелец = Контрагент Тогда
		    СпрОбъект = РезПоиска.ПолучитьОбъект();
			СпрОбъект.Владелец = Контрагент;
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.Записать();
		КонецЕсли; 
		
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;
КонецФункции

Функция ПолучитьНоменклатуру(БазаИсточник, Источник)
	УИД = БазаИсточник.String(Источник.УникальныйИдентификатор()); 
	Приемник = Справочники.Номенклатура;
	
	РезПоиска = Приемник.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		РезПоискаРеквизит = Приемник.НайтиПоНаименованию(Источник.Наименование, Истина);
		Если РезПоискаРеквизит.Пустая() Тогда
			НовыйЭлемент = Приемник.СоздатьЭлемент();
			НовыйЭлемент.УстановитьСсылкуНового(РезПоиска);
			//ЗаполнитьЗначенияСвойств(Приемник, Источник);
			
			//НовыйЭлемент.Код                     = СокрЛП(Источник.Код);
			НовыйЭлемент.Наименование            = СокрЛП(Источник.Наименование);
			НовыйЭлемент.НаименованиеПолное      = СокрЛП(Источник.НаименованиеПолное);
			НовыйЭлемент.БазоваяЕдиницаИзмерения = ПолучитьКлассификаторЕдиницИзмерения(БазаИсточник, Источник.БазоваяЕдиницаИзмерения); 
			НовыйЭлемент.ВидНоменклатуры         = ПолучитьВидНоменклатуры(БазаИсточник, Источник.ВидНоменклатуры);
			НовыйЭлемент.ОбменДанными.Загрузка   = Истина;
			
			
			// для получения ссылки запишем элемент
			НовыйЭлемент.Записать();
			
			НовыйЭлемент.Артикул                                            = Источник.Артикул;
			НовыйЭлемент.ЕдиницаХраненияОстатков                            = ПолучитьЕдиницуИзмерения(БазаИсточник, НовыйЭлемент.Ссылка,Источник.ЕдиницаХраненияОстатков); 
			
			НовыйЭлемент.ИзмеряетсяТолькоВСуммовомВыражении                 = Источник.ИзмеряетсяТолькоВСуммовомВыражении;
			НовыйЭлемент.ТекстДляПечатиВКолонкеКоличествоНалоговойНакладной = Источник.ТекстДляПечатиВКолонкеКоличествоНалоговойНакладной;
			
			НовыйЭлемент.ТранспортнаяУслуга                                 = Источник.ТранспортнаяУслуга;
			НовыйЭлемент.Набор                                 = Источник.Набор;
			НовыйЭлемент.Услуга                                 = Источник.Услуга;
			НовыйЭлемент.Комплект                                 = Источник.Комплект;
			НовыйЭлемент.ЛьготаНДС                                          = Источник.ЛьготаНДС;
			НовыйЭлемент.Комментарий                                        = Источник.Комментарий;
			
			
			
			// записываем ставку ндс
			НовыйЭлемент.СтавкаНДС                    = ПолучитьСтавкуНДС(БазаИсточник, Источник.СтавкаНДС);
			НовыйЭлемент.НоменклатурнаяГруппа         = ПолучитьНоменклатурнуюГруппу(БазаИсточник, Источник.НоменклатурнаяГруппа);
			//НовыйЭлемент.СтатьяЗатрат                 = ПолучитьСтатьюЗатрат(БазаИсточник, Источник.СтатьяЗатрат);
			НовыйЭлемент.НоменклатураГТД              = ПолучитьНоменклатураГТДРеквизит(БазаИсточник, Источник.НоменклатураГТД);
			
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
		Иначе	
			Возврат РезПоискаРеквизит.Ссылка;	
		КонецЕсли; 
	Иначе
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;
КонецФункции

Функция ПолучитьКонтрагента(БазаИсточник, ИстКонтрагент)
	УИД = БазаИсточник.String(ИстКонтрагент.УникальныйИдентификатор()); 
	РезПоиска = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		КодПоЕДРПОУ = СокрЛП(ИстКонтрагент.КодПоЕДРПОУ);
		Если КодПоЕДРПОУ  = "" Тогда
			РезПоискаРеквизит = Справочники.Контрагенты.НайтиПоНаименованию(ИстКонтрагент.Наименование, Истина);
		Иначе	
			РезПоискаРеквизит = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ",КодПоЕДРПОУ);
		КонецЕсли; 
		
		Если РезПоискаРеквизит.Пустая() Тогда
			Возврат КонвСпрКонтрагенты(БазаИсточник, ИстКонтрагент, РезПоиска);
		Иначе	
			Возврат РезПоискаРеквизит.Ссылка;	
		КонецЕсли; 
	Иначе
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьДанныеСУТП(Команда)
	ЗагрузитьДанныеСУТПНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьДанныеСУТПНаСервере()
	
	БазаИсточник = ПодлючитьсяКУТПНаСервере();
	
	СоответствиеДанныхВКеше = Новый Соответствие;
	СоответствиеДанныхВКеше.Вставить("Организации", Новый Соответствие());
	
	Если Объект.ЗаказПокупателя Тогда
		КонвДокЗаказПокупателя(БазаИсточник, СоответствиеДанныхВКеше);
	КонецЕсли; 
	
	Если Объект.ПоступлениеТоваровУслуг Тогда
		КонвДокПоступлениеТоваровУслуг(БазаИсточник, СоответствиеДанныхВКеше);
	КонецЕсли; 
	
	Если Объект.ПлатежноеПоручениеВходящее Тогда
		КонвДокПлатежноеПоручениеВходящее(БазаИсточник, СоответствиеДанныхВКеше);
	КонецЕсли; 
	
	Если Объект.ПлатежноеПоручениеИсходящее Тогда
		КонвДокПлатежноеПоручениеИсходящее(БазаИсточник, СоответствиеДанныхВКеше);
	КонецЕсли; 
	
	БазаИсточник = Неопределено;
	
КонецПроцедуры


&НаСервере
Функция ПодлючитьсяКУТПНаСервере()
	
	Попытка
		_Сообщения.Очистить();
		
		
		СтрокаПодключения = "Srvr=""app1"";Ref=""garazh-1c"";Usr=""ole_user"";Pwd=""26021986"";";
		ОбъектПодключения = новый COMОбъект("V83.COMConnector",Неопределено);
		БазаИсточник = ОбъектПодключения.Connect(СтрокаПодключения);
	
		//_Сообщения.ДобавитьСтроку("Соединение успешно установлено!");
	Исключение
		БазаИсточник = Неопределено;
		_Сообщения.ДобавитьСтроку("Ошибка при соединении с базой (на сервере)" + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		//_Сообщения.ДобавитьСтроку("Затрачено, сек: " + (ТекущаяДата() - пДатаНач));
	КонецПопытки;

	Возврат БазаИсточник;

КонецФункции

Функция КонвСпрКонтрагенты(БазаИсточник, ИстКонтрагент = Неопределено, СсылкаНового)
	Приемник = Справочники.Контрагенты;
	
	Источник = ИстКонтрагент;
	НовыйЭлемент = Приемник.СоздатьЭлемент();
	
	//Отбор = Новый Структура();
	//Если не ИстКонтрагент = Неопределено Тогда
	//	Отбор.Вставить("Код",ИстКонтрагент.Код);
	//КонецЕсли; 
	//
	//Источник = БазаИсточник.Справочники.Контрагенты.ВыбратьИерархически(,,Отбор);
	//
	//Пока Источник.Следующий() Цикл
	//	
	//	КлючПоиска         = СокрЛП(Источник.Код);
	//	КлючПоискаРодителя = СокрЛП(Источник.Родитель.Код);
	//	
	//	РезПоиска = Приемник.НайтиПоКоду(СокрЛП(КлючПоиска));
	//	Если РезПоиска.Пустая() Тогда
	//		Если Источник.IsFolder Тогда
	//			НовыйЭлемент = Приемник.СоздатьГруппу();
	//		Иначе
	//			НовыйЭлемент = Приемник.СоздатьЭлемент();
	//		КонецЕсли;
	//	Иначе
	//		НовыйЭлемент = РезПоиска.Ссылка.ПолучитьОбъект(); 
	//	КонецЕсли;
	//	
	//	Если Источник.Родитель.Пустая() Тогда 
	//		Родитель = Справочники.Контрагенты.ПустаяСсылка(); 
	//	Иначе 
	//		Родитель = Приемник.НайтиПоКоду(КлючПоискаРодителя); 
	//	КонецЕсли;
	//	
	//	Если Источник.IsFolder Тогда
	//		НовыйЭлемент.ПометкаУдаления         = Источник.ПометкаУдаления;
	//		НовыйЭлемент.Родитель                = Родитель;
	//		НовыйЭлемент.Код                     = СокрЛП(КлючПоиска);
	//		НовыйЭлемент.Наименование            = СокрЛП(Источник.Наименование);
	//		НовыйЭлемент.Записать();
	//	Иначе
	
	
			НовыйЭлемент.УстановитьСсылкуНового(СсылкаНового);
			//НовыйЭлемент.ПометкаУдаления         = Источник.ПометкаУдаления;
			//НовыйЭлемент.Родитель                = Родитель;
			НовыйЭлемент.Код                     = СокрЛП(Источник.Код);
			НовыйЭлемент.Наименование            = СокрЛП(Источник.Наименование);
			
			НовыйЭлемент.ЮрФизЛицо                      = ПолучитьЮрФизЛицо(БазаИсточник, Источник.ЮрФизЛицо);
			НовыйЭлемент.НаименованиеПолное             = СокрЛП(Источник.НаименованиеПолное); 
			НовыйЭлемент.ИНН                            = СокрЛП(Источник.ИНН);
			НовыйЭлемент.Комментарий                    = СокрЛП(Источник.Комментарий);
			НовыйЭлемент.ДокументУдостоверяющийЛичность = СокрЛП(Источник.ДокументУдостоверяющийЛичность);
			НовыйЭлемент.КодПоЕДРПОУ                    = СокрЛП(Источник.КодПоЕДРПОУ);
			НовыйЭлемент.НомерСвидетельства             = СокрЛП(Источник.НомерСвидетельства);
			НовыйЭлемент.НеЯвляетсяРезидентом           = Источник.НеЯвляетсяРезидентом;
			
			НовыйЭлемент.Покупатель           = Источник.Покупатель;
			НовыйЭлемент.Поставщик           = Источник.Поставщик;
			НовыйЭлемент.ГоловнойКонтрагент           = НовыйЭлемент.Ссылка;
			
			//Чтобы не было лишних проверок
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			//-
			НовыйЭлемент.Записать();
			
			Возврат НовыйЭлемент.Ссылка; 
			
	//	КонецЕсли;
	//	_Сообщения.ДобавитьСтроку(" Справочник.Контрагенты - " + НовыйЭлемент.Наименование);
	//КонецЦикла;
КонецФункции // КонвСпрКонтрагенты()

Процедура КонвДокЗаказПокупателя(БазаИсточник, СоответствиеДанныхВКеше)
	
	//ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ПродажаКомиссия;
	
	СтатусСоздан = Справочники.Статусы.Создан;
	
	ИсЗапрос = БазаИсточник.NewObject("Запрос");
	ИсЗапрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Ссылка,
		|	Док.ВерсияДанных,
		|	Док.ПометкаУдаления,
		|	Док.Номер,
		|	Док.Дата КАК Дата,
		|	Док.Проведен,
		|	Док.АдресДоставки,
		|	Док.СтруктурнаяЕдиница,
		|	Док.ВалютаДокумента,
		|	Док.ДоговорКонтрагента,
		|	Док.Комментарий,
		|	Док.Контрагент,
		|	Док.КратностьВзаиморасчетов,
		|	Док.КурсВзаиморасчетов,
		|	Док.Организация,
		|	Док.Ответственный,
		|	Док.СуммаВключаетНДС,
		|	Док.СуммаДокумента,
		|	Док.ТипЦен,
		|	Док.УчитыватьНДС,
		|	Док.АвторасчетНДС,
		|	Док.Представление,
		|	Док.Товары.(
		|		Ссылка,
		|		НомерСтроки,
		|		Номенклатура,
		|		ЕдиницаИзмеренияМест,
		|		Цена,
		|		Сумма,
		|		СтавкаНДС,
		|		СуммаНДС,
		|		ХарактеристикаНоменклатуры,
		|		Коэффициент,
		|		Количество,
		|		ПроцентСкидкиНаценки,
		|		КоличествоМест,
		|		ПлановаяСебестоимость,
		|		ЕдиницаИзмерения,
		|		ПроцентАвтоматическихСкидок,
		|		УсловиеАвтоматическойСкидки,
		|		ЗначениеУсловияАвтоматическойСкидки,
		|		КлючСтроки
		|	),
		|	Док.ВозвратнаяТара.(
		|		Ссылка,
		|		НомерСтроки,
		|		Номенклатура,
		|		Количество,
		|		Цена,
		|		Сумма
		|	),
		|	Док.Услуги.(
		|		Ссылка,
		|		НомерСтроки,
		|		Содержание,
		|		Количество,
		|		Цена,
		|		Сумма,
		|		СтавкаНДС,
		|		СуммаНДС,
		|		Номенклатура,
		|		ПроцентСкидкиНаценки,
		|		ПроцентАвтоматическихСкидок,
		|		УсловиеАвтоматическойСкидки,
		|		ЗначениеУсловияАвтоматическойСкидки
		|	),
		|	Док.ДатаОплаты,
		|	Док.ДатаОтгрузки,
		|	Док.СкладГруппа
		|ИЗ
		|	Документ.ЗаказПокупателя КАК Док
		|ГДЕ
		|	Док.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Док.Организация В(&ОрганизацииДляОбмена)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";

	
	ОрганизацииДляОбмена = БазаИсточник.NewObject("Массив");
	
	Для каждого Организация из СпОрганизаций Цикл
		ОрганизацииДляОбмена.Добавить(БазаИсточник.Справочники.Организации.НайтиПоНаименованию(Организация.Значение.Наименование, Истина));
		//_Сообщения.ДобавитьСтроку("Организация базы -  " + Организация.Значение.Наименование);
	КонецЦикла;
	
	ИсЗапрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	ИсЗапрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	ИсЗапрос.УстановитьПараметр("ОрганизацииДляОбмена", ОрганизацииДляОбмена);
	
	Результат = ИсЗапрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		
		УИД = БазаИсточник.String(Выборка.Ссылка.УникальныйИдентификатор()); //Выборка.Ссылка.УникальныйИдентификатор();
		
		РезПоиска = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
		Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
			Документ = Документы.ЗаказПокупателя.СоздатьДокумент();
			Документ.УстановитьСсылкуНового(РезПоиска);
		Иначе
			Если Не ОбновлятьСуществующиеДокументы Тогда
				Продолжить;
			КонецЕсли; 
			Документ = РезПоиска.Получитьобъект();	
			Документ.Товары.Очистить();
			Документ.Услуги.Очистить();
			Документ.ВозвратнаяТара.Очистить();
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Документ.Статус) Тогда
		    Документ.Статус = СтатусСоздан;
		КонецЕсли; 
		
		Документ.Номер                   = Выборка.Номер;
		Документ.Дата                    = Выборка.Дата;
		//Документ.ВидОперации = ВидОперации;//в ут нет ПолучитьВидыОперацийЗаказПокупателя(БазаИсточник, Выборка.ВидОперации);
		
		
		Документ.ДатаОплаты              = Выборка.ДатаОплаты;
		Документ.ДатаОтгрузки            = Выборка.ДатаОтгрузки;
		
		Документ.Организация             = ПолучитьОрганизацию(Выборка.Организация, СоответствиеДанныхВКеше);
		Документ.Контрагент              = ПолучитьКонтрагента(БазаИсточник, Выборка.Контрагент);
		
		Документ.ДоговорКонтрагента      = ПолучитьДоговорКонтрагента(БазаИсточник, СоответствиеДанныхВКеше, Документ.Контрагент, Выборка.ДоговорКонтрагента);

		Документ.Ответственный           = ПолучитьПользователя(БазаИсточник, Выборка.Ответственный);			
		//Документ.СтруктурнаяЕдиница      = ПолучитьСтруктурнуюЕдиницу(Выборка.СтруктурнаяЕдиница);
		//Если НЕ ЗначениеЗаполнено(Документ.СтруктурнаяЕдиница) Тогда
		//	Документ.СтруктурнаяЕдиница  = Документ.Организация.ОсновнойБанковскийСчет;
		//КонецЕсли;	
		Документ.ВалютаДокумента         = ПолучитьВалюту(Выборка.ВалютаДокумента);
		Документ.КратностьВзаиморасчетов = Выборка.КратностьВзаиморасчетов;
		Документ.КурсВзаиморасчетов      = Выборка.КурсВзаиморасчетов;
		Документ.АдресДоставки           = Выборка.АдресДоставки;
		Документ.Комментарий             = Выборка.Комментарий;
		Документ.СкладГруппа             = ПолучитьСклад(Выборка.СкладГруппа);
		Документ.СуммаВключаетНДС        = Выборка.СуммаВключаетНДС;
		Документ.СуммаДокумента          = Выборка.СуммаДокумента;
		Документ.ТипЦен                  = ПолучитьТипЦен(БазаИсточник, Выборка.ТипЦен);
		Документ.УчитыватьНДС            = Выборка.УчитыватьНДС;
		Документ.АвторасчетНДС           = Выборка.АвторасчетНДС;
		
		Для Каждого ИсТовар Из Выборка.Товары.Unload() Цикл
			СтрокаТовары = Документ.Товары.Добавить();
			СтрокаТовары.Номенклатура     = ПолучитьНоменклатуру(БазаИсточник, ИсТовар.Номенклатура);
			СтрокаТовары.ЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(БазаИсточник, СтрокаТовары.Номенклатура.Ссылка, ИсТовар.ЕдиницаИзмерения);
			СтрокаТовары.Коэффициент      = ИсТовар.Коэффициент;
			СтрокаТовары.Количество       = ИсТовар.Количество;
			СтрокаТовары.Цена             = ИсТовар.Цена;
			СтрокаТовары.СтавкаНДС        = ПолучитьСтавкуНДС(БазаИсточник, ИсТовар.СтавкаНДС);
			СтрокаТовары.СуммаНДС         = ИсТовар.СуммаНДС;
			СтрокаТовары.Сумма            = ИсТовар.Сумма;
		КонецЦикла;
		
		Для Каждого ИсУслуга Из Выборка.Услуги.Unload() Цикл
			СтрокаТовары = Документ.Услуги.Добавить();
			СтрокаТовары.Номенклатура     = ПолучитьНоменклатуру(БазаИсточник, ИсУслуга.Номенклатура);
			СтрокаТовары.Содержание       = ИсУслуга.Содержание;
			СтрокаТовары.Количество       = ИсУслуга.Количество;
			СтрокаТовары.Цена             = ИсУслуга.Цена;
			СтрокаТовары.СтавкаНДС        = ПолучитьСтавкуНДС(БазаИсточник, ИсУслуга.СтавкаНДС);
			СтрокаТовары.СуммаНДС         = ИсУслуга.СуммаНДС;
			СтрокаТовары.Сумма            = ИсУслуга.Сумма;
		КонецЦикла;
		
		Для Каждого ИсТара Из Выборка.ВозвратнаяТара.Unload() Цикл
			СтрокаТовары = Документ.ВозвратнаяТара.Добавить();
			СтрокаТовары.Номенклатура     = ПолучитьНоменклатуру(БазаИсточник, ИсТара.Номенклатура);
			СтрокаТовары.Количество       = ИсТара.Количество;
			СтрокаТовары.Цена             = ИсТара.Цена;
			СтрокаТовары.Сумма            = ИсТара.Сумма;
		КонецЦикла;
		
		Документ.ПометкаУдаления       = Выборка.ПометкаУдаления;
		//Документ.Проведен              = Выборка.Проведен;
		Документ.обменДанными.Загрузка = Истина;
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Запись);
			Если Выборка.Проведен Тогда
				Документ.обменДанными.Загрузка = Ложь;
				Документ.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли; 
		Исключение
			//Документ.ПолучитьФорму().Открыть();
		КонецПопытки;
		_Сообщения.ДобавитьСтроку("Обработали: " + Документ);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция  НайтиФункцияКонтрагентовВИсточнике(БазаИсточник)
	Объект.КонтрагентыИсточник.Очистить();
	
	УИД = Объект.Контрагент.УникальныйИдентификатор(); 
	УИДТам = БазаИсточник.NewObject("УникальныйИдентификатор",Строка(УИД));
	
	РезПоиска = БазаИсточник.Справочники.Контрагенты.GetRef(УИДТам);
	Если Найти(Строка(РезПоиска),"<") <> 0 Тогда
		КодПоЕДРПОУ = СокрЛП(Объект.Контрагент.КодПоЕДРПОУ);
		Если КодПоЕДРПОУ  = "" Тогда
			РезПоискаРеквизит = БазаИсточник.Справочники.Контрагенты.НайтиПоНаименованию(Объект.Контрагент.Наименование, Истина);
		Иначе	
			РезПоискаРеквизит = БазаИсточник.Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ",КодПоЕДРПОУ);
		КонецЕсли; 
		
		Если РезПоискаРеквизит.Пустая() Тогда
			Возврат Справочники.Контрагенты.ПустаяСсылка();
		Иначе	
			Возврат РезПоискаРеквизит.Ссылка;	
		КонецЕсли; 
	Иначе
		Возврат РезПоиска.Ссылка;	
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура НайтиКонтрагентовВИсточнике()
	Объект.КонтрагентыИсточник.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		БазаИсточник = ПодлючитьсяКУТПНаСервере();
		
		КонтрагентИсточник = НайтиФункцияКонтрагентовВИсточнике(БазаИсточник);

		Если Не КонтрагентИсточник.Description = "" Тогда
			НС = Объект.КонтрагентыИсточник.Добавить();
			Нс.Наименование = КонтрагентИсточник.Наименование;
			Нс.Код = КонтрагентИсточник.Код;
			Нс.УИД = БазаИсточник.String(КонтрагентИсточник.УникальныйИдентификатор());
		КонецЕсли; 
	
		
	
	КонецЕсли; 
КонецПроцедуры


&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	НайтиКонтрагентовВИсточнике();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОчистка(Элемент, СтандартнаяОбработка)
	Объект.КонтрагентыИсточник.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура НайтиКонтрагентовВИсточникеКлиент(Команда)
	НайтиКонтрагентовВИсточнике();
КонецПроцедуры
