
Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БП_ГруппыКонтрагентов.Ссылка,
	|	БП_ГруппыКонтрагентов.ОсновнойКонтрагент
	|ИЗ
	|	Справочник.БП_ГруппыКонтрагентов КАК БП_ГруппыКонтрагентов
	|ГДЕ
	|	БП_ГруппыКонтрагентов.ОсновнойКонтрагент = &ОсновнойКонтрагент
	|	И НЕ БП_ГруппыКонтрагентов.ПометкаУдаления
	|	И БП_ГруппыКонтрагентов.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ОсновнойКонтрагент", ОсновнойКонтрагент);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если Запрос.Выполнить().Выгрузить().Количество() тогда
		Сообщить("Запис не унікальний! В даному довіднику уже є не помічений на видалення запис з таким основним контрагентом!");	
		Отказ = Истина;	
	КонецЕсли; 
	
	ПереченьКонтрагентовТекст = "";
	
	Для каждого Стр из Контрагенты цикл
		ПереченьКонтрагентовТекст = ?(ПереченьКонтрагентовТекст = "", ПереченьКонтрагентовТекст, ПереченьКонтрагентовТекст + "; ") + Строка(Стр.Контрагент);	
	КонецЦикла;

КонецПроцедуры
