
Процедура ЗаполнитьUrlСайта() Экспорт 
	//https://www.garazh.ua/media/prices/hotline.xml.
	Соединение=Новый HTTPСоединение("www.garazh.ua",,,,,,Новый ЗащищенноеСоединениеOpenSSL(неопределено,неопределено));
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
	
	Попытка
		HTTPОтвет = Соединение.Получить("media/prices/hotline.xml", ВременныйФайл);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;   	
	
	Чтение=Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ВременныйФайл);   
	Фабрика=Новый ФабрикаXDTO;
	ОбXDTO=Фабрика.ПрочитатьXML(Чтение);
	Для Каждого Item  из ОбXDTO.Items.Item Цикл  		
		//сайта хотлайн шукає id_1c&gt; Г0000453850 &lt;/id_1c&gt; та
		//присвоює додатковий номер для цієї номенклатури id&gt;380034&lt;/id&gt; та добавляє «Url»
		//	посилання на ГАРАЖ.
		 id_1c = СокрЛП(Item.id_1c);
		 id_ = СокрЛП(Item.id);
		 url_ = СокрЛП(Item.url);
		 НужноЗаписывать = Ложь;
		 Номенклатура_1с = Справочники.Номенклатура.НайтиПоКоду(id_1c);
		 Если ЗначениеЗаполнено(id_) или ЗначениеЗаполнено(url_) Тогда 
			 Если не Номенклатура_1с = Справочники.Номенклатура.ПустаяСсылка() Тогда 
				 Если Номенклатура_1с.id <> id_ или  
					 Номенклатура_1с.url <> url_ Тогда 
					 НужноЗаписывать = Истина;
				 КонецЕсли;
				 Если НужноЗаписывать Тогда 
					 Номенклатура_1с_Об = Номенклатура_1с.ПолучитьОбъект();
					 Номенклатура_1с_Об.id = id_;
					 Номенклатура_1с_Об.Url = url_;
					 Номенклатура_1с_Об.ДатаОбновлениеГараж_сд = ТекущаяДата();
				 
					 Попытка
						 Номенклатура_1с_Об.ОбменДанными.Загрузка = Истина;
						 Номенклатура_1с_Об.Записать();
					 Исключение
						 #Если Клиент Тогда
							 Сообщить("С.Д. не удалось заполнить id и url! Номенклатура - " + Строка(Номенклатура_1с) +". " + ОписаниеОшибки());
						 #КонецЕсли

					 КонецПопытки;	 
				 КонецЕсли;
			 КонецЕсли;	 
		 КонецЕсли;
	КонецЦикла;	
	#Если Клиент Тогда
		Предупреждение("С.Д. Выполнено id и url!");
	#КонецЕсли
КонецПроцедуры	

Процедура ЗагрузитьИзХотлайна() Экспорт 
	
	//https://hotline.ua/cabinet/4000/analytics/load-report/2166/?hash=dc03edc8b98970f9b32a87d7e93158c0
	//Соединение=Новый HTTPСоединение("www.hotline.ua",,,,,,Новый ЗащищенноеСоединениеOpenSSL(неопределено,неопределено));
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
	
	//Попытка
	//	HTTPОтвет = Соединение.Получить("cabinet/4000/analytics/load-report/2166/?hash=dc03edc8b98970f9b32a87d7e93158c0", ВременныйФайл);
	//Исключение
	//	Сообщить(ОписаниеОшибки());
	//	Возврат;
	//КонецПопытки; 
	
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1"); //WinHttpRequest
	//СтрАдрес = "https://hotline.ua/cabinet/4000/analytics/load-report/2166/?hash=dc03edc8b98970f9b32a87d7e93158c0";   
	Если не ЗначениеЗаполнено(СтрАдрес) тогда
		СтрАдрес = "https://hotline.ua/cabinet/4000/analytics/load-report/2166/?hash=dc03edc8b98970f9b32a87d7e93158c0";
		
	КонецЕсли;
	
	
	WinHttp.Open("GET", СтрАдрес, Ложь);
	WinHttp.Send();
	Если WinHttp.Status = 200 Тогда
		Stream = Новый COMОбъект("ADODB.Stream");
		
		Stream.Type = 1;
		Stream.Mode = 3;
		
		Stream.Open();
		Stream.Write(WinHttp.ResponseBody); 
		Stream.SaveToFile(ВременныйФайл, 2);
		Stream.Close();
		Stream = Неопределено;
		
		//КопироватьФайл(Сайт_,ВременныйФайл);
		
		
		Чтение=Новый ЧтениеXML;
		Чтение.ОткрытьФайл(ВременныйФайл);   
		Фабрика=Новый ФабрикаXDTO;
		ОбXDTO=Фабрика.ПрочитатьXML(Чтение);
		Для Каждого Item  из ОбXDTO.Items.Item Цикл  
			Списком_ = Ложь;
			Если ТипЗнч(Item.ids.id) = тип("СписокXDTO") Тогда 
				Списком_ = Истина;
			КонецЕсли;
			Если Списком_ Тогда 
				для Каждого СтрСп из Item.ids.id Цикл 
					id_ = СокрЛП(СтрСп);
					ОбработатьНоменклатуру(id_, Item);
				КонецЦикла;
			Иначе	
				id_ = СокрЛП(Item.ids.id);
				ОбработатьНоменклатуру(id_, Item);
			КонецЕсли;
		КонецЦикла;	
	#Если Клиент Тогда
		Предупреждение("С.Д. Загрузка из Хотлайна");
	#КонецЕсли
	КонецЕсли;
КонецПроцедуры	

Процедура ОбработатьНоменклатуру(id_, Item)
	
	//avg_price - Середня ціна Хотлайн
	//min_price – Мінімальна ціна Хотлайн
	//max_price – Максимална ціна Хотлайн
	//count_stores – к-сть магазинів
	//min_price_compared - мінімальна ціна Хотлайн (конкуренти)
	//avg_price_compared - Середня ціна Хотлайн (конкуренти)
	//max_price_compared – Максимальна ціна Хотлайн (конкуренти)
	//Додаткові поля для картки товара:
	//	url_path – силка на товар на хотлайні. (кнопку перейти та посилання виводити на головне
	//	вікно підбору.)
	//	url - силка на сайт (кнопку перейти та посилання виводити на головне вікно підбору.)
	//	count_stores – к-сть магазинів (виводити на головне вікно підбору.)
	//	card_popularity – популярність на хотлайні (виводити на головне вікно підбору.)	
	
	Номенклатура_ = Справочники.Номенклатура.НайтиПоРеквизиту("id", id_);
	Если не Номенклатура_ = Справочники.Номенклатура.ПустаяСсылка() Тогда 
		avg_price_ 			= Item.avg_price;
		avg_price_compared_ = Item.avg_price_compared;
		min_price_          = Item.min_price;
		max_price_          = Item.max_price;
		count_stores_       = Item.count_stores;
		min_price_compared_ = Item.min_price_compared;
		max_price_compared_ = Item.max_price_compared;
		url_path_		    = Item.url_path;
		card_popularity_    = Item.card_popularity;
		count_stores_       = Item.count_stores;
		Если не Номенклатура_.avg_price = avg_price_ или
			не Номенклатура_.avg_price_compared = avg_price_compared_ или
			не Номенклатура_.min_price = min_price_ или
			не Номенклатура_.max_price = max_price_ или
			не Номенклатура_.count_stores = count_stores_ или
			не Номенклатура_.min_price_compared = min_price_compared_ или
			не Номенклатура_.max_price_compared = max_price_compared_ или
			не Номенклатура_.card_popularity = card_popularity_ или
			не Номенклатура_.url_path = url_path_ Тогда 
			
			Номенклатура_Об = Номенклатура_.ПолучитьОбъект();
			Номенклатура_Об.avg_price = avg_price_;
			Номенклатура_Об.avg_price_compared = avg_price_compared_;
			Номенклатура_Об.min_price = min_price_;
			Номенклатура_Об.max_price = max_price_;
			Номенклатура_Об.count_stores = count_stores_;
			Номенклатура_Об.min_price_compared = min_price_compared_;
			Номенклатура_Об.max_price_compared = max_price_compared_;
			Номенклатура_Об.card_popularity = card_popularity_;
			Номенклатура_Об.url_path = url_path_; 
			Номенклатура_Об.ДатаОбновлениеХотлайн_сд = ТекущаяДата();
			Попытка
				Номенклатура_Об.ОбменДанными.Загрузка = Истина;
				Номенклатура_Об.Записать();
			Исключение
				#Если Клиент Тогда
					Сообщить("С.Д. не удалось Загрузить Из Хотлайна! Номенклатура - " + Строка(Номенклатура_) +". " + ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 	