
Функция КонтрольКлиента(КодПоЕДРПОУ,Контр) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка <> &Контрагент
	|	Контрагенты.КодПоЕДРПОУ = &Код";
	Запрос.УстановитьПараметр("Код",КодПоЕДРПОУ);
	Запрос.УстановитьПараметр("Контрагент",Контр.Ссылка);
	Если Контр.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		Возврат Ложь;
	КонецЕсли;
	Попытка
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Предупреждение("Данный код ЕДПРОУ уже определен");
			Возврат ИСтина;
		КонецЦикла;
		Возврат Ложь;
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции

Функция ДвижениеНаличности(НачОСт=0,СлВнес=0,СлВил=0,Одерж=0,Видано=0,КонОст=0) Экспорт
	Стр = M301.GetCashInfo();	
	Если Стр="" Тогда
		Возврат 0;
	КонецЕсли;
	НачОст = Число(Сред(Стр,1,11))/100;
	СлВнес = Число(Сред(Стр,12,11))/100;
	СлВил = Число(Сред(Стр,23,11))/100;
	Одерж = Число(Сред(Стр,34,11))/100;
	Видано = Число(Сред(Стр,45,11))/100;
	КонОст = Число(Сред(Стр,56,11))/100;		 
	Возврат 1;
КонецФункции

процедура ПодклККР()экспорт  
	
	Перем Инф; 
	
	Попытка
		M301 = Новый COMОбъект("M304Manager.Application");
		Пользователь=глЗначениеПеременной("глТекущийПользователь");
		Пароль="1111111111";
		Если M301.Init(глЗначениеПеременной("глТекущийПользователь").Касса.Порт, СокрЛП(глЗначениеПеременной("глТекущийПользователь").Касса.Кассир), СокрЛП(Пароль), 0, "ГАРАЖ ЮА")>0 Then 
			ККРВключен=1; 
			Инф=СокрЛП(M301.GetPrinterConfig()); 
		Else
			ККРВключен=0; 
		EndIf;	
	Исключение 
		ККРВключен=0;
	КонецПопытки; 
	
	КассаП = глЗначениеПеременной("глТекущийПользователь").Касса;
	Если ЗначениеЗаполнено(КассаП) Тогда
		Если Не КассаП.МаксАртикул = 9999 Тогда
			КассаП = глЗначениеПеременной("глТекущийПользователь").Касса.ПолучитьОбъект();
			КассаП.МаксАртикул = 9999;
			КассаП.Записать();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьАртикул()
	Попытка
		Возврат  глЗначениеПеременной("глТекущийПользователь").Касса.ТекАртикул;
	Исключение
		Возврат 1;
	КонецПопытки;
КонецФункции

Функция МаксАртикул()
	Попытка
		Возврат  глЗначениеПеременной("глТекущийПользователь").Касса.МаксАртикул;
	Исключение
		Возврат 1;
	КонецПопытки;
КонецФункции

Процедура УстановитьАртикул()
	КассаП = глЗначениеПеременной("глТекущийПользователь").Касса.ПолучитьОбъект();
	КассаП.ТекАртикул = КассаП.ТекАртикул + 1;
	КассаП.Записать();
КонецПроцедуры

Процедура ОтклККР()  // Закрытие модуля 
	Попытка
		M301 = Новый COMОбъект("M301Manager.Application");
		M301.Done(); 
	Исключение	
	КонецПопытки
КонецПроцедуры 

Функция глм_НапечататьЧек(Докум, ОплатаКартой = Ложь) Экспорт
	
	Перем ТаблДокН, ТаблДокНР;
	Перем Отдел,Name,Qty,Price,Article,DiscountDirection,DiscountName,Discount,Налог,СумСтр; 
	Перем НомВозвЧека, КонОстНал;
	
	СчетчикНовыхСтрок = 0;//обнулим счетчик строк,записанных в базу артикулов
	
	Если ККРВключен <> 1 Тогда 
		Возврат Ложь;
	КонецЕсли; 
	
	Стр = M301.GetCashInfo();
	Ключ = M301.GetPrinterKeyPosition();
	Если Ключ = -1 Тогда
		Предупреждение("Ошибка контроля статуса ключа!!!");
		Возврат Ложь;
	КонецЕсли;
	
	Если Ключ <> 1 Тогда
	//	Предупреждение("Переведите ключ в положение ""РАБОТА"" (Р)!");
		//Возврат Ложь;
	КонецЕсли;
	
	M301.AbortCheck();
	Отдел = "1";
	Сум2 = 0; 
	ВидЧека = "Чек продажи"; 
	//КонецЕсли;	
	А = M301.OpenCheck(Отдел); 
	M301.FreeTextLine(1, 0,  0, "Кат. ціни: " + Докум.ТипЦен);			
	Если А <> 0 Тогда  
		ТаблДокН = Новый ТаблицаЗначений;
		ТаблДокН.Колонки.Добавить("НомерСтроки");
		ТаблДокН.Колонки.Добавить("Товар");
		ТаблДокН.Колонки.Добавить("ЦенаРеалФактСНДСВД");
		ТаблДокН.Колонки.Добавить("СуммаСк");
		ТаблДокН.Колонки.Добавить("Сумма");
		ТаблДокН.Колонки.Добавить("НДС");
		ТаблДокН.Колонки.Добавить("Кво");
		ТаблДокН.Колонки.Добавить("Д");
		
		Т = Докум.Товары.Выгрузить();
		Для Каждого Строка из Т Цикл
			Если Окр(Строка.Количество,0) <> Строка.Количество Тогда
				Строка.Количество = 1;
				Строка.Цена = Строка.Сумма;
				Строка.ПроцентСкидкиНаценки = 0;
			КонецЕсли;
		КонецЦикла;
		Для Каждого Строка из Т  Цикл
			Стр = ТаблДокН.Добавить();
			Стр.НомерСтроки = Строка.НомерСтроки;
			Стр.Товар = СокрЛП(Лев(Строка.Номенклатура.Наименование,40));
			Стр.ЦенаРеалФактСНДСВД = Окр(Строка.Цена,2);
			Стр.СуммаСк = Окр(Строка.ПроцентСкидкиНаценки*Строка.Цена*Строка.Количество/100,2);
			Стр.Сумма = Окр(Стр.ЦенаРеалФактСНДСВД * Строка.Количество,2);
			Если Окр(Строка.Количество,0) = Строка.Количество Тогда
				Стр.Д = 0;
				Стр.Кво = Строка.Количество;
			Иначе
				Стр.Кво = Строка.Количество*1000;
				Стр.Д = 1;
			КонецЕсли;
		КонецЦикла; 
		
		Для Каждого Строка из Докум.Услуги Цикл
			Стр = ТаблДокН.Добавить();
			Стр.НомерСтроки = Строка.НомерСтроки;
			Стр.Товар = СокрЛП(Лев(Строка.Содержание,40));
			Стр.ЦенаРеалФактСНДСВД = Окр(Строка.Цена,2);
			Стр.СуммаСк = Окр(Строка.ПроцентСкидкиНаценки*Строка.Цена*Строка.Количество/100,2);
			Стр.Сумма = Окр(Стр.ЦенаРеалФактСНДСВД * Строка.Количество,2);
			Если Окр(Строка.Количество,0) = Строка.Количество Тогда
				Стр.Д = 0;
				Стр.Кво = Строка.Количество;
			Иначе
				//fofa
				Стр.Кво = Строка.Количество*1000;
				//замена
				//Стр.Кво = Строка.Количество;
				//_fofa
				Стр.Д = 1;
			КонецЕсли;
		КонецЦикла; 
		
		Разница = (ТаблДокН.Итог("Сумма")-ТаблДокН.Итог("СуммаСк"))-Докум.СуммаДокумента;
		Стр.СуммаСк = Стр.СуммаСк + Разница;
		Если ТаблДокН.Количество() > 0 Тогда
			Если ТаблДокН.Количество() > 0 Тогда
				Для Каждого СтрокаТ из ТаблДокН Цикл
					Name = СокрЛП(СтрокаТ.Товар);
					Price = Окр(СтрокаТ.ЦенаРеалФактСНДСВД*100,0);
					НомерСтроки = СтрокаТ.НомерСтроки;
					Делимость = СтрокаТ.Д; 
					Qty = Окр(СтрокаТ.Кво,3);  //в штуках
					Article = ПолучитьАртикул();
					УстановитьАртикул();
					Если ПолучитьАртикул() > МаксАртикул() Тогда
						Предупреждение("Закончились свободные артикулы в ЭККР!"+" Продажи заблокированы!!!"+" Необходимо снять технологический Z-отчет!!!");
						Сигнал(); Сигнал(); Сигнал(); Сигнал(); Сигнал(); Сигнал(); Сигнал();
						M301.AbortCheck();
						Возврат Ложь;
					КонецЕсли;
					
					Если ПолучитьАртикул() = МаксАртикул()-50 Тогда
						Предупреждение("Осталось 50 свободных артикулов в ЭККР!"+" Необходимо снять технологический Z-отчет!");
					КонецЕсли;
					Если ПолучитьАртикул() = МаксАртикул()-30 Тогда
						Предупреждение("Осталось 30 свободных артикулов в ЭККР!"+" Необходимо снять технологический Z-отчет!");
					КонецЕсли;
					Если ПолучитьАртикул() = МаксАртикул()-10 Тогда
						Предупреждение("Осталось 10 свободных артикулов в ЭККР!"+" Необходимо снять технологический Z-отчет!");
					КонецЕсли;
					Если ПолучитьАртикул() = МаксАртикул()-5 Тогда
						Предупреждение("Осталось 5 свободных артикулов в ЭККР!"+" Срочно необходимо снять технологический Z-отчет!!!!!!");
					КонецЕсли;
					Если СтрокаТ.СуммаСк <> 0 Тогда
						Если СтрокаТ.СуммаСк < 0 Тогда
							DiscountDirection = 1;
							СтрокаТ.СуммаСк = -1*СтрокаТ.СуммаСк;
						Иначе
							DiscountDirection = 0;
						КонецЕслИ;
						DiscountName = СокрЛП("");
						Discount = Окр(СтрокаТ.СуммаСк*100,0); 
					Иначе
						DiscountDirection = -1;
						DiscountName = СокрЛП("");
						Discount = 0; 
					КонецЕсли;
					Price = Окр(СтрокаТ.ЦенаРеалФактСНДСВД*100,0);
					Налог = 0; 
					Налог = 1; //с.д. рижий 2023-12-29
					
					
					//сообщить("товар="+Name+" кво="+Qty+" цена="+Price+" дел="+Делимость+" НомНалога="+
					//Налог+" код артикула="+Article+" Признакскидки="+DiscountDirection+" имя ски="+DiscountName+" сум сидки="+Discount);  
					СумСтр = M301.FiscalLineEx(Name,Qty,Price,Делимость,Налог,0,Article,DiscountDirection,DiscountName,Discount);
					
					Если СумСтр = -1 Тогда  
						M301.AbortCheck();
						Предупреждение("Ошибка при печати строки "+НомерСтроки+", "+СокрЛП(Name)+"!"+" Отказ от чека!");
						Возврат Ложь;
					КонецЕсли;
					Сум2 = Сум2 + СумСтр;   
					СумСтр = 0;
				КонецЦикла;
			КонецЕсли;
			Если ОплатаКартой Тогда 
				Сум1 = M301.CloseCheckEx(0, Сум2, 0, 0);			
			Иначе 
				Сум1 = M301.CloseCheck();
			КонецЕсли;
			Если Сум1 = Сум2 Тогда
				Т = M301.GetCheckResult();
				Ном = 0;
				Для н = 1 По СтрДлина(Т) Цикл
					Если Сред(Т,н,1) = ";" Тогда
						Ном = Число(Лев(Т,н-1));
						Прервать;
					КонецЕсли;
				КонецЦикла;
				//M301.PutToDisplay(СокрЛП(Формат(Сум1/100, "Ч12.2")));
				//M301.OpenCashBox();
			Иначе
				M301.AbortCheck();
				Предупреждение("Ошибка закрытия чека!");
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе //ошибка открытия чека
		M301.AbortCheck();
		Предупреждение("Ошибка открытия чека!");
		Возврат Ложь; 
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции  


Функция глм_НапечататьЧекХранение(Докум, ОплатаКартой = Ложь) Экспорт
	
	Перем ТаблДокН, ТаблДокНР;
	Перем Отдел,Name,Qty,Price,Article,DiscountDirection,DiscountName,Discount,Налог,СумСтр; 
	Перем НомВозвЧека, КонОстНал;
	
	СчетчикНовыхСтрок = 0;//обнулим счетчик строк,записанных в базу артикулов
	
	Если ККРВключен <> 1 Тогда 
		Возврат Ложь;
	КонецЕсли; 
	
	Стр = M301.GetCashInfo();
	Ключ = M301.GetPrinterKeyPosition();
	Если Ключ = -1 Тогда
		Предупреждение("Ошибка контроля статуса ключа!!!");
		Возврат Ложь;
	КонецЕсли;
	
	Если Ключ <> 1 Тогда
	//	Предупреждение("Переведите ключ в положение ""РАБОТА"" (Р)!");
		//Возврат Ложь;
	КонецЕсли;
	
	M301.AbortCheck();
	Отдел = "1";
	Сум2 = 0; 
	ВидЧека = "Чек продажи"; 
	//КонецЕсли;	
	А = M301.OpenCheck(Отдел); 
	//M301.FreeTextLine(1, 0,  0, "Кат. ціни: " + Докум.ТипЦен);			
	Если А <> 0 Тогда  
		ТаблДокН = Новый ТаблицаЗначений;
		ТаблДокН.Колонки.Добавить("НомерСтроки");
		ТаблДокН.Колонки.Добавить("Товар");
		ТаблДокН.Колонки.Добавить("ЦенаРеалФактСНДСВД");
		ТаблДокН.Колонки.Добавить("СуммаСк");
		ТаблДокН.Колонки.Добавить("Сумма");
		ТаблДокН.Колонки.Добавить("НДС");
		ТаблДокН.Колонки.Добавить("Кво");
		ТаблДокН.Колонки.Добавить("Д");
		
		
//		Для Каждого Строка из Докум.Услуги Цикл
			Стр = ТаблДокН.Добавить();
			Стр.НомерСтроки = 1;
			Стр.Товар = СокрЛП("Зберігання шин");
			Стр.ЦенаРеалФактСНДСВД = Докум.СуммаХранения;
			Стр.СуммаСк = 0;
			Стр.Сумма = Докум.СуммаХранения;
				Стр.Д = 0;
				Стр.Кво = 1;
//		КонецЦикла; 
		
		Разница = 0;
		Стр.СуммаСк = Стр.СуммаСк + Разница;
		Если ТаблДокН.Количество() > 0 Тогда
			Если ТаблДокН.Количество() > 0 Тогда
				Для Каждого СтрокаТ из ТаблДокН Цикл
					Name = СокрЛП(СтрокаТ.Товар);
					Price = Окр(СтрокаТ.ЦенаРеалФактСНДСВД*100,0);
					НомерСтроки = СтрокаТ.НомерСтроки;
					Делимость = СтрокаТ.Д; 
					Qty = Окр(СтрокаТ.Кво,3);  //в штуках
					Article = ПолучитьАртикул();
					УстановитьАртикул();
					Если ПолучитьАртикул() > МаксАртикул() Тогда
						Предупреждение("Закончились свободные артикулы в ЭККР!"+" Продажи заблокированы!!!"+" Необходимо снять технологический Z-отчет!!!");
						Сигнал(); Сигнал(); Сигнал(); Сигнал(); Сигнал(); Сигнал(); Сигнал();
						M301.AbortCheck();
						Возврат Ложь;
					КонецЕсли;
					
					Если ПолучитьАртикул() = МаксАртикул()-50 Тогда
						Предупреждение("Осталось 50 свободных артикулов в ЭККР!"+" Необходимо снять технологический Z-отчет!");
					КонецЕсли;
					Если ПолучитьАртикул() = МаксАртикул()-30 Тогда
						Предупреждение("Осталось 30 свободных артикулов в ЭККР!"+" Необходимо снять технологический Z-отчет!");
					КонецЕсли;
					Если ПолучитьАртикул() = МаксАртикул()-10 Тогда
						Предупреждение("Осталось 10 свободных артикулов в ЭККР!"+" Необходимо снять технологический Z-отчет!");
					КонецЕсли;
					Если ПолучитьАртикул() = МаксАртикул()-5 Тогда
						Предупреждение("Осталось 5 свободных артикулов в ЭККР!"+" Срочно необходимо снять технологический Z-отчет!!!!!!");
					КонецЕсли;
					Если СтрокаТ.СуммаСк <> 0 Тогда
						Если СтрокаТ.СуммаСк < 0 Тогда
							DiscountDirection = 1;
							СтрокаТ.СуммаСк = -1*СтрокаТ.СуммаСк;
						Иначе
							DiscountDirection = 0;
						КонецЕслИ;
						DiscountName = СокрЛП("");
						Discount = Окр(СтрокаТ.СуммаСк*100,0); 
					Иначе
						DiscountDirection = -1;
						DiscountName = СокрЛП("");
						Discount = 0; 
					КонецЕсли;
					Price = Окр(СтрокаТ.ЦенаРеалФактСНДСВД*100,0);
					Налог = 0;     
					Налог = 1; //с.д. рижий 2023-12-29

					//сообщить("товар="+Name+" кво="+Qty+" цена="+Price+" дел="+Делимость+" НомНалога="+
					//Налог+" код артикула="+Article+" Признакскидки="+DiscountDirection+" имя ски="+DiscountName+" сум сидки="+Discount);  
					СумСтр = M301.FiscalLineEx(Name,Qty,Price,Делимость,Налог,0,Article,DiscountDirection,DiscountName,Discount);
					
					Если СумСтр = -1 Тогда  
						M301.AbortCheck();
						Предупреждение("Ошибка при печати строки "+НомерСтроки+", "+СокрЛП(Name)+"!"+" Отказ от чека!");
						Возврат Ложь;
					КонецЕсли;
					Сум2 = Сум2 + СумСтр;   
					СумСтр = 0;
				КонецЦикла;
			КонецЕсли;
			Если ОплатаКартой Тогда 
				Сум1 = M301.CloseCheckEx(0, Сум2, 0, 0);			
			Иначе 
				Сум1 = M301.CloseCheck();
			КонецЕсли;
			Если Сум1 = Сум2 Тогда
				Т = M301.GetCheckResult();
				Ном = 0;
				Для н = 1 По СтрДлина(Т) Цикл
					Если Сред(Т,н,1) = ";" Тогда
						Ном = Число(Лев(Т,н-1));
						Прервать;
					КонецЕсли;
				КонецЦикла;
				//M301.PutToDisplay(СокрЛП(Формат(Сум1/100, "Ч12.2")));
				//M301.OpenCashBox();
			Иначе
				M301.AbortCheck();
				Предупреждение("Ошибка закрытия чека!");
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе //ошибка открытия чека
		M301.AbortCheck();
		Предупреждение("Ошибка открытия чека!");
		Возврат Ложь; 
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции  


Функция глм_НапечататьЧекП(Докум, ОплатаКартой = Ложь) Экспорт
	
	Перем ТаблДокН, ТаблДокНР;
	Перем Отдел,Name,Qty,Price,Article,DiscountDirection,DiscountName,Discount,Налог,СумСтр; 
	Перем НомВозвЧека, КонОстНал;
	
	СчетчикНовыхСтрок=0;//обнулим счетчик строк,записанных в базу артикулов
	If ККРВключен<>1 Тогда 
		Возврат Ложь;
	КонецЕсли; 
	Стр = M301.GetCashInfo();
	Ключ = M301.GetPrinterKeyPosition();
	Если Ключ = -1 Тогда
		Предупреждение("Ошибка контроля статуса ключа!!!");
		Возврат Ложь;
	КонецЕсли;
	Если Ключ <> 1 Тогда
		Предупреждение("Переведите ключ в положение ""РАБОТА"" (Р)!");
	//	Возврат Ложь;
	КонецЕсли;
	M301.AbortCheck();
	Отдел="1";
	Сум2=0; 
	ВидЧека="Чек продажи"; 
	А=M301.OpenCheck(Отдел); 
	//M301.FreeTextLine(1, 0,  0, "Кат. ціни: "+Докум.ТипЦен);			
	Если А<>0 Тогда  
		ТаблДокН= Новый ТаблицаЗначений;
		ТаблДокН.Колонки.Добавить("НомерСтроки");
		ТаблДокН.Колонки.Добавить("Товар");
		ТаблДокН.Колонки.Добавить("ЦенаРеалФактСНДСВД");
		ТаблДокН.Колонки.Добавить("СуммаСк");
		ТаблДокН.Колонки.Добавить("Сумма");
		ТаблДокН.Колонки.Добавить("НДС");
		ТаблДокН.Колонки.Добавить("Кво");
		ТаблДокН.Колонки.Добавить("Д");
		Стр=ТаблДокН.Добавить();
		Стр.НомерСтроки=1;
		Стр.Товар="Предоплата за товар";
		Стр.ЦенаРеалФактСНДСВД=Докум.СуммаДокумента;
		Стр.СуммаСк = 0;
		Стр.Сумма = Докум.СуммаДокумента;
		Стр.Д = 0;
		Стр.Кво=1;
		Если ТаблДокН.Количество() > 0 Тогда
			Если ТаблДокН.Количество() > 0 Тогда
				Для Каждого СтрокаТ из ТаблДокН Цикл
					Name = СокрЛП(СтрокаТ.Товар);
					Price=Окр(СтрокаТ.ЦенаРеалФактСНДСВД*100,0);
					НомерСтроки =  СтрокаТ.НомерСтроки;
					Делимость=СтрокаТ.Д; 
					Qty=Окр(СтрокаТ.Кво,3);  //в штуках
					Article = ПолучитьАртикул();
					УстановитьАртикул();
					Если ПолучитьАртикул() > МаксАртикул() Тогда
						Предупреждение("Закончились свободные артикулы в ЭККР!"+" Продажи заблокированы!!!"+" Необходимо снять технологический Z-отчет!!!");
						Сигнал(); Сигнал(); Сигнал(); Сигнал(); Сигнал(); Сигнал(); Сигнал();
						M301.AbortCheck();
						Возврат Ложь;
					КонецЕсли;
					
					Если ПолучитьАртикул() = МаксАртикул()-50 Тогда
						Предупреждение("Осталось 50 свободных артикулов в ЭККР!"+" Необходимо снять технологический Z-отчет!");
					КонецЕсли;
					Если ПолучитьАртикул() = МаксАртикул()-30 Тогда
						Предупреждение("Осталось 30 свободных артикулов в ЭККР!"+" Необходимо снять технологический Z-отчет!");
					КонецЕсли;
					Если ПолучитьАртикул() = МаксАртикул()-10 Тогда
						Предупреждение("Осталось 10 свободных артикулов в ЭККР!"+" Необходимо снять технологический Z-отчет!");
					КонецЕсли;
					Если ПолучитьАртикул() = МаксАртикул()-5 Тогда
						Предупреждение("Осталось 5 свободных артикулов в ЭККР!"+" Срочно необходимо снять технологический Z-отчет!!!!!!");
					КонецЕсли;
					Если СтрокаТ.СуммаСк <> 0 Тогда
						DiscountDirection=0;
						DiscountName=СокрЛП("");
						Discount=Окр(СтрокаТ.СуммаСк*100,0); 
					Иначе
						DiscountDirection=-1;
						DiscountName=СокрЛП("");
						Discount=0; 
					КонецЕсли;
					Price = Окр(СтрокаТ.ЦенаРеалФактСНДСВД*100,0);
					Налог = 0;  
						Налог = 1; //с.д. рижий 2023-12-29

					//					сообщить("товар="+Name+" кво="+Qty+" цена="+Price+" дел="+Делимость+" НомНалога="+
					//					Налог+" код артикула="+Article+" Признакскидки="+DiscountDirection+" имя ски="+DiscountName+" сум сидки="+Discount);  
					СумСтр=M301.FiscalLineEx(Name,Qty,Price,Делимость,Налог,0,Article,DiscountDirection,DiscountName,Discount);
					
					If	СумСтр = -1 Тогда  
						M301.AbortCheck();
						Предупреждение("Ошибка при печати строки "+НомерСтроки+",  "+СокрЛП(Name)+"!"+" Отказ от чека!");
						Возврат Ложь;
					КонецЕсли;
					Сум2 = Сум2 + СумСтр;   
					СумСтр = 0;
				КонецЦикла;
			КонецЕсли;
			Если ОплатаКартой Тогда 
				Сум1 = M301.CloseCheckEx(0, Сум2, 0, 0);			
			Иначе 
				Сум1 = M301.CloseCheck();
			КонецЕсли;
			Если Сум1 = Сум2 Тогда
				Т = M301.GetCheckResult();
				Ном = 0;
				Для н = 1 По СтрДлина(Т) Цикл
					Если Сред(Т,н,1)=";" Тогда
						Ном = Число(Лев(Т,н-1));
						Прервать;
					КонецЕсли;
				КонецЦикла;
				M301.PutToDisplay(СокрЛП(Формат(Сум1/100, "Ч12.2")));
				//M301.OpenCashBox();
			Иначе
				M301.AbortCheck();
				Предупреждение("Ошибка закрытия чека!");
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе //ошибка открытия чека
		M301.AbortCheck();
		Предупреждение("Ошибка открытия чека!");
		Возврат Ложь; 
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции  

Функция глм_НапечататьЧекВозврат(Конт, ОплатаКартой = Ложь) Экспорт     
	
	Перем Отдел,Name,Qty,Price,Article,DiscountDirection,DiscountName,Discount,Налог,СумСтр; 
	Перем НомВозвЧека, КонОстНал;
	
	СчетчикНовыхСтрок=0;//обнулим счетчик строк,записанных в базу артикулов
	If ККРВключен<>1 Тогда 
		Возврат Ложь;
	КонецЕсли; 
	Стр = M301.GetCashInfo();
	Ключ = M301.GetPrinterKeyPosition();
	Если Ключ = -1 Тогда
		Предупреждение("Ошибка контроля статуса ключа!!!");
		Возврат Ложь;
	КонецЕсли;
	Если Ключ <> 1 Тогда
		Предупреждение("Переведите ключ в положение ""РАБОТА"" (Р)!");
		//Возврат Ложь;
	КонецЕсли;
	M301.AbortCheck();
	Отдел="1";
	Сум2=0; 
	//А=M301.OpenCheck(Отдел); 
	Если ВвестиЧисло(НомВозвЧека,"№ чека, по которому произв. возврат",12,0) <> Истина Тогда
		Возврат Ложь;
	КонецЕсли;	
	Если M301.SetReturnCheckNumber(НомВозвЧека)=0 Тогда
		Предупреждение("Неудачная попытка установить номер чека, по которому производится возврат!");
		Возврат Ложь;
	КонецЕсли;
	А = M301.OpenReturnCheck(Отдел);
	Если А<>0 Тогда  
		Делимость=0; 
		Name = "Повернення товару";
		Price=Окр(Конт.СуммаДокумента*100,0);
		Qty=1;  //в штуках
					Article = ПолучитьАртикул();
					УстановитьАртикул();
					
		Если ПолучитьАртикул() > МаксАртикул() Тогда
			Предупреждение("Закончились свободные артикулы в ЭККР! Продажи заблокированы!!! Необходимо снять технологический Z-отчет!!!");
			Сигнал(); Сигнал(); Сигнал(); Сигнал(); Сигнал(); Сигнал(); Сигнал();
			M301.AbortCheck();
			Возврат Ложь;
		КонецЕсли;
		
		Если ПолучитьАртикул() = МаксАртикул()-50 Тогда
			Предупреждение("Осталось 50 свободных артикулов в ЭККР! Необходимо снять технологический Z-отчет!");
		КонецЕсли;
		Если ПолучитьАртикул() = МаксАртикул()-30 Тогда
			Предупреждение("Осталось 30 свободных артикулов в ЭККР! Необходимо снять технологический Z-отчет!");
		КонецЕсли;
		Если ПолучитьАртикул() = МаксАртикул()-10 Тогда
			Предупреждение("Осталось 10 свободных артикулов в ЭККР! Необходимо снять технологический Z-отчет!");
		КонецЕсли;
		Если ПолучитьАртикул() = МаксАртикул()-5 Тогда
			Предупреждение("Осталось 5 свободных артикулов в ЭККР!. Срочно необходимо снять технологический Z-отчет!!!!!!");
		КонецЕсли;
		DiscountDirection=-1;
		DiscountName=СокрЛП("");
		Discount=0; 
		Налог = 0;  
			Налог = 1; //с.д. рижий 2023-12-29

		//сообщить("товар="+Name+" кво="+Qty+" цена="+Price+" НомНалога="+ Налог+" код артикула="+Article);  
		СумСтр=M301.FiscalLineEx(Name,Qty,Price,Делимость,Налог,0,Article,DiscountDirection,DiscountName,Discount);
		If	СумСтр=-1 Тогда  
			M301.AbortCheck();
			Предупреждение("Ошибка при печати доплаты "+"!"+"Отказ от чека!");
			Возврат Ложь;
		КонецЕсли;
		Сум2 = Сум2 + СумСтр;   
		СумСтр = 0;
		Сум2 = -Сум2; 
		Если ОплатаКартой Тогда 
			Сум1 = M301.CloseCheckEx(0, -Сум2, 0, 0);			
		Иначе 
			Сум1 = M301.CloseCheck();
		КонецЕсли;
		
		//с.д. рижий 2023-12-29 (
		//Если Сум1=Сум2 Тогда  
		Если абс(Сум1)=абс(Сум2) Тогда
	    //с.д. рижий 2023-12-29 )
		
			Т = M301.GetCheckResult();
			Ном = 0;
			Для н = 1 По СтрДлина(Т) Цикл
				Если Сред(Т,н,1)=";" Тогда
					Ном = Число(Лев(Т,н-1));
					Прервать;
				КонецЕсли;
			КонецЦикла;
			M301.PutToDisplay(СокрЛП(Формат(Сум1/100, "Ч12.2")));
			//M301.OpenCashBox();
		Иначе
			M301.AbortCheck();
			
			//с.д. рижий 2023-12-29 (
			//Предупреждение("Ошибка закрытия чека!");    
			Предупреждение("Ошибка закрытия чека! Сум1=" + СокрЛП(Сум1) + " Сум2=" + СокрЛП(Сум2));    
			ЗаписьЖурналаРегистрации("глм_НапечататьЧекВозврат",УровеньЖурналаРегистрации.Ошибка,,,"Ошибка закрытия чека! Сум1=" + СокрЛП(Сум1) + " Сум2=" + СокрЛП(Сум2));
			//с.д. рижий 2023-12-29 )
	
		КонецЕсли;
	Иначе //ошибка открытия чека
		M301.AbortCheck();
		Предупреждение("Ошибка открытия чека!");
		Возврат Ложь; 
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции  

//с.д. рижий 2023-12-29 (
ФУнкция абс(_зн)

	Если _зн <0  тогда
		Возврат _зн * (-1);
	КонецЕсли;	
	
	возврат _зн
Конецфункции	
//с.д. рижий 2023-12-29 )