#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит таблицу значений - состав показателей отчета
Перем мТаблицаСоставПоказателей Экспорт;

// Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт;

// Хранит структуру многостраничных разделов
Перем мСтруктураМногостраничныхРазделов Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов
Перем мЕстьВыбранные Экспорт;

// Хранит имя выбранной формы отчета
Перем мВыбраннаяФорма Экспорт;

// Хранит признак скопированной формы.
Перем мСкопированаФорма Экспорт;

// Хранит ссылку на документ РегламентированныйОтчет,
// хранящий данные отчета
Перем мСохраненныйДок Экспорт;

// Следующие переменные хранят границы
// периода построения отчета
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;

Перем мТаблицаФормОтчета Экспорт;

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;
Перем мЗаписьЗапрещена                Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

//

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока15  = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(15, ДопустимаяДлина.Переменная));

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока254 = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(254, ДопустимаяДлина.Переменная));

МассивБулево = Новый Массив;
МассивБулево.Добавить(Тип("Булево"));
ОписаниеТиповБулево    = Новый ОписаниеТипов(МассивБулево);

// Таблица значений хранит состав показателей отчета.
// В колонках таблицы хранятся следующие данные:
//    - имя поля табличного документа;
//    - код показатели по составу показателей;
//    - код показателя по форме (имя области табличного документа);
//    - признак многострочности;
//    - тип данных показателя.
//
мТаблицаСоставПоказателей         = Новый ТаблицаЗначений;
мТаблицаСоставПоказателей.Колонки.Добавить("ИмяПоляТаблДокумента",    ОписаниеТиповСтрока254);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСоставу",  ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоФорме",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ПризнМногострочности",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ТипДанныхПоказателя",     ОписаниеТиповСтрока15);

мСтруктураВариантыЗаполнения      = Новый Структура;

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(254, ДопустимаяДлина.Переменная));

МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Дата"));
ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));

мТаблицаФормОтчета = Новый ТаблицаЗначений;
мТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
мТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, НСтр("ru='Утверждена';uk='Затверджена'"),  20);
мТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   НСтр("ru='Действует с';uk='Діє з'"), 5);
мТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   НСтр("ru='         по';uk='         по'"), 5);

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2009";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом ГНАУ  30.05.97  N 165 (в редакции приказа ГНАУ от 30.06.2005 № 244)';uk='Затверджена наказом ДПАУ  30.05.97  N 165 (у редакції наказу ДПАУ від 30.06.2005 № 244)'");
НоваяФорма.ДатаНачалоДействия = '20050601';
НоваяФорма.ДатаКонецДействия  = '20110109';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2011";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом ГНАУ  21.12.10  N 969';uk='Затверджена наказом ДПАУ  21.12.10  N 969'");
НоваяФорма.ДатаНачалоДействия = '20110110';
НоваяФорма.ДатаКонецДействия  = '20111231';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2012";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 01.11.11  N 1379'; uk = 'Затверджена наказом Мінфіну від 01.11.11  N 1379'");
НоваяФорма.ДатаНачалоДействия = глЗначениеПеременной("ДатаВступленияВСилуПриказа1379");
НоваяФорма.ДатаКонецДействия  = '20140301';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2014";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Миндоходов от 14.01.2014 г.  № 10'; uk = 'Затверджена наказом Міндоходів України від 14.01.2014 р. № 10'");
НоваяФорма.ДатаНачалоДействия = '20140301';
НоваяФорма.ДатаКонецДействия  = '20141130';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2014Мес12";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина Украины от 22.09.2014 г.  № 957'; uk = 'Затверджена наказом Мінфіну України від 22.09.2014 р. № 957'");
НоваяФорма.ДатаНачалоДействия = '2014-12-01';
НоваяФорма.ДатаКонецДействия  = '2014-12-31';
	
НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2015";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина Украины от 22.09.2014 г.  № 957 (в редакции приказа Минфина Украины от 14.11.2014 № 1129) '; uk = 'Затверджена наказом Мінфіну України від 22.09.2014 р. № 957 (у редакції наказу Мінфіну України від 14.11.2014 № 1129)'");
НоваяФорма.ДатаНачалоДействия = '2015-01-01';
НоваяФорма.ДатаКонецДействия  = '2016-03-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2016";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина Украины от 31.12.2015 г.  № 1307'; uk = 'Затверджена наказом Мінфіну України від 31.12.2015 р. № 1307'");
НоваяФорма.ДатаНачалоДействия = '2016-04-01';
НоваяФорма.ДатаКонецДействия  = '2017-03-15';
	
НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2017";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утвеждена приказом Минфина Украины от 31.12.2015 г.  № 1307 (в редакции Приказа № 276 от 23.02.2017)'; uk = 'Затверджена наказом Мінфіну України від 31.12.2015 р. № 1307 (в редакції Наказу № 276 от 23.02.2017)'");
НоваяФорма.ДатаНачалоДействия = '2017-03-16';
НоваяФорма.ДатаКонецДействия  = '2018-11-30';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2018";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утвеждена приказом Минфина Украины от 31.12.2015 г.  № 1307 (в редакции Приказа № 763 от 17.09.2018)'; uk = 'Затверджена наказом Мінфіну України від 31.12.2015 р. № 1307 ((у редакції Наказу № 763 від 17.09.2018)'");
НоваяФорма.ДатаНачалоДействия = '2018-12-01';
НоваяФорма.ДатаКонецДействия  = Неопределено;
	
#КонецЕсли
