////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	//Э_Гашук(14.05.2015 www.nct.ua 
	//ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	//Э_Гашук) 
	//Э_Нарадько(2014.11.11	
	////Э_Нарадько(2014.10.31
	//Если Объект.Закрыт Тогда
	//	Удалить_Э_ЗаполнитьПартнера();
	//КонецЕсли;	
	////Э_Нарадько)
	//Э_Нарадько)
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Если ЗначениеЗаполнено(Объект.ИННПлательщикаНДС) Тогда
	//	ВыборкаКонтрагент = ПартнерыИКонтрагенты.ИННУжеИспользуетсяВИнформационнойБазе(Объект.ИННПлательщикаНДС,Объект.Ссылка);
	//	Если ВыборкаКонтрагент <> Неопределено Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Данные ИНН уже указаны для контрагента с кодом %1, ответственный - %2.'"),ВыборкаКонтрагент.Код,ВыборкаКонтрагент.ОсновнойМенеджер),
	//		,"Объект.ИННПлательщикаНДС",,);
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеДоступностью();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УправлениеДоступностью();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЦЫ ФОРМЫ КОНТАКТНАЯ ИНФОРМАЦИЯ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УправлениеДоступностью()
	
	//ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ФизЛицо","Доступность",(Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") ИЛИ Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель")));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	//Э_Гашук(14.05.2015 www.nct.ua 
	//УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	//Э_Гашук)
КонецПроцедуры

//&НаСервере
//Процедура Удалить_Э_ЗаполнитьПартнера()
//	//Э_Нарадько(2014.10.31
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Лид", Объект.Ссылка);
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	Партнеры.Ссылка
//	|ИЗ
//	|	Справочник.Контрагенты КАК Партнеры
//	|ГДЕ
//	|	Партнеры.Э_Лид = &Лид";
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Если Выборка.Следующий() Тогда
//		Партнер = Выборка.Ссылка;
//	КонецЕсли;
//	
//	//Э_Нарадько)
//КонецПроцедуры


&НаКлиенте
Процедура НомерТелефонаПриИзменении(Элемент)
	Объект.НомерТелефона = Э_ТелефонияBinotel.Э_ПреобразоватьНомерТелефонаБезРазделителей(Объект.НомерТелефона);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЭ_СоздатьПартнера(Команда)
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		Отказ=Ложь;
		ТекстОшибки = НСтр("ru='Контрагент уже создан на основании данного лида';uk='Контрагент вже створений на підставі даного ліда'");   
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки,Отказ);
				
		Если Отказ Тогда
		    Возврат;
		КонецЕсли;	
	КонецЕсли;
	ПараметрФормы = Новый Структура(
		"Основание",
		Новый Структура("Наименование, Адрес, Объект, АдресЭП, АдресДоставки",
		                Объект.КонтактноеЛицо, Объект.НомерТелефона, Объект.Ссылка, Объект.EMAIL, Объект.Адрес)
	);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", ПараметрФормы,);
КонецПроцедуры

&НаСервере
Процедура ПартнерПриИзмененииНаСервере()
	Э_ТекОбъект=РеквизитФормыВЗначение("Объект");
	Э_ТекОбъект.Э_ОпределитьРеквизитЗакрыт();
	ЗначениеВРеквизитФормы(Э_ТекОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
    ПартнерПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыборПартнераНайдено" И Параметр.Свойство("Партнер") Тогда
		
		Объект.Партнер=Параметр.Партнер;
		ПартнерПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница=Элементы.ГруппаСобытия Тогда
	    ЭлементОтбора = Э_СписокСобытийПоЛиду.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Э_Лид");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Ссылка;		
	КонецЕсли;
КонецПроцедуры


