Перем мВалютаРегламентированногоУчета Экспорт;

// используется при заполнении документа из других объектов 
Перем мВидОперацииДляЗаполнения Экспорт;
Перем мЗаполнятьВозвратнуюТару  Экспорт;

Перем мНеОткрыватьФормуДокумента Экспорт;

Перем КонтрагентНеРезидент;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	
Функция ОпределитьКодСтавки(ИмяКолонки)

	Если ИмяКолонки = "0Эксп" Тогда
		Возврат "901";	
	ИначеЕсли ИмяКолонки = "0Укр" Тогда
		Возврат "902";		
	ИначеЕсли ИмяКолонки = "БезНДС" Тогда
		Возврат "903";		
	ИначеЕсли ИмяКолонки = "7" Тогда
		Возврат "7";	
	Иначе
		Возврат "20";	
	КонецЕсли;	

КонецФункции // ОпределитьКодСтавки()

Функция ПечатьДокументаНалоговыйКодекс2018(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета = "НалоговаяНакладнаяАльбом")
	
 	Перем СтруктураШапкиДокумента;
 	Перем ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим;
 	

	КонтрагентНеРезидент = Контрагент.НеЯвляетсяРезидентом;
	
	Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
	
		СтруктураПоказателей = Новый Структура();
		СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
		СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G32");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G33");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G105_2S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G008");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G009");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G010");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G011");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G11_10");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("ROWNUM");

		
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
			
			Сообщить(НСтр("ru='Документ является служебным и не может быть выгружен в XML!';uk='Документ є службовим та не може бути вивантажений в XML!'"));
			
			// такие операции не предусматривают выписки налоговых накладных
			Возврат	СтруктураПоказателей;
		КонецЕсли;
		
		Если ПродажаНижеОбычнойЦены Тогда
			СтруктураПоказателей.Вставить("НалоговыйДокументЗЦ", 	Новый Структура());	// данные табличной части по накладной по "обычным ценам"
			СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R",  Новый ТаблицаЗначений());  // данные табличной части
			СтруктураПоказателей.НалоговыйДокументЗЦ.R = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Дата,
	|	Номер,
	
	|	СпецРежимНалогообложения,
	
	|	ОбособленноеПодразделение.НаименованиеДляНалоговыхДокументов КАК НаименованиеФилиала,
	|	ОбособленноеПодразделение.Префикс КАК Префикс,
	
	|	ТипПричиныНевыдачиПокупателю,
	|	ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены,
	|	ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,

	|	Контрагент,
	|	Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагент.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН КАК ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН,
	|	Контрагент.КодФилиала КАК ФилиалПокупателя,
	
	|	ДоговорКонтрагента.МногостороннееСоглашениеОРазделеПродукции КАК СоглашениеОРазделеПродукции, 
	
	|	Организация,
	
	|	ЛьготаНДС,
	
	|	ВидОперации,
	
	|	Сводная,
	
	|	КодПризнакаСводной,
	
	|	РеквизитыНомерСтрокиННАктуальны,
	
	|	КтоВыписалНалоговуюНакладную 			КАК КтоВыписалНалоговуюНакладную,
	|	КтоВыписалНалоговуюНакладную.КодПоДРФО  КАК ИННКтоВыписалНН
	|ИЗ
	|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
	|
	|ГДЕ
	|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ДополнениеКНаименованиюОрганизации = "";
    СведенияОГоловномКонтрагентеПокупателя = "";
    ДополнениеКНаименованиюОрганизации = "";

	Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
		СведенияОГоловномКонтрагентеПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ГоловнойКонтрагент, Шапка.Дата);	
	КонецЕсли;
	
	// Подготовим таблицы
	Отказ = Ложь;
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати  = "ПАРАМЕТРЫ_ПЕЧАТИ_НалоговаяНакладная_2018" + ИмяМакета;
	
	Макет = ПолучитьМакет("НалоговаяНакладная2018Альбом");	
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Макет.КодЯзыкаМакета = "ru";
	
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим);

	// Загрузим все таблицы (кроме тары) в одну таблицу
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПрочим, ТаблицаНоменклатуры);	
	
	// свернем подобные строки     
	ТаблицаНоменклатурыДляПревышения = ТаблицаНоменклатуры.Скопировать(); // для НомерСтрокиННПревышения
	НаборРекизитовСвертки = "КодВид, КодСХ, Номенклатура, Характеристика, КодУКТВЭД, ЕдиницаИзмерения, ЕдиницаИзмеренияКод, ЦенаБезНДСРегл, СтавкаНДС, КодЛьготы";   	
	ТаблицаНоменклатуры.Свернуть("НомерСтрокиНН, " + НаборРекизитовСвертки,  "Количество, СуммаБезНДСРегл, СуммаНДСРегл, СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл"); 
	ТаблицаНоменклатуры.Сортировать("НомерСтрокиНН");	
	
	// переименуем колонки
	ТаблицаНоменклатуры.Колонки.ЦенаБезНДСРегл.Имя 				 = "ЦенаБезНДС";
	ТаблицаНоменклатуры.Колонки.СуммаБезНДСРегл.Имя 			 = "Сумма";
	ТаблицаНоменклатуры.Колонки.СуммаНДСРегл.Имя				 = "СуммаНДС";
	
	// Для служебныех целей понадобится исходная таблица
	ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
	// определим параметры шапки документа
	//Дата
	ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
	
	// Номер
	ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
	Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
	    ТекНомерОЦ = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены)), 7);
	Иначе	
		ТекНомерОЦ = ТекНомер;
	КонецЕсли;
	
	// филиал/спецрежим
	КодСпецРежима    = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
	Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
		КодСпецРежима = "5";
	КонецЕсли;
	
	
	ФилиалПродавца   = ?(ЗначениеЗаполнено(Шапка.Префикс), Прав("    " + Формат(Число(Шапка.Префикс),"ЧЦ=4; ЧГ=0"), 4), "");  //число  4 символа, без лидирующих нулей
	ФилиалПокупателя = "";
	ФилиалПокупателяКодПоЕДРПОУ = "";
	
	Если ЗначениеЗаполнено(Шапка.ФилиалПокупателя) Тогда
		ПозицияСобачки = Найти(Шапка.ФилиалПокупателя, "@");
		Если ПозицияСобачки > 0 Тогда
			ФилиалПокупателя = Сред(Шапка.ФилиалПокупателя, 1, ПозицияСобачки - 1);
			ФилиалПокупателяКодПоЕДРПОУ = Сред(Шапка.ФилиалПокупателя, ПозицияСобачки + 1);
		Иначе
			ФилиалПокупателя = Шапка.ФилиалПокупателя;
		КонецЕсли;
		ФилиалПокупателя = Прав("    " + СокрЛП(ФилиалПокупателя), 4);
		ФилиалПокупателяКодПоЕДРПОУ = Прав("          " + СокрЛП(ФилиалПокупателяКодПоЕДРПОУ), 10);
	КонецЕсли;
	
	////////////////////////////////////////////
	// Продавец
	
	// ИНН, Номер свидетельства, Наименование, Адрес
	Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		// налоговые реквизиты не указыватюся
		СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		                                                                                  				   
		ИННОрганизации					= "500000000000";
		НазваниеОрганизации				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце, "ПолноеНаименование,",Ложь);
		Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
			НазваниеОрганизации         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь) 		
										  + ", " + НазваниеОрганизации;
		КонецЕсли;
		
		Страна = "";
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Вид"   , Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		Запрос.УстановитьПараметр("Объект", Шапка.Контрагент);
		Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		               |	КонтактнаяИнформация.Поле1,
		               |	КонтактнаяИнформация.Поле10
		               |ИЗ
		               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		               |ГДЕ
		               |	КонтактнаяИнформация.Объект = &Объект
		               |	И КонтактнаяИнформация.Тип = &Тип
		               |	И КонтактнаяИнформация.Вид = &Вид";
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Поле1  = РезультатЗапроса.Выгрузить()[0].Поле1;
			Поле10 = РезультатЗапроса.Выгрузить()[0].Поле10;
			Если  ЗначениеЗаполнено(Поле1) Тогда
				Если Найти("0123456789", Лев(СокрЛ(Поле1), 1)) > 0 Тогда
					// в Поле1 находится индекс
					Страна = Поле10;
				Иначе
					Страна = Поле1;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Поле10) Тогда
				Страна = Поле10;
			КонецЕсли;
			Страна = СокрЛП(Страна);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Страна) Тогда
			Сообщить("" + Шапка.Контрагент + ": " + НСтр("ru='Не указана страна регистрации контрагента-нерезидента (в контактной информации)! Страна регистрации в налоговой накладной заполнена не будет!';uk='Не вказана країна реєстрації контрагента-нерезидента (у контактній інформації)! Країна реєстрації в податковій накладній заповнена не буде!'"));
		Иначе
			НазваниеОрганизации = НазваниеОрганизации + ", " + Страна		
		КонецЕсли;
		// данные по филиалам меняются местами
		ФилиалПокупателя = ФилиалПродавца;
		ФилиалПродавца	 = "";
		ЕДРПОУОрганизации = "";
		
	Иначе	
		
		СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
		НазваниеОрганизации				= ДополнениеКНаименованиюОрганизации 
										+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		ЕДРПОУОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "КодПоЕДРПОУ," ,Ложь);
		Если НЕ ЗначениеЗаполнено(ЕДРПОУОрганизации) Тогда 
			ЕДРПОУОрганизации	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце, "КодПоДРФО," ,Ложь);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			НазваниеОрганизации = НазваниеОрганизации + Шапка.НаименованиеФилиала;	
		КонецЕсли;
		
	КонецЕсли;
	ИННОрганизации = Прав("            " + ИННОрганизации, 12);
	ЕДРПОУОрганизации	= Прав("            " + СокрЛП(ЕДРПОУОрганизации), 10);
	
	////////////////////////////////////////////
	// покупатель
	
	// Название, адрес, номер свидетельства, ИНН
	Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
		ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда	
		
		// в этом случае контрагентом выступает организация
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		НазваниеКонтрагента				= ДополнениеКНаименованиюОрганизации + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
		
		Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			ИННКонтрагента 				  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		Иначе	
			Если Шапка.Сводная = Истина Тогда
			    ИННКонтрагента 	 = "600000000000";
			Иначе	
				ИННКонтрагента 	 = "400000000000";	
			КонецЕсли;
			
			ФилиалПокупателя = "";			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			НазваниеКонтрагента = НазваниеКонтрагента + Шапка.НаименованиеФилиала;	
		КонецЕсли;
		
		ЕДРПОУКонтрагента = "";

	Иначе
		
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		
		НазваниеКонтрагента				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
		Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
			НазваниеКонтрагента         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь)
										  + ", " + НазваниеКонтрагента;
		КонецЕсли;
		ИННКонтрагента 				  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		
		Если  Шапка.ТипПричиныНевыдачиПокупателю = 0  ИЛИ Шапка.ТипПричиныНевыдачиПокупателю = 12 Тогда
			Если ПустаяСтрока(ФилиалПокупателяКодПоЕДРПОУ) Тогда 
				ЕДРПОУКонтрагента	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "КодПоЕДРПОУ," ,Ложь);
				Если НЕ ЗначениеЗаполнено(ЕДРПОУКонтрагента) Тогда
					ЕДРПОУКонтрагента	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "КодПоДРФО," ,Ложь);
				КонецЕсли;
			Иначе
				ЕДРПОУКонтрагента = ФилиалПокупателяКодПоЕДРПОУ;
			КонецЕсли;	
		Иначе
			ЕДРПОУКонтрагента = "";
		КонецЕсли;
		
		Если  Шапка.ТипПричиныНевыдачиПокупателю = 1 Тогда
			
			ИННКонтрагента = "100000000000";
			НазваниеКонтрагента = "Неплатник";
			
		ИначеЕсли  Шапка.ТипПричиныНевыдачиПокупателю = 12 Тогда
			
			ИННКонтрагента = "200000000000";
			
		ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 7 Тогда
			
			// поставка на экспорт
			ИННКонтрагента = "300000000000";
			// вместо адреса - просто страна нерезидента
			Страна = "";
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Вид"   , Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
			Запрос.УстановитьПараметр("Объект", Шапка.Контрагент);
			Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			               |	КонтактнаяИнформация.Поле1,
			               |	КонтактнаяИнформация.Поле10
			               |ИЗ
			               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			               |ГДЕ
			               |	КонтактнаяИнформация.Объект = &Объект
			               |	И КонтактнаяИнформация.Тип = &Тип
			               |	И КонтактнаяИнформация.Вид = &Вид";
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				Поле1  = РезультатЗапроса.Выгрузить()[0].Поле1;
				Поле10 = РезультатЗапроса.Выгрузить()[0].Поле10;
				Если  ЗначениеЗаполнено(Поле1) Тогда
					Если Найти("0123456789", Лев(СокрЛ(Поле1), 1)) > 0 Тогда
						// в Поле1 находится индекс
						Страна = Поле10;
					Иначе
						Страна = Поле1;
					КонецЕсли;
				ИначеЕсли ЗначениеЗаполнено(Поле10) Тогда
					Страна = Поле10;
				КонецЕсли;
				Страна = СокрЛП(Страна);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Страна) Тогда
				Сообщить("" + Шапка.Контрагент + ": " + НСтр("ru='Не указана страна регистрации контрагента-нерезидента (в контактной информации)! Страна регистрации в налоговой накладной заполнена не будет!';uk='Не вказана країна реєстрації контрагента-нерезидента (у контактній інформації)! Країна реєстрації в податковій накладній заповнена не буде!'"));
			Иначе
				НазваниеКонтрагента = НазваниеКонтрагента + ", " + Страна;
			КонецЕсли;
							
		ИначеЕсли НЕ ЗначениеЗаполнено(ИННКонтрагента)
				 ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
			ИННКонтрагента = "100000000000";
			НазваниеКонтрагента = "Неплатник";
			
		КонецЕсли;
		
	КонецЕсли; 
	ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
	ЕДРПОУКонтрагента	= Прав("            " + СокрЛП(ЕДРПОУКонтрагента), 10);
	
	// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
	ПечКтоВыписалНалоговуюНакладную = "";
	ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
	Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
		ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
										 + ". "
										 + ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
										 + ". "
										 + СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
	Иначе
		ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
	КонецЕсли;
	
	Для Страница = 1 По 1 Цикл
		
		ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
		
		КодПризнакаСводнойНаПечать = "";
		Если НЕ (Шапка.КодПризнакаСводной = 0)Тогда 
			КодПризнакаСводнойНаПечать = Строка(Шапка.КодПризнакаСводной);
		ИначеЕсли  (Шапка.Сводная = Истина) Тогда 
			Если ( Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа) Тогда
				  
				  КодПризнакаСводнойНаПечать =  "1";
				  
			ИначеЕсли (Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации
				  ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации) Тогда
				  
				  КодПризнакаСводнойНаПечать =  "4";
				  
		    КонецЕсли;
		КонецЕсли;
		ОбластьМакетаЗаголовок.Параметры.КодПризнакаСводной = КодПризнакаСводнойНаПечать;
		
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации 
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
		
			ОбластьМакетаЗаголовок.Параметры.Освобожденная = "Без ПДВ";
		
		КонецЕсли;
		
		Если  НЕ Шапка.ТипПричиныНевыдачиПокупателю = 0 Тогда
			// накладная остается у поставщика
			ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
			ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
			ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
		
		// Выводим отступ
		ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		//Дата
		Для Инд = 1 По 8 Цикл
			ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
		КонецЦикла; 
		// Номер
		Для Инд = 1 По 7 Цикл                                                                 
			ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
		КонецЦикла; 
		
		// код спец. режима
		ОбластьМакета.Параметры.СпецРежим = КодСпецРежима;
		// наименование продавца
		ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
		// ИНН продавца
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
		КонецЦикла; 
		// филиал
		Для Инд = 1 По 4 Цикл                                                                 
			ОбластьМакета.Параметры["ФилиалПродавца_"+Инд]    = Сред(ФилиалПродавца, Инд, 1);
		КонецЦикла; 
		// ЕДРПОУ продавца
		Для Инд = 1 По 10 Цикл
			ОбластьМакета.Параметры["ЕДРПОУОрганизации_"+Инд] = Сред(ЕДРПОУОрганизации, Инд, 1);
		КонецЦикла; 
		
		// название покупателя
		ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеКонтрагента;
		// ИНН покупателя
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
		КонецЦикла; 
		// Филиал
		Для Инд = 1 По 4 Цикл                                                                 
			ОбластьМакета.Параметры["ФилиалПокупателя_"+Инд]    = Сред(ФилиалПокупателя, Инд, 1);
		КонецЦикла; 
		// ЕДРПОУ покупателя
		Для Инд = 1 По 10 Цикл
			ОбластьМакета.Параметры["ЕДРПОУКонтрагента_"+Инд] = Сред(ЕДРПОУКонтрагента, Инд, 1);
		КонецЦикла; 
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим шапку накладной вместе с итогами
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();
		ВремТаблица.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
		Для каждого СтрокаТаблицы Из ВремТаблица Цикл
			КолонкаДляСуммы = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС));
			Если  Шапка.СоглашениеОРазделеПродукции = Истина Тогда
				// данные не заполняются
			ИначеЕсли КолонкаДляСуммы = "20" Тогда
				
				ОбластьМакета.Параметры.Сумма20   = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				ОбластьМакета.Параметры.ИтогНДС20 = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G7", СтрокаТаблицы.Сумма);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G7", СтрокаТаблицы.СуммаНДС);
				КонецЕсли;
				
			ИначеЕсли КолонкаДляСуммы = "7" Тогда
				
				ОбластьМакета.Параметры.Сумма7   = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				ОбластьМакета.Параметры.ИтогНДС7 = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G109", СтрокаТаблицы.Сумма);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G109", СтрокаТаблицы.СуммаНДС);
				КонецЕсли;
				
			ИначеЕсли КолонкаДляСуммы = "902" Тогда
				
				ОбластьМакета.Параметры.Сумма0Укр = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G8", СтрокаТаблицы.Сумма);
				КонецЕсли;
				
			ИначеЕсли КолонкаДляСуммы = "901" Тогда
				
				ОбластьМакета.Параметры.Сумма0Эксп = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G9", СтрокаТаблицы.Сумма);
				КонецЕсли;
				
			ИначеЕсли КолонкаДляСуммы = "903" Тогда
				
				ОбластьМакета.Параметры.СуммаБезНДС = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G10", СтрокаТаблицы.Сумма);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		ВсегоСумма = 0; ИтогНДС   = 0;
		ВремТаблица.Свернуть("", "Сумма, СуммаНДС");
		Для каждого СтрокаТаблицы из ВремТаблица Цикл
			ВсегоСумма = СтрокаТаблицы.Сумма;
			ИтогНДС    = СтрокаТаблицы.СуммаНДС;
		КонецЦикла;
		
		СуммаВозвратнойТары = 0;
		ТаблицаПоТаре.Свернуть("", "СуммаСНДСРегл");
		Для каждого СтрокаТаблицы из ТаблицаПоТаре Цикл
			//В таблице не более одной строки
			СуммаВозвратнойТары = СтрокаТаблицы.СуммаСНДСРегл;
		КонецЦикла;
		                                                                                     
		ОбластьМакета.Параметры.Всего    = ОбщегоНазначения.ФорматСумм(ИтогНДС + ВсегоСумма);
		ОбластьМакета.Параметры.ИтогНДС  = ОбщегоНазначения.ФорматСумм(ИтогНДС);
		ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары);
		
		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R04G11", ИтогНДС + ВсегоСумма);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G11", ИтогНДС);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G11", СуммаВозвратнойТары);
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// рассчитаем поля для подвала заранее
		ПечЛьготаНДС = "";
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
		    ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
			
			// выводим информацию только если хотя бы для одного товара не заполнен код льготы или указан "временный" код 99999999
			ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();	
			ВремТаблица.Свернуть("КодЛьготы");
			Для каждого СтрокаТаблицы Из ВремТаблица Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.КодЛьготы)
					ИЛИ СтрокаТаблицы.КодЛьготы = "99999999" Тогда
					ПечЛьготаНДС = Шапка.ЛьготаНДС;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ИННКтоВыписалНН = СокрЛП(Шапка.ИННКтоВыписалНН);
		
		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G1", ОбластьМакетаЗаголовок.Параметры.КодПризнакаСводной);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",	ОбластьМакетаЗаголовок.Параметры.Освобожденная);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	КодСпецРежима);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	ФилиалПродавца);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFBUY",	ФилиалПокупателя);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	НазваниеОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	НазваниеКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HBOS",		ПечКтоВыписалНалоговуюНакладную);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBOS",	ИННКтоВыписалНН);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTINSEL",	ЕДРПОУОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTINBUY",	ЕДРПОУКонтрагента);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	ПечЛьготаНДС);	
 			
		КонецЕсли;
		
		ПроверкаНомерСтрокиНН = 0;
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
				Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
			
			Если Шапка.РеквизитыНомерСтрокиННАктуальны Тогда 
				ОбластьМакета.Параметры.НомерСтроки = СтрокаТаблицы.НомерСтрокиНН;
			КонецЕсли;
			
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = НалоговыйУчет.КодЕдиницыИзмеренияДляПечатиНалоговых(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод);
			
			
			ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
			Если СтрокаТаблицы.КодВид = Перечисления.ВидыКодовДляНалоговойНакладной.КодУслуги Тогда
				ОбластьМакета.Параметры.КодДКПП   = ОбластьМакета.Параметры.КодУКТВЭД;	
				ОбластьМакета.Параметры.КодУКТВЭД = "";
			ИначеЕсли СтрокаТаблицы.КодВид = Перечисления.ВидыКодовДляНалоговойНакладной.КодТовараИмпортированного Тогда
				ОбластьМакета.Параметры.Импортированный = "X";
			КонецЕсли;
			Если НЕ КодСпецРежима = "2" Тогда
			    ОбластьМакета.Параметры.КодСХ = "";
			КонецЕсли;
			
			ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
    		                                      + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")");
			
			// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
			ОбластьМакета.Параметры.КодСтавки = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС));
			
			ОбластьМакета.Параметры.Сумма     = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
			РасчСуммаНДС6Зн = Окр(НалоговыйУчет.РассчитатьСуммуНДС(СтрокаТаблицы.Сумма, Истина,Ложь, НалоговыйУчет.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС)), 6);
			ФорматНДС6Зн = ?(Окр(РасчСуммаНДС6Зн,2) = РасчСуммаНДС6Зн, "ЧЦ=15; ЧДЦ=2; ЧН=' '", "ЧЦ=19; ЧДЦ=6; ЧН=' '");
			ОбластьМакета.Параметры.СуммаНДС6зн     = СокрЛ(Формат(РасчСуммаНДС6Зн, ФорматНДС6Зн));
			
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				
				Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КодЛьготы) Тогда
					ОбластьМакета.Параметры.КодЛьготы = "99999999";
				КонецЕсли;
				
			Иначе
				
				ОбластьМакета.Параметры.КодЛьготы = "";	
				
			КонецЕсли;
			
			ДанныеОСумме = СтрокаТаблицы.Сумма;
			
			Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
				
				ОбластьМакета.Параметры.Номенклатура = "розподіл сум податкового кредиту за багатосторонньою угодою про розподіл продукції";
				ОбластьМакета.Параметры.КодУКТВЭД = "";
				ОбластьМакета.Параметры.КодДКПП = "";
				ОбластьМакета.Параметры.Импортированный = "";
				ОбластьМакета.Параметры.КодСХ = "";
				ОбластьМакета.Параметры.ЕдиницаИзмерения = "";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
				ОбластьМакета.Параметры.Количество = "";
				ОбластьМакета.Параметры.ЦенаБезНДС = "";
				ОбластьМакета.Параметры.КодСтавки = "";
				ОбластьМакета.Параметры.КодЛьготы = "";
				ОбластьМакета.Параметры.Сумма = "";
				ОбластьМакета.Параметры.СуммаНДС6зн = "";
				
				ДанныеОСумме = 0;
			ИначеЕсли Шапка.Сводная = Истина И (Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа) Тогда
					
				ОбластьМакета.Параметры.КодУКТВЭД = "";
				ОбластьМакета.Параметры.КодДКПП = "";
				ОбластьМакета.Параметры.Импортированный = "";
				ОбластьМакета.Параметры.КодСХ = "";
				ОбластьМакета.Параметры.Количество = "";
				ОбластьМакета.Параметры.ЦенаБезНДС = "";
				ОбластьМакета.Параметры.КодСтавки = "";
				ОбластьМакета.Параметры.КодЛьготы = "";
				ОбластьМакета.Параметры.ЕдиницаИзмерения = "грн";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				
				СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
				
				СтрокаСтруктуры.G3S 		= ОбластьМакета.Параметры.Номенклатура;
				СтрокаСтруктуры.G4  		= ОбластьМакета.Параметры.КодУКТВЭД;
				СтрокаСтруктуры.G32  		= ОбластьМакета.Параметры.Импортированный;
				СтрокаСтруктуры.G33  		= ОбластьМакета.Параметры.КодДКПП;
				
				СтрокаСтруктуры.G4S     	= ОбластьМакета.Параметры.ЕдиницаИзмерения;
				СтрокаСтруктуры.G105_2S 	= ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
				
				СтрокаСтруктуры.G5 			= ОбластьМакета.Параметры.Количество;
				СтрокаСтруктуры.G6 			= ОбластьМакета.Параметры.ЦенаБезНДС;
				
				СтрокаСтруктуры.G008  		= ОбластьМакета.Параметры.КодСтавки;
				СтрокаСтруктуры.G009  		= ОбластьМакета.Параметры.КодЛьготы;
				СтрокаСтруктуры.G010  		= ДанныеОСумме;
				СтрокаСтруктуры.G011  		= ОбластьМакета.Параметры.КодСХ;
				СтрокаСтруктуры.G11_10  	= ОбластьМакета.Параметры.СуммаНДС6зн;
				СтрокаСтруктуры.ROWNUM		= ОбластьМакета.Параметры.НомерСтроки;
				
			КонецЕсли;
							
		КонецЦикла;
		
		// Выводим подвал накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
		
		// ДРФО того, кто выписал НН
		Для Инд = 1 По 10 Цикл
			ОбластьМакета.Параметры["ИННКтоВыписалНН_"+Инд] = Сред(ИННКтоВыписалНН, Инд, 1);
		КонецЦикла; 
		
		ОбластьМакета.Параметры.ЛьготаНДС = ПечЛьготаНДС;	
		
		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла; 

	Если ПродажаНижеОбычнойЦены 
		ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки
		Тогда
		
		Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
			// все что мы напечатали по обычной НН не имеет смысла для этого вида операции
			// нужна только "вторая НН" как если бы это была не сводная накладная на превыешение базы над ценой продажи
			ТабДокумент.Очистить();	
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				
				Таблица = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
				Таблица.Очистить();
				СтруктураПоказателей.НалоговыйДокумент.Очистить();
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R", Таблица);
				
				СтруктураПоказателйПечатнойФормы = СтруктураПоказателей.НалоговыйДокумент;	
			КонецЕсли;
		Иначе
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				СтруктураПоказателйПечатнойФормы = СтруктураПоказателей.НалоговыйДокументЗЦ;
			КонецЕсли;
		КонецЕсли;
		
		
		ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		
		//удалим лишние колонки
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
		
		// переименуем колонки
		ТаблицаНоменклатуры.Колонки.СуммаБезНДСПревышенияРегл.Имя 	 = "Сумма";
		ТаблицаНоменклатуры.Колонки.СуммаНДСПревышенияРегл.Имя		 = "СуммаНДС";
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	    Для Страница = 1 По 1 Цикл
		
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			КодПризнакаСводнойНаПечать = "";
			Если НЕ (Шапка.КодПризнакаСводной = 0)Тогда 
				КодПризнакаСводнойНаПечать = Строка(Шапка.КодПризнакаСводной);
			ИначеЕсли (Шапка.Сводная = Истина) Тогда 
				Если (Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки) Тогда
					
					КодПризнакаСводнойНаПечать =  "3";
					  
				КонецЕсли;
			КонецЕсли;
			ОбластьМакетаЗаголовок.Параметры.КодПризнакаСводной = КодПризнакаСводнойНаПечать;

			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации 
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
			
				ОбластьМакетаЗаголовок.Параметры.Освобожденная = "Без ПДВ";
			
			КонецЕсли;			
			
			ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
			
			ТипПричиныСтр = Формат(Шапка.ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены, "ЧЦ=2; ЧВН=");
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
				ТипПричиныСтр = Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2; ЧВН=");
			КонецЕсли;
			ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Лев(ТипПричиныСтр, 1);
			ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Прав(ТипПричиныСтр, 1);
			
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);

			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 7 Цикл                                  
				Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
					ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
				Иначе
					ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомерОЦ, Инд, 1);	
				КонецЕсли;
			КонецЦикла; 
		
			// код спец. режима
			ОбластьМакета.Параметры.СпецРежим = КодСпецРежима;
			// наименование продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			// ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			// филиал
			Для Инд = 1 По 4 Цикл                                                                 
				ОбластьМакета.Параметры["ФилиалПродавца_"+Инд]    = Сред(ФилиалПродавца, Инд, 1);
			КонецЦикла; 
			// ЕДРПОУ продавца
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["ЕДРПОУОрганизации_"+Инд] = Сред(ЕДРПОУОрганизации, Инд, 1);
			КонецЦикла;
			
			// название покупателя = продавца
			ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеОрганизации;
			// ИНН покупателя = продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			// Филиал = продавца
			Для Инд = 1 По 4 Цикл                                                                 
				ОбластьМакета.Параметры["ФилиалПокупателя_"+Инд]    = Сред(ФилиалПродавца, Инд, 1);
			КонецЦикла; 
			// ЕДРПОУ покупателя
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["ЕДРПОУКонтрагента_"+Инд] = Сред(ЕДРПОУКонтрагента, Инд, 1);
			КонецЦикла;
			
			ТабДокумент.Вывести(ОбластьМакета);
 
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
				
				СтруктураПоказателйПечатнойФормы.Вставить("R01G1", ОбластьМакетаЗаголовок.Параметры.КодПризнакаСводной);
				
				СтруктураПоказателйПечатнойФормы.Вставить("R03G10S",ОбластьМакетаЗаголовок.Параметры.Освобожденная);
				
				СтруктураПоказателйПечатнойФормы.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
				СтруктураПоказателйПечатнойФормы.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
				
				СтруктураПоказателйПечатнойФормы.Вставить("HFILL",	Шапка.Дата);
				СтруктураПоказателйПечатнойФормы.Вставить("HNUM",	Прав(ТекНомерОЦ,7));
				СтруктураПоказателйПечатнойФормы.Вставить("HNUM1",	КодСпецРежима);
				СтруктураПоказателйПечатнойФормы.Вставить("HNUM2",	ФилиалПродавца);
				СтруктураПоказателйПечатнойФормы.Вставить("HFBUY",	ФилиалПродавца);
				
				СтруктураПоказателйПечатнойФормы.Вставить("HNAMESEL",	ОбластьМакета.Параметры.НазваниеОрганизации);
				СтруктураПоказателйПечатнойФормы.Вставить("HNAMEBUY",	ОбластьМакета.Параметры.НазваниеОрганизации);
				СтруктураПоказателйПечатнойФормы.Вставить("HKSEL",	ИННОрганизации);
				СтруктураПоказателйПечатнойФормы.Вставить("HKBUY",	ИННОрганизации);
				СтруктураПоказателйПечатнойФормы.Вставить("HBOS",	ПечКтоВыписалНалоговуюНакладную);
				СтруктураПоказателйПечатнойФормы.Вставить("HKBOS",	ИННКтоВыписалНН);
				СтруктураПоказателйПечатнойФормы.Вставить("HTINSEL",	ЕДРПОУОрганизации);
				СтруктураПоказателйПечатнойФормы.Вставить("HTINBUY",	ЕДРПОУКонтрагента);

			КонецЕсли;
			
			// Выводим шапку накладной вместе с итогами
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			
			ВремТаблица = ТаблицаНоменклатуры.Скопировать();
			ВремТаблица.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы Из ВремТаблица Цикл
				
				КолонкаДляСуммы = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС));
				
				Если КолонкаДляСуммы = "20" Тогда
					
					ОбластьМакета.Параметры.Сумма20   = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					ОбластьМакета.Параметры.ИтогНДС20 = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателйПечатнойФормы.Вставить("R01G7", СтрокаТаблицы.Сумма);
						СтруктураПоказателйПечатнойФормы.Вставить("R03G7", СтрокаТаблицы.СуммаНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "7" Тогда
					
					ОбластьМакета.Параметры.Сумма7   = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					ОбластьМакета.Параметры.ИтогНДС7 = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателйПечатнойФормы.Вставить("R01G109", СтрокаТаблицы.Сумма);
						СтруктураПоказателйПечатнойФормы.Вставить("R03G109", СтрокаТаблицы.СуммаНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "902" Тогда
					
					ОбластьМакета.Параметры.Сумма0Укр = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателйПечатнойФормы.Вставить("R01G8", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "901" Тогда
					
					ОбластьМакета.Параметры.Сумма0Эксп = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателйПечатнойФормы.Вставить("R01G9", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "903" Тогда
					
					ОбластьМакета.Параметры.СуммаБезНДС = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателйПечатнойФормы.Вставить("R01G10", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ВсегоСумма = 0; ИтогНДС   = 0;
			ВремТаблица.Свернуть("", "Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы из ВремТаблица Цикл
				ВсегоСумма = СтрокаТаблицы.Сумма;
				ИтогНДС    = СтрокаТаблицы.СуммаНДС;
			КонецЦикла;
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ИтогНДС  = ОбщегоНазначения.ФорматСумм(ИтогНДС);
			ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары);
			ОбластьМакета.Параметры.Всего    = ОбщегоНазначения.ФорматСумм(ИтогНДС + ВсегоСумма + СуммаВозвратнойТары);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				СтруктураПоказателйПечатнойФормы.Вставить("R04G11", ИтогНДС + ВсегоСумма + СуммаВозвратнойТары);
				СтруктураПоказателйПечатнойФормы.Вставить("R03G11", ИтогНДС);
				СтруктураПоказателйПечатнойФормы.Вставить("R02G11", СуммаВозвратнойТары);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			
			Если ЗначениеЗаполнено(КодСпецРежима) Тогда
				ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер) + "/" + СокрЛ(КодСпецРежима);
			Иначе
				ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер);	
			КонецЕсли;
			
			ДопТекст = Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены;
			ДопТекст = СтрЗаменить(ДопТекст,
								   "<визначається автоматично>",
								   ПолныйНомерОсновнойНакладной);
								   
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
				ДопТекст = " (перевищення бази оподаткування, визначеної відповідно до статей 188 і 189 Податкового кодексу України, над фактичною ціною постачання)";	
			КонецЕсли;	
			
			ТекущийНомерСтрокиНН = 0;	
				
			// Выведем на печать все строки таблицы в раздел I
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
					Продолжить
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
				    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
					ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
					Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КодЛьготы) Тогда
						ОбластьМакета.Параметры.КодЛьготы = "99999999";
					КонецЕсли;
				Иначе
					ОбластьМакета.Параметры.КодЛьготы = "";	
				КонецЕсли;
				
				Если Шапка.РеквизитыНомерСтрокиННАктуальны Тогда 
					ТекущийНомерСтрокиНН = ТекущийНомерСтрокиНН + 1;			
					ОбластьМакета.Параметры.НомерСтроки = ТекущийНомерСтрокиНН;
				КонецЕсли;
				
				// п 16. 9) не заполняются данные по номенклатуре:
				ОбластьМакета.Параметры.КодУКТВЭД = "";
				ОбластьМакета.Параметры.КодДКПП = "";
				ОбластьМакета.Параметры.Импортированный = "";
				ОбластьМакета.Параметры.КодСХ = "";
				ОбластьМакета.Параметры.ЕдиницаИзмерения = "";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
				
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
   		                                      + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
											  +" "+ ДопТекст;
				
				Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
				    ОбластьМакета.Параметры.Номенклатура = "розподіл сум податкового кредиту за багатосторонньою угодою про розподіл продукції"
														  +" "+ ДопТекст;
				КонецЕсли;
																 
																 
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				ОбластьМакета.Параметры.КодСтавки = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС));
				
				ОбластьМакета.Параметры.Сумма     = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
				
				ОбластьМакета.Параметры["ЦенаБезНДС"] = Окр(?(СтрокаТаблицы.Количество = 0, 0, СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество), 2);
				
				РасчСуммаНДС6Зн = Окр(НалоговыйУчет.РассчитатьСуммуНДС(СтрокаТаблицы.Сумма, Истина,Ложь, НалоговыйУчет.ПолучитьСтавкуНДС(СтрокаТаблицы.СтавкаНДС)), 6);
				ФорматНДС6Зн = ?(Окр(РасчСуммаНДС6Зн,2) = РасчСуммаНДС6Зн, "ЧЦ=15; ЧДЦ=2; ЧН=' '", "ЧЦ=19; ЧДЦ=6; ЧН=' '");
				ОбластьМакета.Параметры.СуммаНДС6зн     = СокрЛ(Формат(РасчСуммаНДС6Зн, ФорматНДС6Зн));
				
				ТабДокумент.Вывести(ОбластьМакета);

				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					
					СтрокаСтруктуры = СтруктураПоказателйПечатнойФормы.R.Добавить();
					
					СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
					СтрокаСтруктуры.G4  = ОбластьМакета.Параметры.КодУКТВЭД;
					СтрокаСтруктуры.G32  = ОбластьМакета.Параметры.Импортированный;
					СтрокаСтруктуры.G33  = ОбластьМакета.Параметры.КодДКПП;
					
					СтрокаСтруктуры.G4S     = ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G105_2S = ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
					
					СтрокаСтруктуры.G5 = ОбластьМакета.Параметры.Количество;
					СтрокаСтруктуры.G6 = ОбластьМакета.Параметры.ЦенаБезНДС;
					
					СтрокаСтруктуры.G008  = ОбластьМакета.Параметры.КодСтавки;
					СтрокаСтруктуры.G010  = СтрокаТаблицы.Сумма;
					
					СтрокаСтруктуры.G011  = ОбластьМакета.Параметры.КодСХ;
					СтрокаСтруктуры.G11_10 	= ОбластьМакета.Параметры.СуммаНДС6зн;
					СтрокаСтруктуры.ROWNUM	= ОбластьМакета.Параметры.НомерСтроки;
					
				КонецЕсли;				
				
			КонецЦикла;
		
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
			
			// ДРФО того, кто выписал НН
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["ИННКтоВыписалНН_"+Инд] = Сред(ИННКтоВыписалНН, Инд, 1);
			КонецЦикла; 
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
			
			ТабДокумент.Вывести(ОбластьМакета);

		КонецЦикла; 
		
	КонецЕсли;	
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
КонецФункции 


Функция ПечатьДокументаНалоговыйКодекс2017(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета = "НалоговаяНакладнаяАльбом")
	
 	Перем СтруктураШапкиДокумента;
 	Перем ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим;
 	

	КонтрагентНеРезидент = Контрагент.НеЯвляетсяРезидентом;
	
	Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
	
		СтруктураПоказателей = Новый Структура();
		СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
		СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G32");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G33");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G105_2S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G008");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G009");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G010");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G011");
		
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
			
			Сообщить(НСтр("ru='Документ является служебным и не может быть выгружен в XML!';uk='Документ є службовим та не може бути вивантажений в XML!'"));
			
			// такие операции не предусматривают выписки налоговых накладных
			Возврат	СтруктураПоказателей;
		КонецЕсли;
		
		Если ПродажаНижеОбычнойЦены Тогда
			СтруктураПоказателей.Вставить("НалоговыйДокументЗЦ", 	Новый Структура());	// данные табличной части по накладной по "обычным ценам"
			СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R",  Новый ТаблицаЗначений());  // данные табличной части
			СтруктураПоказателей.НалоговыйДокументЗЦ.R = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Дата,
	|	Номер,
	
	|	СпецРежимНалогообложения,
	
	|	ОбособленноеПодразделение.НаименованиеДляНалоговыхДокументов КАК НаименованиеФилиала,
	|	ОбособленноеПодразделение.Префикс КАК Префикс,
	
	|	ТипПричиныНевыдачиПокупателю,
	|	ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены,
	|	ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,

	|	Контрагент,
	|	Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагент.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН КАК ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН,
	|	Контрагент.КодФилиала КАК ФилиалПокупателя,
	
	|	ДоговорКонтрагента.МногостороннееСоглашениеОРазделеПродукции КАК СоглашениеОРазделеПродукции, 
	
	|	Организация,
	
	|	ЛьготаНДС,
	
	|	ВидОперации,
	
	|	Сводная,
	
	|	КтоВыписалНалоговуюНакладную 			КАК КтоВыписалНалоговуюНакладную,
	|	КтоВыписалНалоговуюНакладную.КодПоДРФО  КАК ИННКтоВыписалНН
	|ИЗ
	|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
	|
	|ГДЕ
	|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ДополнениеКНаименованиюОрганизации = "";
    СведенияОГоловномКонтрагентеПокупателя = "";
    ДополнениеКНаименованиюОрганизации = "";

	Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
		СведенияОГоловномКонтрагентеПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ГоловнойКонтрагент, Шапка.Дата);	
	КонецЕсли;
	
	// Подготовим таблицы
	Отказ = Ложь;
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати  = "ПАРАМЕТРЫ_ПЕЧАТИ_НалоговаяНакладная_2016" + ИмяМакета;

	Макет = ПолучитьМакет("НалоговаяНакладная2017Альбом");	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Макет.КодЯзыкаМакета = "ru";
	
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим);
	

	// Загрузим все таблицы (кроме тары) в одну таблицу
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПрочим, ТаблицаНоменклатуры);	
	
		
	
	// свернем подобные строки     
	ТаблицаНоменклатуры.Свернуть("КодВид, КодСХ, Номенклатура, Характеристика, КодУКТВЭД, ЕдиницаИзмерения, ЕдиницаИзмеренияКод, ЦенаБезНДСРегл, СтавкаНДС, КодЛьготы", "Количество, СуммаБезНДСРегл, СуммаНДСРегл, СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");   	
	// переименуем колонки
	ТаблицаНоменклатуры.Колонки.ЦенаБезНДСРегл.Имя 				 = "ЦенаБезНДС";
	ТаблицаНоменклатуры.Колонки.СуммаБезНДСРегл.Имя 			 = "Сумма";
	ТаблицаНоменклатуры.Колонки.СуммаНДСРегл.Имя				 = "СуммаНДС";
	
	// Для служебныех целей понадобится исходная таблица
	ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
	// определим параметры шапки документа
	//Дата
	ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
	
	// Номер
	ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
	Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
	    ТекНомерОЦ = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены)), 7);
	Иначе	
		ТекНомерОЦ = ТекНомер;
	КонецЕсли;
	
	// филиал/спецрежим
	КодСпецРежима    = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
	Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
		КодСпецРежима = "5";
	КонецЕсли;
	
	
	ФилиалПродавца   = ?(ЗначениеЗаполнено(Шапка.Префикс), Прав("    " + Формат(Число(Шапка.Префикс),"ЧЦ=4; ЧГ=0"), 4), "");  //число  4 символа, без лидирующих нулей
	ФилиалПокупателя = "";
	Если ЗначениеЗаполнено(Шапка.ФилиалПокупателя) Тогда
		ПозицияСобачки = Найти(Шапка.ФилиалПокупателя, "@");
		Если ПозицияСобачки > 0 Тогда
			ФилиалПокупателя = Сред(Шапка.ФилиалПокупателя, 1, ПозицияСобачки - 1);
		Иначе
			ФилиалПокупателя = Шапка.ФилиалПокупателя;
		КонецЕсли;
		ФилиалПокупателя = Прав("    " + СокрЛП(ФилиалПокупателя), 4);
	КонецЕсли;
	
	////////////////////////////////////////////
	// Продавец
	
	// ИНН, Номер свидетельства, Наименование, Адрес
	Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		// налоговые реквизиты не указыватюся
		СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		                                                                                  				   
		ИННОрганизации					= "500000000000";
		НазваниеОрганизации				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце, "ПолноеНаименование,",Ложь);
		Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
			НазваниеОрганизации         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь) 		
										  + ", " + НазваниеОрганизации;
		КонецЕсли;
		
		Страна = "";
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Вид"   , Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		Запрос.УстановитьПараметр("Объект", Шапка.Контрагент);
		Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		               |	КонтактнаяИнформация.Поле1,
		               |	КонтактнаяИнформация.Поле10
		               |ИЗ
		               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		               |ГДЕ
		               |	КонтактнаяИнформация.Объект = &Объект
		               |	И КонтактнаяИнформация.Тип = &Тип
		               |	И КонтактнаяИнформация.Вид = &Вид";
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Поле1  = РезультатЗапроса.Выгрузить()[0].Поле1;
			Поле10 = РезультатЗапроса.Выгрузить()[0].Поле10;
			Если  ЗначениеЗаполнено(Поле1) Тогда
				Если Найти("0123456789", Лев(СокрЛ(Поле1), 1)) > 0 Тогда
					// в Поле1 находится индекс
					Страна = Поле10;
				Иначе
					Страна = Поле1;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Поле10) Тогда
				Страна = Поле10;
			КонецЕсли;
			Страна = СокрЛП(Страна);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Страна) Тогда
			Сообщить("" + Шапка.Контрагент + ": " + НСтр("ru='Не указана страна регистрации контрагента-нерезидента (в контактной информации)! Страна регистрации в налоговой накладной заполнена не будет!';uk='Не вказана країна реєстрації контрагента-нерезидента (у контактній інформації)! Країна реєстрації в податковій накладній заповнена не буде!'"));
		Иначе
			НазваниеОрганизации = НазваниеОрганизации + ", " + Страна		
		КонецЕсли;
		// данные по филиалам меняются местами
		ФилиалПокупателя = ФилиалПродавца;
		ФилиалПродавца	 = "";
		
	Иначе	
		
		СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
		НазваниеОрганизации				= ДополнениеКНаименованиюОрганизации 
										+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			НазваниеОрганизации = НазваниеОрганизации + Шапка.НаименованиеФилиала;	
		КонецЕсли;
		
	КонецЕсли;
	ИННОрганизации = Прав("            " + ИННОрганизации, 12);
	
	////////////////////////////////////////////
	// покупатель
	
	// Название, адрес, номер свидетельства, ИНН
	Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
		ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда	
		
		// в этом случае контрагентом выступает организация
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		НазваниеКонтрагента				= ДополнениеКНаименованиюОрганизации + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
		
		Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			ИННКонтрагента 				  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		Иначе	
			Если Шапка.Сводная = Истина Тогда
			    ИННКонтрагента 	 = "600000000000";
			Иначе	
				ИННКонтрагента 	 = "400000000000";	
			КонецЕсли;
			
			ФилиалПокупателя = "";			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			НазваниеКонтрагента = НазваниеКонтрагента + Шапка.НаименованиеФилиала;	
		КонецЕсли;
		
	Иначе
		
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		
		НазваниеКонтрагента				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
		Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
			НазваниеКонтрагента         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь)
										  + ", " + НазваниеКонтрагента;
		КонецЕсли;
		ИННКонтрагента 				  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		
		Если  Шапка.ТипПричиныНевыдачиПокупателю = 1 Тогда
			
			ИННКонтрагента = "100000000000";
			НазваниеКонтрагента = "Неплатник";
			
		ИначеЕсли  Шапка.ТипПричиныНевыдачиПокупателю = 12 Тогда
			
			ИННКонтрагента = "200000000000";
			
		ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 7 Тогда
			
			// поставка на экспорт
			ИННКонтрагента = "300000000000";
			// вместо адреса - просто страна нерезидента
			Страна = "";
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Вид"   , Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
			Запрос.УстановитьПараметр("Объект", Шапка.Контрагент);
			Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			               |	КонтактнаяИнформация.Поле1,
			               |	КонтактнаяИнформация.Поле10
			               |ИЗ
			               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			               |ГДЕ
			               |	КонтактнаяИнформация.Объект = &Объект
			               |	И КонтактнаяИнформация.Тип = &Тип
			               |	И КонтактнаяИнформация.Вид = &Вид";
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				Поле1  = РезультатЗапроса.Выгрузить()[0].Поле1;
				Поле10 = РезультатЗапроса.Выгрузить()[0].Поле10;
				Если  ЗначениеЗаполнено(Поле1) Тогда
					Если Найти("0123456789", Лев(СокрЛ(Поле1), 1)) > 0 Тогда
						// в Поле1 находится индекс
						Страна = Поле10;
					Иначе
						Страна = Поле1;
					КонецЕсли;
				ИначеЕсли ЗначениеЗаполнено(Поле10) Тогда
					Страна = Поле10;
				КонецЕсли;
				Страна = СокрЛП(Страна);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Страна) Тогда
				Сообщить("" + Шапка.Контрагент + ": " + НСтр("ru='Не указана страна регистрации контрагента-нерезидента (в контактной информации)! Страна регистрации в налоговой накладной заполнена не будет!';uk='Не вказана країна реєстрації контрагента-нерезидента (у контактній інформації)! Країна реєстрації в податковій накладній заповнена не буде!'"));
			Иначе
				НазваниеКонтрагента = НазваниеКонтрагента + ", " + Страна;
			КонецЕсли;
							
		ИначеЕсли НЕ ЗначениеЗаполнено(ИННКонтрагента)
				 ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
			ИННКонтрагента = "100000000000";
			НазваниеКонтрагента = "Неплатник";
			
		КонецЕсли;
		
	КонецЕсли; 
	ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
	
	// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
	ПечКтоВыписалНалоговуюНакладную = "";
	ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
	Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
		ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
										 + ". "
										 + ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
										 + ". "
										 + СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
	Иначе
		ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
	КонецЕсли;
	
	Для Страница = 1 По 1 Цикл
		
		ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
		
		Если (    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации
			  ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			  ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа) Тогда
			  
			  ОбластьМакетаЗаголовок.Параметры.Сводная = ?(Шапка.Сводная = Истина, "X", "");	
			  
		КонецЕсли;
		
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации 
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
		
			ОбластьМакетаЗаголовок.Параметры.Освобожденная = "Без ПДВ";
		
		КонецЕсли;
		
		Если  НЕ Шапка.ТипПричиныНевыдачиПокупателю = 0 Тогда
			// накладная остается у поставщика
			ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
			ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
			ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
		
		// Выводим отступ
		ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		//Дата
		Для Инд = 1 По 8 Цикл
			ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
		КонецЦикла; 
		// Номер
		Для Инд = 1 По 7 Цикл                                                                 
			ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
		КонецЦикла; 
		
		// код спец. режима
		ОбластьМакета.Параметры.СпецРежим = КодСпецРежима;
		// наименование продавца
		ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
		// ИНН продавца
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
		КонецЦикла; 
		// филиал
		Для Инд = 1 По 4 Цикл                                                                 
			ОбластьМакета.Параметры["ФилиалПродавца_"+Инд]    = Сред(ФилиалПродавца, Инд, 1);
		КонецЦикла; 
		
		// название покупателя
		ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеКонтрагента;
		// ИНН покупателя
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
		КонецЦикла; 
		// Филиал
		Для Инд = 1 По 4 Цикл                                                                 
			ОбластьМакета.Параметры["ФилиалПокупателя_"+Инд]    = Сред(ФилиалПокупателя, Инд, 1);
		КонецЦикла; 
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим шапку накладной вместе с итогами
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();
		ВремТаблица.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
		Для каждого СтрокаТаблицы Из ВремТаблица Цикл
			КолонкаДляСуммы = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС));
			Если  Шапка.СоглашениеОРазделеПродукции = Истина Тогда
				// данные не заполняются
			ИначеЕсли КолонкаДляСуммы = "20" Тогда
				
				ОбластьМакета.Параметры.Сумма20   = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				ОбластьМакета.Параметры.ИтогНДС20 = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G7", СтрокаТаблицы.Сумма);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G7", СтрокаТаблицы.СуммаНДС);
				КонецЕсли;
				
			ИначеЕсли КолонкаДляСуммы = "7" Тогда
				
				ОбластьМакета.Параметры.Сумма7   = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				ОбластьМакета.Параметры.ИтогНДС7 = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G109", СтрокаТаблицы.Сумма);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G109", СтрокаТаблицы.СуммаНДС);
				КонецЕсли;
				
			ИначеЕсли КолонкаДляСуммы = "902" Тогда
				
				ОбластьМакета.Параметры.Сумма0Укр = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G8", СтрокаТаблицы.Сумма);
				КонецЕсли;
				
			ИначеЕсли КолонкаДляСуммы = "901" Тогда
				
				ОбластьМакета.Параметры.Сумма0Эксп = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G9", СтрокаТаблицы.Сумма);
				КонецЕсли;
				
			ИначеЕсли КолонкаДляСуммы = "903" Тогда
				
				ОбластьМакета.Параметры.СуммаБезНДС = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G10", СтрокаТаблицы.Сумма);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		ВсегоСумма = 0; ИтогНДС   = 0;
		ВремТаблица.Свернуть("", "Сумма, СуммаНДС");
		Для каждого СтрокаТаблицы из ВремТаблица Цикл
			ВсегоСумма = СтрокаТаблицы.Сумма;
			ИтогНДС    = СтрокаТаблицы.СуммаНДС;
		КонецЦикла;
		
		СуммаВозвратнойТары = 0;
		ТаблицаПоТаре.Свернуть("", "СуммаСНДСРегл");
		Для каждого СтрокаТаблицы из ТаблицаПоТаре Цикл
			//В таблице не более одной строки
			СуммаВозвратнойТары = СтрокаТаблицы.СуммаСНДСРегл;
		КонецЦикла;
		                                                                                     
		ОбластьМакета.Параметры.Всего    = ОбщегоНазначения.ФорматСумм(ИтогНДС + ВсегоСумма);
		ОбластьМакета.Параметры.ИтогНДС  = ОбщегоНазначения.ФорматСумм(ИтогНДС);
		ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары);
		
		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R04G11", ИтогНДС + ВсегоСумма);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G11", ИтогНДС);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G11", СуммаВозвратнойТары);
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// рассчитаем поля для подвала заранее
		ПечЛьготаНДС = "";
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
		    ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
			
			// выводим информацию только если хотя бы для одного товара не заполнен код льготы или указан "временный" код 99999999
			ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();	
			ВремТаблица.Свернуть("КодЛьготы");
			Для каждого СтрокаТаблицы Из ВремТаблица Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.КодЛьготы)
					ИЛИ СтрокаТаблицы.КодЛьготы = "99999999" Тогда
					ПечЛьготаНДС = Шапка.ЛьготаНДС;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ИННКтоВыписалНН = СокрЛП(Шапка.ИННКтоВыписалНН);
		
		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H03",		ОбластьМакетаЗаголовок.Параметры.Сводная);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",	ОбластьМакетаЗаголовок.Параметры.Освобожденная);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	КодСпецРежима);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	ФилиалПродавца);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFBUY",	ФилиалПокупателя);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	НазваниеОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	НазваниеКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HBOS",		ПечКтоВыписалНалоговуюНакладную);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBOS",	ИННКтоВыписалНН);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	ПечЛьготаНДС);	
 			
		КонецЕсли;
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
				Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
			
			ОбластьМакета.Параметры.НомерСтроки = ТаблицаНоменклатуры.Индекс(СтрокаТаблицы) + 1;
			
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = НалоговыйУчет.КодЕдиницыИзмеренияДляПечатиНалоговых(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод);
			
			
			ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
			Если СтрокаТаблицы.КодВид = Перечисления.ВидыКодовДляНалоговойНакладной.КодУслуги Тогда
				ОбластьМакета.Параметры.КодДКПП   = ОбластьМакета.Параметры.КодУКТВЭД;	
				ОбластьМакета.Параметры.КодУКТВЭД = "";
			ИначеЕсли СтрокаТаблицы.КодВид = Перечисления.ВидыКодовДляНалоговойНакладной.КодТовараИмпортированного Тогда
				ОбластьМакета.Параметры.Импортированный = "X";
			КонецЕсли;
			Если НЕ КодСпецРежима = "2" Тогда
			    ОбластьМакета.Параметры.КодСХ = "";
			КонецЕсли;
			
			ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
    		                                      + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")");
			
			// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
			ОбластьМакета.Параметры.КодСтавки = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС));
			
			ОбластьМакета.Параметры.Сумма     = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
			
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				
				Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КодЛьготы) Тогда
					ОбластьМакета.Параметры.КодЛьготы = "99999999";
				КонецЕсли;
				
			Иначе
				
				ОбластьМакета.Параметры.КодЛьготы = "";	
				
			КонецЕсли;
			
			ДанныеОСумме = СтрокаТаблицы.Сумма;
			
			Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
				
				ОбластьМакета.Параметры.Номенклатура = "розподіл сум податкового кредиту за багатосторонньою угодою про розподіл продукції";
				ОбластьМакета.Параметры.КодУКТВЭД = "";
				ОбластьМакета.Параметры.КодДКПП = "";
				ОбластьМакета.Параметры.Импортированный = "";
				ОбластьМакета.Параметры.КодСХ = "";
				ОбластьМакета.Параметры.ЕдиницаИзмерения = "";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
				ОбластьМакета.Параметры.Количество = "";
				ОбластьМакета.Параметры.ЦенаБезНДС = "";
				ОбластьМакета.Параметры.КодСтавки = "";
				ОбластьМакета.Параметры.КодЛьготы = "";
				ОбластьМакета.Параметры.Сумма = "";
				
				ДанныеОСумме = 0;
			ИначеЕсли Шапка.Сводная = Истина И (Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа) Тогда
					
				ОбластьМакета.Параметры.КодУКТВЭД = "";
				ОбластьМакета.Параметры.КодДКПП = "";
				ОбластьМакета.Параметры.Импортированный = "";
				ОбластьМакета.Параметры.КодСХ = "";
				ОбластьМакета.Параметры.Количество = "";
				ОбластьМакета.Параметры.ЦенаБезНДС = "";
				ОбластьМакета.Параметры.КодСтавки = "";
				ОбластьМакета.Параметры.КодЛьготы = "";
				ОбластьМакета.Параметры.ЕдиницаИзмерения = "грн";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				
				СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
				
				СтрокаСтруктуры.G3S 		= ОбластьМакета.Параметры.Номенклатура;
				СтрокаСтруктуры.G4  		= ОбластьМакета.Параметры.КодУКТВЭД;
				СтрокаСтруктуры.G32  		= ОбластьМакета.Параметры.Импортированный;
				СтрокаСтруктуры.G33  		= ОбластьМакета.Параметры.КодДКПП;
				
				СтрокаСтруктуры.G4S     	= ОбластьМакета.Параметры.ЕдиницаИзмерения;
				СтрокаСтруктуры.G105_2S 	= ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
				
				СтрокаСтруктуры.G5 			= ОбластьМакета.Параметры.Количество;
				СтрокаСтруктуры.G6 			= ОбластьМакета.Параметры.ЦенаБезНДС;
				
				СтрокаСтруктуры.G008  		= ОбластьМакета.Параметры.КодСтавки;
				СтрокаСтруктуры.G009  		= ОбластьМакета.Параметры.КодЛьготы;
				СтрокаСтруктуры.G010  		= ДанныеОСумме;
				СтрокаСтруктуры.G011  		= ОбластьМакета.Параметры.КодСХ;
				
			КонецЕсли;
							
		КонецЦикла;
		
		// Выводим подвал накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
		
		// ДРФО того, кто выписал НН
		Для Инд = 1 По 10 Цикл
			ОбластьМакета.Параметры["ИННКтоВыписалНН_"+Инд] = Сред(ИННКтоВыписалНН, Инд, 1);
		КонецЦикла; 
		
		ОбластьМакета.Параметры.ЛьготаНДС = ПечЛьготаНДС;	
		
		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла; 

	Если ПродажаНижеОбычнойЦены 
		ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки
		Тогда
		
		Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
			// все что мы напечатали по обычной НН не имеет смысла для этого вида операции
			// нужна только "вторая НН" как если бы это была не сводная накладная на превыешение базы над ценой продажи
			ТабДокумент.Очистить();	
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				
				Таблица = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
				Таблица.Очистить();
				СтруктураПоказателей.НалоговыйДокумент.Очистить();
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R", Таблица);
				
				СтруктураПоказателйПечатнойФормы = СтруктураПоказателей.НалоговыйДокумент;	
			КонецЕсли;
		Иначе
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				СтруктураПоказателйПечатнойФормы = СтруктураПоказателей.НалоговыйДокументЗЦ;
			КонецЕсли;
		КонецЕсли;
		
		
		ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		
		//удалим лишние колонки
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
		
		// переименуем колонки
		ТаблицаНоменклатуры.Колонки.СуммаБезНДСПревышенияРегл.Имя 	 = "Сумма";
		ТаблицаНоменклатуры.Колонки.СуммаНДСПревышенияРегл.Имя		 = "СуммаНДС";
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	    Для Страница = 1 По 1 Цикл
		
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			Если (Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки) Тогда
				  
				  ОбластьМакетаЗаголовок.Параметры.Сводная = ?(Шапка.Сводная = Истина, "X", "");	
				  
			КонецЕсли;

			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации 
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
			
				ОбластьМакетаЗаголовок.Параметры.Освобожденная = "Без ПДВ";
			
			КонецЕсли;			
			
			ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
			
			ТипПричиныСтр = Формат(Шапка.ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены, "ЧЦ=2; ЧВН=");
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
				ТипПричиныСтр = Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2; ЧВН=");
			КонецЕсли;
			ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Лев(ТипПричиныСтр, 1);
			ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Прав(ТипПричиныСтр, 1);
			
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);

			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 7 Цикл                                  
				Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
					ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
				Иначе
					ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомерОЦ, Инд, 1);	
				КонецЕсли;
			КонецЦикла; 
		
			// код спец. режима
			ОбластьМакета.Параметры.СпецРежим = КодСпецРежима;
			// наименование продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			// ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			// филиал
			Для Инд = 1 По 4 Цикл                                                                 
				ОбластьМакета.Параметры["ФилиалПродавца_"+Инд]    = Сред(ФилиалПродавца, Инд, 1);
			КонецЦикла; 
		
			// название покупателя = продавца
			ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеОрганизации;
			// ИНН покупателя = продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			// Филиал = продавца
			Для Инд = 1 По 4 Цикл                                                                 
				ОбластьМакета.Параметры["ФилиалПокупателя_"+Инд]    = Сред(ФилиалПродавца, Инд, 1);
			КонецЦикла; 
				
			ТабДокумент.Вывести(ОбластьМакета);
 
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
				
				СтруктураПоказателйПечатнойФормы.Вставить("H03", ОбластьМакетаЗаголовок.Параметры.Сводная);
				СтруктураПоказателйПечатнойФормы.Вставить("R03G10S",ОбластьМакетаЗаголовок.Параметры.Освобожденная);
				
				СтруктураПоказателйПечатнойФормы.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
				СтруктураПоказателйПечатнойФормы.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
				
				СтруктураПоказателйПечатнойФормы.Вставить("HFILL",	Шапка.Дата);
				СтруктураПоказателйПечатнойФормы.Вставить("HNUM",	Прав(ТекНомерОЦ,7));
				СтруктураПоказателйПечатнойФормы.Вставить("HNUM1",	КодСпецРежима);
				СтруктураПоказателйПечатнойФормы.Вставить("HNUM2",	ФилиалПродавца);
				СтруктураПоказателйПечатнойФормы.Вставить("HFBUY",	ФилиалПродавца);
				
				СтруктураПоказателйПечатнойФормы.Вставить("HNAMESEL",	ОбластьМакета.Параметры.НазваниеОрганизации);
				СтруктураПоказателйПечатнойФормы.Вставить("HNAMEBUY",	ОбластьМакета.Параметры.НазваниеОрганизации);
				СтруктураПоказателйПечатнойФормы.Вставить("HKSEL",	ИННОрганизации);
				СтруктураПоказателйПечатнойФормы.Вставить("HKBUY",	ИННОрганизации);
				СтруктураПоказателйПечатнойФормы.Вставить("HBOS",	ПечКтоВыписалНалоговуюНакладную);
				СтруктураПоказателйПечатнойФормы.Вставить("HKBOS",	ИННКтоВыписалНН);
			

			КонецЕсли;
			
			// Выводим шапку накладной вместе с итогами
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			
			ВремТаблица = ТаблицаНоменклатуры.Скопировать();
			ВремТаблица.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы Из ВремТаблица Цикл
				
				КолонкаДляСуммы = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС));
				
				Если КолонкаДляСуммы = "20" Тогда
					
					ОбластьМакета.Параметры.Сумма20   = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					ОбластьМакета.Параметры.ИтогНДС20 = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателйПечатнойФормы.Вставить("R01G7", СтрокаТаблицы.Сумма);
						СтруктураПоказателйПечатнойФормы.Вставить("R03G7", СтрокаТаблицы.СуммаНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "7" Тогда
					
					ОбластьМакета.Параметры.Сумма7   = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					ОбластьМакета.Параметры.ИтогНДС7 = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателйПечатнойФормы.Вставить("R01G109", СтрокаТаблицы.Сумма);
						СтруктураПоказателйПечатнойФормы.Вставить("R03G109", СтрокаТаблицы.СуммаНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "902" Тогда
					
					ОбластьМакета.Параметры.Сумма0Укр = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателйПечатнойФормы.Вставить("R01G8", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "901" Тогда
					
					ОбластьМакета.Параметры.Сумма0Эксп = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателйПечатнойФормы.Вставить("R01G9", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "903" Тогда
					
					ОбластьМакета.Параметры.СуммаБезНДС = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателйПечатнойФормы.Вставить("R01G10", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ВсегоСумма = 0; ИтогНДС   = 0;
			ВремТаблица.Свернуть("", "Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы из ВремТаблица Цикл
				ВсегоСумма = СтрокаТаблицы.Сумма;
				ИтогНДС    = СтрокаТаблицы.СуммаНДС;
			КонецЦикла;
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ИтогНДС  = ОбщегоНазначения.ФорматСумм(ИтогНДС);
			ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары);
			ОбластьМакета.Параметры.Всего    = ОбщегоНазначения.ФорматСумм(ИтогНДС + ВсегоСумма + СуммаВозвратнойТары);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				СтруктураПоказателйПечатнойФормы.Вставить("R04G11", ИтогНДС + ВсегоСумма + СуммаВозвратнойТары);
				СтруктураПоказателйПечатнойФормы.Вставить("R03G11", ИтогНДС);
				СтруктураПоказателйПечатнойФормы.Вставить("R02G11", СуммаВозвратнойТары);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			
			Если ЗначениеЗаполнено(КодСпецРежима) Тогда
				ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер) + "/" + СокрЛ(КодСпецРежима);
			Иначе
				ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер);	
			КонецЕсли;
			
			ДопТекст = Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены;
			ДопТекст = СтрЗаменить(ДопТекст,
								   "<визначається автоматично>",
								   ПолныйНомерОсновнойНакладной);
								   
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
				ДопТекст = " (перевищення бази оподаткування, визначеної відповідно до статей 188 і 189 Податкового кодексу України, над фактичною ціною постачання)";	
			КонецЕсли;	
				
			// Выведем на печать все строки таблицы в раздел I
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
					Продолжить
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
				    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
					ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
					Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КодЛьготы) Тогда
						ОбластьМакета.Параметры.КодЛьготы = "99999999";
					КонецЕсли;
				Иначе
					ОбластьМакета.Параметры.КодЛьготы = "";	
				КонецЕсли;
				
				ОбластьМакета.Параметры.НомерСтроки = ТаблицаНоменклатуры.Индекс(СтрокаТаблицы) + 1;
				
				// п 16. 9) не заполняются данные по номенклатуре:
				ОбластьМакета.Параметры.КодУКТВЭД = "";
				ОбластьМакета.Параметры.КодДКПП = "";
				ОбластьМакета.Параметры.Импортированный = "";
				ОбластьМакета.Параметры.КодСХ = "";
				ОбластьМакета.Параметры.ЕдиницаИзмерения = "";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
				
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
   		                                      + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
											  +" "+ ДопТекст;
				
				Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
				    ОбластьМакета.Параметры.Номенклатура = "розподіл сум податкового кредиту за багатосторонньою угодою про розподіл продукції"
														  +" "+ ДопТекст;
				КонецЕсли;
																 
																 
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				ОбластьМакета.Параметры.КодСтавки = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС));
				
				ОбластьМакета.Параметры.Сумма     = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
				
				ОбластьМакета.Параметры["ЦенаБезНДС"] = Окр(?(СтрокаТаблицы.Количество = 0, 0, СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество), 2);
				
				ТабДокумент.Вывести(ОбластьМакета);

				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					
					СтрокаСтруктуры = СтруктураПоказателйПечатнойФормы.R.Добавить();
					
					СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
					СтрокаСтруктуры.G4  = ОбластьМакета.Параметры.КодУКТВЭД;
					СтрокаСтруктуры.G32  = ОбластьМакета.Параметры.Импортированный;
					СтрокаСтруктуры.G33  = ОбластьМакета.Параметры.КодДКПП;
					
					СтрокаСтруктуры.G4S     = ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G105_2S = ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
					
					СтрокаСтруктуры.G5 = ОбластьМакета.Параметры.Количество;
					СтрокаСтруктуры.G6 = ОбластьМакета.Параметры.ЦенаБезНДС;
					
					СтрокаСтруктуры.G008  = ОбластьМакета.Параметры.КодСтавки;
					СтрокаСтруктуры.G010  = СтрокаТаблицы.Сумма;
					
					СтрокаСтруктуры.G011  = ОбластьМакета.Параметры.КодСХ;
				КонецЕсли;				
				
			КонецЦикла;
		
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
			
			// ДРФО того, кто выписал НН
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["ИННКтоВыписалНН_"+Инд] = Сред(ИННКтоВыписалНН, Инд, 1);
			КонецЦикла; 
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
			
			ТабДокумент.Вывести(ОбластьМакета);

		КонецЦикла; 
		
	КонецЕсли;	
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
КонецФункции 

Функция ПечатьДокументаНалоговыйКодекс2016(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета = "НалоговаяНакладнаяАльбом")
	
	Перем СтруктураШапкиДокумента;
	
	Перем ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим;
	
	КонтрагентНеРезидент = Контрагент.НеЯвляетсяРезидентом;
	
	Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
	
		СтруктураПоказателей = Новый Структура();
		СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
		СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G105_2S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G008");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G009");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G010");
		
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
			
			Сообщить(НСтр("ru='Документ является служебным и не может быть выгружен в XML!';uk='Документ є службовим та не може бути вивантажений в XML!'"));
			
			// такие операции не предусматривают выписки налоговых накладных
			Возврат	СтруктураПоказателей;
		КонецЕсли;
		
		Если ПродажаНижеОбычнойЦены Тогда
			СтруктураПоказателей.Вставить("НалоговыйДокументЗЦ", 	Новый Структура());	// данные табличной части по накладной по "обычным ценам"
			СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R",  Новый ТаблицаЗначений());  // данные табличной части
			СтруктураПоказателей.НалоговыйДокументЗЦ.R = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Дата,
	|	Номер,
	
	|	СпецРежимНалогообложения,
	
	|	ОбособленноеПодразделение.НаименованиеДляНалоговыхДокументов КАК НаименованиеФилиала,
	|	ОбособленноеПодразделение.Префикс КАК Префикс,
	
	|	ТипПричиныНевыдачиПокупателю,
	|	ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены,
	|	ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,

	|	Контрагент,
	|	Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагент.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН КАК ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН,
	|	Контрагент.КодФилиала КАК ФилиалПокупателя,
	
	|	ДоговорКонтрагента.МногостороннееСоглашениеОРазделеПродукции КАК СоглашениеОРазделеПродукции, 
	
	|	Организация,
	
	|	ЛьготаНДС,
	
	|	ВидОперации,
	
	|	Сводная,
	
	|	КтоВыписалНалоговуюНакладную 			КАК КтоВыписалНалоговуюНакладную,
	|	КтоВыписалНалоговуюНакладную.КодПоДРФО  КАК ИННКтоВыписалНН
	|ИЗ
	|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
	|
	|ГДЕ
	|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	СведенияОГоловномКонтрагентеПокупателя = "";
	ДополнениеКНаименованиюОрганизации = "";

	Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
		СведенияОГоловномКонтрагентеПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ГоловнойКонтрагент, Шапка.Дата);	
	КонецЕсли;

	// Подготовим таблицы
	Отказ = Ложь;
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати  = "ПАРАМЕТРЫ_ПЕЧАТИ_НалоговаяНакладная_2016" + ИмяМакета;

	Макет = ПолучитьМакет("НалоговаяНакладная2016");
	Если ИмяМакета = "НалоговаяНакладнаяАльбом" Тогда
		Макет = ПолучитьМакет("НалоговаяНакладная2016Альбом");	
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	Макет.КодЯзыкаМакета = "ru";
   ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим);

	// Загрузим все таблицы (кроме тары) в одну таблицу
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПрочим, ТаблицаНоменклатуры);	
	
		
	// свернем подобные строки     
	ТаблицаНоменклатуры.Свернуть("Номенклатура, Характеристика, КодУКТВЭД, ЕдиницаИзмерения, ЕдиницаИзмеренияКод, ЦенаБезНДСРегл, СтавкаНДС, КодЛьготы", "Количество, СуммаБезНДСРегл, СуммаНДСРегл, СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");   	
	// переименуем колонки
	ТаблицаНоменклатуры.Колонки.ЦенаБезНДСРегл.Имя 				 = "ЦенаБезНДС";
	ТаблицаНоменклатуры.Колонки.СуммаБезНДСРегл.Имя 			 = "Сумма";
	ТаблицаНоменклатуры.Колонки.СуммаНДСРегл.Имя				 = "СуммаНДС";
	
	// Для служебныех целей понадобится исходная таблица
	ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
	// определим параметры шапки документа
	//Дата
	ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
	
	// Номер
	ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
	Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
	    ТекНомерОЦ = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены)), 7);
	Иначе	
		ТекНомерОЦ = ТекНомер;
	КонецЕсли;
	
	// филиал/спецрежим
	КодСпецРежима    = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
	Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
		КодСпецРежима = "5";
	КонецЕсли;
	
	
	ФилиалПродавца   = ?(ЗначениеЗаполнено(Шапка.Префикс), Прав("    " + Формат(Число(Шапка.Префикс),"ЧЦ=4; ЧГ=0"), 4), "");  //число  4 символа, без лидирующих нулей
	ФилиалПокупателя = "";
	Если ЗначениеЗаполнено(Шапка.ФилиалПокупателя) Тогда
		ПозицияСобачки = Найти(Шапка.ФилиалПокупателя, "@");
		Если ПозицияСобачки > 0 Тогда
			ФилиалПокупателя = Сред(Шапка.ФилиалПокупателя, 1, ПозицияСобачки - 1);
		Иначе
			ФилиалПокупателя = Шапка.ФилиалПокупателя;
		КонецЕсли;
		ФилиалПокупателя = Прав("    " + СокрЛП(ФилиалПокупателя), 4);
	КонецЕсли;
	
	////////////////////////////////////////////
	// Продавец
	
	// ИНН, Номер свидетельства, Наименование, Адрес
	Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		// налоговые реквизиты не указыватюся
		СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		                                                                                  				   
		ИННОрганизации					= "500000000000";
		НазваниеОрганизации				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце, "ПолноеНаименование,",Ложь);
		Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
			НазваниеОрганизации         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь) 		
										  + ", " + НазваниеОрганизации;
		КонецЕсли;
		
		Страна = "";
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Вид"   , Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		Запрос.УстановитьПараметр("Объект", Шапка.Контрагент);
		Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		               |	КонтактнаяИнформация.Поле1,
		               |	КонтактнаяИнформация.Поле10
		               |ИЗ
		               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		               |ГДЕ
		               |	КонтактнаяИнформация.Объект = &Объект
		               |	И КонтактнаяИнформация.Тип = &Тип
		               |	И КонтактнаяИнформация.Вид = &Вид";
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Поле1  = РезультатЗапроса.Выгрузить()[0].Поле1;
			Поле10 = РезультатЗапроса.Выгрузить()[0].Поле10;
			Если  ЗначениеЗаполнено(Поле1) Тогда
				Если Найти("0123456789", Лев(СокрЛ(Поле1), 1)) > 0 Тогда
					// в Поле1 находится индекс
					Страна = Поле10;
				Иначе
					Страна = Поле1;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Поле10) Тогда
				Страна = Поле10;
			КонецЕсли;
			Страна = СокрЛП(Страна);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Страна) Тогда
				Сообщить("" + Шапка.Контрагент + ": " + НСтр("ru='Не указана страна регистрации контрагента-нерезидента (в контактной информации)! Страна регистрации в налоговой накладной заполнена не будет!';uk='Не вказана країна реєстрації контрагента-нерезидента (у контактній інформації)! Країна реєстрації в податковій накладній заповнена не буде!'"));
		Иначе
			НазваниеОрганизации = НазваниеОрганизации + ", " + Страна		
		КонецЕсли;
		// данные по филиалам меняются местами
		ФилиалПокупателя = ФилиалПродавца;
		ФилиалПродавца	 = "";
		
	Иначе	
		
		СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
		НазваниеОрганизации				= ДополнениеКНаименованиюОрганизации 
										+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			НазваниеОрганизации = НазваниеОрганизации + Шапка.НаименованиеФилиала;	
		КонецЕсли;
		
	КонецЕсли;
	ИННОрганизации = Прав("            " + ИННОрганизации, 12);
	
	////////////////////////////////////////////
	// покупатель
	
	// Название, адрес, номер свидетельства, ИНН
	Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
   		//ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
		ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		// в этом случае контрагентом выступает организация
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		НазваниеКонтрагента				= ДополнениеКНаименованиюОрганизации + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
		
		Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			ИННКонтрагента 				  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		Иначе	
			Если Шапка.Сводная = Истина Тогда
			    ИННКонтрагента 	 = "600000000000";
			Иначе	
				ИННКонтрагента 	 = "400000000000";	
			КонецЕсли;
			
			ФилиалПокупателя = "";			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			НазваниеКонтрагента = НазваниеКонтрагента + Шапка.НаименованиеФилиала;	
		КонецЕсли;
		
	Иначе
		
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		
		НазваниеКонтрагента				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
		Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
			НазваниеКонтрагента         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь)
										  + ", " + НазваниеКонтрагента;
		КонецЕсли;
		ИННКонтрагента 				  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		
		Если  Шапка.ТипПричиныНевыдачиПокупателю = 1 Тогда
			
			ИННКонтрагента = "100000000000";
			НазваниеКонтрагента = "Неплатник";
			
		ИначеЕсли  Шапка.ТипПричиныНевыдачиПокупателю = 12 Тогда
			
			ИННКонтрагента = "200000000000";
			
		ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 7 Тогда
			
			// поставка на экспорт
			ИННКонтрагента = "300000000000";
			// вместо адреса - просто страна нерезидента
			Страна = "";
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Вид"   , Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
			Запрос.УстановитьПараметр("Объект", Шапка.Контрагент);
			Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			               |	КонтактнаяИнформация.Поле1,
			               |	КонтактнаяИнформация.Поле10
			               |ИЗ
			               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			               |ГДЕ
			               |	КонтактнаяИнформация.Объект = &Объект
			               |	И КонтактнаяИнформация.Тип = &Тип
			               |	И КонтактнаяИнформация.Вид = &Вид";
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				Поле1  = РезультатЗапроса.Выгрузить()[0].Поле1;
				Поле10 = РезультатЗапроса.Выгрузить()[0].Поле10;
				Если  ЗначениеЗаполнено(Поле1) Тогда
					Если Найти("0123456789", Лев(СокрЛ(Поле1), 1)) > 0 Тогда
						// в Поле1 находится индекс
						Страна = Поле10;
					Иначе
						Страна = Поле1;
					КонецЕсли;
				ИначеЕсли ЗначениеЗаполнено(Поле10) Тогда
					Страна = Поле10;
				КонецЕсли;
				Страна = СокрЛП(Страна);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Страна) Тогда
				Сообщить("" + Шапка.Контрагент + ": " + НСтр("ru='Не указана страна регистрации контрагента-нерезидента (в контактной информации)! Страна регистрации в налоговой накладной заполнена не будет!';uk='Не вказана країна реєстрації контрагента-нерезидента (у контактній інформації)! Країна реєстрації в податковій накладній заповнена не буде!'"));
			Иначе
				НазваниеКонтрагента = НазваниеКонтрагента + ", " + Страна;
			КонецЕсли;
							
		ИначеЕсли НЕ ЗначениеЗаполнено(ИННКонтрагента)
				 ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
			ИННКонтрагента = "100000000000";
			НазваниеКонтрагента = "Неплатник";
			
		КонецЕсли;
		
	КонецЕсли; 
	ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
	
	// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
	ПечКтоВыписалНалоговуюНакладную = "";
	ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
	Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
		ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
										 + ". "
										 + ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
										 + ". "
										 + СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
	Иначе
		ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
	КонецЕсли;
	
	Для Страница = 1 По 1 Цикл
		
		ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
		
		Если (    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации
			  ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			  ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа) Тогда
			  
			  ОбластьМакетаЗаголовок.Параметры.Сводная = ?(Шапка.Сводная = Истина, "X", "");	
			  
		КонецЕсли;
		
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации 
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
		
			ОбластьМакетаЗаголовок.Параметры.Освобожденная = "Без ПДВ";
		
		КонецЕсли;
		
		Если  НЕ Шапка.ТипПричиныНевыдачиПокупателю = 0 Тогда
			// накладная остается у поставщика
			ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
			ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
			ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
		
		// Выводим отступ
		ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		//Дата
		Для Инд = 1 По 8 Цикл
			ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
		КонецЦикла; 
		// Номер
		Для Инд = 1 По 7 Цикл                                                                 
			ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
		КонецЦикла; 
		
		// код спец. режима
		ОбластьМакета.Параметры.СпецРежим = КодСпецРежима;
		// наименование продавца
		ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
		// ИНН продавца
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
		КонецЦикла; 
		// филиал
		Для Инд = 1 По 4 Цикл                                                                 
			ОбластьМакета.Параметры["ФилиалПродавца_"+Инд]    = Сред(ФилиалПродавца, Инд, 1);
		КонецЦикла; 
		
		// название покупателя
		ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеКонтрагента;
		// ИНН покупателя
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
		КонецЦикла; 
		// Филиал
		Для Инд = 1 По 4 Цикл                                                                 
			ОбластьМакета.Параметры["ФилиалПокупателя_"+Инд]    = Сред(ФилиалПокупателя, Инд, 1);
		КонецЦикла; 
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим шапку накладной вместе с итогами
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();
		ВремТаблица.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
		Для каждого СтрокаТаблицы Из ВремТаблица Цикл
			КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			Если  Шапка.СоглашениеОРазделеПродукции = Истина Тогда
				// данные не заполняются
			ИначеЕсли КолонкаДляСуммы = "20" Тогда
				
				ОбластьМакета.Параметры.Сумма20   = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				ОбластьМакета.Параметры.ИтогНДС20 = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G7", СтрокаТаблицы.Сумма);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G7", СтрокаТаблицы.СуммаНДС);
				КонецЕсли;
				
			ИначеЕсли КолонкаДляСуммы = "7" Тогда
				
				ОбластьМакета.Параметры.Сумма7   = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				ОбластьМакета.Параметры.ИтогНДС7 = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G109", СтрокаТаблицы.Сумма);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G109", СтрокаТаблицы.СуммаНДС);
				КонецЕсли;
				
			ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
				
				ОбластьМакета.Параметры.Сумма0Укр = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G8", СтрокаТаблицы.Сумма);
				КонецЕсли;
				
			ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
				
				ОбластьМакета.Параметры.Сумма0Эксп = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G9", СтрокаТаблицы.Сумма);
				КонецЕсли;
				
			ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
				
				ОбластьМакета.Параметры.СуммаБезНДС = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R01G10", СтрокаТаблицы.Сумма);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		ВсегоСумма = 0; ИтогНДС   = 0;
		ВремТаблица.Свернуть("", "Сумма, СуммаНДС");
		Для каждого СтрокаТаблицы из ВремТаблица Цикл
			ВсегоСумма = СтрокаТаблицы.Сумма;
			ИтогНДС    = СтрокаТаблицы.СуммаНДС;
		КонецЦикла;
		
		СуммаВозвратнойТары = 0;
		ТаблицаПоТаре.Свернуть("", "СуммаСНДСРегл");
		Для каждого СтрокаТаблицы из ТаблицаПоТаре Цикл
			//В таблице не более одной строки
			СуммаВозвратнойТары = СтрокаТаблицы.СуммаСНДСРегл;
		КонецЦикла;
		
		ОбластьМакета.Параметры.Всего    = ОбщегоНазначения.ФорматСумм(ИтогНДС + ВсегоСумма);
		
		ОбластьМакета.Параметры.ИтогНДС  = ОбщегоНазначения.ФорматСумм(ИтогНДС);
		ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары);
		
		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R04G11", ИтогНДС + ВсегоСумма);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G11", ИтогНДС);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G11", СуммаВозвратнойТары);
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		// рассчитаем поля для подвала заранее
		ПечЛьготаНДС = "";
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
		    ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
			
			// выводим информацию только если хотя бы для одного товара не заполнен код льготы или указан "временный" код 99999999
			ВремТаблица = ТаблицаНоменклатурыКопия.Скопировать();	
			ВремТаблица.Свернуть("КодЛьготы");
			Для каждого СтрокаТаблицы Из ВремТаблица Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.КодЛьготы)
					ИЛИ СтрокаТаблицы.КодЛьготы = "99999999" Тогда
					ПечЛьготаНДС = Шапка.ЛьготаНДС;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ИННКтоВыписалНН = СокрЛП(Шапка.ИННКтоВыписалНН);
		
		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H03",		ОбластьМакетаЗаголовок.Параметры.Сводная);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",	ОбластьМакетаЗаголовок.Параметры.Освобожденная);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	КодСпецРежима);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	ФилиалПродавца);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFBUY",	ФилиалПокупателя);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	НазваниеОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	НазваниеКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HBOS",		ПечКтоВыписалНалоговуюНакладную);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBOS",	ИННКтоВыписалНН);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	ПечЛьготаНДС);	
 			
		КонецЕсли;
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
				Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
			
			ОбластьМакета.Параметры.НомерСтроки = ТаблицаНоменклатуры.Индекс(СтрокаТаблицы) + 1;
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = НалоговыйУчет.КодЕдиницыИзмеренияДляПечатиНалоговых(ОбластьМакета.Параметры.ЕдиницаИзмеренияКод);
			ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
			
			//ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура);
			ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
			                                      + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")");
			
			// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
			ОбластьМакета.Параметры.КодСтавки = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС));
			ОбластьМакета.Параметры.Сумма     = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
			
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				
				Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КодЛьготы) Тогда
					ОбластьМакета.Параметры.КодЛьготы = "99999999";
				КонецЕсли;
				
			Иначе
				
				ОбластьМакета.Параметры.КодЛьготы = "";	
				
			КонецЕсли;
			
			ДанныеОСумме = СтрокаТаблицы.Сумма;
			
			Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
				
				ОбластьМакета.Параметры.Номенклатура = "розподіл сум податкового кредиту за багатосторонньою угодою про розподіл продукції";
				ОбластьМакета.Параметры.КодУКТВЭД = "";
				ОбластьМакета.Параметры.ЕдиницаИзмерения = "";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
				ОбластьМакета.Параметры.Количество = "";
				ОбластьМакета.Параметры.ЦенаБезНДС = "";
				ОбластьМакета.Параметры.КодСтавки = "";
				ОбластьМакета.Параметры.КодЛьготы = "";
				ОбластьМакета.Параметры.Сумма = "";
				
				ДанныеОСумме = 0;
				
			ИначеЕсли Шапка.Сводная = Истина И (Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа) Тогда
					
				ОбластьМакета.Параметры.КодУКТВЭД = "";
				ОбластьМакета.Параметры.Количество = "";
				ОбластьМакета.Параметры.ЦенаБезНДС = "";
				ОбластьМакета.Параметры.КодСтавки = "";
				ОбластьМакета.Параметры.КодЛьготы = "";
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				
				СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
				
				СтрокаСтруктуры.G3S 		= ОбластьМакета.Параметры.Номенклатура;
				СтрокаСтруктуры.G4  		= ОбластьМакета.Параметры.КодУКТВЭД;
				
				СтрокаСтруктуры.G4S     	= ОбластьМакета.Параметры.ЕдиницаИзмерения;
				СтрокаСтруктуры.G105_2S 	= ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
				
				СтрокаСтруктуры.G5 			= ОбластьМакета.Параметры.Количество;
				СтрокаСтруктуры.G6 			= ОбластьМакета.Параметры.ЦенаБезНДС;
				
				СтрокаСтруктуры.G008  		= ОбластьМакета.Параметры.КодСтавки;
				СтрокаСтруктуры.G009  		= ОбластьМакета.Параметры.КодЛьготы;
				СтрокаСтруктуры.G010  		= ДанныеОСумме;
				
			КонецЕсли;
							
		КонецЦикла;
		
		// Выводим подвал накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
		
		// ДРФО того, кто выписал НН
		Для Инд = 1 По 10 Цикл
			ОбластьМакета.Параметры["ИННКтоВыписалНН_"+Инд] = Сред(ИННКтоВыписалНН, Инд, 1);
		КонецЦикла; 
		
		ОбластьМакета.Параметры.ЛьготаНДС = ПечЛьготаНДС;	
		
		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла; 

	Если ПродажаНижеОбычнойЦены Тогда
		
		ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		
		//удалим лишние колонки
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
		
		// переименуем колонки
		ТаблицаНоменклатуры.Колонки.СуммаБезНДСПревышенияРегл.Имя 	 = "Сумма";
		ТаблицаНоменклатуры.Колонки.СуммаНДСПревышенияРегл.Имя		 = "СуммаНДС";
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	    Для Страница = 1 По 1 Цикл
		
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации 
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
			
				ОбластьМакетаЗаголовок.Параметры.Освобожденная = "Без ПДВ";
			
			КонецЕсли;			
			
			ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
			
			ТипПричиныСтр = Формат(Шапка.ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены, "ЧЦ=2; ЧВН=");
			ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Лев(ТипПричиныСтр, 1);
			ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Прав(ТипПричиныСтр, 1);
			
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);

			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 7 Цикл                                  
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомерОЦ, Инд, 1);
			КонецЦикла; 
		
			// код спец. режима
			ОбластьМакета.Параметры.СпецРежим = КодСпецРежима;
			// наименование продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			// ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			// филиал
			Для Инд = 1 По 4 Цикл                                                                 
				ОбластьМакета.Параметры["ФилиалПродавца_"+Инд]    = Сред(ФилиалПродавца, Инд, 1);
			КонецЦикла; 
		
			// название покупателя = продавца
			ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеОрганизации;
			// ИНН покупателя = продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			// Филиал = продавца
			Для Инд = 1 По 4 Цикл                                                                 
				ОбластьМакета.Параметры["ФилиалПокупателя_"+Инд]    = Сред(ФилиалПродавца, Инд, 1);
			КонецЦикла; 
				
			ТабДокумент.Вывести(ОбластьМакета);
 
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G10S",ОбластьМакетаЗаголовок.Параметры.Освобожденная);
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HFILL",	Шапка.Дата);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM",	Прав(ТекНомерОЦ,7));
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM1",	КодСпецРежима);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM2",	ФилиалПродавца);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HFBUY",	ФилиалПродавца);
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMESEL",	ОбластьМакета.Параметры.НазваниеОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMEBUY",	ОбластьМакета.Параметры.НазваниеОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKSEL",	ИННОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKBUY",	ИННОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HBOS",	ПечКтоВыписалНалоговуюНакладную);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKBOS",	ИННКтоВыписалНН);
			

			КонецЕсли;
			
			// Выводим шапку накладной вместе с итогами
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			
			ВремТаблица = ТаблицаНоменклатуры.Скопировать();
			ВремТаблица.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы Из ВремТаблица Цикл
				
				КолонкаДляСуммы = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС));
				
				Если КолонкаДляСуммы = "20" Тогда
					
					ОбластьМакета.Параметры.Сумма20   = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					ОбластьМакета.Параметры.ИтогНДС20 = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R01G7", СтрокаТаблицы.Сумма);
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G7", СтрокаТаблицы.СуммаНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "7" Тогда
					
					ОбластьМакета.Параметры.Сумма7   = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					ОбластьМакета.Параметры.ИтогНДС7 = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R01G109", СтрокаТаблицы.Сумма);
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G109", СтрокаТаблицы.СуммаНДС);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "902" Тогда
					
					ОбластьМакета.Параметры.Сумма0Укр = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R01G8", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "901" Тогда
					
					ОбластьМакета.Параметры.Сумма0Эксп = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R01G9", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				ИначеЕсли КолонкаДляСуммы = "903" Тогда
					
					ОбластьМакета.Параметры.СуммаБезНДС = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма);
					
					Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R01G10", СтрокаТаблицы.Сумма);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ВсегоСумма = 0; ИтогНДС   = 0;
			ВремТаблица.Свернуть("", "Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы из ВремТаблица Цикл
				ВсегоСумма = СтрокаТаблицы.Сумма;
				ИтогНДС    = СтрокаТаблицы.СуммаНДС;
			КонецЦикла;
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ИтогНДС  = ОбщегоНазначения.ФорматСумм(ИтогНДС);
			ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары);
			ОбластьМакета.Параметры.Всего    = ОбщегоНазначения.ФорматСумм(ИтогНДС + ВсегоСумма + СуммаВозвратнойТары);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R04G11", ИтогНДС + ВсегоСумма + СуммаВозвратнойТары);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G11", ИтогНДС);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R02G11", СуммаВозвратнойТары);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			
			Если ЗначениеЗаполнено(КодСпецРежима) Тогда
				ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер) + "/" + СокрЛ(КодСпецРежима);
			Иначе
				ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер);	
			КонецЕсли;
			
			ДопТекст = Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены;
			ДопТекст = СтрЗаменить(ДопТекст,
								   "<визначається автоматично>",
								   ПолныйНомерОсновнойНакладной);
			
			// Выведем на печать все строки таблицы в раздел I
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
					Продолжить
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				
					ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
					
					Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
					    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
						ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
						Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КодЛьготы) Тогда
							ОбластьМакета.Параметры.КодЛьготы = "99999999";
						КонецЕсли;
					Иначе
						ОбластьМакета.Параметры.КодЛьготы = "";	
					КонецЕсли;

				
				ОбластьМакета.Параметры.НомерСтроки = ТаблицаНоменклатуры.Индекс(СтрокаТаблицы) + 1;
				
				
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				//ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
			                                      + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
												  +" "+ ДопТекст;
												  
				Если Шапка.СоглашениеОРазделеПродукции = Истина Тогда
				    ОбластьМакета.Параметры.Номенклатура = "розподіл сум податкового кредиту за багатосторонньою угодою про розподіл продукції"
														  +" "+ ДопТекст;
				КонецЕсли;
																 
																 
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				ОбластьМакета.Параметры.КодСтавки = ОпределитьКодСтавки(ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС));
				ОбластьМакета.Параметры.Сумма     = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
				
				ОбластьМакета.Параметры["ЦенаБезНДС"] = Окр(?(СтрокаТаблицы.Количество = 0, 0, СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество), 2);
				
				ТабДокумент.Вывести(ОбластьМакета);

				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
					
					СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокументЗЦ.R.Добавить();
					
					СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
					СтрокаСтруктуры.G4  = ОбластьМакета.Параметры.КодУКТВЭД;
					
					СтрокаСтруктуры.G4S     = ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G105_2S = ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
					
					СтрокаСтруктуры.G5 = ОбластьМакета.Параметры.Количество;
					СтрокаСтруктуры.G6 = ОбластьМакета.Параметры.ЦенаБезНДС;
					
					СтрокаСтруктуры.G008  = ОбластьМакета.Параметры.КодСтавки;
					//СтрокаСтруктуры.G009  = ОбластьМакета.Параметры.КодЛьготы;
					СтрокаСтруктуры.G010  = СтрокаТаблицы.Сумма;
					
				КонецЕсли;				
				
			КонецЦикла;
		
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
			
			// ДРФО того, кто выписал НН
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["ИННКтоВыписалНН_"+Инд] = Сред(ИННКтоВыписалНН, Инд, 1);
			КонецЦикла; 
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
			
			ТабДокумент.Вывести(ОбластьМакета);

		КонецЦикла; 
		
	КонецЕсли;	
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
КонецФункции 
	
Функция ПечатьДокументаНалоговыйКодекс2015(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета = "НалоговаяНакладнаяАльбом")
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим;
	
	КонтрагентНеРезидент = Контрагент.НеЯвляетсяРезидентом;
	
	Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
	
		СтруктураПоказателей = Новый Структура();
		СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
		СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G2D");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G42");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G7");
		
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G109");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G8");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G9");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G10");
		
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
			
			Сообщить(НСтр("ru = 'Документ является служебным и не может быть выгружен в XML!'; uk = 'Документ є службовим та не може бути вивантажений в XML!'"));
			
			// такие операции не предусматривают выписки налоговых накладных
			Возврат	СтруктураПоказателей;
		КонецЕсли;
		
		Если ПродажаНижеОбычнойЦены Тогда
			СтруктураПоказателей.Вставить("НалоговыйДокументЗЦ", 	Новый Структура());	// данные табличной части по накладной по "обычным ценам"
			СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R",  Новый ТаблицаЗначений());  // данные табличной части
			СтруктураПоказателей.НалоговыйДокументЗЦ.R = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
	|	ЭлектронныйДокумент,
	|	ТипПричиныНевыдачиПокупателю,
	|	ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены,
	|	СпецРежимНалогообложения,
	|	ДоговорКонтрагента.Дата  КАК ДатаДоговора,
	|	ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	Дата,
	|	Контрагент,
	|	Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагент.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН КАК ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН,
	
	|	ДоговорКонтрагента.МногостороннееСоглашениеОРазделеПродукции КАК СоглашениеОРазделеПродукции, 
	
	|	Организация,
	|	ЛьготаНДС,
	|	УсловиеПродажи,
	|	ВидДоговора,
	|	ФормаРасчетов,
	|	ВидОперации,
	|	ОбособленноеПодразделение.НаименованиеДляНалоговыхДокументов КАК НаименованиеФилиала,
	|	ОбособленноеПодразделение.Префикс КАК Префикс,
	|	УслугиНерезидентаДляНехозДеят КАК УслугиНерезидентаДляНехозДеят,
	|	ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
	|	ПодтверждаетсяГТД,
	|	ПоставкаДипПредставительству,
	|	КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную
	|ИЗ
	|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
	|
	|ГДЕ
	|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН = Ложь;
	//УчетнаяПолитикаНеЗадана = Ложь;
	//УчетнаяПолитика	= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	//Если НЕ УчетнаяПолитикаНеЗадана тогда
	//	ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН = УчетнаяПолитика.ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН;
	//КонецЕсли;
	
	ДополнениеКНаименованиюОрганизации = "";
	ДополнениеКАдресуОрганизации = "";
	//Если  ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН = Истина
	//	И ЗначениеЗаполнено(Шапка.ГоловнаяОрганизация) Тогда
	//	
	//	СведенияОГоловнойОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ГоловнаяОрганизация, Шапка.Дата);
	//	
	//	ДополнениеКНаименованиюОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловнойОрганизации,    "ПолноеНаименование,",Ложь) 			+ " - " ;
	//	ДополнениеКАдресуОрганизации       = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловнойОрганизации,    "ЮридическийАдресПочтовый,",  Ложь)  + " - " ;
	//
	//КонецЕсли;
	Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
		СведенияОГоловномКонтрагентеПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ГоловнойКонтрагент, Шапка.Дата);	
	КонецЕсли;
	
	// Подготовим таблицы
	Отказ = Ложь;
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати  = "ПАРАМЕТРЫ_ПЕЧАТИ_НалоговаяНакладная_2015" + ИмяМакета;

	Макет = ПолучитьМакет("НалоговаяНакладная2015");
	Если ИмяМакета = "НалоговаяНакладнаяАльбом" Тогда
		Макет = ПолучитьМакет("НалоговаяНакладная2015Альбом");	
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	Макет.КодЯзыкаМакета = "ru";
	
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим);

	// Загрузим все таблицы (кроме тары) в одну таблицу
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПрочим, ТаблицаНоменклатуры);	
	
	// свернем подобные строки                                                                   
	ТаблицаНоменклатуры.Свернуть("ДатаОтгрузкиОплаты, Номенклатура, Характеристика, КодУКТВЭД, ЕдиницаИзмерения, ЕдиницаИзмеренияКод, ЦенаБезНДСРегл, СтавкаНДС", "Количество, СуммаБезНДСРегл, СуммаНДСРегл, СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");   	
	// переименуем колонки
	ТаблицаНоменклатуры.Колонки.ЦенаБезНДСРегл.Имя 				 = "ЦенаБезНДС";
	ТаблицаНоменклатуры.Колонки.СуммаБезНДСРегл.Имя 			 = "Сумма";
	ТаблицаНоменклатуры.Колонки.СуммаНДСРегл.Имя				 = "СуммаНДС";
	
	// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
	ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
	// определим параметры шапки документа
	//Дата
	ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
	
	// Номер
	ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
	Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
	    ТекНомерОЦ = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены)), 7);
	Иначе	
		ТекНомерОЦ = ТекНомер;
	КонецЕсли;
	
	// филиал/спецрежим
	ТекНомерФилиал = "";
	КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
	НомерФилиала  = ?(ЗначениеЗаполнено(Шапка.Префикс), Прав("    " + Формат(Число(Шапка.Префикс),"ЧЦ=4; ЧГ=0"), 4), "");  //число  4 символа, без лидирующих нулей
	Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
		ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
	КонецЕсли;
	
	// номер договора
	ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
	
	// дата договора
	ТекДатаДоговора = Шапка.ДатаДоговора;
	Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
		ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
	Иначе
		ТекДатаДоговора = "";
	КонецЕсли;
	
	////////////////////////////////////////////
	// Продавец
	
	// ИНН, Номер свидетельства, Наименование, Адрес
	Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		// налоговые реквизиты не указыватюся
		СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		ИННОрганизации					= ?(Шапка.УслугиНерезидентаДляНехозДеят = Истина, "200000000000", "500000000000");
		НазваниеОрганизации				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце, "ПолноеНаименование,",Ложь);
		Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
			НазваниеОрганизации         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь) 		
										  + " - " + НазваниеОрганизации;
		КонецЕсли;
		
		// вместо адреса - просто страна нерезидента
		АдресОрганизации = "";
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Вид"   , Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		Запрос.УстановитьПараметр("Объект", Шапка.Контрагент);
		Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		               |	КонтактнаяИнформация.Поле1,
		               |	КонтактнаяИнформация.Поле10
		               |ИЗ
		               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		               |ГДЕ
		               |	КонтактнаяИнформация.Объект = &Объект
		               |	И КонтактнаяИнформация.Тип = &Тип
		               |	И КонтактнаяИнформация.Вид = &Вид";
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Поле1  = РезультатЗапроса.Выгрузить()[0].Поле1;
			Поле10 = РезультатЗапроса.Выгрузить()[0].Поле10;
			Если  ЗначениеЗаполнено(Поле1) Тогда
				Если Найти("0123456789", Лев(СокрЛ(Поле1), 1)) > 0 Тогда
					// в Поле1 находится индекс
					АдресОрганизации = Поле10;
				Иначе
					АдресОрганизации = Поле1;
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Поле10) Тогда
				АдресОрганизации = Поле10;
			КонецЕсли;
			АдресОрганизации = СокрЛП(АдресОрганизации);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(АдресОрганизации) Тогда
			Сообщить("" + Шапка.Контрагент + ": " + НСтр("ru='Не указана страна регистрации контрагента-нерезидента (в контактной информации)! Адрес в налоговой накладной заполнен не будет!';uk='Не вказана країна реєстрації контрагента-нерезидента (у контактній інформації)! Адреса в податковій накладній заповнена не буде!'"));
		КонецЕсли;
		
		// остальные данные (телефон) не заполняется
		ТекТелефоныОрганизации = "";
		
	Иначе	
		
		СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
		НазваниеОрганизации				= ДополнениеКНаименованиюОрганизации + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		АдресОрганизации 				= ДополнениеКАдресуОрганизации 		 + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдресПочтовый,",  Ложь);
		
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			НазваниеОрганизации = НазваниеОрганизации + Шапка.НаименованиеФилиала;	
		КонецЕсли;
		
		ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце, "Телефоны,", Ложь);
		
	КонецЕсли;
	ИННОрганизации 				  = Прав("            " + ИННОрганизации, 12);
	
	// телефон
	ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
	ДлинаСтрокиТелефоновОрганизации = СтрДлина(ТекТелефоныОрганизации);
	
	
	////////////////////////////////////////////
	// покупатель
	
	// Название, адрес, номер свидетельства, ИНН
	Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
		ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		// в этом случае контрагентом выступает организация
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		НазваниеКонтрагента				= ДополнениеКНаименованиюОрганизации + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
		АдресКонтрагента 				= ДополнениеКАдресуОрганизации 		 + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдресПочтовый,",  Ложь);
		Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			ИННКонтрагента 				  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		Иначе	
			ИННКонтрагента 				  = "400000000000";
		КонецЕсли;
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			НазваниеКонтрагента = НазваниеКонтрагента + Шапка.НаименованиеФилиала;	
		КонецЕсли;
		
		ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);

	Иначе
		
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		
		НазваниеКонтрагента				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
		АдресКонтрагента 				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдресПочтовый,",  Ложь);
		Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
			НазваниеКонтрагента         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь)
										  + " - " + НазваниеКонтрагента;
			АдресКонтрагента 			= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ЮридическийАдресПочтовый,",  Ложь)	
										  + " - " + АдресКонтрагента;
		КонецЕсли;
		
		ИННКонтрагента 				  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		
		ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
		
		Если  Шапка.ПоставкаДипПредставительству = Истина 
			И Шапка.ТипПричиныНевыдачиПокупателю <=2 Тогда
			
			ИННКонтрагента = "400000000000";
			
		ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 7 Тогда
			
			// поставка на экспорт
			ИННКонтрагента = "300000000000";
			// вместо адреса - просто страна нерезидента
			АдресКонтрагента = "";
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Вид"   , Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
			Запрос.УстановитьПараметр("Объект", Шапка.Контрагент);
			Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			               |	КонтактнаяИнформация.Поле1,
			               |	КонтактнаяИнформация.Поле10
			               |ИЗ
			               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			               |ГДЕ
			               |	КонтактнаяИнформация.Объект = &Объект
			               |	И КонтактнаяИнформация.Тип = &Тип
			               |	И КонтактнаяИнформация.Вид = &Вид";
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				Поле1  = РезультатЗапроса.Выгрузить()[0].Поле1;
				Поле10 = РезультатЗапроса.Выгрузить()[0].Поле10;
				Если  ЗначениеЗаполнено(Поле1) Тогда
					Если Найти("0123456789", Лев(СокрЛ(Поле1), 1)) > 0 Тогда
						// в Поле1 находится индекс
						АдресКонтрагента = Поле10;
					Иначе
						АдресКонтрагента = Поле1;
					КонецЕсли;
				ИначеЕсли ЗначениеЗаполнено(Поле10) Тогда
					АдресКонтрагента = Поле10;
				КонецЕсли;
				АдресКонтрагента = СокрЛП(АдресКонтрагента);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(АдресКонтрагента) Тогда
				Сообщить("" + Шапка.Контрагент + ": " + НСтр("ru='Не указана страна регистрации контрагента-нерезидента (в контактной информации)! Адрес в налоговой накладной заполнен не будет!';uk='Не вказана країна реєстрації контрагента-нерезидента (у контактній інформації)! Адреса в податковій накладній заповнена не буде!'"));
			КонецЕсли;
							
			ТекТелефоныКонтрагента = "";

		ИначеЕсли НЕ ЗначениеЗаполнено(ИННКонтрагента)
				 ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
			ИННКонтрагента = "100000000000";
			НазваниеКонтрагента = "Неплатник";
			АдресКонтрагента = "";
			ТекТелефоныКонтрагента = "";
			
		КонецЕсли;
		
	КонецЕсли; 
	
	ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
	
	// телефон
	ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
	ДлинаСтрокиТелефоновКонтрагентов = СтрДлина(ТекТелефоныКонтрагента);
	
	// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
	ПечКтоВыписалНалоговуюНакладную = "";
	ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
	Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
		ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
										 + ". "
										 + ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
										 + ". "
										 + СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
	Иначе
		ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
	КонецЕсли;
	
	Для Страница = 1 По 1 Цикл
		
		ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
		
		ОбластьМакетаЗаголовок.Параметры.СоглашениеОРазделеПродукции = ?(Шапка.СоглашениеОРазделеПродукции = Истина, "Х", "");
		
		Если  НЕ Шапка.ТипПричиныНевыдачиПокупателю = 0 Тогда
			// накладная остается у поставщика
			ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
			ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
			ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
		
		// Выводим отступ
		ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим заголовок накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		//Дата
		Для Инд = 1 По 8 Цикл
			ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
		КонецЦикла; 
		
		// Номер
		Для Инд = 1 По 7 Цикл                                                                 
			ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
		КонецЦикла; 
		
		// филиал/спецрежим 
		Для Инд = 1 По 5 Цикл                                                                 
			ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
		КонецЦикла; 
		
		// наименование продавца
		ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
		
		// адрес продавца
		ОбластьМакета.Параметры.АдресОрганизации    = АдресОрганизации;
		
		// телефон продавца
		Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
			ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
		КонецЦикла;
		
		// ИНН продавца
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
		КонецЦикла; 
		
		// название покупателя
		ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеКонтрагента;
		
		// адрес покупателя
		ОбластьМакета.Параметры.АдресКонтрагента    = АдресКонтрагента;
		
		// телефон покупателя
		Для НомерСимвола = 1 По ДлинаСтрокиТелефоновКонтрагентов ЦИкл
			ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
		КонецЦикла;
		// ИНН покупателя
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
		КонецЦикла; 
		
		// номер договора
		ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
		
		// дата договора
		Для Инд = 1 По 8 Цикл
			ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
		КонецЦикла; 
		
		ТабДокумент.Вывести(ОбластьМакета);

		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H_1", ОбластьМакетаЗаголовок.Параметры.СоглашениеОРазделеПродукции);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	Лев(ТекНомерФилиал, 1));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	Сред(ТекНомерФилиал, 2));
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	ОбластьМакета.Параметры.НазваниеОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	ОбластьМакета.Параметры.НазваниеКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCSEL",	ОбластьМакета.Параметры.АдресОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCBUY",	ОбластьМакета.Параметры.АдресКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELSEL",	ТекТелефоныОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELBUY",	ТекТелефоныКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G1S",	ОбластьМакета.Параметры.ВидДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G2D",	Шапка.ДатаДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G3S",	ТекНомерДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H02G1S",	ОбластьМакета.Параметры.ФормаРасчетов);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H10G1S",	ПечКтоВыписалНалоговуюНакладную);
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	Шапка.ЛьготаНДС);	
			Иначе
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	"");	
			КонецЕсли;
 			
		КонецЕсли;
				
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ТабДокумент.Вывести(ОбластьМакета);
		
		ЭтоПерваяСтрока = Истина;
		// Выведем на печать все строки таблицы в раздел I
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			
			Если ЭтоПерваяСтрока Тогда	
				// в первой строке раздела укажем номер раздела
				ОбластьМакета.Параметры.НомерРаздела = "I";
				ЭтоПерваяСтрока = Ложь;
			Иначе
				ОбластьМакета.Параметры.НомерРаздела = "";
			КонецЕсли;	
			
			ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
			
			ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
			
			// дата отгрузки/оплаты
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
				// укажем дату выписки накладной
				ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И Страница = 1 Тогда
				Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
			КонецЕсли;
			
			ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
												+ ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")");
			
			// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
			Колонка = "Сумма" + ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
				СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
				СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
				
				СтрокаСтруктуры.G4 = ОбластьМакета.Параметры.КодУКТВЭД;
				
				СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
				СтрокаСтруктуры.G42 = ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
				СтрокаСтруктуры.G5  = ОбластьМакета.Параметры.Количество;
				СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
				
				КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				Если КолонкаДляСуммы = "20" Тогда
					СтрокаСтруктуры.G7  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "7" Тогда
					СтрокаСтруктуры.G109  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
					СтрокаСтруктуры.G8  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
					СтрокаСтруктуры.G9  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
					СтрокаСтруктуры.G10 = СтрокаТаблицы.Сумма;	
				КонецЕсли;
				
			КонецЕсли;
							
		КонецЦикла;
		
	
		// Выводми итог по I разделу и раздел II
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
		
		Сумма1разд = 0;
		
		// Получим итоговые суммы по товарам
		ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			
			Сумма = СтрокаТаблицы.Сумма; 
			
			Колонка = "Сумма"; 
			Сумма1разд = Сумма1разд + Сумма;
			
			ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
			
		КонецЦикла;	
		
		// колонка 11 по товарам (раздел I)
		ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
		ТабДокумент.Вывести(ОбластьМакета);

		
		// Выводим раздел II (тара)
		ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
		ТаблицаПоТаре.Свернуть("", "СуммаСНДСРегл");
		
		СуммаВозвратнойТары = 0;
		Для каждого СтрокаТаблицы из ТаблицаПоТаре Цикл
			//В таблице не более одной строки
			СуммаВозвратнойТары = СтрокаТаблицы.СуммаСНДСРегл;
		КонецЦикла;
		ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары);
		
		ТабДокумент.Вывести(ОбластьМакета);		
		
		Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G11",	СуммаВозвратнойТары);
			
		КонецЕсли;
		
		// Выводим разделы III - IV (итоги)
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		
		ИтогНДС = 0;
		Всего = СуммаВозвратнойТары;
		
		// в макете жестко прописан крестик, но п. 13 говорит иногда делать в этом поле пометку...
		ОбластьМакета.Параметры["ИтогНДСБезНДС"] = "";
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			
			// Итоги
			Если СуффиксКолонки = "20" ИЛИ СуффиксКолонки = "7" Тогда
				ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
			ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
				// п.13 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
				ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
			КонецЕсли;
			ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
			
			Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				Если СуффиксКолонки = "20" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "7" Тогда               
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G109",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда           
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",	"Без ПДВ");
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;
		
		// Итоги в 11 колонке
		ТаблицаНоменклатуры.Свернуть("","Сумма,СуммаНДС");
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			//в таблице не более одной строки
			ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
			Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
		КонецЦикла;
		ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
		ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
		
		ТабДокумент.Вывести(ОбластьМакета);	
		
		// Выводим подвал накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
		
		Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
		    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
			ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
			ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

	КонецЦикла; 

	Если ПродажаНижеОбычнойЦены Тогда
		
		ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		
		//удалим лишние колонки
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
		
		// переименуем колонки
		ТаблицаНоменклатуры.Колонки.СуммаБезНДСПревышенияРегл.Имя 	 = "Сумма";
		ТаблицаНоменклатуры.Колонки.СуммаНДСПревышенияРегл.Имя		 = "СуммаНДС";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	    Для Страница = 1 По 1 Цикл
		
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
			
			ТипПричиныСтр = Формат(Шапка.ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены, "ЧЦ=2; ЧВН=");
			ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Лев(ТипПричиныСтр, 1);
			ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Прав(ТипПричиныСтр, 1);
			
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);

			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 7 Цикл                                  
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомерОЦ, Инд, 1);
			КонецЦикла; 
			
			// спецрежим/филиал
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла; 
						
			// наименование продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			
			// адрес продавца
			ОбластьМакета.Параметры.АдресОрганизации    = АдресОрганизации;
			
			// телефон продавца
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;
			
			// ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// данные покупателя равны данным поставщика
			
			// название покупателя                        
			ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеОрганизации;
			
			// адрес покупателя                           
			ОбластьМакета.Параметры.АдресКонтрагента    = АдресОрганизации;
			
			// телефон покупателя                       
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл                      
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;

			// ИНН покупателя
			Для Инд = 1 По 12 Цикл                                       
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// номер договора
			ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
			
			// дата договора
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
			КонецЦикла;

			ТабДокумент.Вывести(ОбластьМакета);
 
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HFILL",	Шапка.Дата);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM",	Прав(ТекНомерОЦ,7));
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM1",	Лев(ТекНомерФилиал, 1));
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM2",	Сред(ТекНомерФилиал, 2));
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMESEL",	НазваниеОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMEBUY",	НазваниеОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKSEL",		ИННОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKBUY",		ИННОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCSEL",	АдресОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCBUY",	АдресОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELSEL",	ТекТелефоныОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELBUY",	ТекТелефоныОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G1S",	ОбластьМакета.Параметры.ВидДоговора);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G2D",	Шапка.ДатаДоговора);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G3S",	ТекНомерДоговора);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H02G1S",	ОбластьМакета.Параметры.ФормаРасчетов);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H10G1S",	ПечКтоВыписалНалоговуюНакладную);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R003G10S",	"");	
	 			
			КонецЕсли;
			
			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			
			ЭтоПерваяСтрока = Истина;
			
			Если ЗначениеЗаполнено(НомерФилиала) Тогда
				ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер) + "/" + СокрЛ(КодСпецРежима) + "/" + СокрЛ(НомерФилиала);
			ИначеЕсли ЗначениеЗаполнено(КодСпецРежима) Тогда
				ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер) + "/" + СокрЛ(КодСпецРежима);
			Иначе
				ПолныйНомерОсновнойНакладной = СокрЛ(ТекНомер);	
			КонецЕсли;
			
			ДопТекст = Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены;
			ДопТекст = СтрЗаменить(ДопТекст,
								   "<визначається автоматично>",
								   ПолныйНомерОсновнойНакладной);
			
			// Выведем на печать все строки таблицы в раздел I
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
					Продолжить
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
					
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				// номенклатура с учетом текста дополнения
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
	 												 + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
													 +" "+ ДопТекст;
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
				
				ОбластьМакета.Параметры["ЦенаБезНДС"] = Окр(?(СтрокаТаблицы.Количество = 0, 0, СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество), 2);
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокументЗЦ.R.Добавить();
					СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
					СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
					
					СтрокаСтруктуры.G4 = ОбластьМакета.Параметры.КодУКТВЭД;
					
					СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G42 = ОбластьМакета.Параметры.ЕдиницаИзмеренияКод;
					
					СтрокаСтруктуры.G5  = ОбластьМакета.Параметры.Количество;
					СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
					
					КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
					Если КолонкаДляСуммы = "20" Тогда
						СтрокаСтруктуры.G7  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "7" Тогда
						СтрокаСтруктуры.G109  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
						СтрокаСтруктуры.G8  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
						СтрокаСтруктуры.G9  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
						СтрокаСтруктуры.G10 = СтрокаТаблицы.Сумма;	
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
		
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
			
			Сумма1разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.Сумма; 
			
				Колонка = "Сумма"; 
				Сумма1разд = Сумма1разд + Сумма;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
				
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел I)
			ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим раздел II (тара)
			ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары);
			
			ТабДокумент.Вывести(ОбластьМакета);		
			
			// Выводим разделы III..IV
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
			
			ИтогНДС = 0;
			Всего = СуммаВозвратнойТары;
			ОбластьМакета.Параметры["ИтогНДСБезНДС"] = "";
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				
				// Итоги
				Если СуффиксКолонки = "20" ИЛИ СуффиксКолонки = "7" Тогда
					ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
					// п.13 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
				
				Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					Если СуффиксКолонки = "20" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "7" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G109",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G10S",	"Без ПДВ");
					КонецЕсли;
					
				КонецЕсли;
							
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
			
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);

		КонецЦикла; 
		
	КонецЕсли;	
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
КонецФункции 
	
Функция ПечатьДокументаНалоговыйКодекс2014Мес12(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета = "НалоговаяНакладнаяАльбом")
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим;
	
	КонтрагентНеРезидент = Контрагент.НеЯвляетсяРезидентом;
	
	Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
	
		СтруктураПоказателей = Новый Структура();
		СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
		СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G2D");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G7");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G109");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G8");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G9");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G10");
		
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
			// такие операции не предусматривают выписки налоговых накладных
			Возврат	СтруктураПоказателей;
		КонецЕсли;
		
		Если ПродажаНижеОбычнойЦены Тогда
			СтруктураПоказателей.Вставить("НалоговыйДокументЗЦ", 	Новый Структура());	// данные табличной части по накладной по "обычным ценам"
			СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R",  Новый ТаблицаЗначений());  // данные табличной части
			СтруктураПоказателей.НалоговыйДокументЗЦ.R = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
		КонецЕсли;
		
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
	|	ЭлектронныйДокумент,
	|	ТипПричиныНевыдачиПокупателю,
	|	СпецРежимНалогообложения,
	|	ДоговорКонтрагента.Дата  КАК ДатаДоговора,
	|	ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	Дата,
	|	Контрагент,
	|	Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагент.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН КАК ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН,
	|	Организация,
	|	ЛьготаНДС,
	|	УсловиеПродажи,
	|	ВидДоговора,
	|	ФормаРасчетов,
	|	ВидОперации,
	|	ОбособленноеПодразделение.НаименованиеДляНалоговыхДокументов КАК НаименованиеФилиала,
	|	ОбособленноеПодразделение.Префикс КАК Префикс,
	|	УслугиНерезидентаДляНехозДеят КАК УслугиНерезидентаДляНехозДеят,
	|	ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
	|	ПодтверждаетсяГТД,
	|	ПоставкаДипПредставительству,
	|	КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную
	|ИЗ
	|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
	|
	|ГДЕ
	|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН = Ложь;
	//УчетнаяПолитикаНеЗадана = Ложь;
	//УчетнаяПолитика	= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация);
	//Если НЕ УчетнаяПолитикаНеЗадана тогда
	//	ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН = УчетнаяПолитика.ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН;
	//КонецЕсли;
	
	ДополнениеКНаименованиюОрганизации = "";
	ДополнениеКАдресуОрганизации = "";
	//Если  ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН = Истина
	//	И ЗначениеЗаполнено(Шапка.ГоловнаяОрганизация) Тогда
	//	
	//	СведенияОГоловнойОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ГоловнаяОрганизация, Шапка.Дата);
	//	
	//	ДополнениеКНаименованиюОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловнойОрганизации,    "ПолноеНаименование,",Ложь) 			+ " - " ;
	//	ДополнениеКАдресуОрганизации       = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловнойОрганизации,    "ЮридическийАдресПочтовый,",  Ложь)  + " - " ;
	//
	//КонецЕсли;
	Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
		СведенияОГоловномКонтрагентеПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ГоловнойКонтрагент, Шапка.Дата);	
	КонецЕсли;
	
	// Подготовим таблицы
	Отказ = Ложь;
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати  = "ПАРАМЕТРЫ_ПЕЧАТИ_НалоговаяНакладная_2014_Мес12" + ИмяМакета;

	Макет = ПолучитьМакет("НалоговаяНакладная2014Мес12");
	Если ИмяМакета = "НалоговаяНакладнаяАльбом" Тогда
		Макет = ПолучитьМакет("НалоговаяНакладная2014Мес12Альбом");	
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	Макет.КодЯзыкаМакета = "ru";
	
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим);

	// Загрузим все таблицы (кроме тары) в одну таблицу
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПрочим, ТаблицаНоменклатуры);	

	
	// свернем подобные строки
	ТаблицаНоменклатуры.Свернуть("ДатаОтгрузкиОплаты, Номенклатура, Характеристика, КодУКТВЭД, ЕдиницаИзмерения, ЦенаБезНДСРегл, СтавкаНДС", "Количество, СуммаБезНДСРегл, СуммаНДСРегл, СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");	
	
	// переименуем колонки
	ТаблицаНоменклатуры.Колонки.ЦенаБезНДСРегл.Имя 				 = "ЦенаБезНДС";
	ТаблицаНоменклатуры.Колонки.СуммаБезНДСРегл.Имя 			 = "Сумма";
	ТаблицаНоменклатуры.Колонки.СуммаНДСРегл.Имя				 = "СуммаНДС";
	
	// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
	ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
	// определим параметры шапки документа
	//Дата
	ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
	
	// Номер
	ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
	Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
	    ТекНомерОЦ = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены)), 7);
	Иначе	
		ТекНомерОЦ = ТекНомер;
	КонецЕсли;
	
	// филиал/спецрежим
	ТекНомерФилиал = "";
	КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
	НомерФилиала  = ?(ЗначениеЗаполнено(Шапка.Префикс), Прав("    " + Формат(Число(Шапка.Префикс),"ЧЦ=4; ЧГ=0"), 4), "");  //число  4 символа, без лидирующих нулей
	Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
		ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
	КонецЕсли;
	
	// номер договора
	ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
	
	// дата договора
	ТекДатаДоговора = Шапка.ДатаДоговора;
	Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
		ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
	Иначе
		ТекДатаДоговора = "";
	КонецЕсли;
	
	////////////////////////////////////////////
	// Продавец
	
	// ИНН, Номер свидетельства, Наименование, Адрес
	Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		// налоговые реквизиты не указыватюся
		СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		ИННОрганизации					= ?(Шапка.УслугиНерезидентаДляНехозДеят = Истина, "200000000000", "300000000000");
		НазваниеОрганизации				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
			НазваниеОрганизации         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь) 		
										  + " - " + НазваниеОрганизации;
		КонецЕсли;
		
		// вместо адреса - просто страна нерезидента
		АдресОрганизации = "";
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Вид"   , Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
		Запрос.УстановитьПараметр("Объект", Шапка.Контрагент);
		Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		               |	КонтактнаяИнформация.Поле1,
		               |	КонтактнаяИнформация.Поле10
		               |ИЗ
		               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		               |ГДЕ
		               |	КонтактнаяИнформация.Объект = &Объект
		               |	И КонтактнаяИнформация.Тип = &Тип
		               |	И КонтактнаяИнформация.Вид = &Вид";
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Поле1  = РезультатЗапроса.Выгрузить()[0].Поле1;
			Поле10 = РезультатЗапроса.Выгрузить()[0].Поле10;
				Если  ЗначениеЗаполнено(Поле1) Тогда
					Если Найти("0123456789", Лев(СокрЛ(Поле1), 1)) > 0 Тогда
						// в Поле1 находится индекс
						АдресКонтрагента = Поле10;
					Иначе
						АдресКонтрагента = Поле1;
					КонецЕсли;
				ИначеЕсли ЗначениеЗаполнено(Поле10) Тогда
					АдресКонтрагента = Поле10;
				КонецЕсли;
			АдресОрганизации = СокрЛП(АдресОрганизации);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(АдресОрганизации) Тогда
			Сообщить("" + Шапка.Контрагент + ": " + НСтр("ru='Не указана страна регистрации контрагента-нерезидента (в контактной информации)! Адрес в налоговой накладной заполнен не будет!';uk='Не вказана країна реєстрації контрагента-нерезидента (у контактній інформації)! Адреса в податковій накладній заповнена не буде!'"));
		КонецЕсли;
		
		// остальные данные (телефон) не заполняется
		ТекТелефоныОрганизации = "";
		
	Иначе	
		
		СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
		НазваниеОрганизации				= ДополнениеКНаименованиюОрганизации + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		АдресОрганизации 				= ДополнениеКАдресуОрганизации 		 + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдресПочтовый,",  Ложь);
		
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			НазваниеОрганизации = НазваниеОрганизации + Шапка.НаименованиеФилиала;	
		КонецЕсли;
		
		ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце, "Телефоны,", Ложь);
		
	КонецЕсли;
	ИННОрганизации 				  = Прав("            " + ИННОрганизации, 12);
	
	// телефон
	ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
	ДлинаСтрокиТелефоновОрганизации = СтрДлина(ТекТелефоныОрганизации);
	
	
	////////////////////////////////////////////
	// покупатель
	
	// Название, адрес, номер свидетельства, ИНН
	Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
		ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		// в этом случае контрагентом выступает организация
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		НазваниеКонтрагента				= ДополнениеКНаименованиюОрганизации + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
		АдресКонтрагента 				= ДополнениеКАдресуОрганизации 		 + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдресПочтовый,",  Ложь);
		Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			ИННКонтрагента 				  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		Иначе	
			ИННКонтрагента 				  = "400000000000";
		КонецЕсли;
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			НазваниеКонтрагента = НазваниеКонтрагента + Шапка.НаименованиеФилиала;	
		КонецЕсли;
		
		ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);

	Иначе
		
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		
		НазваниеКонтрагента				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
		АдресКонтрагента 				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдресПочтовый,",  Ложь);
		Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
			НазваниеКонтрагента         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь)
										  + " - " + НазваниеКонтрагента;
			АдресКонтрагента 			= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ЮридическийАдресПочтовый,",  Ложь)	
										  + " - " + АдресКонтрагента;
		КонецЕсли;
		
		ИННКонтрагента 				  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		
		ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
		
		Если  Шапка.ПоставкаДипПредставительству = Истина 
			И Шапка.ТипПричиныНевыдачиПокупателю <=2 Тогда
			
			ИННКонтрагента = "400000000000";
			
		ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 7 Тогда
			
			// поставка на экспорт
			ИННКонтрагента = "300000000000";
			// вместо адреса - просто страна нерезидента
			АдресКонтрагента = "";
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Вид"   , Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
			Запрос.УстановитьПараметр("Объект", Шапка.Контрагент);
			Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			               |	КонтактнаяИнформация.Поле1,
			               |	КонтактнаяИнформация.Поле10
			               |ИЗ
			               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			               |ГДЕ
			               |	КонтактнаяИнформация.Объект = &Объект
			               |	И КонтактнаяИнформация.Тип = &Тип
			               |	И КонтактнаяИнформация.Вид = &Вид";
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				Поле1  = РезультатЗапроса.Выгрузить()[0].Поле1;
				Поле10 = РезультатЗапроса.Выгрузить()[0].Поле10;
				Если  ЗначениеЗаполнено(Поле1)
					И Найти("0123456789", Лев(СокрЛ(Поле1), 1)) > 0 Тогда
					// в Поле1 находится индекс
					АдресКонтрагента = Поле10;
				Иначе
					АдресКонтрагента = Поле1;
				КонецЕсли;
				АдресКонтрагента = СокрЛП(АдресКонтрагента);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(АдресКонтрагента) Тогда
				Сообщить("" + Шапка.Контрагент + ": " + НСтр("ru='Не указана страна регистрации контрагента-нерезидента (в контактной информации)! Адрес в налоговой накладной заполнен не будет!';uk='Не вказана країна реєстрації контрагента-нерезидента (у контактній інформації)! Адреса в податковій накладній заповнена не буде!'"));
			КонецЕсли;
							
			ТекТелефоныКонтрагента = "";

		ИначеЕсли НЕ ЗначениеЗаполнено(ИННКонтрагента)
				 ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
			
			ИННКонтрагента = "400000000000";
			НазваниеКонтрагента = "Неплатник";
			АдресКонтрагента = "";
			ТекТелефоныКонтрагента = "";
			
		КонецЕсли;
		
	КонецЕсли; 
	
	ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
	
	// телефон
	ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
	ДлинаСтрокиТелефоновКонтрагентов = СтрДлина(ТекТелефоныКонтрагента);
	
	// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
	ПечКтоВыписалНалоговуюНакладную = "";
	ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
	Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
		ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
										 + ". "
										 + ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
										 + ". "
										 + СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
	Иначе
		ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
	КонецЕсли;
	
	Для Страница = 1 По 2 Цикл
		
		Если  Страница = 2 Тогда
			Если     ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента 
				ИЛИ (Шапка.ЭлектронныйДокумент И НЕ Шапка.ПодтверждаетсяГТД) Тогда
				// печатаем в одном экземпляре
				Продолжить;
			КонецЕсли;
			
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			
		КонецЕсли;
		
		ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
		ОбластьМакетаЗаголовок.Параметры.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Шапка.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных;
		ОбластьМакетаЗаголовок.Параметры.ЭлектронныйДокумент 							 = Шапка.ЭлектронныйДокумент И НЕ Шапка.ПодтверждаетсяГТД;
		Если Шапка.ЭлектронныйДокумент = Ложь ИЛИ Шапка.ПодтверждаетсяГТД = Истина Тогда
			Если Страница = 2 Тогда
				// копия - всегда остается у продавца
				ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца  = "Х";
				
			Иначе
				
				// оргинал
				Если  Шапка.ТипПричиныНевыдачиПокупателю = 0 ИЛИ Шапка.ТипПричиныНевыдачиПокупателю = 1 Тогда
					
					// НН, для которой тип причины невыдачи - продажа ниже обычных цен выдается покупателю, вторая пара накладных (собстенно на превышение) - нет
					ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
				
				Иначе
					
					// накладная остается у поставщика
					ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
					ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
					ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
		
		// Выводим отступ
		ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим заголовок накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		//Дата
		Для Инд = 1 По 8 Цикл
			ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
		КонецЦикла; 
		
		// Номер
		Для Инд = 1 По 7 Цикл                                                                 
			ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
		КонецЦикла; 
		
		// филиал/спецрежим 
		Для Инд = 1 По 5 Цикл                                                                 
			ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
		КонецЦикла; 
		
		// наименование продавца
		ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
		
		// адрес продавца
		ОбластьМакета.Параметры.АдресОрганизации    = АдресОрганизации;
		
		// телефон продавца
		Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
			ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
		КонецЦикла;
		
		// ИНН продавца
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
		КонецЦикла; 
		
		// название покупателя
		ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеКонтрагента;
		
		// адрес покупателя
		ОбластьМакета.Параметры.АдресКонтрагента    = АдресКонтрагента;
		
		// телефон покупателя
		Для НомерСимвола = 1 По ДлинаСтрокиТелефоновКонтрагентов ЦИкл
			ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
		КонецЦикла;
		// ИНН покупателя
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
		КонецЦикла; 
		
		// номер договора
		ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
		
		// дата договора
		Для Инд = 1 По 8 Цикл
			ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
		КонецЦикла; 
		
		ТабДокумент.Вывести(ОбластьМакета);

		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG",	ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HERPN",	Формат(ОбластьМакетаЗаголовок.Параметры.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных, "БЛ=; БИ=Х"));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HEL",	    Формат(ОбластьМакетаЗаголовок.Параметры.ЭлектронныйДокумент, "БЛ=; БИ=Х"));
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HCOPY",	ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	Лев(ТекНомерФилиал, 1));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	Сред(ТекНомерФилиал, 2));
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	ОбластьМакета.Параметры.НазваниеОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	ОбластьМакета.Параметры.НазваниеКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCSEL",	ОбластьМакета.Параметры.АдресОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCBUY",	ОбластьМакета.Параметры.АдресКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELSEL",	ТекТелефоныОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELBUY",	ТекТелефоныКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G1S",	ОбластьМакета.Параметры.ВидДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G2D",	Шапка.ДатаДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G3S",	ТекНомерДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H02G1S",	ОбластьМакета.Параметры.ФормаРасчетов);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H10G1S",	ПечКтоВыписалНалоговуюНакладную);
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	Шапка.ЛьготаНДС);	
			Иначе
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	"");	
			КонецЕсли;
 			
		КонецЕсли;
				
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ТабДокумент.Вывести(ОбластьМакета);
		
				
		
		ЭтоПерваяСтрока = Истина;
		// Выведем на печать все строки таблицы в раздел I
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			
			Если ЭтоПерваяСтрока Тогда	
				// в первой строке раздела укажем номер раздела
				ОбластьМакета.Параметры.НомерРаздела = "I";
				ЭтоПерваяСтрока = Ложь;
			Иначе
				ОбластьМакета.Параметры.НомерРаздела = "";
			КонецЕсли;	
			
			ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
			
			ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
			
			// дата отгрузки/оплаты
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
				// укажем дату выписки накладной
				ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И Страница = 1 Тогда
				Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
			КонецЕсли;
			
			ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
												+ ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")");
			
			// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
			Колонка = "Сумма" + ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
			
			ОбластьМакета.Параметры["ЦенаБезНДС"] = Окр(?(СтрокаТаблицы.Количество = 0, 0, СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество), 2);
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
				СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
				СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
				
				СтрокаСтруктуры.G4 = ОбластьМакета.Параметры.КодУКТВЭД;
				
				СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
				СтрокаСтруктуры.G5  = ОбластьМакета.Параметры.Количество;
				СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
				
				КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				Если КолонкаДляСуммы = "20" Тогда
					СтрокаСтруктуры.G7  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "7" Тогда
					СтрокаСтруктуры.G109  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
					СтрокаСтруктуры.G8  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
					СтрокаСтруктуры.G9  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
					СтрокаСтруктуры.G10 = СтрокаТаблицы.Сумма;	
				КонецЕсли;
				
			КонецЕсли;
							
		КонецЦикла;
		
	
		// Выводми итог по I разделу и раздел II
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
		
		Сумма1разд = 0;
		
		// Получим итоговые суммы по товарам
		ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			
			Сумма = СтрокаТаблицы.Сумма; 
			
			Колонка = "Сумма"; 
			Сумма1разд = Сумма1разд + Сумма;
			
			ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
			
		КонецЦикла;	
		
		// колонка 11 по товарам (раздел I)
		ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
		ТабДокумент.Вывести(ОбластьМакета);

		
		// Выводим раздел II (тара)
		ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
		ТаблицаПоТаре.Свернуть("", "СуммаСНДСРегл");
		
		СуммаВозвратнойТары = 0;
		Для каждого СтрокаТаблицы из ТаблицаПоТаре Цикл
			//В таблице не более одной строки
			СуммаВозвратнойТары = СтрокаТаблицы.СуммаСНДСРегл;
		КонецЦикла;
		ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары);
		
		ТабДокумент.Вывести(ОбластьМакета);		
		
		Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G11",	СуммаВозвратнойТары);
			
		КонецЕсли;
		
		// Выводим разделы III - IV (итоги)
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		
		ИтогНДС = 0;
		Всего = СуммаВозвратнойТары;
		
		// в макете жестко прописан крестик, но п. 13 говорит иногда делать в этом поле пометку...
		ОбластьМакета.Параметры["ИтогНДСБезНДС"] = "Х";
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			
			// Итоги
			Если СуффиксКолонки = "20" ИЛИ СуффиксКолонки = "7" Тогда
				ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
			ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
				// п.13 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
				ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
			КонецЕсли;
			ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
			
			Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S", "Х");
				Если СуффиксКолонки = "20" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "7" Тогда               
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G109",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда           
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",	"Без ПДВ");
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;
		
		// Итоги в 11 колонке
		ТаблицаНоменклатуры.Свернуть("","Сумма,СуммаНДС");
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			//в таблице не более одной строки
			ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
			Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
		КонецЦикла;
		ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
		ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
		
		ТабДокумент.Вывести(ОбластьМакета);	
		
		// Выводим подвал накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
		
		Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
		    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
			ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
			ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

		Если Страница <> 2 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
	КонецЦикла; 

	Если ПродажаНижеОбычнойЦены И НЕ ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		
		ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		
		//удалим лишние колонки
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
		
		// переименуем колонки
		ТаблицаНоменклатуры.Колонки.СуммаБезНДСПревышенияРегл.Имя 	 = "Сумма";
		ТаблицаНоменклатуры.Колонки.СуммаНДСПревышенияРегл.Имя		 = "СуммаНДС";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	    Для Страница = 1 По 2 Цикл
			
			Если  Страница = 2 Тогда
				
				ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
				
			КонецЕсли;
		
			ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
			Если  Страница = 2 Тогда
				// копия - накладная остается у поставщика 
				ОбластьМакета.Параметры.ОстаетсяУПродавца = "Х";
			Иначе	
				// оригинал, но все копии остаются у поставщика
				ОбластьМакета.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
				ОбластьМакета.Параметры.ТипПричины1 = "0";
				ОбластьМакета.Параметры.ТипПричины2 = "1";
				// безоплатная поставка тип причины - "12"
				Если СуммаДокумента = 0 Тогда
					ОбластьМакета.Параметры.ТипПричины1 = "1";
					ОбластьМакета.Параметры.ТипПричины2 = "2";
				КонецЕсли;
			КонецЕсли;	
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 7 Цикл                                  
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомерОЦ, Инд, 1);
			КонецЦикла; 
			
			// спецрежим/филиал
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла; 
						
			// наименование продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			
			// адрес продавца
			ОбластьМакета.Параметры.АдресОрганизации    = АдресОрганизации;
			
			// телефон продавца
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;
			
			// ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// данные покупателя равны данным поставщика
			
			// название покупателя                        
			ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеОрганизации;
			
			// адрес покупателя                           
			ОбластьМакета.Параметры.АдресКонтрагента    = АдресОрганизации;
			
			// телефон покупателя                       
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл                      
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;

			// ИНН покупателя
			Для Инд = 1 По 12 Цикл                                       
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// номер договора
			ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
			
			// дата договора
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
			КонецЦикла;

			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);

			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIG",	ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HERPN",	Формат(ОбластьМакетаЗаголовок.Параметры.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных, "БЛ=; БИ=Х"));
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HEL",	Формат(ОбластьМакетаЗаголовок.Параметры.ЭлектронныйДокумент, "БЛ=; БИ=Х"));
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HCOPY",	ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTYPR",	"" + ОбластьМакетаЗаголовок.Параметры.ТипПричины1 + ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HFILL",	Шапка.Дата);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM",	Прав(ТекНомерОЦ,7));
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM1",	Лев(ТекНомерФилиал, 1));
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM2",	Сред(ТекНомерФилиал, 2));
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMESEL",	НазваниеОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMEBUY",	НазваниеОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKSEL",		ИННОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKBUY",		ИННОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCSEL",	АдресОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCBUY",	АдресКонтрагента);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELSEL",	ТекТелефоныОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELBUY",	ТекТелефоныОрганизации);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G1S",	ОбластьМакета.Параметры.ВидДоговора);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G2D",	Шапка.ДатаДоговора);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G3S",	ТекНомерДоговора);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H02G1S",	ОбластьМакета.Параметры.ФормаРасчетов);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H10G1S",	ПечКтоВыписалНалоговуюНакладную);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R003G10S",	"");	
	 			
			КонецЕсли;
			
			
			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			
			ЭтоПерваяСтрока = Истина;
			// Выведем на печать все строки таблицы в раздел I
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
					Продолжить
				КонецЕсли;
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
					
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				// номенклатура с учетом текста дополнения
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
													 + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
													 +" "+ Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены;
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокументЗЦ.R.Добавить();
					СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
					СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
					
					СтрокаСтруктуры.G4 = ОбластьМакета.Параметры.КодУКТВЭД;
					
					СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G5  = ОбластьМакета.Параметры.Количество;
					СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
					
					КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
					Если КолонкаДляСуммы = "20" Тогда
						СтрокаСтруктуры.G7  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "7" Тогда
						СтрокаСтруктуры.G109  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
						СтрокаСтруктуры.G8  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
						СтрокаСтруктуры.G9  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
						СтрокаСтруктуры.G10 = СтрокаТаблицы.Сумма;	
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
			
			Сумма1разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.Сумма; 
			
				Колонка = "Сумма"; 
				Сумма1разд = Сумма1разд + Сумма;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
				
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел I)
			ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим раздел II (тара)
			ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары);
			
			ТабДокумент.Вывести(ОбластьМакета);		
			
			// Выводим разделы III..IV
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
			
			ИтогНДС = 0;
			Всего = СуммаВозвратнойТары;
			
			ОбластьМакета.Параметры["ИтогНДСБезНДС"] = "Х";
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				
				// Итоги
				Если СуффиксКолонки = "20" ИЛИ СуффиксКолонки = "7" Тогда
					ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
					// п.13 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
				
				Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G10S", "Х");
					Если СуффиксКолонки = "20" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "7" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G109",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G10S",	"Без ПДВ");
					КонецЕсли;
					
				КонецЕсли;
							
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
			
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);

			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;	
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
КонецФункции 

// Функция формирует табличный документ с регламентированной печатной формой 
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьДокумента(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Ложь
	,ИмяМакета = "НалоговаяНакладнаяАльбом"
	) Экспорт

	Если РабочаяДата >= '2016-04-01' Тогда
		
		// начиная с 04.2016 выгрузка в ЕРНН должна осуществляется по форме НА ДАТУ РЕГИСТРАЦИИ??!!
		// проверим соответствующую настройку (возможно данное положение со временем будет отменено)
		ВыгрузкаПечатьНН_ПоФормеНаДатуДокумента = Ложь;
		УчетнаяПолитикаНеЗадана = Ложь;
		УчетнаяПолитика	= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(РабочаяДата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
		Если НЕ УчетнаяПолитикаНеЗадана Тогда
			ВыгрузкаПечатьНН_ПоФормеНаДатуДокумента = УчетнаяПолитика.ВыгрузкаПечатьНН_ПоФормеНаДатуДокумента;
		КонецЕсли;
		
		Если ВыгрузкаПечатьНН_ПоФормеНаДатуДокумента = Ложь Тогда
		    // печатную форму выбираем в зависимости не от даты док, а от рабочей даты
			
			Если РабочаяДата >= '2018-12-01' Тогда
				
				Возврат ПечатьДокументаНалоговыйКодекс2018(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета);
			
			ИначеЕсли РабочаяДата >= '2017-03-16' Тогда
			
				Возврат ПечатьДокументаНалоговыйКодекс2017(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета);
			
			ИначеЕсли РабочаяДата >= '2016-04-01' Тогда
			
				Возврат ПечатьДокументаНалоговыйКодекс2016(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета);
				
			КонецЕсли;	
		
		КонецЕсли;
		
	КонецЕсли;	
	
	Если Дата >= '2018-12-01' Тогда
		
		Возврат ПечатьДокументаНалоговыйКодекс2018(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета);
	
	ИначеЕсли Дата >= '2017-03-16' Тогда
		
		Возврат ПечатьДокументаНалоговыйКодекс2017(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета);
	ИначеЕсли Дата >= '2016-04-01' Тогда
		Возврат ПечатьДокументаНалоговыйКодекс2016(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета);
	
	ИначеЕсли Дата >= '2015-01-01' Тогда
	
		Возврат ПечатьДокументаНалоговыйКодекс2015(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета);
	
	ИначеЕсли Дата >= '2011-01-10' Тогда
		Если Дата >= '2014-12-01' Тогда
		
			Возврат ПечатьДокументаНалоговыйКодекс2014Мес12(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета);
			
		ИначеЕсли Дата >= '2014-03-01' Тогда
		
			Возврат ПечатьДокументаНалоговыйКодекс2014(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета);
			
		ИначеЕсли Дата >= глЗначениеПеременной("ДатаВступленияВСилуПриказа1379")   Тогда
		    Возврат ПечатьДокументаНалоговыйКодекс2012(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы
													, ИмяМакета 
													);
		Иначе	
			
			Возврат ПечатьДокументаНалоговыйКодекс(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы);
		КонецЕсли;
	ИначеЕсли Дата < '20110101' Тогда	
		Возврат ПечатьДокументаЗаконПоНДС(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы);
	Иначе
		// в период с 01.01 по 09.01 когда новая форма не вступила в действие
		// оставляем возможность печатать документ по старой или по новой форме
		Если ПечататьПоФормеПриказа969 Тогда
			Возврат ПечатьДокументаНалоговыйКодекс(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы);
		Иначе
			Возврат ПечатьДокументаЗаконПоНДС(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы);		
		КонецЕсли;
	КонецЕсли;
	
КонецФункции // ПечатьДокумента()
	
Функция ПечатьДокументаЗаконПоНДС(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы)
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим;

	Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
	
		СтруктураПоказателей = Новый Структура();
		СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
		СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G2D");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5_");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G7");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G8");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G9");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G10");
		
		СтруктураПоказателей.Вставить("НалоговыйДокументЗЦ", 	Новый Структура());	// данные табличной части по накладной по "обычным ценам"
		СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R",  Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокументЗЦ.R = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
		
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
			// такие операции не предусматривают выписки налоговых накладных
			Возврат	СтруктураПоказателей;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата,
	|	Контрагент,
	|	Организация,
	|	ЛьготаНДС,
	|	УсловиеПродажи,
	|	ПометкаОбОсобенностяхЗаполнения,
	|	ФормаРасчетов,
	|	ВидОперации,
	|	ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
	|	КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную
	|ИЗ
	|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
	|
	|ГДЕ
	|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	// Подготовим таблицы
	Отказ = Ложь;
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим);
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НалоговаяНакладная_НалоговаяНакладная";

	Макет = ПолучитьобщийМакет("НалоговаяНакладная");

	Если НалоговыйУчет.НоваяСхемаНДС(Дата) Тогда
		Суффикс = "";
	Иначе
		Суффикс = "_Старая";
	КонецЕсли;
	
	// Загрузим все таблицы (кроме тары) в одну таблицу
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаНоменклатуры);
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПрочим , ТаблицаНоменклатуры);
	
	// свернем подобные строки
	ТаблицаНоменклатуры.Свернуть("ДатаОтгрузкиОплаты, Номенклатура, ТекстДляПечатиВКолонкеКоличество, Характеристика, ЕдиницаИзмерения, ЦенаМестаБезНДСБезСкидкиРегл, СтавкаНДС, Товаротранспортная", "Количество, СуммаБезНДСБезСкидкиРегл, СуммаСкидкиБезНДСРегл, СуммаНДСРегл, СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");
	
	// переименуем колонки
	ТаблицаНоменклатуры.Колонки.ЦенаМестаБезНДСБезСкидкиРегл.Имя = "ЦенаБезНДС";
	ТаблицаНоменклатуры.Колонки.СуммаБезНДСБезСкидкиРегл.Имя 	 = "СуммаБезСкидки";
	ТаблицаНоменклатуры.Колонки.СуммаНДСРегл.Имя				 = "СуммаНДС";
	ТаблицаНоменклатуры.Колонки.СуммаСкидкиБезНДСРегл.Имя		 = "Скидка";
	
	// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
	ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
    Для Страница = 1 По 2 Цикл
	
		// Выводим отступ
		ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим область оригинал/копия
		Если Страница = 1 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Оригинал"+Суффикс);
			ТабДокумент.Вывести(ОбластьМакета);
		ИначеЕсли Страница = 2 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия"+Суффикс);
			ТабДокумент.Вывести(ОбластьМакета);
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		КонецЕсли;

		// Выводим заголовок накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"+Суффикс);
		
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		ОбластьМакета.Параметры.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект);
	
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
			ИННОрганизации					= "ХХХХХХХХХХХХ";
			НомерСвидетельстваОрганизации	= "ХХХХХХХХХХХХ"	
		Иначе	
			СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
			ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НомерСвидетельстваОрганизации 	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
		КонецЕсли;
		
		ОбластьМакета.Параметры.НазваниеОрганизации           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		ОбластьМакета.Параметры.АдресОрганизации              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
		ОбластьМакета.Параметры.ТелефоныОрганизации           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
		
		ОбластьМакета.Параметры.НомерСвидетельстваОрганизации = НомерСвидетельстваОрганизации;
		
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННОрганизации_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
		КонецЦикла; 
		Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
 		 ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		Иначе
			СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		КонецЕсли; 
		ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
		ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдрес,",  Ложь);
		ОбластьМакета.Параметры.ТелефоныКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны,"          ,Ложь);

		НомерСвидетельстваКонтрагента                         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
		Если НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента) Тогда
			НомерСвидетельстваКонтрагента = "ХХХХХХХХХХХХ";
		КонецЕсли; 
		ОбластьМакета.Параметры.НомерСвидетельстваКонтрагента = НомерСвидетельстваКонтрагента;

		ИННКонтрагента                                        = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН,"               ,Ложь);
		Если НЕ ЗначениеЗаполнено(ИННКонтрагента) Тогда
			ИННКонтрагента = "ХХХХХХХХХХХХ";
		КонецЕсли; 
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
		КонецЦикла; 

		ТабДокумент.Вывести(ОбластьМакета);
		
		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIGS",	ОбластьМакета.Параметры.ПометкаОбОсобенностяхЗаполнения);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HCOPY",	"Х");
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	ОбластьМакета.Параметры.Дата);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		ОбластьМакета.Параметры.Номер);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	ОбластьМакета.Параметры.НазваниеОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	ОбластьМакета.Параметры.НазваниеКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	?(Найти("0123456789", Лев(СокрЛ(ИННОрганизации),1)) = 0, "", ИННОрганизации));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	?(Найти("0123456789", Лев(СокрЛ(ИННКонтрагента),1)) = 0, "", ИННКонтрагента));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNSPDVSEL",?(Найти("0123456789", Лев(СокрЛ(НомерСвидетельстваОрганизации),1)) = 0, "", НомерСвидетельстваОрганизации));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNSPDVBUY",?(Найти("0123456789", Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0, "", НомерСвидетельстваКонтрагента));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCSEL",	ОбластьМакета.Параметры.АдресОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCBUY",	ОбластьМакета.Параметры.АдресКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELSEL",	ОбластьМакета.Параметры.ТелефоныОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELBUY",	ОбластьМакета.Параметры.ТелефоныКонтрагента);
			Если Дата >= '20110101' Тогда
			
			Иначе	
				СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G1S",	ОбластьМакета.Параметры.УсловиеПродажи);
			КонецЕсли;
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H02G1S",	ОбластьМакета.Параметры.ФормаРасчетов);
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H10G1S",	Шапка.КтоВыписалНалоговуюНакладную);
			
			Если ПродажаНижеОбычнойЦены Тогда
			
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIGS",		СтруктураПоказателей.НалоговыйДокумент.HORIGS);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HCOPY",		СтруктураПоказателей.НалоговыйДокумент.HCOPY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HFILL",		СтруктураПоказателей.НалоговыйДокумент.HFILL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM",		СтруктураПоказателей.НалоговыйДокумент.HNUM + "/ЗЦ");
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMESEL",	СтруктураПоказателей.НалоговыйДокумент.HNAMESEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMEBUY",	СтруктураПоказателей.НалоговыйДокумент.HNAMEBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKSEL",		СтруктураПоказателей.НалоговыйДокумент.HKSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKBUY",		СтруктураПоказателей.НалоговыйДокумент.HKBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNSPDVSEL",	СтруктураПоказателей.НалоговыйДокумент.HNSPDVSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNSPDVBUY",	СтруктураПоказателей.НалоговыйДокумент.HNSPDVBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCSEL",	СтруктураПоказателей.НалоговыйДокумент.HLOCSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCBUY",	СтруктураПоказателей.НалоговыйДокумент.HLOCBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELSEL",	СтруктураПоказателей.НалоговыйДокумент.HTELSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELBUY",	СтруктураПоказателей.НалоговыйДокумент.HTELBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G1S",		СтруктураПоказателей.НалоговыйДокумент.H01G1S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H02G1S",		СтруктураПоказателей.НалоговыйДокумент.H02G1S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H10G1S",		СтруктураПоказателей.НалоговыйДокумент.H10G1S);
			
			КонецЕсли;
			
		КонецЕсли;

		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка"+Суффикс);
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим табличную часть
		ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
		ЭтоПерваяСтрока = Истина;
		// Выведем на печать все строки таблицы в раздел I, кроме строк, в которых указаны товаротранспортные услуги
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			Если СтрокаТаблицы.ТовароТранспортная = Истина Тогда
				Продолжить
			КонецЕсли;
			
			Если ЭтоПерваяСтрока Тогда	
				// в первой строке раздела укажем номер раздела
				ОбластьМакета.Параметры.НомерРаздела = "I";
				ЭтоПерваяСтрока = Ложь;
			Иначе
				ОбластьМакета.Параметры.НомерРаздела = "";
			КонецЕсли;	
			
			ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество) Тогда
				ОбластьМакета.Параметры.Количество = СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество;
			КонецЕсли;
			
			// дата отгрузки/оплаты
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
				// укажем дату выписки накладной
				ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
				Сообщить("В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!", СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			
			// номенклатура с учетом харакетристики
			ОбластьМакета.Параметры.Номенклатура = "" + СтрокаТаблицы.Номенклатура + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")");
			
			ОбластьМакета.Параметры.СуммаБезСкидки20 	= "Х";
			ОбластьМакета.Параметры.СуммаБезСкидки0Укр 	= "Х";
			ОбластьМакета.Параметры.СуммаБезСкидки0Эксп	= "Х";
			ОбластьМакета.Параметры.СуммаБезСкидкиБезНДС= "Х";
			
			// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
			Колонка = "СуммаБезСкидки"+ ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
				СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
				СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
				СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
				СтрокаСтруктуры.G5_ = ОбластьМакета.Параметры.Количество;
				СтрокаСтруктуры.G5  = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),0,ОбластьМакета.Параметры.Количество);
				СтрокаСтруктуры.G5S = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество,"_");
				СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
				
				КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				Если КолонкаДляСуммы = "20" Тогда
					СтрокаСтруктуры.G7  = СтрокаТаблицы.СуммаБезСкидки;	
				ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
					СтрокаСтруктуры.G8  = СтрокаТаблицы.СуммаБезСкидки;	
				ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
					СтрокаСтруктуры.G9  = СтрокаТаблицы.СуммаБезСкидки;	
				ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
					СтрокаСтруктуры.G10 = СтрокаТаблицы.СуммаБезСкидки;	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	
		// Выводми итог по I разделу и раздел II
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделIИТовТранс");
		ОбластьМакета.Параметры.СуммаБезТранс20 	= "Х";
		ОбластьМакета.Параметры.СуммаБезТранс0Укр 	= "Х";
		ОбластьМакета.Параметры.СуммаБезТранс0Эксп	= "Х";
		ОбластьМакета.Параметры.СуммаБезТрансБезНДС	= "Х";
		ОбластьМакета.Параметры.СуммаТранс20 		= "Х";
		ОбластьМакета.Параметры.СуммаТранс0Укр 		= "Х";
		ОбластьМакета.Параметры.СуммаТранс0Эксп		= "Х";
		ОбластьМакета.Параметры.СуммаТрансБезНДС	= "Х";
		
		Сумма1разд = 0;
		Сумма2разд = 0;
		
		// Получим итоговые суммы по товарам и товаротранспортным затратам
		ТаблицаНоменклатуры.Свернуть("СтавкаНДС, Товаротранспортная", " СуммаБезСкидки, Скидка, СуммаНДС");
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			
			Сумма = СтрокаТаблицы.СуммаБезСкидки; 
			
			Если СтрокаТаблицы.Товаротранспортная Тогда
				Колонка = "СуммаТранс";
				Сумма2разд = Сумма2разд + Сумма;	
			Иначе
				Колонка = "СуммаБезТранс"; 
				Сумма1разд = Сумма1разд + Сумма;
			КонецЕсли;
			
			ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
			
			Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Колонка = "СуммаТранс" И Страница = 1 Тогда
				
				Если СуффиксКолонки = "20" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R2000G7",	Сумма);
				ИначеЕсли СуффиксКолонки = "0Укр" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R2000G8",	Сумма);
				ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R2000G9",	Сумма);
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R2000G10",	Сумма);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;	
		
		// колонка 11 по товарам (раздел II)
		ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
		// колонка 11 по Товаротранспортным затратам (раздел II)
		ОбластьМакета.Параметры.Сумма2разд = ОбщегоНазначения.ФорматСумм(Сумма2разд, ,"0,00");
		
		ТабДокумент.Вывести(ОбластьМакета);

		
		// Выводим раздел III (тара)
		ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
		ТаблицаПоТаре.Свернуть("", "СуммаСНДСРегл");
		
		СуммаВозвратнойТары = 0;
		Для каждого СтрокаТаблицы из ТаблицаПоТаре Цикл
			//В таблице не более одной строки
			СуммаВозвратнойТары = СтрокаТаблицы.СуммаСНДСРегл;
		КонецЦикла;
		
		ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары, ,"0,00");
		
		ТабДокумент.Вывести(ОбластьМакета);		
		
		Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R3000G11",	СуммаВозвратнойТары);
			
		КонецЕсли;
		
		// Выводим разделы IV...VII (скидки и итоги)
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, Скидка, СуммаНДС");		
		
		ИтогСуммаСкидки = 0;
		ИтогСуммаНадбавки = 0;
		ИтогНДС = 0;
		ИтогСуммаБезНДС = 0;
		Всего = СуммаВозвратнойТары;
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
					
			// Скидки
			СуммаСкидки   = 0;
			СуммаНадбавки = 0;
			Если СтрокаТаблицы.Скидка > 0 Тогда
				  СуммаСкидки	  	= СтрокаТаблицы.Скидка;
				  ИтогСуммаСкидки 	= ИтогСуммаСкидки  + СуммаСкидки;
			ИначеЕсли СтрокаТаблицы.Скидка < 0 Тогда
				  СуммаНадбавки     =  - СтрокаТаблицы.Скидка;
				  ИтогСуммаНадбавки = ИтогСуммаНадбавки + СуммаНадбавки;
			КонецЕсли;
			
			ОбластьМакета.Параметры["СуммаСкидки" 	  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СуммаСкидки, ,"0,00");
			ОбластьМакета.Параметры["СуммаНадбавки"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СуммаНадбавки, ,"0,00");
			
			// Итоги
			Если СуффиксКолонки = "0Эксп" Или СуффиксКолонки = "0Укр" Тогда
				ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = "0";
			Иначе					
				ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
			КонецЕсли; 
			
			Если СуффиксКолонки = "БезНДС" Тогда
				// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
				ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ " + Шапка.ЛьготаНДС;
			КонецЕсли;
			ОбластьМакета.Параметры["ИтогСуммаБезНДС" + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки - СтрокаТаблицы.Скидка, ,"0,00");
			ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки - СтрокаТаблицы.Скидка + СтрокаТаблицы.СуммаНДС, ,"0,00");
			
		
			Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				Если СуффиксКолонки = "20" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R4100G7",	СуммаНадбавки);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R4200G7",	СуммаСкидки);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R5100G7",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "0Укр" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R4100G8",	СуммаНадбавки);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R4200G8",	СуммаСкидки);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R5100G8",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R4100G9",	СуммаНадбавки);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R4200G9",	СуммаСкидки);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R5100G9",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R4100G10",	СуммаНадбавки);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R4200G10",	СуммаСкидки);
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R5100G10",	СтрокаТаблицы.СуммаНДС);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Итоги в 11 колонке
		ТаблицаНоменклатуры.Свернуть("","СуммаБезСкидки, Скидка, СуммаНДС");
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			//в таблице не более одной строки
			ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
			ИтогСуммаБезНДС = СтрокаТаблицы.СуммаБезСкидки - СтрокаТаблицы.Скидка;
			Всего 			= Всего + ИтогСуммаБезНДС + ИтогНДС;
		КонецЦикла;
		ОбластьМакета.Параметры.СуммаНадбавки 	= ОбщегоНазначения.ФорматСумм(ИтогСуммаНадбавки, ,"0,00");
		ОбластьМакета.Параметры.СуммаСкидки		= ОбщегоНазначения.ФорматСумм(ИтогСуммаСкидки, ,"0,00");
		ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
		ОбластьМакета.Параметры.ИтогСуммаБезНДС = ОбщегоНазначения.ФорматСумм(ИтогСуммаБезНДС, ,"0,00");
		ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
		
		ТабДокумент.Вывести(ОбластьМакета);	
		
		// Выводим подвал накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал"+Суффикс);
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьМакета);

		Если Страница <> 2 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЦикла; 

	Если НалоговыйУчет.НоваяСхемаНДС(Дата) И ПродажаНижеОбычнойЦены Тогда
		
		ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		
		//удалим лишние колонки
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаБезСкидки);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Скидка);
		
		// переименуем колонки
		ТаблицаНоменклатуры.Колонки.СуммаБезНДСПревышенияРегл.Имя 	 = "СуммаБезСкидки";
		ТаблицаНоменклатуры.Колонки.СуммаНДСПревышенияРегл.Имя		 = "СуммаНДС";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	    Для Страница = 1 По 2 Цикл
		
			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим область оригинал/копия
			Если Страница = 1 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал"+Суффикс);
				ТабДокумент.Вывести(ОбластьМакета);
			ИначеЕсли Страница = 2 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия"+Суффикс);
				ТабДокумент.Вывести(ОбластьМакета);
				ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			КонецЕсли;

			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок"+Суффикс);
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			ОбластьМакета.Параметры.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)+"/ЗЦ";

			СведенияОПродавце   = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
			ОбластьМакета.Параметры.НазваниеОрганизации           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресОрганизации              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдрес,",  Ложь);
			ОбластьМакета.Параметры.ТелефоныОрганизации           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);

			Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// налоговые реквизиты не указыватюся
				ИННОрганизации					= "ХХХХХХХХХХХХ";
				НомерСвидетельстваОрганизации	= "ХХХХХХХХХХХХ"	
			Иначе	
				ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
				НомерСвидетельстваОрганизации 	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
			КонецЕсли;
			
			ОбластьМакета.Параметры.НомерСвидетельстваОрганизации = НомерСвидетельстваОрганизации;
			
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд]    = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
 			 ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// в этом случае контрагентом выступает организация
				СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
			Иначе
				СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
			КонецЕсли; 
			ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдрес,",  Ложь);
			ОбластьМакета.Параметры.ТелефоныКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны,"          ,Ложь);

			НомерСвидетельстваКонтрагента                         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			Если НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента) Тогда
				НомерСвидетельстваКонтрагента = "ХХХХХХХХХХХХ";
			КонецЕсли; 
			ОбластьМакета.Параметры.НомерСвидетельстваКонтрагента = НомерСвидетельстваКонтрагента;

			ИННКонтрагента                                        = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН,"               ,Ложь);
			Если НЕ ЗначениеЗаполнено(ИННКонтрагента) Тогда
				ИННКонтрагента = "ХХХХХХХХХХХХ";
			КонецЕсли; 
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 

			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка"+Суффикс);
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			ЭтоПерваяСтрока = Истина;
			// Выведем на печать все строки таблицы в раздел I, кроме строк, в которых указаны товаротранспортные услуги
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если СтрокаТаблицы.ТовароТранспортная = Истина Тогда
					Продолжить
				КонецЕсли;
				
				Если СтрокаТаблицы.СуммаБезСкидки = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
					Продолжить
				КонецЕсли;
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество) Тогда
					ОбластьМакета.Параметры.Количество = СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество;
				КонецЕсли;
			
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить("В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!", СтатусСообщения.Важное);
					Продолжить;
				КонецЕсли;
				
				// номенклатура с учетом харакетристики
				ОбластьМакета.Параметры.Номенклатура = "" + СтрокаТаблицы.Номенклатура + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
					+ " "+ Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены;
				
				ОбластьМакета.Параметры.СуммаБезСкидки20 	= "Х";
				ОбластьМакета.Параметры.СуммаБезСкидки0Укр 	= "Х";
				ОбластьМакета.Параметры.СуммаБезСкидки0Эксп	= "Х";
				ОбластьМакета.Параметры.СуммаБезСкидкиБезНДС= "Х";
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "СуммаБезСкидки"+ ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки, ,"0,00");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокументЗЦ.R.Добавить();
					СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
					СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
					СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G5_ = ОбластьМакета.Параметры.Количество;
					СтрокаСтруктуры.G5  = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),0,ОбластьМакета.Параметры.Количество);
					СтрокаСтруктуры.G5S = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество,"");
					СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
					
					КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
					Если КолонкаДляСуммы = "20" Тогда
						СтрокаСтруктуры.G7  = СтрокаТаблицы.СуммаБезСкидки;	
					ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
						СтрокаСтруктуры.G8  = СтрокаТаблицы.СуммаБезСкидки;	
					ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
						СтрокаСтруктуры.G9  = СтрокаТаблицы.СуммаБезСкидки;	
					ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
						СтрокаСтруктуры.G10 = СтрокаТаблицы.СуммаБезСкидки;	
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделIИТовТранс");
			ОбластьМакета.Параметры.СуммаБезТранс20 	= "Х";
			ОбластьМакета.Параметры.СуммаБезТранс0Укр 	= "Х";
			ОбластьМакета.Параметры.СуммаБезТранс0Эксп	= "Х";
			ОбластьМакета.Параметры.СуммаБезТрансБезНДС	= "Х";
			ОбластьМакета.Параметры.СуммаТранс20 		= "Х";
			ОбластьМакета.Параметры.СуммаТранс0Укр 		= "Х";
			ОбластьМакета.Параметры.СуммаТранс0Эксп		= "Х";
			ОбластьМакета.Параметры.СуммаТрансБезНДС	= "Х";
			
			Сумма1разд = 0;
			Сумма2разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС, Товаротранспортная", " СуммаБезСкидки, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.СуммаБезСкидки; 
				
				Если СтрокаТаблицы.Товаротранспортная Тогда
					Колонка = "СуммаТранс";
					Сумма2разд = Сумма2разд + Сумма;
				Иначе
					Колонка = "СуммаБезТранс"; 
					Сумма1разд = Сумма1разд + Сумма;
				КонецЕсли;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
				
				Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Колонка = "СуммаТранс" И Страница = 1 Тогда
					
					Если СуффиксКолонки = "20" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R2000G7",	Сумма);
					ИначеЕсли СуффиксКолонки = "0Укр" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R2000G8",	Сумма);
					ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R2000G9",	Сумма);
					ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R2000G10",	Сумма);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел II)
			ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
			// колонка 11 по Товаротранспортным затратам (раздел II)
			ОбластьМакета.Параметры.Сумма2разд = ОбщегоНазначения.ФорматСумм(Сумма2разд, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);

			
			// Выводим раздел III (тара)
			ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);		
			
			// Выводим разделы IV...VII (скидки и итоги)
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "СуммаБезСкидки, СуммаНДС");
			
			ИтогСуммаСкидки = 0;
			ИтогСуммаНадбавки = 0;
			ИтогНДС = 0;
			ИтогСуммаБезНДС = 0;
			Всего = СуммаВозвратнойТары;
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
						
				// Скидки
				СуммаСкидки   = 0;
				СуммаНадбавки = 0;
				
				ОбластьМакета.Параметры["СуммаСкидки" 	  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СуммаСкидки, ,"0,00");
				ОбластьМакета.Параметры["СуммаНадбавки"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СуммаНадбавки, ,"0,00");
				
				// Итоги
				Если НалоговыйУчет.НоваяСхемаНДС(Дата) И (СуффиксКолонки = "0Эксп" Или СуффиксКолонки = "0Укр") Тогда
					ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = "0";
				Иначе					
					ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				КонецЕсли; 
				
				Если СуффиксКолонки = "БезНДС" Тогда
					// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ " + Шапка.ЛьготаНДС;
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаБезНДС" + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки, ,"0,00");
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаБезСкидки + СтрокаТаблицы.СуммаНДС, ,"0,00");
				
				Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					Если СуффиксКолонки = "20" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R5100G7",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "0Укр" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R5100G8",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R5100G9",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R5100G10",	СтрокаТаблицы.СуммаНДС);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","СуммаБезСкидки, СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				ИтогСуммаБезНДС = СтрокаТаблицы.СуммаБезСкидки;
				Всего 			= Всего + ИтогСуммаБезНДС + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.СуммаНадбавки 	= ОбщегоНазначения.ФорматСумм(ИтогСуммаНадбавки, ,"0,00");
			ОбластьМакета.Параметры.СуммаСкидки		= ОбщегоНазначения.ФорматСумм(ИтогСуммаСкидки, ,"0,00");
			ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.ИтогСуммаБезНДС = ОбщегоНазначения.ФорматСумм(ИтогСуммаБезНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал"+Суффикс);
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ТабДокумент.Вывести(ОбластьМакета);

			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		Возврат ТабДокумент;
		
	КонецЕсли;

КонецФункции // ПечатьДокумента()

Функция ПечатьДокументаНалоговыйКодекс2012(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы
	, ИмяМакета = "НалоговаяНакладнаяАльбом"
	)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим, ТаблицаПоОС, ТаблицаПоНМА;
	
	Если НЕ ТолькоФормироватьСтруктуруПоказателейПечатнойФормы 	= Истина
		  И ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных 	= Истина
		  И ВключенаВЕдиныйРеестрНалоговыхНакладных 			= Ложь Тогда
	
		Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 должна быть зарегистрирована в Едином реестре!
				                       |Нельзя выдавать покупателю печатный документ до регистрации в Едином реестре!'; uk = '%1 має бути зареєстрована у Єдиному реєстрі податкових накладних!
				                       |Не можна видавати покупцю другований документ до реєстрації у Єдиному реєстрі!'")
									   , Ссылка)
			   , СтатусСообщения.ОченьВажное);			
	
	КонецЕсли;

	
	Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
	
		СтруктураПоказателей = Новый Структура();
		СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
		СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G2D");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5_");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G7");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G8");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G9");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G10");
		
		СтруктураПоказателей.Вставить("НалоговыйДокументЗЦ", 	Новый Структура());	// данные табличной части по накладной по "обычным ценам"
		СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R",  Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокументЗЦ.R = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
		
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
			// такие операции не предусматривают выписки налоговых накладных
			Возврат	СтруктураПоказателей;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	ВключенаВЕдиныйРеестрНалоговыхНакладных,
	|	ТипПричиныНевыдачиПокупателю,
	|	СпецРежимНалогообложения,
	|	ДоговорКонтрагента.Дата  КАК ДатаДоговора,
	|	ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	Дата,
	|	Контрагент,
	|	Организация,
	|	ЛьготаНДС,
	|	УсловиеПродажи,
	|	ВидДоговора,
	|	ФормаРасчетов,
	|	ВидОперации,
	|	ОбособленноеПодразделение.НаименованиеДляНалоговыхДокументов КАК НаименованиеФилиала,
	|	ОбособленноеПодразделение.Префикс КАК Префикс,
	|	Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагент.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН КАК ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН,
	|	УслугиНерезидентаДляНехозДеят КАК УслугиНерезидентаДляНехозДеят,
	|	ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
	|	КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную
	|ИЗ
	|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
	|
	|ГДЕ
	|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	СимволДляПустыхПоказателей = "X";
	ПечататьКодУКТВЭДБезПробелов = Ложь;
	ПечататьДатыБезРазделителей = Ложь;
	ДополнитьНазваниеНомеромГТД = Ложь;
	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитика	= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	Если НЕ УчетнаяПолитикаНеЗадана тогда
		СимволДляПустыхПоказателей    	 = УчетнаяПолитика.СимволПустыхПоказателейВНалоговойНакладной; 
		ПечататьКодУКТВЭДБезПробелов 	 = УчетнаяПолитика.ПечататьКодУКТВЭДБезПробелов;
		ПечататьДатыБезРазделителей    	 = НЕ УчетнаяПолитика.ПечататьДатыВНалоговыхНакладныхСРазделителями; 
		ДополнитьНазваниеНомеромГТД    	 = НЕ УчетнаяПолитика.НеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах; 
	КонецЕсли;
	
	// Подготовим таблицы
	Отказ = Ложь;
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
		
	ТабДокумент = Новый ТабличныйДокумент;
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НалоговаяНакладная_НалоговаяНакладная";
	ТабДокумент.КлючПараметровПечати  = "ПАРАМЕТРЫ_ПЕЧАТИ_НалоговаяНакладная_" + ИмяМакета;

	Макет = ПолучитьОбщийМакет("НалоговаяНакладная2012");
	Если ИмяМакета = "НалоговаяНакладнаяАльбом" Тогда
		Макет = ПолучитьОбщийМакет("НалоговаяНакладная2012Альбом");	
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	Макет.КодЯзыкаМакета = "ru";
	
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим);

	// Загрузим все таблицы (кроме тары) в одну таблицу
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПрочим, ТаблицаНоменклатуры);
	// свернем подобные строки
	ТаблицаНоменклатуры.Свернуть("ДатаОтгрузкиОплаты, Номенклатура, Характеристика, КодУКТВЭД, НомерГТД, ДатаГТД, ТекстДляПечатиВКолонкеКоличество, ЕдиницаИзмерения, ЦенаБезНДСРегл, СтавкаНДС", "Количество, СуммаБезНДСРегл, СуммаНДСРегл, СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");   	
	
	// переименуем колонки
	ТаблицаНоменклатуры.Колонки.ЦенаБезНДСРегл.Имя 				 = "ЦенаБезНДС";
	ТаблицаНоменклатуры.Колонки.СуммаБезНДСРегл.Имя 			 = "Сумма";
	ТаблицаНоменклатуры.Колонки.СуммаНДСРегл.Имя				 = "СуммаНДС";
	
	// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
	ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
	Для Страница = 1 По 2 Цикл
		
		Если  Страница = 2
			И ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// печатаем в одном экземпляре
			Продолжить;
		КонецЕсли;
		
		// Выводим область оригинал/копия
		Если Страница = 1 Тогда
			
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			ОбластьМакетаЗаголовок.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
			
			Если Шапка.ТипПричиныНевыдачиПокупателю = 0  Тогда
				
				ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 1  Тогда	
				
				// т.к. причина лишь превышение над обычной ценой, то первый экземпляр таки должен быть выдан покупателю
				ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
				
			Иначе
				
				// накладная остается у поставщика
				ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца = "Х";
				ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
				ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			
		ИначеЕсли Страница = 2 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия");
			ОбластьМакета.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
			ТабДокумент.Вывести(ОбластьМакета);
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		КонецЕсли;
		
		// Выводим отступ
		ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим заголовок накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		Для Инд = 1 По 8 Цикл
			ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
		КонецЦикла; 
		
		// Номер
		ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
		Для Инд = 1 По 7 Цикл                                                                 
			ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
		КонецЦикла; 
		
		// филиал/спецрежим
		ТекНомерФилиал = "";
		КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
		НомерФилиала  = ?(ЗначениеЗаполнено(Шапка.Префикс), Прав("0000" + СокрЛП(Шапка.Префикс), 4), "");  //число, сведущими нулями, 4 символа 
		Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
			ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
		КонецЕсли;
		Для Инд = 1 По 5 Цикл                                                                 
			ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
		КонецЦикла; 
				
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
			ИННОрганизации					= ?(Шапка.УслугиНерезидентаДляНехозДеят = Истина, "200000000000", "300000000000");
			НомерСвидетельстваОрганизации	= "0"	
		Иначе	
			СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
			ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НомерСвидетельстваОрганизации 	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
		КонецЕсли;
		ОбластьМакета.Параметры.НазваниеОрганизации           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			ОбластьМакета.Параметры.НазваниеОрганизации = ОбластьМакета.Параметры.НазваниеОрганизации + Шапка.НаименованиеФилиала;	
		КонецЕсли;
		ОбластьМакета.Параметры.АдресОрганизации              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдресПочтовый,",  Ложь);
		
		// телефон
		ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
		ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
		ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);
		Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
			ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
		КонецЦикла;
		
		ИННОрганизации = Прав("            " + ИННОрганизации, 12);
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
		КонецЦикла; 
		НомерСвидетельстваОрганизации = Прав("            " + НомерСвидетельстваОрганизации, 10);
		Для Инд = 1 По 10 Цикл
			ОбластьМакета.Параметры["НомерСвидетельстваОрганизации_"+Инд] = Сред(НомерСвидетельстваОрганизации, Инд, 1);
		КонецЦикла; 
		
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		Иначе
			СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
			СведенияОГоловномКонтрагентеПокупателя = Неопределено;
			Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
				СведенияОГоловномКонтрагентеПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ГоловнойКонтрагент, Шапка.Дата);
			КонецЕсли;
		КонецЕсли; 
		
		ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
		ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдресПочтовый,",  Ложь);
		Если НЕ СведенияОГоловномКонтрагентеПокупателя = Неопределено Тогда
			ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь) 			+ " - " + ОбластьМакета.Параметры.НазваниеКонтрагента;
			ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ЮридическийАдресПочтовый,",  Ложь)	+ " - " + ОбластьМакета.Параметры.АдресКонтрагента;
		КонецЕсли;
		
		// телефон
		ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
		ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
		ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);
		Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
			ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
		КонецЦикла;
		
		ИННКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
			ИЛИ НЕ ЗначениеЗаполнено(ИННКонтрагента)
			ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
			ИННКонтрагента = "0";
		КонецЕсли; 
		ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
		КонецЦикла; 
		
		НомерСвидетельстваКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
			ИЛИ НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
			ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
			НомерСвидетельстваКонтрагента = "0";
		КонецЕсли; 
		НомерСвидетельстваКонтрагента = Прав("            " + НомерСвидетельстваКонтрагента, 10);
		Если  Дата >= '2014-01-01'
			И СокрЛП(НомерСвидетельстваКонтрагента) = "0"
			И НЕ СокрЛП(ИННКонтрагента) = "0" Тогда
			НомерСвидетельстваКонтрагента = "";	
		КонецЕсли;
		
		Для Инд = 1 По 10 Цикл
			ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента_"+Инд] = Сред(НомерСвидетельстваКонтрагента, Инд, 1);
		КонецЦикла; 
		
		ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
		ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
		
		ТекДатаДоговора = Шапка.ДатаДоговора;
		Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
			ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
			КонецЦикла; 
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG",	ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HERPN",	Формат(ОбластьМакетаЗаголовок.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных, "БЛ=; БИ=Х"));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTYPR",	""+ОбластьМакетаЗаголовок.Параметры.ТипПричины1+ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HCOPY",	"");
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	Лев(ТекНомерФилиал, 1));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	Сред(ТекНомерФилиал, 2));
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	ОбластьМакета.Параметры.НазваниеОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	ОбластьМакета.Параметры.НазваниеКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNSPDVSEL",НомерСвидетельстваОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNSPDVBUY",НомерСвидетельстваКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCSEL",	ОбластьМакета.Параметры.АдресОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCBUY",	ОбластьМакета.Параметры.АдресКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELSEL",	ТекТелефоныОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELBUY",	ТекТелефоныКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G1S",	ОбластьМакета.Параметры.ВидДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G2D",	Шапка.ДатаДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G3S",	ТекНомерДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H02G1S",	ОбластьМакета.Параметры.ФормаРасчетов);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H10G1S",	Шапка.КтоВыписалНалоговуюНакладную);
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	Шапка.ЛьготаНДС);	
			Иначе
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	"");	
			КонецЕсли;

			Если ПродажаНижеОбычнойЦены Тогда
				
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIG",		СтруктураПоказателей.НалоговыйДокумент.HORIG);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIG1",		СтруктураПоказателей.НалоговыйДокумент.HORIG1);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HERPN",		СтруктураПоказателей.НалоговыйДокумент.HERPN);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTYPR",		1);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HCOPY",		СтруктураПоказателей.НалоговыйДокумент.HCOPY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HFILL",		СтруктураПоказателей.НалоговыйДокумент.HFILL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM",		СтруктураПоказателей.НалоговыйДокумент.HNUM);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM1",		СтруктураПоказателей.НалоговыйДокумент.HNUM1);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM2",		СтруктураПоказателей.НалоговыйДокумент.HNUM2);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMESEL",	СтруктураПоказателей.НалоговыйДокумент.HNAMESEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMEBUY",	СтруктураПоказателей.НалоговыйДокумент.HNAMEBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKSEL",		СтруктураПоказателей.НалоговыйДокумент.HKSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKBUY",		СтруктураПоказателей.НалоговыйДокумент.HKBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNSPDVSEL",	СтруктураПоказателей.НалоговыйДокумент.HNSPDVSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNSPDVBUY",	СтруктураПоказателей.НалоговыйДокумент.HNSPDVBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCSEL",	СтруктураПоказателей.НалоговыйДокумент.HLOCSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCBUY",	СтруктураПоказателей.НалоговыйДокумент.HLOCBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELSEL",	СтруктураПоказателей.НалоговыйДокумент.HTELSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELBUY",	СтруктураПоказателей.НалоговыйДокумент.HTELBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G1S",		СтруктураПоказателей.НалоговыйДокумент.H01G1S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G2D",		СтруктураПоказателей.НалоговыйДокумент.H01G2D);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G3S",		СтруктураПоказателей.НалоговыйДокумент.H01G3S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H02G1S",		СтруктураПоказателей.НалоговыйДокумент.H02G1S);
                СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H10G1S",		СтруктураПоказателей.НалоговыйДокумент.H10G1S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R003G10S",	СтруктураПоказателей.НалоговыйДокумент.R003G10S);
			
			КонецЕсли;
			
		КонецЕсли;
				
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим табличную часть
		ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
		Если ПечататьДатыБезРазделителей Тогда
			ОбластьМакета.Области.ДатаОтгрузкиОплаты.Формат = "ДФ=ddMMyyyy";	
		КонецЕсли;
		
		ЭтоПерваяСтрока = Истина;
		// Выведем на печать все строки таблицы в раздел I
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			Если ЭтоПерваяСтрока Тогда	
				// в первой строке раздела укажем номер раздела
				ОбластьМакета.Параметры.НомерРаздела = "I";
				ЭтоПерваяСтрока = Ложь;
			Иначе
				ОбластьМакета.Параметры.НомерРаздела = "";
			КонецЕсли;	
			
			ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
			
			Если ПечататьКодУКТВЭДБезПробелов Тогда
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество) Тогда
				ОбластьМакета.Параметры.Количество = СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество;
			КонецЕсли;
			
			// дата отгрузки/оплаты
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
				// укажем дату выписки накладной
				ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И Страница = 1 Тогда
				Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
			КонецЕсли;
			
			ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура) 
												 + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
												 + ?(ДополнитьНазваниеНомеромГТД И ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД), ". ВМД №: " + СтрокаТаблицы.НомерГТД + ", дата ВМД: " + Формат(СтрокаТаблицы.ДатаГТД, ?(ПечататьДатыБезРазделителей,"ДФ=ddMMyyyy","ДФ=dd.MM.yyyy")), "");
												 ;
			
			ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.СуммаБезНДС = СимволДляПустыхПоказателей;
			
			// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
			Колонка = "Сумма" + ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
				СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
				СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
				
				СтрокаСтруктуры.G4 = ОбластьМакета.Параметры.КодУКТВЭД;
				
				СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
				СтрокаСтруктуры.G5_ = ОбластьМакета.Параметры.Количество;
				СтрокаСтруктуры.G5  = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),0,ОбластьМакета.Параметры.Количество);
				СтрокаСтруктуры.G5S = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество,"");
				СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
				
				КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				Если КолонкаДляСуммы = "20" Тогда
					СтрокаСтруктуры.G7  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
					СтрокаСтруктуры.G8  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
					СтрокаСтруктуры.G9  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
					СтрокаСтруктуры.G10 = СтрокаТаблицы.Сумма;	
				КонецЕсли;
				
			КонецЕсли;
							
		КонецЦикла;
		
	
		// Выводми итог по I разделу и раздел II
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
		ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
		ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
		ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
		ОбластьМакета.Параметры.СуммаБезНДС	= СимволДляПустыхПоказателей;
		
		Сумма1разд = 0;
		
		// Получим итоговые суммы по товарам
		ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			
			Сумма = СтрокаТаблицы.Сумма; 
			
			Колонка = "Сумма"; 
			Сумма1разд = Сумма1разд + Сумма;
			
			ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
			
		КонецЦикла;	
		
		// колонка 11 по товарам (раздел I)
		ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
		ТабДокумент.Вывести(ОбластьМакета);

		
		// Выводим раздел II (тара)
		ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
		ТаблицаПоТаре.Свернуть("", "СуммаСНДСРегл");
		
		СуммаВозвратнойТары = 0;
		Для каждого СтрокаТаблицы из ТаблицаПоТаре Цикл
			//В таблице не более одной строки
			СуммаВозвратнойТары = СтрокаТаблицы.СуммаСНДСРегл;
		КонецЦикла;
		ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары, ,СимволДляПустыхПоказателей);
		
		ТабДокумент.Вывести(ОбластьМакета);		
		
		Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G11",	СуммаВозвратнойТары);
			
		КонецЕсли;
		
		// Выводим разделы III - IV (итоги)
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		
		ИтогНДС = 0;
		Всего = СуммаВозвратнойТары;
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
					
			// Итоги
			ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
			Если СуффиксКолонки = "БезНДС" Тогда
				// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
				ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
			ИначеЕсли СуффиксКолонки = "0Укр"
				  ИЛИ СуффиксКолонки = "0Эксп" Тогда
				// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
				ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
				ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
			КонецЕсли;
			ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
			
			Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				Если СуффиксКолонки = "20" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "0Укр" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G8",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G9",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",	"Без ПДВ");
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;
		
		// Итоги в 11 колонке
		ТаблицаНоменклатуры.Свернуть("","Сумма,СуммаНДС");
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			//в таблице не более одной строки
			ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
			Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
		КонецЦикла;
		ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
		ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
		
		ТабДокумент.Вывести(ОбластьМакета);	
		
		// Выводим подвал накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = Шапка.КтоВыписалНалоговуюНакладную;	
		
		Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
		    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
			ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
			ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

		Если Страница <> 2 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЦикла; 

	Если ПродажаНижеОбычнойЦены Тогда
		
		ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		
		//удалим лишние колонки
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
		
		// переименуем колонки
		ТаблицаНоменклатуры.Колонки.СуммаБезНДСПревышенияРегл.Имя 	 = "Сумма";
		ТаблицаНоменклатуры.Колонки.СуммаНДСПревышенияРегл.Имя		 = "СуммаНДС";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	    Для Страница = 1 По 2 Цикл
			
			Если  Страница = 2
				И ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// печатаем в одном экземпляре
				Продолжить;
			КонецЕсли;
		
			// Выводим область оригинал/копия
			Если Страница = 1 Тогда
				
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
				
				
				// накладная остается у поставщика
				ОбластьМакета.Параметры.ОстаетсяУПродавца = "Х";
				ОбластьМакета.Параметры.ТипПричины1 = "0";
				ОбластьМакета.Параметры.ТипПричины2 = "1";
				
				// безоплатная поставка тип причины - "12"
				Если СуммаДокумента = 0 Тогда
					ОбластьМакета.Параметры.ТипПричины1 = "1";
					ОбластьМакета.Параметры.ТипПричины2 = "2";
				КонецЕсли;
				
				ТабДокумент.Вывести(ОбластьМакета);
				
			ИначеЕсли Страница = 2 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия");
				ТабДокумент.Вывести(ОбластьМакета);
				ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			КонецЕсли;

			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			    ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены)), 7);
			Иначе	
				ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
			КонецЕсли;
			
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим
			ТекНомерФилиал = "";
			КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
			НомерФилиала  = ?(ЗначениеЗаполнено(Шапка.Префикс), Прав("0000" + СокрЛП(Шапка.Префикс), 4), "");  //число, сведущими нулями, 4 символа 
			Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
				ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
			КонецЕсли;
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла; 
					
			Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// налоговые реквизиты не указыватюся
				СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
				ИННОрганизации					= ?(Шапка.УслугиНерезидентаДляНехозДеят = Истина, "200000000000", "300000000000");
				НомерСвидетельстваОрганизации	= "0"	
			Иначе	
				СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
				ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
				НомерСвидетельстваОрганизации 	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
			КонецЕсли;
			ОбластьМакета.Параметры.НазваниеОрганизации           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
				ОбластьМакета.Параметры.НазваниеОрганизации = ОбластьМакета.Параметры.НазваниеОрганизации + Шапка.НаименованиеФилиала;	
			КонецЕсли;
			ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдресПочтовый,",  Ложь);
			
			// телефон
			ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
			ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;
			ИННОрганизации = Прав("            " + ИННОрганизации, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			НомерСвидетельстваОрганизации = Прав("            " + НомерСвидетельстваОрганизации, 10);
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["НомерСвидетельстваОрганизации_"+Инд] = Сред(НомерСвидетельстваОрганизации, Инд, 1);
			КонецЦикла; 
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// в этом случае контрагентом выступает организация
				СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
			Иначе
				СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
				СведенияОГоловномКонтрагентеПокупателя = Неопределено;
				Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
					СведенияОГоловномКонтрагентеПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ГоловнойКонтрагент, Шапка.Дата);
				КонецЕсли;
			КонецЕсли; 
			
			ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдресПочтовый,",  Ложь);
			Если НЕ СведенияОГоловномКонтрагентеПокупателя = Неопределено Тогда
				ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь) 			+ " - " + ОбластьМакета.Параметры.НазваниеКонтрагента;
				ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ЮридическийАдресПочтовый,",  Ложь)	+ " - " + ОбластьМакета.Параметры.АдресКонтрагента;
			КонецЕсли;
			
			// телефон
			ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
			ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
			КонецЦикла;
			
			НомерСвидетельстваКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
	   			ИЛИ НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
			    ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
				НомерСвидетельстваКонтрагента = "0";
			КонецЕсли; 
			НомерСвидетельстваКонтрагента = Прав("            " + НомерСвидетельстваКонтрагента, 10);
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента_"+Инд] = Сред(НомерСвидетельстваКонтрагента, Инд, 1);
			КонецЦикла; 

			ИННКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
	   			ИЛИ НЕ ЗначениеЗаполнено(ИННКонтрагента)
			    ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "0";
			КонецЕсли; 
			ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
			ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
			
			ТекДатаДоговора = Шапка.ДатаДоговора;
			Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
				ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
				КонецЦикла; 
			КонецЕсли;

			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			Если ПечататьДатыБезРазделителей Тогда
				ОбластьМакета.Области.ДатаОтгрузкиОплаты.Формат = "ДФ=ddMMyyyy";	
			КонецЕсли;
			
			ЭтоПерваяСтрока = Истина;
			// Выведем на печать все строки таблицы в раздел I
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
					Продолжить
				КонецЕсли;
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				Если ПечататьКодУКТВЭДБезПробелов Тогда
					ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество) Тогда
					ОбластьМакета.Параметры.Количество = СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество;
				КонецЕсли;
			
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				// номенклатура с учетом текста дополнения
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура) 
													 + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
													 + ?(ДополнитьНазваниеНомеромГТД И ЗначениеЗаполнено(СтрокаТаблицы.НомерГТД), ". ВМД №: " + СтрокаТаблицы.НомерГТД + ", дата ВМД: " + Формат(СтрокаТаблицы.ДатаГТД, ?(ПечататьДатыБезРазделителей,"ДФ=ddMMyyyy","ДФ=dd.MM.yyyy")), "")
													 +" "+ Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены
													 ;
				
				ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.СуммаБезНДС = СимволДляПустыхПоказателей;
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокументЗЦ.R.Добавить();
					СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
					СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
					
					СтрокаСтруктуры.G4 = ОбластьМакета.Параметры.КодУКТВЭД;
					
					СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G5_ = ОбластьМакета.Параметры.Количество;
					СтрокаСтруктуры.G5  = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),0,ОбластьМакета.Параметры.Количество);
					СтрокаСтруктуры.G5S = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество,"");
					СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
					
					КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
					Если КолонкаДляСуммы = "20" Тогда
						СтрокаСтруктуры.G7  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
						СтрокаСтруктуры.G8  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
						СтрокаСтруктуры.G9  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
						СтрокаСтруктуры.G10 = СтрокаТаблицы.Сумма;	
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЦикла;
			
		
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
			ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.СуммаБезНДС	= СимволДляПустыхПоказателей;
			
			Сумма1разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.Сумма; 
			
				Колонка = "Сумма"; 
				Сумма1разд = Сумма1разд + Сумма;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
				
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел I)
			ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);

			
			// Выводим раздел II (тара)
			ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары, ,СимволДляПустыхПоказателей);
			
			ТабДокумент.Вывести(ОбластьМакета);		
			
			// Выводим разделы III..IV
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
			
			ИтогНДС = 0;
			Всего = СуммаВозвратнойТары;
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
						
				// Итоги
				ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				Если СуффиксКолонки = "БезНДС" Тогда
					// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
				ИначеЕсли СуффиксКолонки = "0Укр"
					  ИЛИ СуффиксКолонки = "0Эксп" Тогда
					// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
					ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
				
				Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					Если СуффиксКолонки = "20" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "0Укр" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G8",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G9",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G10",	"Без ПДВ");
					КонецЕсли;
					
				КонецЕсли;
							
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = Шапка.КтоВыписалНалоговуюНакладную;	
			
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);

			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;	
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
КонецФункции // ()

Функция ПечатьДокументаНалоговыйКодекс(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим;
	
	Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
	
		СтруктураПоказателей = Новый Структура();
		СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
		СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G2D");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5_");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G7");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G8");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G9");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G10");
		
		СтруктураПоказателей.Вставить("НалоговыйДокументЗЦ", 	Новый Структура());	// данные табличной части по накладной по "обычным ценам"
		СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R",  Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокументЗЦ.R = СтруктураПоказателей.НалоговыйДокумент.R.Скопировать();
		
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
			// такие операции не предусматривают выписки налоговых накладных

			Возврат	СтруктураПоказателей;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	ВключенаВЕдиныйРеестрНалоговыхНакладных,
	|	ТипПричиныНевыдачиПокупателю,
	|	СпецРежимНалогообложения,
	|	ДоговорКонтрагента.Дата  КАК ДатаДоговора,
	|	ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	Дата,
	|	Контрагент,
	|	Организация,
	|	ЛьготаНДС,
	|	УсловиеПродажи,
	|	ВидДоговора,
	|	ФормаРасчетов,
	|	ВидОперации,
	|	ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
	|	КтоВыписалНалоговуюНакладную.Представление КАК КтоВыписалНалоговуюНакладную
	|ИЗ
	|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
	|
	|ГДЕ
	|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	СимволДляПустыхПоказателей = "X";
	ВыводитьНомерДоговораБезКлеточек = Ложь;
	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитика	= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	Если НЕ УчетнаяПолитикаНеЗадана тогда
		СимволДляПустыхПоказателей    	 = УчетнаяПолитика.СимволПустыхПоказателейВНалоговойНакладной; 
		ВыводитьНомерДоговораБезКлеточек = УчетнаяПолитика.ВыводитьНомерДоговораБезКлеточек; 
	КонецЕсли;
	
	// Подготовим таблицы
	Отказ = Ложь;
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НалоговаяНакладная_НалоговаяНакладная";

	Макет = ПолучитьОбщийМакет("НалоговаяНакладная2011");
	
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим);

	// Загрузим все таблицы (кроме тары) в одну таблицу
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПрочим , ТаблицаНоменклатуры);
	
	// свернем подобные строки
	ТаблицаНоменклатуры.Свернуть("ДатаОтгрузкиОплаты, Номенклатура, Характеристика, ТекстДляПечатиВКолонкеКоличество, ЕдиницаИзмерения, ЦенаБезНДСРегл, СтавкаНДС", "Количество, СуммаБезНДСРегл, СуммаНДСРегл, СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");
	
	// переименуем колонки
	ТаблицаНоменклатуры.Колонки.ЦенаБезНДСРегл.Имя 				 = "ЦенаБезНДС";
	ТаблицаНоменклатуры.Колонки.СуммаБезНДСРегл.Имя 			 = "Сумма";
	ТаблицаНоменклатуры.Колонки.СуммаНДСРегл.Имя				 = "СуммаНДС";
	
	// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
	ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
	Для Страница = 1 По 2 Цикл
	
		// Выводим область оригинал/копия
		Если Страница = 1 Тогда
			
			ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
			
			ОбластьМакетаЗаголовок.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
			
			Если Шапка.ТипПричиныНевыдачиПокупателю = 0  Тогда
				
				ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
				
			ИначеЕсли Шапка.ТипПричиныНевыдачиПокупателю = 1  Тогда	
				
				// т.к. причина лишь превышение над обычной ценой, то первый экземпляр таки должен быть выдан покупателю
				ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
				
			Иначе
				
				// накладная остается у поставщика
				ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца = "Х";
				ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
				ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
			
		ИначеЕсли Страница = 2 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия");
			ТабДокумент.Вывести(ОбластьМакета);
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		КонецЕсли;
		
		// Выводим отступ
		ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим заголовок накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		//Дата
		ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
		Для Инд = 1 По 8 Цикл
			ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
		КонецЦикла; 
		
		// Номер
		ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
		Для Инд = 1 По 7 Цикл                                                                 
			ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
		КонецЦикла; 
		
		// филиал/спецрежим
		ТекНомерФилиал = "";
		Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения) Тогда
			ТекНомерФилиал	= "" + Шапка.СпецРежимНалогообложения + ТекНомерФилиал; 
		КонецЕсли;
		Для Инд = 1 По 4 Цикл                                                                 
			ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
		КонецЦикла; 
				
		Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// налоговые реквизиты не указыватюся
			СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
			ИННОрганизации					= "0";
			НомерСвидетельстваОрганизации	= "0"	
		Иначе	
			СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
			ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
			НомерСвидетельстваОрганизации 	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
		КонецЕсли;
		ОбластьМакета.Параметры.НазваниеОрганизации           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		ОбластьМакета.Параметры.АдресОрганизации              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдресПочтовый,",  Ложь);
		
		// телефон
		ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
		ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
		ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);
		Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
			ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
		КонецЦикла;
		
		ИННОрганизации = Прав("            " + ИННОрганизации, 12);
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
		КонецЦикла; 
		
		НомерСвидетельстваОрганизации = Прав("            " + НомерСвидетельстваОрганизации, 10);
		Для Инд = 1 По 10 Цикл
			ОбластьМакета.Параметры["НомерСвидетельстваОрганизации_"+Инд] = Сред(НомерСвидетельстваОрганизации, Инд, 1);
		КонецЦикла; 
		
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
			ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			// в этом случае контрагентом выступает организация
			СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		Иначе
			СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		КонецЕсли; 
		
		ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
		ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдресПочтовый,",  Ложь);
		// телефон
		ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
		ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
		ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);
		Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
			ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
		КонецЦикла;
		
		НомерСвидетельстваКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
			ИЛИ НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
			ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
			НомерСвидетельстваКонтрагента = "0";
		КонецЕсли; 
		НомерСвидетельстваКонтрагента = Прав("            " + НомерСвидетельстваКонтрагента, 10);
		Для Инд = 1 По 10 Цикл
			ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента_"+Инд] = Сред(НомерСвидетельстваКонтрагента, Инд, 1);
		КонецЦикла; 

		ИННКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
			ИЛИ НЕ ЗначениеЗаполнено(ИННКонтрагента)
			ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
			ИННКонтрагента = "0";
		КонецЕсли; 
		ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
		КонецЦикла; 
		
		ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
		Если ЗначениеЗаполнено(ТекНомерДоговора) Тогда
			Для Инд = 1 По 6 Цикл
				ОбластьМакета.Параметры["НомерДоговора_"+Инд]    = Сред(ТекНомерДоговора, Инд, 1);
			КонецЦикла; 
		КонецЕсли;
		Если ВыводитьНомерДоговораБезКлеточек = Истина Тогда
			ОбластьНомера = ОбластьМакета.Область("НомерДоговора");	
		    ОбластьНомера.Объединить();
			ОбластьМакета.Параметры.НомерДоговора_1 = ТекНомерДоговора;
		КонецЕсли;
		
		ТекДатаДоговора = Шапка.ДатаДоговора;
		Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
			ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
			КонецЦикла; 
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG",	ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HERPN",	Формат(ОбластьМакетаЗаголовок.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных, "БЛ=; БИ=Х"));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG1",	ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTYPR",	""+ОбластьМакетаЗаголовок.Параметры.ТипПричины1+ОбластьМакетаЗаголовок.Параметры.ТипПричины2);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HCOPY",	"");
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	Лев(ТекНомерФилиал, 1));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	Сред(ТекНомерФилиал, 2,3));
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	ОбластьМакета.Параметры.НазваниеОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	ОбластьМакета.Параметры.НазваниеКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNSPDVSEL",НомерСвидетельстваОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNSPDVBUY",НомерСвидетельстваКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCSEL",	ОбластьМакета.Параметры.АдресОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCBUY",	ОбластьМакета.Параметры.АдресКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELSEL",	ТекТелефоныОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELBUY",	ТекТелефоныКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G1S",	ОбластьМакета.Параметры.ВидДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G2D",	Шапка.ДатаДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G3S",	ТекНомерДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H02G1S",	ОбластьМакета.Параметры.ФормаРасчетов);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H10G1S",	Шапка.КтоВыписалНалоговуюНакладную);
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	Шапка.ЛьготаНДС);	
			Иначе
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	"");	
			КонецЕсли;
			
			Если ПродажаНижеОбычнойЦены Тогда
			
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIG",		СтруктураПоказателей.НалоговыйДокумент.HORIG);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HORIG1",		СтруктураПоказателей.НалоговыйДокумент.HORIG1);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HERPN",		СтруктураПоказателей.НалоговыйДокумент.HERPN);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTYPR",		1);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HCOPY",		СтруктураПоказателей.НалоговыйДокумент.HCOPY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HFILL",		СтруктураПоказателей.НалоговыйДокумент.HFILL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM",		СтруктураПоказателей.НалоговыйДокумент.HNUM);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM1",		СтруктураПоказателей.НалоговыйДокумент.HNUM1);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNUM2",		СтруктураПоказателей.НалоговыйДокумент.HNUM2);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMESEL",	СтруктураПоказателей.НалоговыйДокумент.HNAMESEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNAMEBUY",	СтруктураПоказателей.НалоговыйДокумент.HNAMEBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKSEL",		СтруктураПоказателей.НалоговыйДокумент.HKSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HKBUY",		СтруктураПоказателей.НалоговыйДокумент.HKBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNSPDVSEL",	СтруктураПоказателей.НалоговыйДокумент.HNSPDVSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HNSPDVBUY",	СтруктураПоказателей.НалоговыйДокумент.HNSPDVBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCSEL",	СтруктураПоказателей.НалоговыйДокумент.HLOCSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HLOCBUY",	СтруктураПоказателей.НалоговыйДокумент.HLOCBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELSEL",	СтруктураПоказателей.НалоговыйДокумент.HTELSEL);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("HTELBUY",	СтруктураПоказателей.НалоговыйДокумент.HTELBUY);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G1S",		СтруктураПоказателей.НалоговыйДокумент.H01G1S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G2D",		СтруктураПоказателей.НалоговыйДокумент.H01G2D);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H01G3S",		СтруктураПоказателей.НалоговыйДокумент.H01G3S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H02G1S",		СтруктураПоказателей.НалоговыйДокумент.H02G1S);
                СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("H10G1S",		СтруктураПоказателей.НалоговыйДокумент.H10G1S);
				СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R003G10S",	СтруктураПоказателей.НалоговыйДокумент.R003G10S);
			
			КонецЕсли;
			
		КонецЕсли;
				
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим табличную часть
		ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
		ЭтоПерваяСтрока = Истина;
		// Выведем на печать все строки таблицы в раздел I
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			Если ЭтоПерваяСтрока Тогда	
				// в первой строке раздела укажем номер раздела
				ОбластьМакета.Параметры.НомерРаздела = "I";
				ЭтоПерваяСтрока = Ложь;
			Иначе
				ОбластьМакета.Параметры.НомерРаздела = "";
			КонецЕсли;	
			
			ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество) Тогда
				ОбластьМакета.Параметры.Количество = СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество;
			КонецЕсли;
			
			// дата отгрузки/оплаты
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
				// укажем дату выписки накладной
				ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И Страница = 1 Тогда
				Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
			КонецЕсли;
			
			ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура) + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")");
			
			ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.СуммаБезНДС = СимволДляПустыхПоказателей;
			
			// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
			Колонка = "Сумма" + ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
			ТабДокумент.Вывести(ОбластьМакета);
										
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
				СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
				СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
				СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
				СтрокаСтруктуры.G5_ = ОбластьМакета.Параметры.Количество;
				СтрокаСтруктуры.G5  = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),0,ОбластьМакета.Параметры.Количество);
				СтрокаСтруктуры.G5S = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество,"_");
				СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
				
				КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				Если КолонкаДляСуммы = "20" Тогда
					СтрокаСтруктуры.G7  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
					СтрокаСтруктуры.G8  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
					СтрокаСтруктуры.G9  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
					СтрокаСтруктуры.G10 = СтрокаТаблицы.Сумма;	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	
		// Выводми итог по I разделу и раздел II
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
		ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
		ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
		ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
		ОбластьМакета.Параметры.СуммаБезНДС	= СимволДляПустыхПоказателей;
		
		Сумма1разд = 0;
		
		// Получим итоговые суммы по товарам
		ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			
			Сумма = СтрокаТаблицы.Сумма; 
			
			Колонка = "Сумма"; 
			Сумма1разд = Сумма1разд + Сумма;
			
			ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
			
			Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				Если СуффиксКолонки = "20" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R2000G7",	Сумма);
				ИначеЕсли СуффиксКолонки = "0Укр" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R2000G8",	Сумма);
				ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R2000G9",	Сумма);
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R2000G10",	Сумма);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;	
		
		// колонка 11 по товарам (раздел I)
		ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
		ТабДокумент.Вывести(ОбластьМакета);

		
		// Выводим раздел II (тара)
		ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
		ТаблицаПоТаре.Свернуть("", "СуммаСНДСРегл");
		СуммаВозвратнойТары = 0;
		Для каждого СтрокаТаблицы из ТаблицаПоТаре Цикл
			//В таблице не более одной строки
			СуммаВозвратнойТары = СтрокаТаблицы.СуммаСНДСРегл;
		КонецЦикла;
		ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары, ,"0,00");
		
		Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G11",	СуммаВозвратнойТары);
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);		
		
		Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G11",	СуммаВозвратнойТары);
			
		КонецЕсли;
		
		// Выводим разделы III - IV (итоги)
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		
		ИтогНДС = 0;
		Всего = СуммаВозвратнойТары;
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
					
			// Итоги
			ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
			Если СуффиксКолонки = "БезНДС" Тогда
				// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
				ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
			ИначеЕсли СуффиксКолонки = "0Укр"
				  ИЛИ СуффиксКолонки = "0Эксп" Тогда
				// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
				ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
				ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
			КонецЕсли;
			ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
			
			Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				Если СуффиксКолонки = "20" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "0Укр" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G8",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G9",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",	СтрокаТаблицы.СуммаНДС);
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;
		
		// Итоги в 11 колонке
		ТаблицаНоменклатуры.Свернуть("","Сумма,СуммаНДС");
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			//в таблице не более одной строки
			ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
			Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
		КонецЦикла;
		ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
		ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
		
		ТабДокумент.Вывести(ОбластьМакета);	
		
		// Выводим подвал накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = Шапка.КтоВыписалНалоговуюНакладную;	
		
		Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
		    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
			ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
			ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

		Если Страница <> 2 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЦикла; 

	Если ПродажаНижеОбычнойЦены Тогда
		
		ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		
		//удалим лишние колонки
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
		
		// переименуем колонки
		ТаблицаНоменклатуры.Колонки.СуммаБезНДСПревышенияРегл.Имя 	 = "Сумма";
		ТаблицаНоменклатуры.Колонки.СуммаНДСПревышенияРегл.Имя		 = "СуммаНДС";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	    Для Страница = 1 По 2 Цикл
		
			// Выводим область оригинал/копия
			Если Страница = 1 Тогда
				
				ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
				
				ОбластьМакета.Параметры.ВключенаВЕдиныйРеестрНалоговыхНакладных = Шапка.ВключенаВЕдиныйРеестрНалоговыхНакладных;
				
				// накладная остается у поставщика
				ОбластьМакета.Параметры.ОстаетсяУПродавца = "Х";
				ОбластьМакета.Параметры.ТипПричины1 = "0";
				ОбластьМакета.Параметры.ТипПричины2 = "1";
				
				ТабДокумент.Вывести(ОбластьМакета);
				
			ИначеЕсли Страница = 2 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ПерваяКопия");
				ТабДокумент.Вывести(ОбластьМакета);
				ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			КонецЕсли;

			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			    ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены)), 7);
			Иначе	
				ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
			КонецЕсли;
			
			Для Инд = 1 По 7 Цикл                                                                 
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
			КонецЦикла; 
			
			// филиал/спецрежим
			ТекНомерФилиал = "";
			Если ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения) Тогда
				ТекНомерФилиал	= "" + Шапка.СпецРежимНалогообложения + ТекНомерФилиал; 
			КонецЕсли;
			Для Инд = 1 По 4 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла; 
					
			Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// налоговые реквизиты не указыватюся
				СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
				ИННОрганизации					= "0";
				НомерСвидетельстваОрганизации	= "0"	
			Иначе	
				СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
				ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
				НомерСвидетельстваОрганизации 	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "НомерСвидетельства,",Ложь);	
			КонецЕсли;
			ОбластьМакета.Параметры.НазваниеОрганизации           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресОрганизации              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдресПочтовый,",  Ложь);
			
			// телефон
			ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "Телефоны,",          Ложь);
			ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныОрганизации);
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;
			
			ИННОрганизации = Прав("            " + ИННОрганизации, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			НомерСвидетельстваОрганизации = Прав("            " + НомерСвидетельстваОрганизации, 10);
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["НомерСвидетельстваОрганизации_"+Инд] = Сред(НомерСвидетельстваОрганизации, Инд, 1);
			КонецЦикла; 
			
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
				ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
				// в этом случае контрагентом выступает организация
				СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
			Иначе
				СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
			КонецЕсли; 
			
			ОбластьМакета.Параметры.НазваниеКонтрагента           = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ПолноеНаименование,",Ложь);
			ОбластьМакета.Параметры.АдресКонтрагента              = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ЮридическийАдресПочтовый,",  Ложь);
			// телефон
			ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
			ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
			ДлинаСтрокиТелефонов = СтрДлина(ТекТелефоныКонтрагента);
			Для НомерСимвола = 1 По ДлинаСтрокиТелефонов ЦИкл
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
			КонецЦикла;
			
			НомерСвидетельстваКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "НомерСвидетельства,",Ложь);
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
	   			ИЛИ НЕ ЗначениеЗаполнено(НомерСвидетельстваКонтрагента)
			    ИЛИ Найти("0123456789",Лев(СокрЛ(НомерСвидетельстваКонтрагента),1)) = 0 Тогда
				НомерСвидетельстваКонтрагента = "0";
			КонецЕсли; 
			НомерСвидетельстваКонтрагента = Прав("            " + НомерСвидетельстваКонтрагента, 10);
			Для Инд = 1 По 10 Цикл
				ОбластьМакета.Параметры["НомерСвидетельстваКонтрагента_"+Инд] = Сред(НомерСвидетельстваКонтрагента, Инд, 1);
			КонецЦикла; 

			ИННКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
			Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
	   			ИЛИ НЕ ЗначениеЗаполнено(ИННКонтрагента)
			    ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
				ИННКонтрагента = "0";
			КонецЕсли; 
			ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
			Если ЗначениеЗаполнено(ТекНомерДоговора) Тогда
				Для Инд = 1 По 6 Цикл
					ОбластьМакета.Параметры["НомерДоговора_"+Инд]    = Сред(ТекНомерДоговора, Инд, 1);
				КонецЦикла; 
			КонецЕсли;
			
			Если ВыводитьНомерДоговораБезКлеточек = Истина Тогда
				ОбластьНомера = ОбластьМакета.Область("НомерДоговора");	
			    ОбластьНомера.Объединить();
				ОбластьМакета.Параметры.НомерДоговора_1 = ТекНомерДоговора;
			КонецЕсли;
			
			ТекДатаДоговора = Шапка.ДатаДоговора;
			Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
				ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
				Для Инд = 1 По 8 Цикл
					ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
				КонецЦикла; 
			КонецЕсли;

			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			ЭтоПерваяСтрока = Истина;
			// Выведем на печать все строки таблицы в раздел I
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
					Продолжить
				КонецЕсли;
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество) Тогда
					ОбластьМакета.Параметры.Количество = СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество;
				КонецЕсли;
			
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				// номенклатура с учетом текста дополнения
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")") +" "+ Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены);
				
				ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
				ОбластьМакета.Параметры.СуммаБезНДС = СимволДляПустыхПоказателей;
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокументЗЦ.R.Добавить();
					СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
					СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
					СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
					СтрокаСтруктуры.G5_ = ОбластьМакета.Параметры.Количество;
					СтрокаСтруктуры.G5  = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),0,ОбластьМакета.Параметры.Количество);
					СтрокаСтруктуры.G5S = ?(ЗначениеЗаполнено(СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество),СтрокаТаблицы.ТекстДляПечатиВКолонкеКоличество,"");
					СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
					
					КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
					Если КолонкаДляСуммы = "20" Тогда
						СтрокаСтруктуры.G7  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
						СтрокаСтруктуры.G8  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
						СтрокаСтруктуры.G9  = СтрокаТаблицы.Сумма;	
					ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
						СтрокаСтруктуры.G10 = СтрокаТаблицы.Сумма;	
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЦикла;
			
		
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
			ОбластьМакета.Параметры.Сумма20 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Укр 	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.Сумма0Эксп	= СимволДляПустыхПоказателей;
			ОбластьМакета.Параметры.СуммаБезНДС	= СимволДляПустыхПоказателей;
			
			Сумма1разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.Сумма; 
			
				Колонка = "Сумма"; 
				Сумма1разд = Сумма1разд + Сумма;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
												
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел I)
			ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);

			
			// Выводим раздел II (тара)
			ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);		
			
			// Выводим разделы III..IV
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
			
			ИтогНДС = 0;
			Всего = СуммаВозвратнойТары;
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
						
				// Итоги
				ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				Если СуффиксКолонки = "БезНДС" Тогда
					// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ ";
				ИначеЕсли СуффиксКолонки = "0Укр"
					  ИЛИ СуффиксКолонки = "0Эксп" Тогда
					// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
					ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
				
				Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					Если СуффиксКолонки = "20" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "0Укр" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G8",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G9",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G10",	СтрокаТаблицы.СуммаНДС);
					КонецЕсли;
					
				КонецЕсли;
							
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = Шапка.КтоВыписалНалоговуюНакладную;	
			
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);

			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;	
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		Возврат ТабДокумент;
		
	КонецЕсли;

КонецФункции // ()

Функция ПечатьДокументаНалоговыйКодекс2014(ТолькоФормироватьСтруктуруПоказателейПечатнойФормы, ИмяМакета = "НалоговаяНакладнаяАльбом")
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим;
	
	КонтрагентНеРезидент = Контрагент.НеЯвляетсяРезидентом;
	
	Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
	
		СтруктураПоказателей = Новый Структура();
		СтруктураПоказателей.Вставить("НалоговыйДокумент",   	Новый Структура());	// данные налоговой накладной
		СтруктураПоказателей.НалоговыйДокумент.Вставить("R",   	Новый ТаблицаЗначений());  // данные табличной части
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G2D");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G3S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G4S");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G5");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G6");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G7");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G8");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G9");
		СтруктураПоказателей.НалоговыйДокумент.R.Колонки.Добавить("G10");
		
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
			// такие операции не предусматривают выписки налоговых накладных
			Возврат	СтруктураПоказателей;
		КонецЕсли;
		
		Если глЗначениеПеременной("ДатаНачалаИспользованияФормыННПоЛекарствам") > Дата  Тогда
			Если ВДокументеЕстьСтавкаНДС7ИДругиеСтавки() Тогда
				Возврат СтруктураПоказателей;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных,
	|	ЭлектронныйДокумент,
	|	ТипПричиныНевыдачиПокупателю,
	|	СпецРежимНалогообложения,
	|	ДоговорКонтрагента.Дата  КАК ДатаДоговора,
	|	ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	Дата,
	|	Контрагент,
	|	Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагент.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН КАК ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН,
	|	Организация,
//	|	Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ЛьготаНДС,
	|	УсловиеПродажи,
	|	ВидДоговора,
	|	ФормаРасчетов,
	|	ВидОперации,
	|	ОбособленноеПодразделение.НаименованиеДляНалоговыхДокументов КАК НаименованиеФилиала,
	|	ОбособленноеПодразделение.Префикс КАК Префикс,
	|	УслугиНерезидентаДляНехозДеят КАК УслугиНерезидентаДляНехозДеят,
	|	ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены,
	|	ПодтверждаетсяГТД,
	|	КтоВыписалНалоговуюНакладную КАК КтоВыписалНалоговуюНакладную
	|ИЗ
	|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
	|
	|ГДЕ
	|	НалоговаяНакладная.Ссылка = &ТекущийДокумент";
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН = Ложь;
	//УчетнаяПолитикаНеЗадана = Ложь;
	//УчетнаяПолитика	= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	//Если НЕ УчетнаяПолитикаНеЗадана тогда
	//	ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН = УчетнаяПолитика.ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН;
	//КонецЕсли;
	
	ДополнениеКНаименованиюОрганизации = "";
	ДополнениеКАдресуОрганизации = "";
	//Если  ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН = Истина
	//	И ЗначениеЗаполнено(Шапка.ГоловнаяОрганизация) Тогда
	//	
	//	СведенияОГоловнойОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ГоловнаяОрганизация, Шапка.Дата);
	//	
	//	ДополнениеКНаименованиюОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловнойОрганизации,    "ПолноеНаименование,",Ложь) 			+ " - " ;
	//	ДополнениеКАдресуОрганизации       = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловнойОрганизации,    "ЮридическийАдресПочтовый,",  Ложь)  + " - " ;
	//
	//КонецЕсли;
	Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
		СведенияОГоловномКонтрагентеПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.ГоловнойКонтрагент, Шапка.Дата);	
	КонецЕсли;
	
	// Подготовим таблицы
	Отказ = Ложь;
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати  = "ПАРАМЕТРЫ_ПЕЧАТИ_НалоговаяНакладная_" + ИмяМакета;

	Макет = ПолучитьМакет("НалоговаяНакладная2014");
	Если ИмяМакета = "НалоговаяНакладнаяАльбом" Тогда
		Макет = ПолучитьМакет("НалоговаяНакладная2014Альбом");	
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	Макет.КодЯзыкаМакета = "ru";
	
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим);

	// Загрузим все таблицы (кроме тары) в одну таблицу
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПрочим, ТаблицаНоменклатуры);	
	
	// свернем подобные строки
	ТаблицаНоменклатуры.Свернуть("ДатаОтгрузкиОплаты, Номенклатура, Характеристика, КодУКТВЭД, ЕдиницаИзмерения, ЦенаБезНДСРегл, СтавкаНДС", "Количество, СуммаБезНДСРегл, СуммаНДСРегл, СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");   	
	// переименуем колонки
	ТаблицаНоменклатуры.Колонки.ЦенаБезНДСРегл.Имя 				 = "ЦенаБезНДС";
	ТаблицаНоменклатуры.Колонки.СуммаБезНДСРегл.Имя 			 = "Сумма";
	ТаблицаНоменклатуры.Колонки.СуммаНДСРегл.Имя				 = "СуммаНДС";
	
	// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
	ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
	// определим параметры шапки документа
	//Дата
	ТекДата = Формат(Шапка.Дата, "ДФ=ddMMyyyy");
	
	// Номер
	ТекНомер = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(ЭтотОбъект)), 7);
	Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
	    ТекНомерОЦ = Прав("       " + СокрЛП(ОбщегоНазначения.ПолучитьНомерНаПечать(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены)), 7);
	Иначе	
		ТекНомерОЦ = ТекНомер;
	КонецЕсли;
	
	// филиал/спецрежим
	ТекНомерФилиал = "";
	КодСпецРежима = ?(ЗначениеЗаполнено(Шапка.СпецРежимНалогообложения), "" + Шапка.СпецРежимНалогообложения, " "); //или пробел или одна цифра
	НомерФилиала  = ?(ЗначениеЗаполнено(Шапка.Префикс), Прав("    " + Формат(Число(Шапка.Префикс),"ЧЦ=4; ЧГ=0"), 4), "");  //число  4 символа, без лидирующих нулей
	Если ЗначениеЗаполнено(КодСпецРежима + НомерФилиала) Тогда
		ТекНомерФилиал	= ТекНомерФилиал + КодСпецРежима + НомерФилиала; 
	КонецЕсли;
	
	// номер договора
	ТекНомерДоговора = СокрЛП("" + Шапка.НомерДоговора);
	
	// дата договора
	ТекДатаДоговора = Шапка.ДатаДоговора;
	Если ЗначениеЗаполнено(ТекДатаДоговора) Тогда
		ТекДатаДоговора = Формат(ТекДатаДоговора,"ДФ=ddMMyyyy");
	Иначе
		ТекДатаДоговора = "";
	КонецЕсли;
	
	////////////////////////////////////////////
	// Продавец
	
	// ИНН, Номер свидетельства, Наименование, Адрес
	Если  Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		// налоговые реквизиты не указыватюся
		СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		ИННОрганизации					= ?(Шапка.УслугиНерезидентаДляНехозДеят = Истина, "200000000000", "300000000000");
		НазваниеОрганизации				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		АдресОрганизации 				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдресПочтовый,",  Ложь);
		Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
			НазваниеОрганизации         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь) 		
										  + " - " + НазваниеОрганизации;
			АдресОрганизации 			= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ЮридическийАдресПочтовый,",  Ложь)	
										  + " - " + АдресОрганизации;
		КонецЕсли;
		
	Иначе	
		
		СведенияОПродавце   		    = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		ИННОрганизации					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ИНН,"               ,Ложь);
		НазваниеОрганизации				= ДополнениеКНаименованиюОрганизации + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ПолноеНаименование,",Ложь);
		АдресОрганизации 				= ДополнениеКАдресуОрганизации 		 + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце,    "ЮридическийАдресПочтовый,",  Ложь);
		
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			НазваниеОрганизации = НазваниеОрганизации + Шапка.НаименованиеФилиала;	
		КонецЕсли;
		
	КонецЕсли;
	ИННОрганизации 				  = Прав("            " + ИННОрганизации, 12);
	
	// телефон
	ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПродавце, "Телефоны,", Ложь);
	ТекТелефоныОрганизации = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныОрганизации);
	ДлинаСтрокиТелефоновОрганизации = СтрДлина(ТекТелефоныОрганизации);
	
	
	////////////////////////////////////////////
	// покупатель
	
	// Название, адрес, номер свидетельства, ИНН
	Если    Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа
   		//ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажаСписаниеОС 
		ИЛИ Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		// в этом случае контрагентом выступает организация
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
		НазваниеКонтрагента				= ДополнениеКНаименованиюОрганизации + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
		АдресКонтрагента 				= ДополнениеКАдресуОрганизации 		 + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдресПочтовый,",  Ложь);
		Если Шапка.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
			ИННКонтрагента 				  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		Иначе	
			ИННКонтрагента 				  = "400000000000";
		КонецЕсли;
		Если ЗначениеЗаполнено(Шапка.НаименованиеФилиала) Тогда
			НазваниеКонтрагента = НазваниеКонтрагента + Шапка.НаименованиеФилиала;	
		КонецЕсли;
	Иначе
		СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.Дата);
		
		НазваниеКонтрагента				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ПолноеНаименование,",Ложь);
		АдресКонтрагента 				= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,    "ЮридическийАдресПочтовый,",  Ложь);
		Если Шапка.ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН = Истина Тогда
			НазваниеКонтрагента         = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ПолноеНаименование,",Ложь)
										  + " - " + НазваниеКонтрагента;
			АдресКонтрагента 			= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГоловномКонтрагентеПокупателя,  "ЮридическийАдресПочтовый,",  Ложь)	
										  + " - " + АдресКонтрагента;
		КонецЕсли;
		
		ИННКонтрагента 				  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "ИНН," ,Ложь);
		
		Если НЕ ЗначениеЗаполнено(ИННКонтрагента)
			ИЛИ Найти("0123456789",Лев(СокрЛ(ИННКонтрагента),1)) = 0 Тогда
			ИННКонтрагента = "400000000000";
		КонецЕсли; 
		
	КонецЕсли; 
	ИННКонтрагента = Прав("            " + ИННКонтрагента, 12);
	
	// телефон
	ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,  "Телефоны," ,Ложь);
	ТекТелефоныКонтрагента = ФормированиеПечатныхФорм.ПолучитьТелефонДляНалоговойНакладной(ТекТелефоныКонтрагента);
	ДлинаСтрокиТелефоновКонтрагентов = СтрДлина(ТекТелефоныКонтрагента);
	
	// кто выписал налоговую накладную нужно формировать в виде "И.О. Фамилия"
	ПечКтоВыписалНалоговуюНакладную = "";
	ФИОКтоВыписалНалоговуюНакладную = РегистрыСведений.ФИОФизЛиц.СрезПоследних(Дата, Новый Структура("ФизЛицо", Шапка.КтоВыписалНалоговуюНакладную));
	Если ФИОКтоВыписалНалоговуюНакладную.Количество() > 0 Тогда
		ПечКтоВыписалНалоговуюНакладную =  ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Имя), 1))
										 + ". "
										 + ВРег(Лев(СокрЛ(ФИОКтоВыписалНалоговуюНакладную[0].Отчество), 1))
										 + ". "
										 + СокрЛП(ФИОКтоВыписалНалоговуюНакладную[0].Фамилия); 
	Иначе
		ПечКтоВыписалНалоговуюНакладную = "" + Шапка.КтоВыписалНалоговуюНакладную;									 
	КонецЕсли;
	
	Для Страница = 1 По 2 Цикл
		
		Если  Страница = 2 Тогда
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента 
				ИЛИ (Шапка.ЭлектронныйДокумент И НЕ Шапка.ПодтверждаетсяГТД) Тогда
				// печатаем в одном экземпляре
				Продолжить;
			КонецЕсли;
			
			ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
			
		КонецЕсли;
		
		ОбластьМакетаЗаголовок = Макет.ПолучитьОбласть("Оригинал");
		ОбластьМакетаЗаголовок.Параметры.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Шапка.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных;
		ОбластьМакетаЗаголовок.Параметры.ЭлектронныйДокумент 							 = Шапка.ЭлектронныйДокумент И НЕ Шапка.ПодтверждаетсяГТД;
		Если Шапка.ЭлектронныйДокумент = Ложь ИЛИ Шапка.ПодтверждаетсяГТД = Истина Тогда
			Если Страница = 2 Тогда
				// копия - всегда остается у продавца
				ОбластьМакетаЗаголовок.Параметры.ОстаетсяУПродавца  = "Х";
				
			Иначе
				
				// оргинал
				Если  Шапка.ТипПричиныНевыдачиПокупателю = 0 ИЛИ Шапка.ТипПричиныНевыдачиПокупателю = 1 Тогда
					
					// НН, для которой тип причины невыдачи - продажа ниже обычных цен выдается покупателю, вторая пара накладных (собстенно на превышение) - нет
					ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю = "Х";
				
				Иначе
					
					// накладная остается у поставщика
					ОбластьМакетаЗаголовок.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
					ОбластьМакетаЗаголовок.Параметры.ТипПричины1 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),1,1);
					ОбластьМакетаЗаголовок.Параметры.ТипПричины2 = Сред(Формат(Шапка.ТипПричиныНевыдачиПокупателю, "ЧЦ=2;ЧВН="),2,1);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
		
		// Выводим отступ
		ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
		ТабДокумент.Вывести(ОбластьМакета);

		// Выводим заголовок накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		//Дата
		Для Инд = 1 По 8 Цикл
			ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
		КонецЦикла; 
		
		// Номер
		Для Инд = 1 По 7 Цикл                                                                 
			ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомер, Инд, 1);
		КонецЦикла; 
		
		// филиал/спецрежим 
		Для Инд = 1 По 5 Цикл                                                                 
			ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
		КонецЦикла; 
		
		// наименование продавца
		ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
		
		// адрес продавца
		ОбластьМакета.Параметры.АдресОрганизации    = АдресОрганизации;
		
		// телефон продавца
		Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
			ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
		КонецЦикла;
		
		// ИНН продавца
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
		КонецЦикла; 
		
		// название покупателя
		ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеКонтрагента;
		
		// адрес покупателя
		ОбластьМакета.Параметры.АдресКонтрагента    = АдресКонтрагента;
		
		// телефон покупателя
		Для НомерСимвола = 1 По ДлинаСтрокиТелефоновКонтрагентов ЦИкл
			ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
		КонецЦикла;
		// ИНН покупателя
		Для Инд = 1 По 12 Цикл
			ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
		КонецЦикла; 
		
		// номер договора
		ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
		
		// дата договора
		Для Инд = 1 По 8 Цикл
			ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
		КонецЦикла; 
		
		ТабДокумент.Вывести(ОбластьМакета);

		Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина  И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HORIG",	ОбластьМакетаЗаголовок.Параметры.ВыдаетсяПокупателю);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HERPN",	Формат(ОбластьМакетаЗаголовок.Параметры.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных, "БЛ=; БИ=Х"));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HEL",	Формат(ОбластьМакетаЗаголовок.Параметры.ЭлектронныйДокумент, "БЛ=; БИ=Х"));
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HFILL",	Шапка.Дата);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM",		Прав(ТекНомер,7));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM1",	Лев(ТекНомерФилиал, 1));
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNUM2",	Сред(ТекНомерФилиал, 2));
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMESEL",	ОбластьМакета.Параметры.НазваниеОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HNAMEBUY",	ОбластьМакета.Параметры.НазваниеКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKSEL",	ИННОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HKBUY",	ИННКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCSEL",	ОбластьМакета.Параметры.АдресОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HLOCBUY",	ОбластьМакета.Параметры.АдресКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELSEL",	ТекТелефоныОрганизации);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("HTELBUY",	ТекТелефоныКонтрагента);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G1S",	ОбластьМакета.Параметры.ВидДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G2D",	Шапка.ДатаДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H01G3S",	ТекНомерДоговора);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H02G1S",	ОбластьМакета.Параметры.ФормаРасчетов);
			СтруктураПоказателей.НалоговыйДокумент.Вставить("H10G1S",	ПечКтоВыписалНалоговуюНакладную);
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	Шапка.ЛьготаНДС);	
			Иначе
				СтруктураПоказателей.НалоговыйДокумент.Вставить("R003G10S",	"");	
			КонецЕсли;
 			
		КонецЕсли;
				
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ТабДокумент.Вывести(ОбластьМакета);
		
				
		
		ЭтоПерваяСтрока = Истина;
		// Выведем на печать все строки таблицы в раздел I
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			
			Если ЭтоПерваяСтрока Тогда	
				// в первой строке раздела укажем номер раздела
				ОбластьМакета.Параметры.НомерРаздела = "I";
				ЭтоПерваяСтрока = Ложь;
			Иначе
				ОбластьМакета.Параметры.НомерРаздела = "";
			КонецЕсли;	
			
			ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
			
			ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
			
			// дата отгрузки/оплаты
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
				// укажем дату выписки накладной
				ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) И Страница = 1 Тогда
				Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
			КонецЕсли;
			
			ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
												+ ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")");
			
			// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
			Колонка = "Сумма" + ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
			ТабДокумент.Вывести(ОбластьМакета);
			
			Если ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				СтрокаСтруктуры = СтруктураПоказателей.НалоговыйДокумент.R.Добавить();
				СтрокаСтруктуры.G2D = ОбластьМакета.Параметры.ДатаОтгрузкиОплаты;
				СтрокаСтруктуры.G3S = ОбластьМакета.Параметры.Номенклатура;
				
				СтрокаСтруктуры.G4 = ОбластьМакета.Параметры.КодУКТВЭД;
				
				СтрокаСтруктуры.G4S = ОбластьМакета.Параметры.ЕдиницаИзмерения;
				СтрокаСтруктуры.G5  = ОбластьМакета.Параметры.Количество;
				СтрокаСтруктуры.G6  = ОбластьМакета.Параметры.ЦенаБезНДС;
				
				КолонкаДляСуммы = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				Если КолонкаДляСуммы = "20" Тогда
					СтрокаСтруктуры.G7  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Укр" Тогда
					СтрокаСтруктуры.G8  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "0Эксп" Тогда
					СтрокаСтруктуры.G9  = СтрокаТаблицы.Сумма;	
				ИначеЕсли КолонкаДляСуммы = "БезНДС" Тогда
					СтрокаСтруктуры.G10 = СтрокаТаблицы.Сумма;	
				КонецЕсли;
				
			КонецЕсли;
							
		КонецЦикла;
		
	
		// Выводми итог по I разделу и раздел II
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
		
		Сумма1разд = 0;
		
		// Получим итоговые суммы по товарам
		ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			
			Сумма = СтрокаТаблицы.Сумма; 
			
			Колонка = "Сумма"; 
			Сумма1разд = Сумма1разд + Сумма;
			
			ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
			
		КонецЦикла;	
		
		// колонка 11 по товарам (раздел I)
		ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
		ТабДокумент.Вывести(ОбластьМакета);

		
		// Выводим раздел II (тара)
		ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
		ТаблицаПоТаре.Свернуть("", "СуммаСНДСРегл");
		
		СуммаВозвратнойТары = 0;
		Для каждого СтрокаТаблицы из ТаблицаПоТаре Цикл
			//В таблице не более одной строки
			СуммаВозвратнойТары = СтрокаТаблицы.СуммаСНДСРегл;
		КонецЦикла;
		ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары);
		
		ТабДокумент.Вывести(ОбластьМакета);		
		
		Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
			
			СтруктураПоказателей.НалоговыйДокумент.Вставить("R02G11",	СуммаВозвратнойТары);
			
		КонецЕсли;
		
		// Выводим разделы III - IV (итоги)
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
		
		ИтогНДС = 0;
		Всего = СуммаВозвратнойТары;
		
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			
			СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
			
			// Итоги
			ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
			Если СуффиксКолонки = "БезНДС" Тогда
				// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
				ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
			ИначеЕсли СуффиксКолонки = "0Укр"
				  ИЛИ СуффиксКолонки = "0Эксп" Тогда
				// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
				Если НЕ СпецРежимНалогообложения = 7 Тогда
					ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
			КонецЕсли;
			ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
			
			Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
				
				Если СуффиксКолонки = "20" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "0Укр" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G8",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G9",	СтрокаТаблицы.СуммаНДС);
				ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
					СтруктураПоказателей.НалоговыйДокумент.Вставить("R03G10S",	"Без ПДВ");
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЦикла;
		
		// Итоги в 11 колонке
		ТаблицаНоменклатуры.Свернуть("","Сумма,СуммаНДС");
		Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
			//в таблице не более одной строки
			ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
			Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
		КонецЦикла;
		ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
		ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
		
		ТабДокумент.Вывести(ОбластьМакета);	
		
		// Выводим подвал накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
		
		Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
		    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
			ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
			ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);

		Если Страница <> 2 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
	КонецЦикла; 

	Если ПродажаНижеОбычнойЦены И НЕ ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
		
		//удалим лишние колонки
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.ЦенаБезНДС);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.Сумма);
		ТаблицаНоменклатуры.Колонки.Удалить(ТаблицаНоменклатуры.Колонки.СуммаНДС);
		
		// переименуем колонки
		ТаблицаНоменклатуры.Колонки.СуммаБезНДСПревышенияРегл.Имя 	 = "Сумма";
		ТаблицаНоменклатуры.Колонки.СуммаНДСПревышенияРегл.Имя		 = "СуммаНДС";
		
		// Для печати второго экземпляра накладной понадобится исходная таблица, которая в процессе печати первого экземпляра будет свернута
		ТаблицаНоменклатурыКопия = ТаблицаНоменклатуры.Скопировать();
	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	    Для Страница = 1 По 2 Цикл
			
			Если  Страница = 2 Тогда
				
				ТаблицаНоменклатуры = ТаблицаНоменклатурыКопия.Скопировать();
				
			КонецЕсли;
		
			ОбластьМакета = Макет.ПолучитьОбласть("Оригинал");
			Если  Страница = 2 Тогда
				// копия - накладная остается у поставщика 
				ОбластьМакета.Параметры.ОстаетсяУПродавца = "Х";
			Иначе	
				// оригинал, но все копии остаются у поставщика
				ОбластьМакета.Параметры.ВсеЭкзОстаютсяУПродавца = "Х";
				ОбластьМакета.Параметры.ТипПричины1 = "0";
				ОбластьМакета.Параметры.ТипПричины2 = "1";
				// безоплатная поставка тип причины - "12"
				Если СуммаДокумента = 0 Тогда
					ОбластьМакета.Параметры.ТипПричины1 = "1";
					ОбластьМакета.Параметры.ТипПричины2 = "2";
				КонецЕсли;
			КонецЕсли;	
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим отступ
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);
			
			// Выводим заголовок накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.Заполнить(Шапка);
			
			//Дата
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["Дата_"+Инд]    = Сред(ТекДата, Инд, 1);
			КонецЦикла; 
			
			// Номер
			Для Инд = 1 По 7 Цикл                                  
				ОбластьМакета.Параметры["Номер_"+Инд]    = Сред(ТекНомерОЦ, Инд, 1);
			КонецЦикла; 
			
			// спецрежим/филиал
			Для Инд = 1 По 5 Цикл                                                                 
				ОбластьМакета.Параметры["НомерФилиал_"+Инд]    = Сред(ТекНомерФилиал, Инд, 1);
			КонецЦикла; 
						
			// наименование продавца
			ОбластьМакета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
			
			// адрес продавца
			ОбластьМакета.Параметры.АдресОрганизации    = АдресОрганизации;
			
			// телефон продавца
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновОрганизации ЦИкл
				ОбластьМакета.Параметры["ТелефоныОрганизации_"+НомерСимвола] = Сред(ТекТелефоныОрганизации, НомерСимвола, 1);
			КонецЦикла;
			
			// ИНН продавца
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННОрганизации_"+Инд] = Сред(ИННОрганизации, Инд, 1);
			КонецЦикла; 
			
			// название покупателя
			ОбластьМакета.Параметры.НазваниеКонтрагента = НазваниеКонтрагента;
			
			// адрес покупателя
			ОбластьМакета.Параметры.АдресКонтрагента    = АдресКонтрагента;
			
			// телефон покупателя
			Для НомерСимвола = 1 По ДлинаСтрокиТелефоновКонтрагентов ЦИкл
				ОбластьМакета.Параметры["ТелефоныКонтрагента_"+НомерСимвола] = Сред(ТекТелефоныКонтрагента, НомерСимвола, 1);
			КонецЦикла;

			// ИНН покупателя
			Для Инд = 1 По 12 Цикл
				ОбластьМакета.Параметры["ИННКонтрагента_"+Инд]    = Сред(ИННКонтрагента, Инд, 1);
			КонецЦикла; 
			
			// номер договора
			ОбластьМакета.Параметры.НомерДоговора = ТекНомерДоговора;
			
			// дата договора
			Для Инд = 1 По 8 Цикл
				ОбластьМакета.Параметры["ДатаДоговора_"+Инд]    = Сред(ТекДатаДоговора, Инд, 1);
			КонецЦикла;

			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим шапку накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим табличную часть
			ОбластьМакета = Макет.ПолучитьОбласть("РазделI");
			
			ЭтоПерваяСтрока = Истина;
			// Выведем на печать все строки таблицы в раздел I
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				Если СтрокаТаблицы.Сумма = 0 И СтрокаТаблицы.СуммаНДС = 0 Тогда
					Продолжить
				КонецЕсли;
				
				Если ЭтоПерваяСтрока Тогда	
					// в первой строке раздела укажем номер раздела
					ОбластьМакета.Параметры.НомерРаздела = "I";
					ЭтоПерваяСтрока = Ложь;
				Иначе
					ОбластьМакета.Параметры.НомерРаздела = "";
				КонецЕсли;	
				
				ОбластьМакета.Параметры.Заполнить(СтрокаТаблицы);
				ОбластьМакета.Параметры.КодУКТВЭД = СтрЗаменить(ОбластьМакета.Параметры.КодУКТВЭД, " ", "");
				
				// дата отгрузки/оплаты
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДатаОтгрузкиОплаты) Тогда
					
					// укажем дату выписки накладной
					ОбластьМакета.Параметры.ДатаОтгрузкиОплаты = Дата;
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
					Сообщить(НСтр("ru='В одной из строк не заполнено наименование номенклатуры - проверьте заполнение документа!';uk='В одному з рядків не заповнене найменування номенклатури - перевірте заповнення документа!'"), СтатусСообщения.Важное);
				КонецЕсли;
				
				// номенклатура с учетом текста дополнения
				ОбластьМакета.Параметры.Номенклатура = СокрП("" + СтрокаТаблицы.Номенклатура)
	 												 + ?(НЕ ЗначениеЗаполнено(СтрокаТаблицы.Характеристика), "", "(" + СтрокаТаблицы.Характеристика +")")
													 +" "+ Шапка.ТекстДополненияКНаименованиюПриПродажеНижеОбычнойЦены;
				
				// Определим в какую колонку (в зависимости от ставки НДС) попадает сумма без НДС
				Колонка = "Сумма"+ ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				ОбластьМакета.Параметры[Колонка] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма, ,"0,00");
				
				ТабДокумент.Вывести(ОбластьМакета);
					
			КонецЦикла;
			
		
			// Выводми итог по I разделу и раздел II
			ОбластьМакета = Макет.ПолучитьОбласть("ИтогРазделI");
			
			Сумма1разд = 0;
			
			// Получим итоговые суммы по товарам и товаротранспортным затратам
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", " Сумма, СуммаНДС");
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
				
				Сумма = СтрокаТаблицы.Сумма; 
			
				Колонка = "Сумма"; 
				Сумма1разд = Сумма1разд + Сумма;
				
				ОбластьМакета.Параметры[Колонка + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(Сумма, ,"0,00");
				
			КонецЦикла;	
			
			// колонка 11 по товарам (раздел I)
			ОбластьМакета.Параметры.Сумма1разд = ОбщегоНазначения.ФорматСумм(Сумма1разд, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);

			// Выводим раздел II (тара)
			ОбластьМакета = Макет.ПолучитьОбласть("ВозврТара");
			
			СуммаВозвратнойТары = 0;
			
			ОбластьМакета.Параметры.ВозвТара = ОбщегоНазначения.ФорматСумм(СуммаВозвратнойТары);
			
			ТабДокумент.Вывести(ОбластьМакета);		
			
			// Выводим разделы III..IV
			ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
			ТаблицаНоменклатуры.Свернуть("СтавкаНДС", "Сумма, СуммаНДС");
			
			ИтогНДС = 0;
			Всего = СуммаВозвратнойТары;
			
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				
				СуффиксКолонки = ОпределитьКолонкуТаблицы(СтрокаТаблицы.СтавкаНДС);
						
				// Итоги
				ОбластьМакета.Параметры["ИтогНДС" 		  + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.СуммаНДС, ,"0,00");
				Если СуффиксКолонки = "БезНДС" Тогда
					// п.10 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					ОбластьМакета.Параметры["ИтогНДС" 	  + СуффиксКолонки] = "Без ПДВ";
				ИначеЕсли СуффиксКолонки = "0Укр"
					  ИЛИ СуффиксКолонки = "0Эксп" Тогда
					// п.11 Порядка заполнения налоговой накладной устанавливает особые правила заполнения этой ячейки:
					Если НЕ СпецРежимНалогообложения = 7 Тогда
						ОбластьМакета.Параметры["ИтогНДС0Укр"]  = "0";
					КонецЕсли;
					ОбластьМакета.Параметры["ИтогНДС0Эксп"] = "0";
				КонецЕсли;
				ОбластьМакета.Параметры["ИтогСуммаСНДС"   + СуффиксКолонки] = ОбщегоНазначения.ФорматСумм(СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаНДС, ,"0,00");
				
				Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина И Страница = 1 Тогда
					
					Если СуффиксКолонки = "20" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G7",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "0Укр" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G8",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "0Эксп" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G9",	СтрокаТаблицы.СуммаНДС);
					ИначеЕсли СуффиксКолонки = "БезНДС" Тогда
						СтруктураПоказателей.НалоговыйДокументЗЦ.Вставить("R03G10",	"Без ПДВ");
					КонецЕсли;
					
				КонецЕсли;
							
			КонецЦикла;
			
			// Итоги в 11 колонке
			ТаблицаНоменклатуры.Свернуть("","Сумма, СуммаНДС");
			Для каждого СтрокаТаблицы Из ТаблицаНоменклатуры Цикл
				//в таблице не более одной строки
				ИтогНДС 		= СтрокаТаблицы.СуммаНДС;
				Всего 			= Всего + СтрокаТаблицы.Сумма + ИтогНДС;
			КонецЦикла;
			ОбластьМакета.Параметры.ИтогНДС			= ОбщегоНазначения.ФорматСумм(ИтогНДС, ,"0,00");
			ОбластьМакета.Параметры.Всего 			= ОбщегоНазначения.ФорматСумм(Всего, ,"0,00");
			
			ТабДокумент.Вывести(ОбластьМакета);	
			
			// Выводим подвал накладной
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			
			ОбластьМакета.Параметры.КтоВыписалНалоговуюНакладную = ПечКтоВыписалНалоговуюНакладную;	
			
			Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
			    ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
				ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
				ОбластьМакета.Параметры.ЛьготаНДС = Шапка.ЛьготаНДС;	
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);

			Если Страница <> 2 Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла; 
		
	КонецЕсли;	
	
	Если  ТолькоФормироватьСтруктуруПоказателейПечатнойФормы = Истина Тогда
		
		Возврат СтруктураПоказателей;
		
	Иначе	
		
		Возврат ТабДокумент;
		
	КонецЕсли;
	
КонецФункции 

//Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
		// такие операции не предусматривают выписки налоговых накладных
		Возврат	
	КонецЕсли;
	
	Если глЗначениеПеременной("ДатаНачалаИспользованияФормыННПоЛекарствам") > Дата  Тогда
		Если ВДокументеЕстьСтавкаНДС7ИДругиеСтавки() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;		
	
	Если ЗначениеЗаполнено(ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи!");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли; 

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	// Получить экземпляр документа на печать
	Если  ИмяМакета = "НалоговаяНакладная"
	    ИЛИ ИмяМакета = "НалоговаяНакладнаяАльбом"
		Тогда
		//ТабДокумент = ПечатьДокумента();
		ТабДокумент = ПечатьДокумента(,ИмяМакета);
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект));

КонецПроцедуры // Печать


// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;

	СтруктураМакетов.Вставить("НалоговаяНакладная", "Налоговая накладная");
	СтруктураМакетов.Вставить("НалоговаяНакладнаяАльбом", "Налоговая накладная (альбом. ориент.)");

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли

Функция ВДокументеЕстьСтавкаНДС7ИДругиеСтавки(ВыдаватьСообщенение = Истина) Экспорт
                                                       
	Отбор = Новый Структура("СтавкаНДС", Перечисления.СтавкиНДС.НДС7);
	КоличествоНДС7 =   Товары.НайтиСтроки(Отбор).Количество()
					 + Услуги.НайтиСтроки(Отбор).Количество()
			 		 + Прочее.НайтиСтроки(Отбор).Количество();
					 
	КоличествоВсего =  Товары.Количество()
					 + Услуги.Количество()
			 		 + Прочее.Количество();
					 
	Если КоличествоНДС7 > 0 И (КоличествоНДС7 <> КоличествоВсего) Тогда
		
			Если ВыдаватьСообщенение = Истина Тогда
			
				Сообщить(НСтр("ru = 'Форма налоговой накладной, утвержденная 14.01.2014 приказом Миндоходов № 10, не предусматривает наличие ставки НДС  7%. 
                               |В данной налоговой накладной присутствует номенклатура, которая облагается как по ставке 7% так и по другим ставкам.
                               |Согласно рекомендации Миндоходов, изложенной в письме  от 04.04.2014  № 7860/7/99-99-19-04-02-17, на номенклатуру, облагаемую НДС по ставке 7%, необходимо выписывать отдельную налоговую накладную.
                               |Воспользуйтесь пунктом ""Перенести товары по ставке 7% в отдельную накладную"" меню ""Действия"" на форме документа!'; uk = 'Форма податкової накладню, що затверждена 14.01.2014 наказом Міндоходів № 10, не передбачає наявності ставки ПДВ 7%.
                               |В податковій накладній наявна номенклатура, що оподатковується ПДВ як за ставкою 7% так і за іншими ставками.
                               |Згідно рекомендації Міндоходів, що викладена у листі від 04.04.2014  № 7860/7/99-99-19-04-02-17, на номенклатуру, що оподатковується ПДВ за ставкою 7%, необхідно складати окрему податкову накладну.
                               |Скористайтеся пунктом ""Перенести товари за ставкою 7% до окремої накладної""  меню ""Дії"" на формі документа! '"), СтатусСообщения.ОченьВажное);
				
			КонецЕсли;
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;

КонецФункции

Функция ВДокументеЕстьСтавкаНДС7() Экспорт
                                                       
	Отбор = Новый Структура("СтавкаНДС", Перечисления.СтавкиНДС.НДС7);
	
	Если    (Товары.НайтиСтроки(Отбор).Количество() > 0)
		ИЛИ (Услуги.НайтиСтроки(Отбор).Количество() > 0)
		ИЛИ (Прочее.	НайтиСтроки(Отбор).Количество() > 0)
		Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;

КонецФункции

Функция ВыделитьСтавкуНДС7ВОтдельныйДокумент(ВыдаватьСообщения = Истина) Экспорт
	
	НоваяНакладная = Неопределено;
	
	Если ВДокументеЕстьСтавкаНДС7() = Ложь Тогда
		Если ВыдаватьСообщения = Истина Тогда
			Сообщить(Нстр("ru = 'В данной накладной нет товаров по ставке 7%. Действие не выполнено!'; uk = 'В цій накладній немає товарів по ставці 7%. Дія не виконана!'"));
		КонецЕсли;
		Возврат НоваяНакладная;
	КонецЕсли;

	Если ВДокументеЕстьСтавкаНДС7ИДругиеСтавки(Ложь) = Ложь Тогда
		Если ВыдаватьСообщения = Истина Тогда
			Сообщить(Нстр("ru = 'В данной накладной все товары по ставке 7%. Действие не выполнено!'; uk = 'В цій накладній всі товари по ставці 7%. Дія не виконана!'"));
		КонецЕсли;
		Возврат НоваяНакладная;
	КонецЕсли;
	
	НоваяНакладная = ЭтотОбъект.Скопировать();
	НоваяНакладная.Дата = Дата;
	НоваяНакладная.УстановитьНовыйНомер();
	
	НДС7 = Перечисления.СтавкиНДС.НДС7;
	
	СписокТЧ = Новый Структура("Товары, Услуги, Прочее");
	
	ВсеСтрокиКУдалениюСтараяНакладная = Новый Структура;
	ВсеСтрокиКУдалениюНоваяНакладная  = Новый Структура;
	
	Для каждого ТЧ Из СписокТЧ Цикл
		
		ИмяТЧ = ТЧ.Ключ;
		
		СтрокиКУдалениюСтараяНакладная = Новый Массив;
		СтрокиКУдалениюНоваяНакладная  = Новый Массив;
		
		Для НомСтр = 1 По ЭтотОБъект[ИмяТЧ].Количество() Цикл
			
			ТекущаяСтрока = ЭтотОБъект[ИмяТЧ][НомСтр-1];
			
			Если ТекущаяСтрока.СтавкаНДС = НДС7 Тогда
				
				СтрокиКУдалениюСтараяНакладная.Добавить(ТекущаяСтрока);
				
			Иначе	
				
				СтрокиКУдалениюНоваяНакладная.Добавить(НоваяНакладная[ИмяТЧ][НомСтр-1]);	
				
			КонецЕсли;
			
		КонецЦикла;  	
		
		ВсеСтрокиКУдалениюСтараяНакладная.Вставить(ИмяТЧ, СтрокиКУдалениюСтараяНакладная);
		ВсеСтрокиКУдалениюНоваяНакладная.Вставить (ИмяТЧ, СтрокиКУдалениюНоваяНакладная);
		
	КонецЦикла;
	
	// удалим все строки в новой налоговой и попытаемся ее записать
	Для каждого ТекТЧ Из ВсеСтрокиКУдалениюНоваяНакладная Цикл
		
		ИмяТЧ 						  = ТекТЧ.Ключ;
		СтрокиКУдалениюНоваяНакладная = ТекТЧ.Значение;
		
		Для каждого СтрокаКУдалению Из СтрокиКУдалениюНоваяНакладная Цикл
			
			НоваяНакладная[ИмяТЧ].Удалить(СтрокаКУдалению);
			
		КонецЦикла;
	
	КонецЦикла;	
		
	Попытка
		
		НоваяНакладная.Записать(РежимЗаписиДокумента.Запись);
		
	Исключение
		
		Если ВыдаватьСообщения = Истина Тогда
			Сообщить(НСтр("ru = 'Не удалось выделить товары по ставке НДС 7% в отдельную накладную:'; uk = 'Не вдалося перенести товари за ставкою ПДВ 7% до окремої накладної: '") + ОписаниеОшибки());
		КонецЕсли;
		
		НоваяНакладная = Неопределено;
		
		Возврат НоваяНакладная;
		
	КонецПопытки;
		
	// теперь окончательно "испортим" текущую накладную - так как новая уже записана
	Для каждого ТекТЧ Из ВсеСтрокиКУдалениюСтараяНакладная Цикл
		
		ИмяТЧ 						  = ТекТЧ.Ключ;
		СтрокиКУдалениюСтараяНакладная = ТекТЧ.Значение;
		
		Для каждого СтрокаКУдалению Из СтрокиКУдалениюСтараяНакладная Цикл
			
			ЭтотОбъект[ИмяТЧ].Удалить(СтрокаКУдалению);
			
		КонецЦикла;
	
	КонецЦикла;	
	
	Возврат НоваяНакладная;
	
КонецФункции

Процедура ЗаполнитьСтатьюКнигиПродаж(СтрокаТЧ, ИмяТабЧасти) Экспорт
	
	МетаданныеДокумента = Метаданные();
	
	Если НЕ ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СтавкаНДС", МетаданныеДокумента, ИмяТабЧасти) Тогда
			Возврат
	КонецЕсли;

	Если  ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа Тогда
		
		Если Дата >= '20110301' Тогда
				СтрокаТЧ.СтатьяКнигиПродаж = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20;
		Иначе	
			СтрокаТЧ.СтатьяКнигиПродаж = Справочники.СтатьиНалоговыхДеклараций.НДС_НОКорректировкаПрочее;
		КонецЕсли;

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		СтрокаТЧ.СтатьяКнигиПродаж = Справочники.СтатьиНалоговыхДеклараций.НДС_НОНерезидентУслуги;	
		
	ИначеЕсли СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС20
		ИЛИ  СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
		
		// 20%
			СтрокаТЧ.СтатьяКнигиПродаж = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке20;
		
	ИначеЕсли СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		
		// 0%
		Если ЗначениеЗаполнено(ДоговорКонтрагента) 
			   И ДоговорКонтрагента.Внешнеэкономический Тогда
					
			// договор - внешнеэкономический
			СтрокаТЧ.СтатьяКнигиПродаж = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке0Экспорт;
				
		ИначеЕсли Контрагент.НеЯвляетсяРезидентом Тогда
		// хоть документ и в гривне, но считаем это поставкой на экспорт
			СтрокаТЧ.СтатьяКнигиПродаж = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке0Экспорт;
			
		Иначе
			
			// на терриории Украины
			СтрокаТЧ.СтатьяКнигиПродаж = Справочники.СтатьиНалоговыхДеклараций.НДС_НОПоСтавке0Другие;
			
		КонецЕсли;
		
	ИначеЕсли СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		
		// освобожденные операции (п.5 Закона)
		СтрокаТЧ.СтатьяКнигиПродаж = Справочники.СтатьиНалоговыхДеклараций.НДС_НООсвобожден;
		
	ИначеЕсли СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НеНДС Тогда
		
		// операция не является объектом налогообложения (п.3 Закона)
		СтрокаТЧ.СтатьяКнигиПродаж = Справочники.СтатьиНалоговыхДеклараций.НДС_НОНеОбъектНалог;
		
	Иначе
		
		//в строке ТЧ не указаны ставка НДС
		СтрокаТЧ.СтатьяКнигиПродаж = Справочники.СтатьиНалоговыхДеклараций.ПустаяСсылка();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУКТВЭДВСтрокеТоваров(СтрокаТабличнойЧасти,ЕстьХарактеристики = Ложь) Экспорт
	
	Если ЕстьХарактеристики И ЗначениеЗаполнено(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры.НоменклатураГТД) Тогда
		ЗначениеНоменклатураГТД = СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры.НоменклатураГТД;
		Если ТипЗнч(ЗначениеНоменклатураГТД) = Тип("СправочникСсылка.НоменклатураГТД") Тогда
			СтрокаТабличнойЧасти.КодУКТВЭД = ЗначениеНоменклатураГТД.КодУКТВЭД;
		ИначеЕсли ТипЗнч(ЗначениеНоменклатураГТД) = Тип("СправочникСсылка.КлассификаторУКТВЭД") Тогда
			СтрокаТабличнойЧасти.КодУКТВЭД = ЗначениеНоменклатураГТД;
		КонецЕсли; 
	ИначеЕсли ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
		ЗначениеНоменклатураГТД = СтрокаТабличнойЧасти.Номенклатура.НоменклатураГТД;
		Если ТипЗнч(ЗначениеНоменклатураГТД) = Тип("СправочникСсылка.НоменклатураГТД") Тогда
			СтрокаТабличнойЧасти.КодУКТВЭД = ЗначениеНоменклатураГТД.КодУКТВЭД;
		ИначеЕсли ТипЗнч(ЗначениеНоменклатураГТД) = Тип("СправочникСсылка.КлассификаторУКТВЭД") Тогда
			СтрокаТабличнойЧасти.КодУКТВЭД = ЗначениеНоменклатураГТД;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

// Обновляет значение реквизита ЛьготаНДС при изменении номенклатуры или вида операции
Процедура ОбновитьЗначениеЛьготыНДС(СтрокаТабличнойЧасти = Неопределено) Экспорт
	Если Не (ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации
		     ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации
			 ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации
		     ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации) Тогда
		Возврат;
	КонецЕсли; 
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		
		Для каждого СтрокаТЧ Из Товары Цикл
		
			ОбновитьЗначениеЛьготыНДС(СтрокаТЧ);
		
		КонецЦикла;
		
		Для каждого СтрокаТЧ Из Услуги Цикл
		
			ОбновитьЗначениеЛьготыНДС(СтрокаТЧ);
		
		КонецЦикла;
		
	Иначе
		
		ЛьготаНДС = СокрЛП(ЛьготаНДС);

		ЛьготаТовара = СокрЛП(СтрокаТабличнойЧасти.Номенклатура.ЛьготаНДС);
		Если СтрДлина(ЛьготаТовара) = 0 Тогда
			Возврат;
		КонецЕсли; 
		
		Если Найти(ЛьготаНДС, ЛьготаТовара) = 0 Тогда
			
			Если СтрДлина(ЛьготаНДС) = 0 Тогда
			    ЛьготаНДС = ЛьготаТовара;
			Иначе	
			    ЛьготаНДС = ЛьготаНДС + ", " + ЛьготаТовара;
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ЛьготаНДС) Тогда
		ЛьготаНДСОписание = "Постачання за " + ЛьготаНДС + " Кодексу";
	Иначе
		ЛьготаНДСОписание = "";	
	КонецЕсли;
	
КонецПроцедуры

Процедура СкопироватьТовары(Основание = Неопределено) Экспорт

	Если Основание = Неопределено Тогда
		Основание = ДокументОснование;
	КонецЕсли;
	
	МетаданныеДокумента = Основание.Метаданные();
	Если МетаданныеДокумента.ТабличныеЧасти.Найти("Товары") = Неопределено Тогда
		// нет такой табличной части
		Возврат
	КонецЕсли;
	
	ПогрешностиОкругления = Новый Соответствие;
	ВидДокумента = МетаданныеДокумента.Имя;
	
	
	ЕстьПроцентСкидкиНаценки		= Основание.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ПроцентСкидкиНаценки") <> Неопределено; 
	ЕстьПроцентАвтоматическихСкидок	= Основание.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ПроцентАвтоматическихСкидок") <> Неопределено; 
	ЕстьЕдиницаИзмеренияМест		= Основание.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ЕдиницаИзмеренияМест") <> Неопределено; 
	ЕстьКоличествоМест				= Основание.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("КоличествоМест") <> Неопределено; 
	ОснованиемЯвляетсяЧекККМ		= ( ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекККМ") );
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("ДопустимыеСтавкиНДС", ОпределитьДопустимыеСтавкиНДС());
	Запрос.УстановитьПараметр("ВалютаРеглУчета", 	мВалютаРегламентированногоУчета);

	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.ЕдиницаИзмерения,
	|	Основание.Количество,
	|	Основание.Коэффициент,
	|	Основание.Номенклатура,
	|	Основание.ХарактеристикаНоменклатуры,
	|	Основание.Цена,
	|	Основание.Сумма,";
	Если ЕстьКоличествоМест Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.КоличествоМест,";
	КонецЕсли;
	Если ЕстьЕдиницаИзмеренияМест Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.ЕдиницаИзмеренияМест,";
	КонецЕсли;
	Если ЕстьПроцентСкидкиНаценки Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.ПроцентСкидкиНаценки,";
	КонецЕсли;
	Если ЕстьПроцентАвтоматическихСкидок Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.ПроцентАвтоматическихСкидок,";
	Иначе
		ТекстЗапроса = 	ТекстЗапроса +"
	|	0 КАК ПроцентАвтоматическихСкидок,";
	КонецЕсли;

	Если ОснованиемЯвляетсяЧекККМ Тогда
		ТекстЗапроса = 	ТекстЗапроса +"
	|	&ВалютаРеглУчета КАК	ВалютаДокумента,
	|	1 КАК					КурсДокумента,
	|	1 КАК					КратностьДокумента,
	|	Основание.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	0 						КАК СуммаНДС,
	|	ИСТИНА 					КАК УчитыватьНДС,
	|	ИСТИНА 					КАК СуммаВключаетНДС,";
	Иначе
		ТекстЗапроса = 	ТекстЗапроса +"
	|	Основание.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента,
	|	Основание.СтавкаНДС,
	|	Основание.СуммаНДС,
	|	Основание.Ссылка.УчитыватьНДС          КАК УчитыватьНДС,
	|	Основание.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,";
	КонецЕсли; 

	ТекстЗапроса = 	ТекстЗапроса +"
	|	Основание.Ссылка.Дата			       КАК ДатаОтгрузки
	|ИЗ
	|	Документ."+ВидДокумента+".Товары КАК Основание
	|
	|ГДЕ
	|	  Основание.Ссылка = &ДокументОснование";
	
	Если ОснованиемЯвляетсяЧекККМ Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|   И Основание.Номенклатура.СтавкаНДС В (&ДопустимыеСтавкиНДС)
	|   И Основание.Номенклатура.Услуга = Ложь";
	Иначе
		ТекстЗапроса = ТекстЗапроса +"	
	|   И Основание.СтавкаНДС В (&ДопустимыеСтавкиНДС)";
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура               = Выборка.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		НоваяСтрока.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
		Если ЕстьЕдиницаИзмеренияМест Тогда		
			НоваяСтрока.ЕдиницаИзмеренияМест   = Выборка.ЕдиницаИзмеренияМест;		
		КонецЕсли;
		НоваяСтрока.Коэффициент                = Выборка.Коэффициент;
		НоваяСтрока.Количество                 = Выборка.Количество;
		
		Если ЕстьКоличествоМест Тогда
			НоваяСтрока.КоличествоМест             = Выборка.КоличествоМест;
		КонецЕсли; 

		НоваяСтрока.СтавкаНДС                  = Выборка.СтавкаНДС;

		НоваяСтрока.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
				МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
				Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
				Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
				Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
				Выборка.СуммаВключаетНДС,
				УчитыватьНДС,
				СуммаВключаетНДС,
				НалоговыйУчет.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
				
		Если ЕстьПроцентСкидкиНаценки Тогда		
			НоваяСтрока.ПроцентСкидкиНаценки     = Выборка.ПроцентСкидкиНаценки;		
		КонецЕсли;
		
		Если ЕстьПроцентАвтоматическихСкидок Тогда		
			НоваяСтрока.ПроцентАвтоматическихСкидок = Выборка.ПроцентАвтоматическихСкидок;		
		КонецЕсли;

		Если НоваяСтрока.ПроцентСкидкиНаценки + НоваяСтрока.ПроцентАвтоматическихСкидок = 100 Тогда
			НоваяСтрока.Цена = 0;
		ИначеЕсли НоваяСтрока.Количество <> 0 Тогда
			НоваяСтрока.Цена = НоваяСтрока.Сумма 
			/ ((1 - (НоваяСтрока.ПроцентСкидкиНаценки - НоваяСтрока.ПроцентАвтоматическихСкидок)/ 100)
			* НоваяСтрока.Количество);
		КонецЕсли;	
		
		Если НЕ ОснованиемЯвляетсяЧекККМ Тогда
			НоваяСтрока.СуммаНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, Выборка.ВалютаДокумента, ВалютаДокумента,
															  Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
															  Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
		Иначе
			
			НоваяСтрока.СуммаНДС  = НалоговыйУчет.РассчитатьСуммуНДСсУчетомПогрешности(Выборка.Сумма,
																			 УчитыватьНДС,
																			 СуммаВключаетНДС,
																			 Выборка.СтавкаНДС,
																			 ПогрешностиОкругления);
		КонецЕсли;
		
		//Если Выборка.ДатаОтгрузки < Дата Тогда
		//	НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		//КонецЕсли;
		
		ЗаполнитьСтатьюКнигиПродаж(НоваяСтрока, "Товары");
		
		ЗаполнитьУКТВЭДВСтрокеТоваров(НоваяСтрока,Истина);
			
	КонецЦикла;

КонецПроцедуры // СкопироватьТовары()

// Данная процедура предназначена для заполнения ТЧ в особом случае - по документу Корректировка долга по возвратной таре
Процедура СкопироватьТаруВТовары() Экспорт
	
	// это может быть только Корректировка долга по таре
	ВидДокумента = ДокументОснование.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ДопустимыеСтавкиНДС", ОпределитьДопустимыеСтавкиНДС());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	Основание.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмеренияМест,
	|	Основание.Количество,
	|	Основание.Количество КАК КоличествоМест,
	|	Основание.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
	|	Основание.Номенклатура,
	|	NULL КАК ХарактеристикаНоменклатуры,
	|	Основание.Цена,
	|	0 КАК ПроцентСкидкиНаценки,
	|	Основание.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента,
	|	Основание.Сумма,
	|	Основание.СтавкаНДС,
	|	Основание.СуммаНДС КАК СуммаНДС,
	|	Основание.Ссылка.Дата			       КАК ДатаОтгрузки,
	|	Основание.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,
	|	Основание.Ссылка.УчитыватьНДС          КАК УчитыватьНДС
	|ИЗ
	|	Документ."+ВидДокумента+".ВозвратнаяТара КАК Основание
	|
	|ГДЕ
	|	  Основание.Ссылка = &ДокументОснование
	|   И Основание.СтавкаНДС В (&ДопустимыеСтавкиНДС)
	|";

	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура               = Выборка.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		НоваяСтрока.ЕдиницаИзмерения           = Выборка.ЕдиницаИзмерения;
		НоваяСтрока.Коэффициент                = Выборка.Коэффициент;
		НоваяСтрока.Количество                 = Выборка.Количество;
		НоваяСтрока.КоличествоМест             = Выборка.КоличествоМест;

		НоваяСтрока.СтавкаНДС                  = Выборка.СтавкаНДС;

		НоваяСтрока.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
								МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
									Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
									Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
									Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
									Выборка.СуммаВключаетНДС,
									УчитыватьНДС,
									СуммаВключаетНДС,
									НалоговыйУчет.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
				
		НоваяСтрока.ПроцентСкидкиНаценки             = Выборка.ПроцентСкидкиНаценки;		
		
		Если НоваяСтрока.ПроцентСкидкиНаценки = 100 Тогда
			НоваяСтрока.Цена = 0;
		ИначеЕсли НоваяСтрока.Количество <> 0 Тогда
			НоваяСтрока.Цена = НоваяСтрока.Сумма 
			/ ((1 - НоваяСтрока.ПроцентСкидкиНаценки / 100)
			* НоваяСтрока.Количество);
		КонецЕсли;	
		
		НоваяСтрока.СуммаНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, Выборка.ВалютаДокумента, ВалютаДокумента,
														  Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
														  Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
		
		//Если Выборка.ДатаОтгрузки < Дата Тогда
		//	НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		//КонецЕсли;
			
		ЗаполнитьСтатьюКнигиПродаж(НоваяСтрока, "Товары");
		
		ЗаполнитьУКТВЭДВСтрокеТоваров(НоваяСтрока);
		
	КонецЦикла;

КонецПроцедуры // СкопироватьТаруВТовары()

Процедура СкопироватьВозвратнуюТару(Основание = Неопределено) Экспорт
	
	Если Основание = Неопределено Тогда
		Основание = ДокументОснование;
	КонецЕсли;
	
	Если Основание.Метаданные().ТабличныеЧасти.Найти("ВозвратнаяТара") = Неопределено Тогда
		// нет такой табличной части
		Возврат
	КонецЕсли;
	
	ВидДокумента = Основание.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.Количество,
	|	Основание.Номенклатура,
	|	Основание.Сумма,
	|	Основание.Цена,
	|	Основание.Ссылка.ВалютаДокумента	КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                           КАК КратностьДокумента
	|ИЗ
	|	Документ."+ВидДокумента+".ВозвратнаяТара КАК Основание
	|
	|ГДЕ
	|	Основание.Ссылка = &ДокументОснование
	|";

	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		НоваяСтрока = ВозвратнаяТара.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Количество   = Выборка.Количество;
		НоваяСтрока.Цена  = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Цена, Выборка.ВалютаДокумента, ВалютаДокумента, Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
							Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ЭтотОбъект);
			
	КонецЦикла;

КонецПроцедуры // СкопироватьВозвратнуюТару()

Процедура СкопироватьУслуги(Основание = Неопределено) Экспорт
	
	Если Основание = Неопределено Тогда
		Основание = ДокументОснование;
	КонецЕсли;
	
	ОснованиемЯвляетсяЧекККМ = ( ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекККМ") );
	
	Если ОснованиемЯвляетсяЧекККМ Тогда
		
		ЕстьСодержаниеУслуги = Ложь;
		
	иначе
		
		Если Основание.Метаданные().ТабличныеЧасти.Найти("Услуги") = Неопределено Тогда
			// нет такой табличной части
			Возврат
		КонецЕсли;
		
		ЕстьСодержаниеУслуги = Основание.Метаданные().ТабличныеЧасти.Услуги.Реквизиты.Найти("Содержание")   <> Неопределено; 
		
	КонецЕсли; 
	
	ЭтоРаботыОтНерезидента = (ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента);	

	ПогрешностиОкругления = Новый Соответствие;
	ВидДокумента = Основание.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("ДопустимыеСтавкиНДС", ОпределитьДопустимыеСтавкиНДС());
	Запрос.УстановитьПараметр("ВалютаРеглУчета", 	мВалютаРегламентированногоУчета);

	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.Количество,
	|	Основание.Номенклатура,
	|	Основание.Цена,
	|	Основание.Сумма,";
	Если ЕстьСодержаниеУслуги Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.Содержание,";
	Иначе
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.Номенклатура.Представление КАК Содержание,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса +"
	|	Основание.Номенклатура.ТранспортнаяУслуга КАК Товаротранспортная,";
	
	Если  НЕ ЭтоРаботыОтНерезидента Тогда 
	ТекстЗапроса = ТекстЗапроса +"
	|	Основание.ПроцентСкидкиНаценки,";	
	Иначе
	ТекстЗапроса = ТекстЗапроса +"
	|	0 КАК ПроцентСкидкиНаценки,";	
	КонецЕсли;
	
	Если ОснованиемЯвляетсяЧекККМ Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|	&ВалютаРеглУчета 		КАК ВалютаДокумента,
	|	1 						КАК КурсДокумента,
	|	1 						КАК КратностьДокумента,
	|	Основание.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	0 						КАК СуммаНДС,
	|	ИСТИНА 					КАК УчитыватьНДС,
	|	ИСТИНА 					КАК СуммаВключаетНДС,";
	Иначе
		ТекстЗапроса = ТекстЗапроса +"
	|	Основание.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                  КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ                                  КАК КратностьДокумента,	
	|	Основание.СтавкаНДС,
	|	Основание.СуммаНДС,
	|	Основание.Ссылка.УчитыватьНДС          КАК УчитыватьНДС,
	|	Основание.СуммаНДС,";
		Если ЭтоРаботыОтНерезидента Тогда
			// НДС на стоимость услуг начисляется исходя из их стоимости.
			// Документ поступления не должен учитывать НДС.
			ТекстЗапроса = ТекстЗапроса +"
		|	ЛОЖЬ КАК СуммаВключаетНДС,";
		Иначе
			ТекстЗапроса = ТекстЗапроса +"
		|	Основание.Ссылка.СуммаВключаетНДС      КАК СуммаВключаетНДС,";
		КонецЕсли;
	
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +"
	|	Основание.Ссылка.Дата			       КАК ДатаОтгрузки
	|ИЗ
	|	Документ."+ВидДокумента+?(ОснованиемЯвляетсяЧекККМ,".Товары",".Услуги")+" КАК Основание
	|
	|ГДЕ
	|	Основание.Ссылка = &ДокументОснование";
	
	Если ОснованиемЯвляетсяЧекККМ Тогда
		ТекстЗапроса = ТекстЗапроса +"
	|   И Основание.Номенклатура.СтавкаНДС В (&ДопустимыеСтавкиНДС)
	|   И Основание.Номенклатура.Услуга = Истина";
	ИначеЕсли НЕ ЭтоРаботыОтНерезидента Тогда
		ТекстЗапроса = ТекстЗапроса +"	
	|   И Основание.СтавкаНДС В (&ДопустимыеСтавкиНДС)";
	КонецЕсли;

	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Услуги.Добавить();
		НоваяСтрока.Номенклатура               = Выборка.Номенклатура;
		НоваяСтрока.Содержание                 = Выборка.Содержание;
		НоваяСтрока.Количество                 = Выборка.Количество;
        НоваяСтрока.Товаротранспортная		   = Выборка.Товаротранспортная;
		НоваяСтрока.ПроцентСкидкиНаценки	   = Выборка.ПроцентСкидкиНаценки;
		Если ЭтоРаботыОтНерезидента Тогда
			НоваяСтрока.СтавкаНДС 			   = Перечисления.СтавкиНДС.НДС20;
		Иначе
			НоваяСтрока.СтавкаНДС 			   = Выборка.СтавкаНДС;
		КонецЕсли;

		НоваяСтрока.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
				МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
				Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
				Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
				Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
				Выборка.СуммаВключаетНДС,
				УчитыватьНДС,
				СуммаВключаетНДС,
				НалоговыйУчет.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(НоваяСтрока, ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));
		
		Если НЕ ОснованиемЯвляетсяЧекККМ Тогда
			
			Если ЭтоРаботыОтНерезидента Тогда
				
				НоваяСтрока.СуммаНДС = НалоговыйУчет.РассчитатьСуммуНДСсУчетомПогрешности(НоваяСтрока.Сумма,
																			УчитыватьНДС,
																			СуммаВключаетНДС,
																			НоваяСтрока.СтавкаНДС,
																			ПогрешностиОкругления);
			Иначе	

				НоваяСтрока.СуммаНДС = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.СуммаНДС, Выборка.ВалютаДокумента, ВалютаДокумента,
																  Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
																  Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
																
			КонецЕсли;			
		
		Иначе
			
			НоваяСтрока.СуммаНДС  = НалоговыйУчет.РассчитатьСуммуНДСсУчетомПогрешности(Выборка.Сумма,
																			 УчитыватьНДС,
																			 СуммаВключаетНДС,
																			 Выборка.СтавкаНДС,
																			 ПогрешностиОкругления);
		КонецЕсли;

		//Если Выборка.ДатаОтгрузки < Дата Тогда
		//	НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		//КонецЕсли;
		
		ЗаполнитьСтатьюКнигиПродаж(НоваяСтрока, "Услуги");
		ЗаполнитьУКТВЭДВСтрокеТоваров(НоваяСтрока);
			
	КонецЦикла;

	
КонецПроцедуры // СкопироватьУслуги()

Процедура СкопироватьУслугуПоКомиссии(Основание = Неопределено) Экспорт
		
		Если Основание = Неопределено Тогда
			Основание = ДокументОснование;
		КонецЕсли;
		
		Если НЕ ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			Возврат;
		КонецЕсли; 
	
		СтрокаУслуг = Услуги.Добавить();
		
		Товар = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяУслугаКомиссии");	
		Если НЕ ЗначениеЗаполнено(Товар) Тогда
			Сообщить("Для пользователя не указано значение ""Основная номенклатура-услуга по комиссии"" в индивидуальных настройках!", СтатусСообщения.Важное);
		КонецЕсли; 
		
		СтрокаУслуг.Номенклатура = Товар;
		СтрокаУслуг.Содержание 	 = Товар.НаименованиеПолное;
		
		СтрокаУслуг.Количество 		= 1;
		СтрокаУслуг.СтавкаНДС  		= Основание.СтавкаНДСВознаграждения;
		
		СтрокаУслуг.Цена 			= Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
												МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Основание.Товары.Итог("СуммаВознаграждения"), Основание.ВалютаДокумента, ВалютаДокумента,
																		   Основание.КурсВзаиморасчетов, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
																		   Основание.КратностьВзаиморасчетов, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
												Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
												Основание.СуммаВключаетНДС,
												УчитыватьНДС,
												СуммаВключаетНДС,
												НалоговыйУчет.ПолучитьСтавкуНДС(СтрокаУслуг.СтавкаНДС));

		
		СтрокаУслуг.Сумма 			= СтрокаУслуг.Цена;
		СтрокаУслуг.СуммаНДС 		= МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Основание.Товары.Итог("СуммаНДСВознаграждения"), Основание.ВалютаДокумента, ВалютаДокумента,
																 Основание.КурсВзаиморасчетов, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
																 Основание.КратностьВзаиморасчетов, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
											  

		ЗаполнитьСтатьюКнигиПродаж(СтрокаУслуг, "Услуги");
		ЗаполнитьУКТВЭДВСтрокеТоваров(СтрокаУслуг);
		
КонецПроцедуры

Процедура СкопироватьУслугиКомиссииОтНерезидента(Основание = Неопределено) Экспорт
	
	Если Основание = Неопределено Тогда
		Основание = ДокументОснование;
	КонецЕсли;

	Если НЕ ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		// эта процедура работет только с документом  ОтчетКомиссионераОПродажах
		Возврат
	КонецЕсли;
	
	ПогрешностиОкругления = Новый Соответствие;
	ВидДокумента = Основание.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Основание);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", 	мВалютаРегламентированногоУчета);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Основание.Ссылка.УслугаКомиссии КАК Товар,
	|	1 КАК Количество,
	|	Основание.СуммаВознаграждения КАК Цена,
	|	Основание.СуммаВознаграждения КАК Сумма,
	|	""Продаж "" + ВЫРАЗИТЬ(Основание.Номенклатура.Наименование КАК СТРОКА(100)) КАК Содержание,
	|	Основание.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КурсВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ  КАК КурсДокумента,
	|	ВЫБОР КОГДА Основание.Ссылка.ВалютаДокумента = Основание.Ссылка.ДоговорКонтрагента.ВалютаВзаиморасчетов ТОГДА
	|		Основание.Ссылка.КратностьВзаиморасчетов
	|	ИНАЧЕ
	|		1
	|	КОНЕЦ КАК КратностьДокумента,
	|	ЛОЖЬ  КАК СуммаВключаетНДС,
	|	Основание.Ссылка.Дата КАК ДатаОтгрузки
	|ИЗ
	|	Документ."+ВидДокумента+".Товары КАК Основание
	|
	|ГДЕ
	|	Основание.Ссылка = &ДокументОснование";
	
	Запрос.Текст = ТекстЗапроса;
	
	Товар = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяУслугаКомиссии");	
	ВыдаватьСообщениеОбОшибке = Истина;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Услуги.Добавить();
		
		НоваяСтрока.Номенклатура = Выборка.Товар;
		Если НоваяСтрока.Номенклатура.Пустая() Тогда
			
			Если НЕ ЗначениеЗаполнено(Товар) Тогда
				
				Если ВыдаватьСообщениеОбОшибке Тогда
					Сообщить("Для пользователя не указано значение ""Основная номенклатура-услуга по комиссии"" в индивидуальных настройках!", СтатусСообщения.Важное);	
					ВыдаватьСообщениеОбОшибке = Ложь;
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока.Номенклатура = Товар;	
				
			КонецЕсли; 
			
		КонецЕсли;
		
		НоваяСтрока.Содержание                 = Выборка.Содержание;
		НоваяСтрока.Количество                 = Выборка.Количество;

		НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;

		НоваяСтрока.Сумма = Ценообразование.ПересчитатьЦенуПриИзмененииФлаговНалогов(
										МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Выборка.Сумма, Выборка.ВалютаДокумента, ВалютаДокумента,
										Выборка.КурсДокумента, ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
										Выборка.КратностьДокумента, ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета)),
										Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры,
										Выборка.СуммаВключаетНДС,
										УчитыватьНДС,
										СуммаВключаетНДС,
										НалоговыйУчет.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
				
		ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(НоваяСтрока, ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"));
		
		НоваяСтрока.СуммаНДС = НалоговыйУчет.РассчитатьСуммуНДСсУчетомПогрешности(НоваяСтрока.Сумма,
																	УчитыватьНДС,
																	СуммаВключаетНДС,
																	НоваяСтрока.СтавкаНДС,
																	ПогрешностиОкругления);
															  
		
		//Если Выборка.ДатаОтгрузки < Дата Тогда
		//	НоваяСтрока.ДатаОтгрузкиОплаты = Выборка.ДатаОтгрузки;
		//КонецЕсли;
		
		ЗаполнитьСтатьюКнигиПродаж(НоваяСтрока, "Услуги");
		ЗаполнитьУКТВЭДВСтрокеТоваров(НоваяСтрока);
			
	КонецЦикла;

	
КонецПроцедуры // СкопироватьУслуги()

// Процедура выполняет заполнение текста условий продажи.
//
// Параметры:
//   Нет.
//
Процедура ЗаполнитьУсловиеПродажи(Основание = Неопределено) Экспорт
	
	Если Основание = Неопределено Тогда
		Основание = ДокументОснование;
	КонецЕсли;	
	
	УсловиеПродажи = "";
	
	Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации	Тогда
		
		НаименованиеДоговора = ДоговорКонтрагента.НаименованиеДляПечати;
		
		Если НЕ ЗначениеЗаполнено(НаименованиеДоговора) Тогда
			
			Если ЗначениеЗаполнено(ДоговорКонтрагента.Номер) Тогда
			
				НаименованиеДоговора = "№ " + ДоговорКонтрагента.Номер;
			
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДоговорКонтрагента.Дата) Тогда
			
				НаименованиеДоговора = НаименованиеДоговора +" від " + Формат(ДоговорКонтрагента.Дата, "ДФ='дд.ММ.гггг'");
			
			КонецЕсли;
		
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НаименованиеДоговора) Тогда
			УсловиеПродажи = "Договiр "+СокрЛП(НаименованиеДоговора);	
		КонецЕсли;
		
	КонецЕсли; 
		
	// заполним текстовые реквизиты по-украински
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ЕстьТовары = (Основание.Товары.Количество() > 0);
		ЕстьУслуги = (Основание.Услуги.Количество() > 0);
		
		Если ЕстьУслуги И НЕ ЕстьТовары Тогда
			УсловиеПродажи = ?(ЗначениеЗаполнено(УсловиеПродажи),УсловиеПродажи + ", ","") + "акт № "+ОбщегоНазначения.ПолучитьНомерНаПечать(Основание)+" вiд "+Формат(Основание.Дата, "ДФ='дд.ММ.гггг'");
	 	Иначе	
			УсловиеПродажи = ?(ЗначениеЗаполнено(УсловиеПродажи),УсловиеПродажи + ", ","") + "накладна № "+ОбщегоНазначения.ПолучитьНомерНаПечать(Основание)+" вiд "+Формат(Основание.Дата, "ДФ='дд.ММ.гггг'");
		КонецЕсли;
	ИначеЕсли  ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		
		УсловиеПродажи = ?(ЗначениеЗаполнено(УсловиеПродажи),УсловиеПродажи + ", ","") + "рахунок № "+ОбщегоНазначения.ПолучитьНомерНаПечать(ДокументОснование)+" вiд "+Формат(ДокументОснование.Дата, "ДФ='дд.ММ.гггг'");
		
	ИначеЕсли  ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") Тогда
		
		УсловиеПродажи = ?(ЗначениеЗаполнено(УсловиеПродажи),УсловиеПродажи + ", ","") + "звіт комісіонера № "+ОбщегоНазначения.ПолучитьНомерНаПечать(ДокументОснование)+" вiд "+Формат(ДокументОснование.Дата, "ДФ='дд.ММ.гггг'");
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекККМ") Тогда
		
		УсловиеПродажи = "Касовий чек № "+Основание.НомерЧекаККМ+" вiд "+Формат(Основание.Дата, "ДФ='дд.ММ.гггг'");
		
	КонецЕсли;		 
	
КонецПроцедуры // ЗаполнитьУсловиеПродажи()

Процедура ЗаполнитьВидДоговора() Экспорт

	ВидДоговора = ДоговорКонтрагента.ВидДоговораПоГК;

КонецПроцедуры


// Функция по СтавкеНДС определяет суффикс имени параметра табличного документа:
// фактически колонку таблицы налоговой накладной 20%, 0%... где должна отображаться соответствующая сумма
//
Функция ОпределитьКолонкуТаблицы(СтавкаНДС=Неопределено)
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		Если НЕ ВалютаДокумента  = мВалютаРегламентированногоУчета
			// если это поставка на экспорт в гривнях - определим это по признаку нерезидентности контрагента
			ИЛИ КонтрагентНеРезидент = Истина 
			Тогда

			Возврат "0Эксп";
		Иначе       
			Возврат "0Укр";
		КонецЕсли;
	ИначеЕсли  СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Возврат "БезНДС";
	ИначеЕсли  СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
		Если глЗначениеПеременной("ДатаНачалаИспользованияФормыННПоЛекарствам") <= Дата  Тогда
			Возврат "7";	
		Иначе	
			Возврат "0Укр";	
		КонецЕсли;
	Иначе
		Возврат "20";	
	КонецЕсли;
	
КонецФункции

Функция ОпределитьДопустимыеСтавкиНДС() Экспорт
	СписокСтавокНДС = Новый СписокЗначений();
	
	Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации или 
		 ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации или 
		 ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации Тогда
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС20);
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС7);
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС0);
    ИначеЕсли	ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа Тогда
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС20);
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС7);
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НеНДС);
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации или 
		 ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации или
		 ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.БезНДС);
	ИначеЕсли  ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС20);
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС20);
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС7);
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НДС0);
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.БезНДС);
		СписокСтавокНДС.Добавить(Перечисления.СтавкиНДС.НеНДС);
	КонецЕсли;

		
	Возврат СписокСтавокНДС;
	
КонецФункции

Функция ОпределитьВозможныеВидыОперацийПоОснованию(Основание)
	
	ТаблицаВидовОпераций = Новый ТаблицаЗначений();
	ТаблицаВидовОпераций.Колонки.Добавить("ВидОперации", ,"Вид операции",60);

	ОснованиеЧек = (ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекККМ"));
	
	Если НЕ ОснованиеЧек Тогда
		
		// теперь функция работает только для ЧекККМ
		Возврат ТаблицаВидовОпераций;
		
	КонецЕсли;
		
	ТекстЗапроса =  "";
				
	Если Основание.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
		Если ОснованиеЧек Тогда
			ТекстЗапроса = " 
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Док.Номенклатура.СтавкаНДС КАК СтавкаНДС
			|ИЗ 
			|	Документ." + Основание.Метаданные().Имя + ".Товары КАК Док
			|ГДЕ
			|	Док.Ссылка = &Основание
			|";
		Иначе
			ТекстЗапроса = " 
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Док.СтавкаНДС
			|ИЗ 
			|	Документ." + Основание.Метаданные().Имя + ".Товары КАК Док
			|ГДЕ
			|	Док.Ссылка = &Основание
			|";
		КонецЕсли;
	КонецЕсли;
	
	Если Основание.Метаданные().ТабличныеЧасти.Найти("Услуги") <> Неопределено Тогда
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса +"
			| ОБЪЕДИНИТЬ
			|";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + " 
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.СтавкаНДС
		|ИЗ 
		|	Документ." + Основание.Метаданные().Имя + ".Услуги КАК Док
		|ГДЕ
		|	Док.Ссылка = &Основание
		|";
	КонецЕсли;
	
	Если Основание.Метаданные().ТабличныеЧасти.Найти("ОС") <> Неопределено Тогда
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса +"
			| ОБЪЕДИНИТЬ
			|";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + " 
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.СтавкаНДС
		|ИЗ 
		|	Документ." + Основание.Метаданные().Имя + ".ОС КАК Док
		|ГДЕ
		|	Док.Ссылка = &Основание
		|";
	КонецЕсли;
	
	Если Основание.Метаданные().ТабличныеЧасти.Найти("НематериальныеАктивы") <> Неопределено Тогда
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса +"
			| ОБЪЕДИНИТЬ
			|";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + " 
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Док.СтавкаНДС
		|ИЗ 
		|	Документ." + Основание.Метаданные().Имя + ".НематериальныеАктивы КАК Док
		|ГДЕ
		|	Док.Ссылка = &Основание
		|";
	КонецЕсли;
	
	Если ТекстЗапроса = "" Тогда
		// в этом документе нет обрабатываемых подходящих табличных частей
		Возврат ТаблицаВидовОпераций;
	КонецЕсли;
	
	ЗапросПоСтавкамНДС = Новый Запрос(ТекстЗапроса);
	ЗапросПоСтавкамНДС.УстановитьПараметр("Основание", Основание); 
	
	Выборка = ЗапросПоСтавкамНДС.Выполнить().Выбрать();	
	
	ВключатьОблагаемыеОперации = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			СтрокаТаблицы = ТаблицаВидовОпераций.Добавить();
			Если ОснованиеЧек Тогда
				СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации;
			Иначе
				СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации;
			КонецЕсли;
		ИначеЕсли Выборка.СтавкаНДС = Перечисления.СтавкиНДС.НеНДС Тогда
			СтрокаТаблицы = ТаблицаВидовОпераций.Добавить();
			СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации;
		Иначе
			//0% или 20% - один вид операции
			ВключатьОблагаемыеОперации = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если  ВключатьОблагаемыеОперации Тогда
		СтрокаТаблицы = ТаблицаВидовОпераций.Добавить();
		Если ОснованиеЧек Тогда
			СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации;
		Иначе
			СтрокаТаблицы.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТаблицаВидовОпераций;
	
КонецФункции

Функция ПроверитьРеквизитыНомерСтрокиННАктуальны(СообщатьОбОшибках = Ложь) Экспорт
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры;
	Перем ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим;
	
	// Подготовим таблицы
	Отказ = Ложь;
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим);

	// Загрузим все таблицы (кроме тары) в одну таблицу
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПрочим , ТаблицаНоменклатуры);	
		
	Результат = Ложь;
	
	НаборРекизитовСвертки = "КодВид, КодСХ, Номенклатура, Характеристика, КодУКТВЭД, ЕдиницаИзмерения, ЕдиницаИзмеренияКод, ЦенаБезНДСРегл, СтавкаНДС, КодЛьготы";	
	ТаблицаНоменклатуры.Свернуть("НомерСтрокиНН, " + НаборРекизитовСвертки); 
	ТаблицаНоменклатуры.Сортировать("НомерСтрокиНН");
	КолВоСтрок = ТаблицаНоменклатуры.Количество();
	Если КолВоСтрок = 0 Тогда
		// фиг с ним, считаем что без строк нормально
		Результат = Истина;
	ИначеЕсли ТаблицаНоменклатуры[0].НомерСтрокиНН = 0 Тогда
		// Есть пустые номера
		Если СообщатьОбОшибках Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В документе есть незаполненные реквизиты ""Номер строки НН""!'; uk = 'У документі є незаповнені реквізити ""Номер рядка ПН""!'"));
		КонецЕсли; 
		Результат = Ложь;
	ИначеЕсли ТаблицаНоменклатуры[0].НомерСтрокиНН <> 1 Тогда
		// Нумерация не начинается с 1
		Если СообщатьОбОшибках Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В документе нумерация реквизов ""Номер строки НН"" начинается не с 1!'; uk = 'У документі нумерація реквізитів ""Номер рядка ПН"" починається не з 1!'"));
		КонецЕсли; 
		Результат = Ложь;
	ИначеЕсли ТаблицаНоменклатуры[КолВоСтрок-1].НомерСтрокиНН > КолВоСтрок Тогда
		// Есть пропуски в нумерации 
		Если СообщатьОбОшибках Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В документе есть пропуски в нумерации!'; uk = 'У документі є пропуски в нумерації!'"));
		КонецЕсли; 
		Результат = Ложь;
	ИначеЕсли ТаблицаНоменклатуры[КолВоСтрок-1].НомерСтрокиНН < КолВоСтрок Тогда
		// Есть строки с одинаковым номером, но разными ключевыми полями 
		Если СообщатьОбОшибках Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В документе есть строки з одинаковыми реквизитами ""Номер строки НН"", но разными ключевыми полями!'; uk = 'У документі є рядки з однаковими реквізитами ""Номер рядка ПН"", але різними ключовими полями!'"));
		КонецЕсли; 
		Результат = Ложь;
	ИначеЕсли ТаблицаНоменклатуры[КолВоСтрок-1].НомерСтрокиНН = КолВоСтрок Тогда
		// Все почти ок!
		Результат = Истина;
		// Теперь проверяем все внутри
		Для ИндСтроки = 1 По КолВоСтрок Цикл
			ТекущийНомерСтрокиНН = ТаблицаНоменклатуры[ИндСтроки-1].НомерСтрокиНН;
			Если НЕ ТекущийНомерСтрокиНН = ИндСтроки Тогда
				Если СообщатьОбОшибках Тогда
					ТекстСооющенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В документе для строки печатной формы %1 указан некорректный ""Номер строки НН"" %2!'; uk = 'У документі для рядка друкованої форми %1 вказано некоректний ""Номер строки НН"" %2!'"), ИндСтроки, ТекущийНомерСтрокиНН);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСооющенияОбОшибке);
				КонецЕсли; 
				Результат = Ложь;
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции // ()

Процедура ПроизвестиУстановкуНомерСтрокиНН() Экспорт
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим;
	
	Если РеквизитыНомерСтрокиННАктуальны Тогда 
		Возврат;
	КонецЕсли;
	
	// Подготовим таблицы
	Отказ = Ложь;
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаНоменклатуры, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим);

	// Загрузим все таблицы (кроме тары) в одну таблицу
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоУслугам, ТаблицаНоменклатуры);	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоПрочим , ТаблицаНоменклатуры);	
		
	НаборРекизитовСвертки = "КодВид, КодСХ, Номенклатура, Характеристика, КодУКТВЭД, ЕдиницаИзмерения, ЕдиницаИзмеренияКод, ЦенаБезНДСРегл, СтавкаНДС, КодЛьготы";
	
	
	Если ТаблицаНоменклатуры.Количество() = 0 Тогда
		РеквизитыНомерСтрокиННАктуальны = Истина;
		Возврат;
	КонецЕсли;
	
	ТаблицаНоменклатурыУстановкаНомерСтрокиНН = ТаблицаНоменклатуры.Скопировать();
	ТаблицаНоменклатуры.Свернуть(НаборРекизитовСвертки); 
	
	ПараметрыПоиска = Новый Структура(НаборРекизитовСвертки);
	Для каждого СтрокаТаблицы из ТаблицаНоменклатуры Цикл
		НовыйНомерСтрокиНН = ТаблицаНоменклатуры.Индекс(СтрокаТаблицы) + 1;
		Для каждого ЭлементСтруктуры Из ПараметрыПоиска Цикл
			ИмяПоляЗначения = ЭлементСтруктуры.Ключ;
			ПараметрыПоиска.Вставить(ЭлементСтруктуры.Ключ, СтрокаТаблицы[ИмяПоляЗначения]);
		КонецЦикла;
		МассивСтрокНомерСтрокиНН = ТаблицаНоменклатурыУстановкаНомерСтрокиНН.НайтиСтроки(ПараметрыПоиска);
		Если МассивСтрокНомерСтрокиНН.Количество()> 0 Тогда
			Для каждого НайденнаяСтрока Из МассивСтрокНомерСтрокиНН Цикл
				ЭтотОбъект[НайденнаяСтрока.ИмяТЧ][НайденнаяСтрока.НомерСтрокиТЧ-1].НомерСтрокиНН =  НовыйНомерСтрокиНН;
			КонецЦикла; 
		КонецЕсли;
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нумерация реквизитов ""Номер строки НН"" восстановлена автоматически!'; uk = 'Нумерація реквізитів ""Номер рядка ПН"" відновлена автоматично!'"));
	РеквизитыНомерСтрокиННАктуальны = Истина;

КонецПроцедуры // ()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА


// Процедура заполняет колонки таблицы товаров, которые будут в дальнейшем использоваться
// для формирования движений  и печати
Процедура ДобавитьКолонкиТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение) Экспорт
	
	//добавим недостающие колонки
	Если ТаблицаТоваров.Колонки.Найти("Характеристика") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));	
		ТаблицаТоваров.ЗаполнитьЗначения(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), "Характеристика");	
	КонецЕсли; 
	
	Если ТаблицаТоваров.Колонки.Найти("ТовароТранспортная") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ТовароТранспортная", Новый ОписаниеТипов("Булево"));	
		ТаблицаТоваров.ЗаполнитьЗначения(Ложь, "ТовароТранспортная");	
	КонецЕсли; 
	
	Если ТаблицаТоваров.Колонки.Найти("ПроцентСкидкиНаценки") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ПроцентСкидкиНаценки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));	
		ТаблицаТоваров.ЗаполнитьЗначения(0, "ПроцентСкидкиНаценки");	
	КонецЕсли; 
	
	Если ТаблицаТоваров.Колонки.Найти("ПроцентАвтоСкидкиНаценки") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ПроцентАвтоСкидкиНаценки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));	
		ТаблицаТоваров.ЗаполнитьЗначения(0, "ПроцентАвтоСкидкиНаценки");	
	КонецЕсли;
	
	Если ТаблицаТоваров.Колонки.Найти("ТекстДляПечатиВКолонкеКоличество") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ТекстДляПечатиВКолонкеКоличество", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(150));	
		ТаблицаТоваров.ЗаполнитьЗначения("", "ТекстДляПечатиВКолонкеКоличество");	
	КонецЕсли; 
	
	
	// Суммы в документе в валюте документа
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДСВал"        , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСВал"           , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаСНДСВал"          , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	// Суммы в документе в валюте регл. учета
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДСРегл"        , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСРегл"           , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаСНДСРегл"          , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	// Суммы в документе в валюте регл. учета
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДСПревышенияРегл"        , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСПревышенияРегл"           , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаСНДСПревышенияРегл"          , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	// Колонки, необходимые для печати документа
	ТаблицаТоваров.Колонки.Добавить("ЦенаМестаБезНДСБезСкидкиРегл", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(18,5));
	ТаблицаТоваров.Колонки.Добавить("СуммаСкидкиБезНДСРегл"   	  , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаТоваров.Колонки.Добавить("СуммаБезНДСБезСкидкиРегл"	  , ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));	
	ТаблицаТоваров.Колонки.Добавить("ЦенаБезНДСРегл", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(18,2));
	
	
	ВалРегл = мВалютаРегламентированногоУчета;
	Данные = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалРегл, Дата);
	
	Для каждого СтрокаТаблицы Из ТаблицаТоваров Цикл
		
		// Рассчитаем суммы в документе в валюте документа
		СтрокаТаблицы.СуммаСНДСВал    = СтрокаТаблицы.Сумма + ?(СуммаВключаетНДС, 0, СтрокаТаблицы.НДС);
		СтрокаТаблицы.СуммаНДСВал     = СтрокаТаблицы.НДС;
		СтрокаТаблицы.СуммаБезНДСВал  = СтрокаТаблицы.СуммаСНДСВал - СтрокаТаблицы.СуммаНДСВал;
		
		// Рассчитаем суммы в документе в валюте регл. учета
		Если СтруктураШапкиДокумента.ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
			СтрокаТаблицы.СуммаСНДСРегл = СтрокаТаблицы.СуммаСНДСВал;
			СтрокаТаблицы.СуммаНДСРегл  = СтрокаТаблицы.СуммаНДСВал;
		Иначе
			
			СтрокаТаблицы.СуммаСНДСРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаСНДСВал, 
												СтруктураШапкиДокумента.ВалютаДокумента,
												мВалютаРегламентированногоУчета, 
												ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета), 
												Данные.Курс,
												ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
												Данные.Кратность,
												, ПогрешностиОкругления, "СуммаСНДСРегл");
			
			СтрокаТаблицы.СуммаНДСРегл  = НалоговыйУчет.РассчитатьСуммуНДСсУчетомПогрешности(СтрокаТаблицы.СуммаСНДСРегл,
												СтруктураШапкиДокумента.УчитыватьНДС,
												Истина,
												СтрокаТаблицы.СтавкаНДС,
												ПогрешностиОкругления);
		КонецЕсли;
		СтрокаТаблицы.СуммаБезНДСРегл = СтрокаТаблицы.СуммаСНДСРегл - СтрокаТаблицы.СуммаНДСРегл;
		
		// Рассчитаем суммы превыешния в документе в валюте регл. учета
		Если СтруктураШапкиДокумента.ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
			СтрокаТаблицы.СуммаСНДСПревышенияРегл = СтрокаТаблицы.СуммаПревышения + СтрокаТаблицы.СуммаНДСПревышения;
			СтрокаТаблицы.СуммаНДСПревышенияРегл = СтрокаТаблицы.СуммаНДСПревышения;
		Иначе
			
			СтрокаТаблицы.СуммаСНДСПревышенияРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаПревышения + СтрокаТаблицы.СуммаНДСПревышения, 
												СтруктураШапкиДокумента.ВалютаДокумента,
												мВалютаРегламентированногоУчета, 
												ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета), 
												1,
												ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
												1,
												, ПогрешностиОкругленияПревышение, "СуммаСНДСРегл");
			
			// не правильно рассчитывать НДС "от обратного" исходя из суммы СНДС уже пересчитанной в грн
			// правильно - рассчитывать от валютной суммы с учетом округления
			//СтрокаТаблицы.СуммаНДСПревышенияРегл  = Ценообразование.РассчитатьСуммуНДСсУчетомПогрешности(СтрокаТаблицы.СуммаНДСПревышения,
			//									СтруктураШапкиДокумента.УчитыватьНДС,
			//									Истина,
			//									СтрокаТаблицы.СтавкаНДС,
			//									ПогрешностиОкругленияПревышение);
			СтрокаТаблицы.СуммаНДСПревышенияРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.СуммаНДСПревышения, 
												СтруктураШапкиДокумента.ВалютаДокумента,
												мВалютаРегламентированногоУчета, 
												ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета), 
												1,
												ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
												1,
												, ПогрешностиОкругленияПревышение, СтрокаТаблицы.СтавкаНДС);
		КонецЕсли;

		СтрокаТаблицы.СуммаБезНДСПревышенияРегл = СтрокаТаблицы.СуммаСНДСПревышенияРегл - СтрокаТаблицы.СуммаНДСПревышенияРегл;
		
		// Поля, используемые при печати документа
		// Скидка
		ПроцентСкидкиНаценки 	 = СтрокаТаблицы.ПроцентСкидкиНаценки + СтрокаТаблицы.ПроцентАвтоСкидкиНаценки;
		Если ПроцентСкидкиНаценки = 100  Тогда
			СтрокаТаблицы.СуммаСкидкиБезНДСРегл = 0;
		Иначе
			СтрокаТаблицы.СуммаСкидкиБезНДСРегл = ОбщегоНазначения.ОкруглитьСУчетомПогрешности(СтрокаТаблицы.СуммаБезНДСРегл * ПроцентСкидкиНаценки / (100 - ПроцентСкидкиНаценки), 2);			
		КонецЕсли;
		
		// Суммы
		СтрокаТаблицы.СуммаБезНДСБезСкидкиРегл 		= СтрокаТаблицы.СуммаБезНДСРегл + СтрокаТаблицы.СуммаСкидкиБезНДСРегл;
		Если  СтруктураШапкиДокумента.ВалютаДокумента = мВалютаРегламентированногоУчета 
			И НЕ СтруктураШапкиДокумента.СуммаВключаетНДС Тогда
			СтрокаТаблицы.ЦенаМестаБезНДСБезСкидкиРегл = СтрокаТаблицы.Цена;
		Иначе
			СтрокаТаблицы.ЦенаМестаБезНДСБезСкидкиРегл 	= СтрокаТаблицы.СуммаБезНДСБезСкидкиРегл /?(СтрокаТаблицы.Количество = 0, 1, СтрокаТаблицы.Количество);	 
		КонецЕсли;
		
		Если СтрокаТаблицы.Количество = 0 Тогда
			СтрокаТаблицы.ЦенаБезНДСРегл = СтрокаТаблицы.ЦенаБезНДСРегл; 
		Иначе	
			Если     СтруктураШапкиДокумента.ВалютаДокумента = СтруктураШапкиДокумента.ВалютаРегламентированногоУчета 
				И НЕ СтруктураШапкиДокумента.СуммаВключаетНДС
				И    СтрокаТаблицы.СуммаСкидкиБезНДСРегл = 0 Тогда
				СтрокаТаблицы.ЦенаБезНДСРегл = 	СтрокаТаблицы.Цена;
			Иначе	
				СтрокаТаблицы.ЦенаБезНДСРегл = СтрокаТаблицы.СуммаБезНДСРегл / СтрокаТаблицы.Количество; 
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение)

	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();
	
	ДобавитьКолонкиТоваровРегл(ТаблицаТоваров, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);

	Возврат ТаблицаТоваров;

КонецФункции // ПодготовитьТаблицуТоваров()


// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуУслуг(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение)

	Возврат ПодготовитьТаблицуТоваров(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);

КонецФункции // ПодготовитьТаблицуТоваров()


Функция ПодготовитьТаблицуПрочие(РезультатЗапросаПоПрочим, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение)

	Возврат  ПодготовитьТаблицуТоваров(РезультатЗапросаПоПрочим, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);

КонецФункции // ПодготовитьТаблицуТоваров()


// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТаре  - результат запроса по табличной части "ВозвратнаяТара",
//  СтруктураШапкиДокумента - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента, ПогрешностиОкругления)

	ТаблицаТары = РезультатЗапросаПоТаре.Выгрузить();
	
	ТаблицаТары.Колонки.Добавить("СтавкаНДС", 	  Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТаблицаТары.Колонки.Добавить("СуммаСНДСРегл", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	
	// Надо заполнить новые колонки.
	ТаблицаТары.ЗаполнитьЗначения(Перечисления.СтавкиНДС.НеНДС, "СтавкаНДС");
	
	ВалРегл = мВалютаРегламентированногоУчета;
	Данные = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалРегл, Дата);

	Для каждого СтрокаТаблицы Из ТаблицаТары Цикл

		Если СтруктураШапкиДокумента.ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
			СтрокаТаблицы.СуммаСНДСРегл = СтрокаТаблицы.Сумма;
		Иначе
			СтрокаТаблицы.СуммаСНДСРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СтрокаТаблицы.Сумма, 
												СтруктураШапкиДокумента.ВалютаДокумента,
												мВалютаРегламентированногоУчета, 
												ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета), 
												Данные.Курс,
												ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета),
												Данные.Кратность,
												,ПогрешностиОкругления, "СуммаСНДСРегл");
		КонецЕсли;

	КонецЦикла;
	
	Возврат ТаблицаТары;

КонецФункции // ПодготовитьТаблицуТары()


// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Укажем, что надо проверить:
	Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации  
		 ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации  
		 ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
		 ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки
		 Тогда
		СтруктураОбязательныхПолей = Новый Структура("ВидОперации, Организация, ВалютаДокумента");
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации
	      ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда 
		  
		СтруктураОбязательныхПолей = Новый Структура("ВидОперации, Организация, ВалютаДокумента, Контрагент");
		
	Иначе

		СтруктураОбязательныхПолей = Новый Структура("ВидОперации, Организация, ВалютаДокумента, Контрагент, ДоговорКонтрагента, КурсВзаиморасчетов, КратностьВзаиморасчетов");
	КонецЕсли;
	
	Если ПродажаНижеОбычнойЦены 
		И Дата >= '2015-01-01' 
		И Дата < '2016-04-01'
		Тогда
		СтруктураОбязательныхПолей.Вставить("ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены");	
	КонецЕсли;
	
	Если ВключаетсяВУточняющийРасчет Тогда
		СтруктураОбязательныхПолей.Вставить("УточняемыйПериод");
	КонецЕсли;
	
 	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если Дата >= '2015-01-01' Тогда
		Если ПродажаНижеОбычнойЦены Тогда
			Если ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены = 1 И СуммаДокумента = 0 Тогда                                                                                                                                                    // разрешаем проводить
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru = 'Указан неверное значение реквизита ""Тип причины (01,12,15,16)"". Значение должно быть 12!'; uk = 'У реквізита ""Тип причини (01, 12, 15, 16)"" невірне значення. Значення має бути 12!'"),,Заголовок);				
			ИначеЕсли ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены = 12 И СуммаДокумента <> 0 Тогда	                                                                                                                                       // разрешаем проводить
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru = 'Указан неверное значение реквизита ""Тип причины (01,12,15,16)"". Значение должно быть 1!'; uk = 'У реквізита ""Тип причини (01, 12, 15, 16)"" невірне значення. Значення має бути 1!'"),,Заголовок);				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()


// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)

	ИмяТабличнойЧасти = "Товары";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество, ЕдиницаИзмерения, Сумма, СтавкаНДС, СтатьяКнигиПродаж");
	Если СуммаДокумента = 0 Тогда
		// разрешаем налоговую накладную на безоплатную передачу
		СтруктураОбязательныхПолей.Удалить("Сумма");
	КонецЕсли;
	
	УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, ИмяТабличнойЧасти, Перечисления.ВидыСкладов.Оптовый, СтруктураОбязательныхПолей);

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()


// Проверяет правильность заполнения строк табличной части "Услуги".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиУслуги(ТаблицаПоУслугам, СтруктураШапкиДокумента, 
	                                              Отказ, Заголовок)

	ИмяТабличнойЧасти = "Услуги";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Содержание, Количество, Сумма, СтавкаНДС, СтатьяКнигиПродаж");
	Если СуммаДокумента = 0 Тогда
		// разрешаем налоговую накладную на безоплатную передачу
		СтруктураОбязательныхПолей.Удалить("Сумма");
	КонецЕсли;

	УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, ИмяТабличнойЧасти, Перечисления.ВидыСкладов.Оптовый, СтруктураОбязательныхПолей);

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);

КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиУслуги()


// Проверяет правильность заполнения строк табличной части "Возвратная тара".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТаре           - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара(ТаблицаПоТаре, СтруктураШапкиДокумента, 
                                                          Отказ, Заголовок)

	ИмяТабличнойЧасти = "ВозвратнаяТара";
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("");

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара()


Процедура ПроверитьЗаполнениеТабличнойЧастиПрочее(ТаблицаПоПрочим, СтруктураШапкиДокумента, Отказ, Заголовок)
   	ИмяТабличнойЧасти = "Прочее";

	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Наименование, Количество, Сумма, СтавкаНДС, СтатьяКнигиПродаж");
	Если СуммаДокумента = 0 Тогда
		// разрешаем налоговую накладную на безоплатную передачу
		СтруктураОбязательныхПолей.Удалить("Сумма");
	КонецЕсли;
	
	УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, ИмяТабличнойЧасти, Перечисления.ВидыСкладов.Оптовый, СтруктураОбязательныхПолей);

	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры


// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, 
	                          ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим,
							  Отказ, Заголовок)
	
	ДвиженияПоРегиструНДСПродаж(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим, Отказ);
	
	ДвиженияПоРегиструКнигаПродаж(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим, Отказ);
	
						  
КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоРегиструНДСПродаж(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам,  ТаблицаПоПрочим, Отказ)

	Если СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа 
	 ИЛИ СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		// в этом случае движения не требуются
		Возврат;
	КонецЕсли;
	
	НаборДвижений = Движения.НДСПродаж;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	
	ТаблицаДвижений.Очистить();
	ТаблицаДвиженийТара 	  = ТаблицаДвижений.Скопировать();
	ТаблицаДвиженийОплата 	  = ТаблицаДвижений.Скопировать();
	
	
	// ТОВАРЫ
	ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
	ТаблицаКопия.Свернуть("СтавкаНДС","СуммаСНДСРегл,СуммаБезНДСРегл,СуммаНДСРегл");
	ТаблицаПродаж = ТаблицаКопия.Скопировать();
	
	// УСЛУГИ
	ТаблицаКопия = ТаблицаПоУслугам.Скопировать();
	ТаблицаКопия.Свернуть("СтавкаНДС","СуммаСНДСРегл,СуммаБезНДСРегл,СуммаНДСРегл");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаПродаж);
	
	// ПРОЧЕЕ
	ТаблицаКопия = ТаблицаПоПрочим.Скопировать();
	ТаблицаКопия.Свернуть("СтавкаНДС","СуммаСНДСРегл,СуммаБезНДСРегл,СуммаНДСРегл");
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаПродаж);

	ТаблицаПродаж.Свернуть("СтавкаНДС","СуммаСНДСРегл,СуммаБезНДСРегл,СуммаНДСРегл");
	ТаблицаПродаж.Колонки.СуммаСНДСРегл  .Имя = "СуммаВзаиморасчетовРегл";
	ТаблицаПродаж.Колонки.СуммаБезНДСРегл.Имя = "БазаНДС";
	ТаблицаПродаж.Колонки.СуммаНДСРегл   .Имя = "НДС";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПродаж, ТаблицаДвижений);
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	
	Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации 
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации 
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации 
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОсвобожденныеОперации Тогда
		
		СобытиеНДС = Перечисления.СобытияНДСПродаж.РозничнаяВыручка;

	Иначе	
		
		СобытиеНДС = Перечисления.СобытияНДСПродаж.РеализацияПокупателю;
		
	КонецЕсли; 
	
	ТаблицаДвижений.ЗаполнитьЗначения(СобытиеНДС, "СобытиеНДС");

	// Если договор не бартерный
	// сформируем второе движение - подтверждение НДС по оплате.
	Если СтруктураШапкиДокумента.ВидДоговора <>  Перечисления.ВидыДоговоровКонтрагентов.Бартерный 
		И (  	СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации
		    ИЛИ	СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации
			ИЛИ	СтруктураШапкиДокумента.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации) Тогда

		//получим копию таблицы движений свернутую по измерениям  
		ТаблицаКопия = ТаблицаДвижений.Скопировать();
		ТаблицаКопия.Свернуть("ВозвратнаяТара","СуммаВзаиморасчетовРегл");
		// загрузим во временную таблицу, со структурой совпадающей со структурой регистра
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвиженийОплата);
		
		ТаблицаДвиженийОплата.ЗаполнитьЗначения(Организация       , "Организация");
		ТаблицаДвиженийОплата.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
		ТаблицаДвиженийОплата.ЗаполнитьЗначения(Перечисления.СобытияНДСПродаж.ОплатаПокупателем,	  "СобытиеНДС");
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаДвиженийОплата, ТаблицаДвижений);
	КонецЕсли;
	
	// ТАРА
	ТаблицаКопия = ТаблицаПоТаре.Скопировать();
	ТаблицаКопия.Свернуть("СтавкаНДС","СуммаСНДСРегл");
	ТаблицаКопия.Колонки.СуммаСНДСРегл.Имя = "СуммаВзаиморасчетовРегл";
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвиженийТара);
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Истина            , "ВозвратнаяТара");
	ТаблицаДвиженийТара.ЗаполнитьЗначения(Перечисления.СобытияНДСПродаж.РеализацияПокупателю, "СобытиеНДС");
	
	// Если договор не бартерный
	// сформируем второе движение - подтверждение НДС по оплате.
	Если СтруктураШапкиДокумента.ВидДоговора <>  Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
		//получим копию таблицы движений свернутую по измерениям  
		ТаблицаКопия = ТаблицаДвиженийТара.Скопировать();
		ТаблицаКопия.Свернуть("ВозвратнаяТара","СуммаВзаиморасчетовРегл");
		
		// загрузим во временную таблицу, со структурой совпадающей со структурой регистра		
		ТаблицаДвиженийОплата.Очистить();
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвиженийОплата);
		
		ТаблицаДвиженийОплата.ЗаполнитьЗначения(Организация       , "Организация");
		ТаблицаДвиженийОплата.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
		ТаблицаДвиженийОплата.ЗаполнитьЗначения(Перечисления.СобытияНДСПродаж.ОплатаПокупателем,	  "СобытиеНДС");
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаДвиженийОплата, ТаблицаДвиженийТара);
	КонецЕсли;

	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	
		Движения.НДСПродаж.ВыполнитьРасход();
		Движения.НДСПродаж.Записать();
		
	КонецЕсли;
	
	Если НЕ Отказ И ТаблицаДвиженийТара.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвиженийТара;
	
		Движения.НДСПродаж.ВыполнитьРасход();
		Движения.НДСПродаж.Записать();
		
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегиструНДСПродаж()							  

Процедура ДвиженияПоРегиструКнигаПродаж(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам,  ТаблицаПоПрочим, Отказ)
			
	НаборДвижений = Движения.КнигаПродаж;
	
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	
	Если НЕ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
	
		// ТОВАРЫ
		ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
	    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяКнигиПродаж", "СуммаБезНДСРегл, СуммаНДСРегл");
		ТаблицаКопия.Колонки.СуммаБезНДСРегл.Имя = "БазаНДС";
		ТаблицаКопия.Колонки.СуммаНДСРегл	.Имя = "НДС";
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
		
		// УСЛУГИ
		ТаблицаКопия = ТаблицаПоУслугам.Скопировать();
	    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяКнигиПродаж", "СуммаБезНДСРегл, СуммаНДСРегл");
		ТаблицаКопия.Колонки.СуммаБезНДСРегл.Имя = "БазаНДС";
		ТаблицаКопия.Колонки.СуммаНДСРегл	.Имя = "НДС";
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
		
		// Прочее
		ТаблицаКопия = ТаблицаПоПрочим.Скопировать();
	    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяКнигиПродаж", "СуммаБезНДСРегл, СуммаНДСРегл");
		ТаблицаКопия.Колонки.СуммаБезНДСРегл.Имя = "БазаНДС";
		ТаблицаКопия.Колонки.СуммаНДСРегл	.Имя = "НДС";
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
	КонецЕсли;
	
	Если ПродажаНижеОбычнойЦены
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки
		Тогда
		// ТОВАРЫ
		ТаблицаКопия = ТаблицаПоТоварам.Скопировать();
	    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяКнигиПродаж", "СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");
		ТаблицаКопия.Колонки.СуммаБезНДСПревышенияРегл	.Имя = "БазаНДС";
		ТаблицаКопия.Колонки.СуммаНДСПревышенияРегл		.Имя = "НДС";
		ТаблицаКопия.Колонки.Добавить("ПродажаНижеОбычнойЦены", Новый ОписаниеТипов("Булево"));
		ТаблицаКопия.ЗаполнитьЗначения(Истина,"ПродажаНижеОбычнойЦены");
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	
		// УСЛУГИ
		ТаблицаКопия = ТаблицаПоУслугам.Скопировать();
	    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяКнигиПродаж", "СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");
		ТаблицаКопия.Колонки.СуммаБезНДСПревышенияРегл	.Имя = "БазаНДС";
		ТаблицаКопия.Колонки.СуммаНДСПревышенияРегл		.Имя = "НДС";
		ТаблицаКопия.Колонки.Добавить("ПродажаНижеОбычнойЦены", Новый ОписаниеТипов("Булево"));
		ТаблицаКопия.ЗаполнитьЗначения(Истина,"ПродажаНижеОбычнойЦены");
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
		
		// Прочее
		ТаблицаКопия = ТаблицаПоПрочим.Скопировать();
	    ТаблицаКопия.Свернуть("СтавкаНДС, СтатьяКнигиПродаж", "СуммаБезНДСПревышенияРегл, СуммаНДСПревышенияРегл");
		ТаблицаКопия.Колонки.СуммаБезНДСПревышенияРегл	.Имя = "БазаНДС";
		ТаблицаКопия.Колонки.СуммаНДСПревышенияРегл		.Имя = "НДС";
		ТаблицаКопия.Колонки.Добавить("ПродажаНижеОбычнойЦены", Новый ОписаниеТипов("Булево"));
		ТаблицаКопия.ЗаполнитьЗначения(Истина,"ПродажаНижеОбычнойЦены");
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаКопия, ТаблицаДвижений);
	КонецЕсли; 
	
	ТаблицаДвижений.ЗаполнитьЗначения(Организация       , "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(ДоговорКонтрагента, "ДоговорКонтрагента");
	
	ТаблицаДвижений.ЗаполнитьЗначения(ФормаРасчетов, "ФормаРасчетов");
	
	Если НЕ Отказ И ТаблицаДвижений.Количество() > 0 Тогда
		
		НаборДвижений.мПериод          = Дата;
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Движения.КнигаПродаж.ДобавитьДвижение();
	
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ


// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если Не Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)) ИЛИ Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипОснования = ТипЗнч(Основание);
	
	Если ТипОснования = Тип("ДокументСсылка.ЧекККМ") Тогда
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		ТаблицаВидовОпераций = ОпределитьВозможныеВидыОперацийПоОснованию(Основание);
		
		Если ТаблицаВидовОпераций.Количество() > 1 Тогда
			ВыбранныйВидОперации = ТаблицаВидовОпераций.ВыбратьСтроку("Выберите операцию для формирования налоговой накладной");
		ИначеЕсли ТаблицаВидовОпераций.Количество() = 1 Тогда
			ВыбранныйВидОперации = ТаблицаВидовОпераций[0];
		Иначе
			//в документе-основании нет строк с заполненной СтавкойНДС
			ВыбранныйВидОперации = Неопределено;
		КонецЕсли;
			
		Если ВыбранныйВидОперации = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ВидОперации = ВыбранныйВидОперации[0];
		
		// Этот документ всегда имеет установленный флаг УчитыватьНДС
		УчитыватьНДС = Истина;
		
		ЗаполнитьУсловиеПродажи(Основание);

		// в документе Чек нет некоторых реквизитов...  установим вручную
		Организация = Основание.КассаККМ.Владелец;
		ОбособленноеПодразделение = Основание.КассаККМ.ОбособленноеПодразделение;
		ВалютаДокумента = мВалютаРегламентированногоУчета;
		КурсВзаиморасчетов = 1;
		КратностьВзаиморасчетов = 1;
		СуммаВключаетНДС = Истина;
		АвторасчетНДС = Истина;
		
		ФормаРасчетов = "";
		


		СуммаБезналичнойОплаты 	= 0;
		СуммаНаличнойОплаты		= 0;
		Для каждого СтрокаОплаты Из Основание.Оплата Цикл
			Если СтрокаОплаты.ВидОплаты = Справочники.ВидыОплатЧекаККМ.Наличные Тогда
				СуммаНаличнойОплаты = СуммаНаличнойОплаты + СтрокаОплаты.Сумма;
			Иначе
				СуммаБезналичнойОплаты 	= СуммаБезналичнойОплаты + СтрокаОплаты.Сумма;
			КонецЕсли; 
		КонецЦикла; 
		
 		Если СуммаБезналичнойОплаты > 0 Тогда
			
			ФормаРасчетов = "Безготівковий розрахунок";
			
		КонецЕсли;
		Если СуммаНаличнойОплаты - СуммаБезналичнойОплаты > 0 Тогда
			
			Если ФормаРасчетов = "" Тогда
				ФормаРасчетов = "Готівка";
			Иначе
				ФормаРасчетов = ФормаРасчетов + ", готівка";
			КонецЕсли; 
			
		КонецЕсли;

		
		// В качестве документа-основания не имеет смысл выбирать документ ЧекККМ
		// с видом операции "Чек на возврат"
		Если   Основание.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
	    	Сообщить("Нельзя вводить документ Налоговая накладная на основании Чека на возврат! ", СтатусСообщения.Внимание);
			Возврат;
		КонецЕсли;
		
		СкопироватьТовары(Основание);
		СкопироватьУслуги(Основание);

		Возврат;
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.СписаниеТоваров")  Тогда
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа;
		ДокументОснование = Основание;
		
		// Заполняется только количество, т.к. бухгалтерской себестоимости у нас нет
		
		Для каждого СтрокаТЧ Из Основание.Товары Цикл
			
		 	НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура				=	СтрокаТЧ.Номенклатура;
			НоваяСтрока.ХарактеристикаНоменклатуры	=	СтрокаТЧ.ХарактеристикаНоменклатуры;
			НоваяСтрока.Количество					=	СтрокаТЧ.Количество;
			НоваяСтрока.ЕдиницаИзмерения			=	СтрокаТЧ.ЕдиницаИзмерения;
			НоваяСтрока.Коэффициент					=	СтрокаТЧ.Коэффициент;
			
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, ЭтотОбъект);
			
			Если  НЕ НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20
				И НЕ НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
			
				НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
			
			КонецЕсли;
			
			ЗаполнитьСтатьюКнигиПродаж(НоваяСтрока, "Товары");
			
		КонецЦикла; 
		
		НоваяНакладная = ВыделитьСтавкуНДС7ВОтдельныйДокумент(Ложь);
		Если НЕ НоваяНакладная = Неопределено Тогда
			Форма7 = НоваяНакладная.ПолучитьФорму("ФормаДокумента",, Новый УникальныйИдентификатор);	
			Форма7.Открыть();
		КонецЕсли;
		
		Возврат;
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах") 
		    И Основание.ДоговорКонтрагента.Внешнеэкономический Тогда
#Если Клиент Тогда			
	
	
			Если Основание.Дата < '20110101' Тогда
				// необходимо определиться: либо вводим налоговоую накладную на проданный товар,
				// либо вводим налоговую накладную на услуги комиссии от нерезидента.
				СписокВариантов = Новый СписокЗначений();
				СписокВариантов.Добавить(1,"На реализованный товар");
				СписокВариантов.Добавить(2,"На услугу комиссии от нерезидента");
				Выбор = СписокВариантов.ВыбратьЭлемент("Выберите вариант заполнения налоговой накладной:", СписокВариантов[0]);
			Иначе	
				// имеет смысл вводить налоговую только на услуги нерезидента. 
				// с 2011 года налоговые выписываются при передаче товаров комиссионеру (поставке)
				Выбор = Новый Структура("Значение", 2);
			КонецЕсли;
			
			Если Выбор = Неопределено Тогда
				//отказались от выбора
				мНеОткрыватьФормуДокумента = Истина;
				Возврат;
			ИначеЕсли Выбор.Значение = 2 Тогда
			
				// Заполним реквизиты из стандартного набора по документу основанию.
				ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
				
				ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента;
				
				// Этот документ всегда имеет установленный флаг УчитыватьНДС
				УчитыватьНДС = Истина;
				
				//Заполним ТЧ
				СкопироватьУслугиКомиссииОтНерезидента(Основание);
				
				УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
				
				Возврат;
			
			Иначе// Выбор = 1;
				//Стандартное заполнение с помощью обработки
			КонецЕсли;
#КонецЕсли		
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
		  ИЛИ ТипОснования = Тип("ДокументСсылка.ПоступлениеТоваровУслугВНТТ") Тогда	
		
		Если НЕ Основание.ДоговорКонтрагента.Внешнеэкономический Тогда
			
			Сообщить("На основании документа ""Поступление товаров и услуг"" можно вводить ""Налоговую накладную"" только при поставке от нерезидента!");
			
			мНеОткрыватьФормуДокумента = Истина;
			Возврат;
			
		КонецЕсли;	
			       
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
		ДокументОснование = Основание;
		
		ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента;
		
		// Этот документ всегда имеет установленный флаг УчитыватьНДС
		УчитыватьНДС = Истина;
		
		//Заполним ТЧ
		СкопироватьУслуги(Основание);
		
		УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();

		Возврат;
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") 
			И Основание.ВидОперации = Перечисления.ВидыОперацийПКО.ПриходДенежныхСредствРозничнаяВыручка Тогда	
			
		мНеОткрыватьФормуДокумента = Истина;
		
		ОбработкаФормированияНН = Обработки.ФормированиеНалоговыхНакладныхПоРознице.ПолучитьФорму();
		ОбработкаФормированияНН.Открыть();
		
		ОбработкаФормированияНН.ЭтотОбъект.Организация = Основание.Организация;
		ОбработкаФормированияНН.ЭтотОбъект.ДатаНачала 	 = Основание.Дата;
		ОбработкаФормированияНН.ЭтотОбъект.ДатаОкончания = Основание.Дата;
		
		Возврат;
	ИначеЕсли  ТипОснования = Тип("ДокументСсылка.КорректировкаДолгаПоВозвратнойТаре") Тогда
		Если Основание.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолгаПоВозвратнойТаре.УПокупателя Тогда
			Сообщить("Нельзя вводить Налоговую накладную на основании документа Корректировка долга по возвратной таре с видом операции ""списание тары покупателя"" ", СтатусСообщения.Внимание);
			мНеОткрыватьФормуДокумента = Истина;
			Возврат;
		КонецЕсли;
		
		// списание тары поставщика влечет появление налоговых обязательст (условная продажа)
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа;
		
		ДокументОснование = Основание;
		СкопироватьТаруВТовары();
	
		Возврат;
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		      И Основание.Дата >='20110101'
			  И Основание.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
		// налоговые обязательства возникают по поставке.
		// заполним документ на основании.
		
		// возможно, в документе указаны облагаемые и не облагаемые НДС товары
		ЕстьОблагаемыеОперации = Истина;
		ЕстьНеОблагаемыеОперации = Истина;
		ЕстьНеНДСперации = Истина;
		СтавкиНДС = Основание.Товары.ВыгрузитьКолонку("СтавкаНДС");
		Если  СтавкиНДС.Найти(Перечисления.СтавкиНДС.НДС20) = Неопределено
			И СтавкиНДС.Найти(Перечисления.СтавкиНДС.НДС7) = Неопределено
			И СтавкиНДС.Найти(Перечисления.СтавкиНДС.НДС0) = Неопределено Тогда
			ЕстьОблагаемыеОперации = Ложь;	
		КонецЕсли;
		Если  СтавкиНДС.Найти(Перечисления.СтавкиНДС.БезНДС) = Неопределено Тогда
			ЕстьНеОблагаемыеОперации = Ложь;	
		КонецЕсли;
		Если  СтавкиНДС.Найти(Перечисления.СтавкиНДС.НеНДС) = Неопределено Тогда
			ЕстьНеНДСперации = Ложь;	
		КонецЕсли;
		
		Если  НЕ ЕстьОблагаемыеОперации 
			И НЕ ЕстьНеОблагаемыеОперации
			И НЕ ЕстьНеНДСперации Тогда
		
			//Сообщить("Нет данных для заполнения документа!");
			
			мНеОткрыватьФормуДокумента = Истина;
			Возврат;
		
		КонецЕсли;
		
		ТекущийДокументЗаполнен = Ложь;
		Если ЕстьОблагаемыеОперации Тогда
		
			ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
			ДокументОснование = Основание;
			ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации;
			Дата = Основание.Дата;
			// Этот документ всегда имеет установленный флаг УчитыватьНДС
			УчитыватьНДС = Истина;
			
			ЗаполнитьВидДоговора();
			ЗаполнитьУсловиеПродажи();
			ФормаРасчетов = "Оплата з поточного рахунку";
			УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
			Сделка = Основание.Сделка;
			
			//Заполним ТЧ
			СкопироватьТовары(Основание);
			Если НЕ ТекущийДокументЗаполнен Тогда
				ТекущийДокументЗаполнен = Истина;
				СкопироватьВозвратнуюТару(Основание);
			КонецЕсли;
			
			Если глЗначениеПеременной("ДатаВступленияВСилуПриказа1379") <= Дата И Дата < '2014-03-01'  ИЛИ Дата >= '2015-01-01' Тогда
				ФормаРасчетов = "Оплата з поточного рахунка";
			КонецЕсли;
			УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
		
		КонецЕсли;
		
		Если ЕстьНеОблагаемыеОперации Тогда
			
			Если ТекущийДокументЗаполнен Тогда
				новДок = Документы.НалоговаяНакладная.СоздатьДокумент();
			Иначе
				новДок = ЭтотОбъект;
			КонецЕсли;
			
			ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(новДок, Основание);
			новДок.ДокументОснование = Основание;
			новДок.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ОсвобожденныеОперации;
			новДок.Дата = Основание.Дата;
			
			// Этот документ всегда имеет установленный флаг УчитыватьНДС
			новДок.УчитыватьНДС = Истина;
			
			новДок.ЗаполнитьВидДоговора();
			новДок.ЗаполнитьУсловиеПродажи();
			новДок.ФормаРасчетов = "Оплата з поточного рахунку";
			Если глЗначениеПеременной("ДатаВступленияВСилуПриказа1379") <= новДок.Дата И новДок.Дата < '2014-03-01' ИЛИ новДок.Дата >= '2015-01-01' Тогда
				новДок.ФормаРасчетов = "Оплата з поточного рахунка";
			КонецЕсли;
			новДок.УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
			новДок.Сделка = Основание.Сделка;
			
			//Заполним ТЧ
			новДок.СкопироватьТовары(Основание);
			Если НЕ ТекущийДокументЗаполнен Тогда
				ТекущийДокументЗаполнен = Истина;
				новДок.СкопироватьВозвратнуюТару(Основание);
			Иначе
				ФормаНовДок = НовДок.ПолучитьФорму(,,Новый УникальныйИдентификатор);
				ФормаНовДок.Открыть();
			КонецЕсли;
		
		КонецЕсли;
		
		Если ЕстьНеНДСперации Тогда
			
			Если ТекущийДокументЗаполнен Тогда
				новДок = Документы.НалоговаяНакладная.СоздатьДокумент();
			Иначе
				новДок = ЭтотОбъект;
			КонецЕсли;
			
			ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(новДок, Основание);
			новДок.ДокументОснование = Основание;
			новДок.ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации;
			новДок.Дата = Основание.Дата;
			
			// Этот документ всегда имеет установленный флаг УчитыватьНДС
			новДок.УчитыватьНДС = Истина;
			
			новДок.ЗаполнитьВидДоговора();
			новДок.ЗаполнитьУсловиеПродажи();
			новДок.ФормаРасчетов = "Оплата з поточного рахунку";
			Если глЗначениеПеременной("ДатаВступленияВСилуПриказа1379") <= новДок.Дата И новДок.Дата < '2014-03-01' ИЛИ новДок.Дата >= '2015-01-01' Тогда
				новДок.ФормаРасчетов = "Оплата з поточного рахунка";
			КонецЕсли;
			новДок.УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию();
			новДок.Сделка = Основание.Сделка;
			
			//Заполним ТЧ
			новДок.СкопироватьТовары(Основание);
			Если НЕ ТекущийДокументЗаполнен Тогда
				ТекущийДокументЗаполнен = Истина;
				новДок.СкопироватьВозвратнуюТару(Основание);
			Иначе
				ФормаНовДок = НовДок.ПолучитьФорму(,,Новый УникальныйИдентификатор);
				ФормаНовДок.Открыть();
			КонецЕсли;
		
		КонецЕсли;
		
		Если НЕ ТекущийДокументЗаполнен Тогда
			ТекстПредупреждения = "Нет данных для заполнения документа!";
			#Если Клиент Тогда
				Предупреждение(ТекстПредупреждения);
			#Иначе
				Сообщить(ТекстПредупреждения, СтатусСообщения.Информация);
			#КонецЕсли
		КонецЕсли;
		
		Возврат;
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")
			И Основание.Дата >= '20110101'
		    И НЕ Основание.ДоговорКонтрагента.Внешнеэкономический Тогда
			
			ТекстПредупреждения = "С 2011 года налоговые обязательства в комиссионной торговле возникают при поставке товаров на комиссию (необходимо вводить Налоговую накладную на основании документа ""Реализация товаров и услуг""!
					 |По отчету комиссионера можно вводить Приложение 2 к Налоговой накладной на разницу в цене передачи и реализации товаров.";
			#Если Клиент Тогда
				Предупреждение(ТекстПредупреждения);
			#Иначе
				Сообщить(ТекстПредупреждения, СтатусСообщения.Информация);
			#КонецЕсли
			
			мНеОткрыватьФормуДокумента = Истина;
			Возврат;
	
		
	КонецЕсли;
	
	// при вводе на основании запускается специальная обработка, которая и
	// формирует налоговые накладные
	мНеОткрыватьФормуДокумента = Истина;
		
	Если ((    ТипОснования = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее")
		  ИЛИ ТипОснования = Тип("ДокументСсылка.ПлатежноеТребованиеВыставленное")
		  ИЛИ ТипОснования = Тип("ДокументСсылка.ПлатежныйОрдерПоступлениеДенежныхСредств")
		  ИЛИ ТипОснования = Тип("ДокументСсылка.ПлатежноеТребованиеПоручениеВыставленное")
		  ИЛИ ТипОснования = Тип("ДокументСсылка.АккредитивПолученный")
		  ) И Основание.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком)
		  ИЛИ
		  (  ТипОснования = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") 
		   И Основание.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком) Тогда
		   
#Если Клиент Тогда
			Предупреждение("По данному документу не возникают налоговые обязательства!");
#Иначе
			Сообщить("По данному документу не возникают налоговые обязательства!", СтатусСообщения.Информация);
#КонецЕсли

			Возврат;
	КонецЕсли; 	
	
	
	ОбработкаФормированияНН = Обработки.ФормированиеНалоговыхНакладных.Создать();
	ОбработкаФормированияНН.РасчетыВозврат = Перечисления.РасчетыВозврат.Расчеты;
	
	ОбработкаФормированияНН.Дата = Основание.Дата;
	
	Если НЕ ЗначениеЗаполнено(Основание.Организация) Тогда
		Сообщить("В документе не указана организация! Заполнение невозможно.");
		Возврат;
	Иначе
		ОбработкаФормированияНН.Организация = Основание.Организация;
	КонецЕсли;
	
	// Основание может содержать номенклатуру для заполнения налоговой накладной
	ОснованиеСодержитНоменклатуру = Ложь;
	Для каждого ДопустимыйТип Из ОбработкаФормированияНН.ДопустимыеТипыДокументов Цикл
		Если ТипОснования = ДопустимыйТип Тогда
			ОснованиеСодержитНоменклатуру = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла; 

	ОтборДоговоров = ОбработкаФормированияНН.ОтборДоговоровКонтрагентов;
	Если ОснованиеСодержитНоменклатуру Тогда
		Если НЕ ЗначениеЗаполнено(Основание.ДоговорКонтрагента) Тогда
			
			Сообщить("В документе не указан договор контрагента! Заполнение невозможно.");
			Возврат;
			
		Иначе	
			
			СтрокаОтбора = ОтборДоговоров.Добавить();
			СтрокаОтбора.ДоговорКонтрагента = Основание.ДоговорКонтрагента;
			СтрокаОтбора.Контрагент 		= Основание.ДоговорКонтрагента.Владелец;
			
		КонецЕсли;
	Иначе
		
	   Если НЕ Основание.Метаданные().ТабличныеЧасти.Найти("РасшифровкаПлатежа") = Неопределено Тогда
				
			// платежные документы
			Для каждого СтрокаТЧ Из Основание.РасшифровкаПлатежа  Цикл
					СтрокаОтбора = ОтборДоговоров.Добавить();
					СтрокаОтбора.ДоговорКонтрагента = СтрокаТЧ.ДоговорКонтрагента;
					СтрокаОтбора.Контрагент	 		= СтрокаТЧ.ДоговорКонтрагента.Владелец;		
			КонецЦикла;
			ОтборДоговоров.Свернуть("Контрагент, ДоговорКонтрагента","");
			
		Иначе
			
			Сообщить("В документе не указан договор контрагента! Заполнение невозможно.");
			Возврат;
				
		КонецЕсли;		
		
	КонецЕсли;

	// получим данные регистра НДСПродаж на текущий момент
	ОбработкаФормированияНН.ОбновитьДоговора();
	
	Если ОснованиеСодержитНоменклатуру Тогда	
		
		СтрокаИсточниковНоменклатуры = ОбработкаФормированияНН.ИсточникиНоменклатуры.Добавить();
		СтрокаИсточниковНоменклатуры.Документ 			= Основание;
		СтрокаИсточниковНоменклатуры.ДоговорКонтрагента = Основание.ДоговорКонтрагента;
		СтрокаИсточниковНоменклатуры.РасчетыВозврат 	= ОбработкаФормированияНН.РасчетыВозврат;
		
		СтруктураОтбора = Новый Структура();
		СтруктураОтбора.Вставить("Документ", 			Основание);
		СтруктураОтбора.Вставить("ДоговорКонтрагента", 	Основание.ДоговорКонтрагента);
		СтруктураОтбора.Вставить("РасчетыВозврат", 		ОбработкаФормированияНН.РасчетыВозврат);
		СтруктураОтбора.Вставить("Дата", 				Основание.Дата);
	
		ОбработкаФормированияНН.ЗаполнитьТабличныеЧасти(СтруктураОтбора);
		
		ТаблицаЧастичнойОтгрузки = Неопределено;
		МожноФормироватьНалоговыеНакладные = ОбработкаФормированияНН.МожноФормироватьНалоговыеНакладные(СтруктураОтбора, ТаблицаЧастичнойОтгрузки);
		Если МожноФормироватьНалоговыеНакладные Тогда
			
			ОбработкаФормированияНН.ОткрыватьДокументы = Истина;
			
			// сформированные документы не будут записаны в базу
			ОбработкаФормированияНН.мНеЗаписыватьДокументы = Истина;
			
			ОбработкаФормированияНН.СформироватьНалоговыеДокументы();	
			Возврат;	
			
		ИначеЕсли НЕ ОбработкаФормированияНН.БудутСформированыНалоговыеНакладные(ТаблицаЧастичнойОтгрузки) Тогда
			  
#Если Клиент Тогда
			Ответ = Вопрос("По данному документу не возникают налоговые обязательства. Открыть форму обработки заполнения налоговой накладной номенклатурным составом?", РежимДиалогаВопрос.ДаНет);
			Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;
#Иначе
			Сообщить("По данному документу не возникают налоговые обязательства!", СтатусСообщения.Информация);
			Возврат;
#КонецЕсли
			
			
		Иначе
#Если Клиент Тогда
				Ответ = Вопрос("На текущий момент сумма неподтвержденных налоговых обязательств по одной или нескольким ставкам НДС меньше соответствующей суммы документа. Заполнить налоговую накладную номенклатурным составом невозможно. Открыть форму обработки заполнения налоговой накладной номенклатурным составом?", РежимДиалогаВопрос.ДаНетОтмена);
				Если Ответ = КодВозвратаДиалога.Нет Тогда
				
					// открываем НН заполненную строками "частичная отгрузка"
					ОбработкаФормированияНН.ПодготовитьНоменклатурныйСоставПриЧастичнойОтгрузке(СтруктураОтбора, ТаблицаЧастичнойОтгрузки);
					ОбработкаФормированияНН.ОткрыватьДокументы = Истина;
					ОбработкаФормированияНН.СформироватьНалоговыеДокументы();	
					Возврат;	
				ИначеЕсли НЕ Ответ = КодВозвратаДиалога.Да Тогда
					Возврат;
				КонецЕсли; 
#Иначе
				Сообщить("На текущий момент сумма неподтвержденных налоговых обязательств по одной или нескольким ставкам НДС меньше соответствующей суммы документа. Заполнить налоговую накладную номенклатурным составом невозможно!", СтатусСообщения.Информация);
#КонецЕсли

		КонецЕсли;
	КонецЕсли;
	
	// необходимо подкорректировать номенклатурный состав.
	// откроем обработку. Но в ТЧ Договора может не быть строк - если остатков по регистру НДСПродаж не текущий момент нет
	// Добавим строки при необходимости
	Для каждого СтрокаОтбораДоговоров Из ОтборДоговоров Цикл
		
		Если ОбработкаФормированияНН.Договора.Найти(СтрокаОтбораДоговоров.ДоговорКонтрагента, "ДоговорКонтрагента") = Неопределено Тогда
			
			СтрокаДоговоров = ОбработкаФормированияНН.Договора.Добавить();
			СтрокаДоговоров.ДоговорКонтрагента 	= СтрокаОтбораДоговоров.ДоговорКонтрагента;
			СтрокаДоговоров.РасчетыВозврат 		= ОбработкаФормированияНН.РасчетыВозврат;
			
			СтрокаИсточниковНоменклатуры = ОбработкаФормированияНН.ИсточникиНоменклатуры.Добавить();
			СтрокаИсточниковНоменклатуры.ДоговорКонтрагента 	= СтрокаОтбораДоговоров.ДоговорКонтрагента;
			СтрокаИсточниковНоменклатуры.РасчетыВозврат 		= ОбработкаФормированияНН.РасчетыВозврат;
			
		КонецЕсли; 
	КонецЦикла; 
	
	ФормаОбоработки =  ОбработкаФормированияНН.ПолучитьФорму();
	ФормаОбоработки.ВосстанавливатьЗначенияПриОткрытии = Ложь;
	ФормаОбоработки.ОткрыватьДокументы = Истина;
	ФормаОбоработки.Открыть();
	ФормаОбоработки.ЭлементыФормы.Панель.ТекущаяСтраница = ФормаОбоработки.ЭлементыФормы.Панель.Страницы.Данные;
		
КонецПроцедуры // ОбработкаЗаполнения()


// Процедура вызывается перед записью документа 
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены) Тогда
		Возврат;
	КонецЕсли;
	
	Если Товары.Количество() > 0
	   И (ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента) Тогда
		Товары.Очистить();
	КонецЕсли;
	
	Если НЕ ПродажаНижеОбычнойЦены 
		 И НЕ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки
		Тогда
		
		Для каждого СтрокаТЧ Из Товары Цикл
			СтрокаТЧ.ЦенаОбычная = 0;
			СтрокаТЧ.СуммаПревышения = 0;
			СтрокаТЧ.СуммаНДСПревышения = 0;
		КонецЦикла; 
		Для каждого СтрокаТЧ Из Услуги Цикл
			СтрокаТЧ.ЦенаОбычная = 0;
			СтрокаТЧ.СуммаПревышения = 0;
			СтрокаТЧ.СуммаНДСПревышения = 0;
		КонецЦикла; 
		Для каждого СтрокаТЧ Из Прочее Цикл
			СтрокаТЧ.ЦенаОбычная = 0;
			СтрокаТЧ.СуммаПревышения = 0;
			СтрокаТЧ.СуммаНДСПревышения = 0;
		КонецЦикла; 
		
	КонецЕсли;
	
	Если АвторасчетНДС Тогда
		// соответствие для хранения погрешностей округлений
		ПогрешностиОкругления = Новый Соответствие();
		// пересчет сумм НДС с учетом ошибок округления
		ОбработкаТабличныхЧастей.ПересчитатьНДСсУчетомПогрешностиОкругления(Товары, ЭтотОбъект, ПогрешностиОкругления,  "Товары");
		ОбработкаТабличныхЧастей.ПересчитатьНДСсУчетомПогрешностиОкругления(Услуги, ЭтотОбъект, ПогрешностиОкругления,  "Услуги");
		ОбработкаТабличныхЧастей.ПересчитатьНДСсУчетомПогрешностиОкругления(Прочее, ЭтотОбъект, ПогрешностиОкругления,  "Прочее");
	КонецЕсли;
	
	// Посчитать суммы документа и записать их в соответствующие реквизиты шапки для показа в журналах
	Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
		СуммаНДСДокумента = Товары.Итог("СуммаНДСПревышения")+Услуги.Итог("СуммаНДСПревышения")+Прочее.Итог("СуммаНДСПревышения");
		// суммы превышения всегда без НДС
		СуммаДокумента    = Товары.Итог("СуммаПревышения")+Услуги.Итог("СуммаПревышения")+Прочее.Итог("СуммаПревышения");
		Если СуммаВключаетНДС Тогда
			СуммаДокумента = СуммаДокумента + СуммаНДСДокумента;	
		КонецЕсли;
	Иначе
		// Посчитать суммы документа и записать их в соответствующие реквизиты шапки для показа в журналах
		СуммаДокумента 	  = НалоговыйУчет.ПолучитьСуммуДокументаСНДС(ЭтотОбъект,, Ложь); //с учетом стоимости возвратнонй тары
		СуммаНДСДокумента = НалоговыйУчет.ПолучитьНДСДокумента(ЭтотОбъект);
	КонецЕсли;
	
	
	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитика	= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	Если УчетнаяПолитикаНеЗадана тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ 
		ИЛИ (  Дата < '2015-01-01' 
		     И (УчетнаяПолитикаНеЗадана ИЛИ НЕ УчетнаяПолитика.ВестиРаздельнуюНумерациюНалоговыхНакладныхПоОбычнымЦенам = Истина)) 
		Тогда
		// манипуляций со служебной налоговой не делаем
	ИначеЕсли ПродажаНижеОбычнойЦены Тогда
		
		Если НЕ ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			
			
			// в начале получим номер, если его еще нет, т.к. хорошо бы номер основной налоговой был меньше налоговой по ОЦ
			Если НЕ ЗначениеЗаполнено(Номер) Тогда
				УстановитьНовыйНомер();
			КонецЕсли;	
			
			Док = Документы.НалоговаяНакладная.СоздатьДокумент();	
			ЗаполнитьЗначенияСвойств(Док, ЭтотОбъект);
			
			Док.СуммаНДСДокумента =   Товары.Итог("СуммаНДСПревышения") 
									+ Услуги.Итог("СуммаНДСПревышения") 
									+ Прочее.Итог("СуммаНДСПревышения");
									
			Док.СуммаДокумента 	  =   Товары.Итог("СуммаПревышения") 
									+ Услуги.Итог("СуммаПревышения") 
									+ Прочее.Итог("СуммаПревышения");
												
			Если НЕ Док.СуммаВключаетНДС Тогда
				Док.СуммаДокумента = Док.СуммаДокумента + Док.СуммаНДСДокумента;
			КонецЕсли;								
						
            Док.ЭлектронныйДокумент = Истина;
			Док.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
			Док.ПродажаНижеОбычнойЦены = Ложь;
			
			Док.Номер = "";
			Док.ПродажаНижеОбычнойЦены = Ложь;
			Док.ПодтверждаетсяГТД = Ложь;
			Док.Проведен = Ложь;
			Док.ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены = Неопределено;
			Док.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены 		   = Неопределено;
			
			Док.УстановитьНовыйНомер();
			Док.ОбменДанными.Загрузка = Истина;
			Док.Записать(РежимЗаписиДокумента.Запись);
			
			// пропишем вспомогательный документ для номера в реквизит
			НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены = Док.Ссылка; 
			
		Иначе	
			
			// возможно нужно изменить номер документа (при изменении даты/организации)
			Док = НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены.ПолучитьОбъект();	
			// синхронизируем пометки
			Док.УстановитьПометкуУдаления(ПометкаУдаления);
			Док.Записать(РежимЗаписи);
			
			ЗаполнитьЗначенияСвойств(Док, ЭтотОбъект, , "Номер,ПометкаУдаления,Проведен");
			ОбщегоНазначения.ПроверитьНомерНалоговогоДокумента(Док);
			Док.СуммаНДСДокумента =   Товары.Итог("СуммаНДСПревышения") 
									+ Услуги.Итог("СуммаНДСПревышения") 
									+ Прочее.Итог("СуммаНДСПревышения");
									
			Док.СуммаДокумента 	  =   Товары.Итог("СуммаПревышения") 
									+ Услуги.Итог("СуммаПревышения") 
									+ Прочее.Итог("СуммаПревышения");

			
	        Док.ЭлектронныйДокумент = Истина;
			Док.ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
			Док.ПродажаНижеОбычнойЦены = Ложь;
			Если Не ЗначениеЗаполнено(Док.Номер) Тогда
				Док.УстановитьНовыйНомер();
			КонецЕсли;
			
			Док.ОбменДанными.Загрузка = Истина;
			Док.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
		    // "освободим" сформированную налоговую
			Док = НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены.ПолучитьОбъект();	
			Если НЕ Док = Неопределено Тогда
				Док.СуммаДокумента 	  = НалоговыйУчет.ПолучитьСуммуДокументаСНДС(Док); //с учетом стоимости возвратнонй тары
				Док.СуммаНДСДокумента = НалоговыйУчет.ПолучитьНДСДокумента(Док);
				
				Док.ПродажаНижеОбычнойЦены = Ложь;
				Док.ТипПричиныНевыдачиПокупателюПриПродажеНижеОбычнойЦены = 0;
				Док.ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены = Неопределено;
				Док.НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены 		   = Неопределено;
				Док.ОбменДанными.Загрузка = Истина;
				Док.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		КонецЕсли;
		
		НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены = Неопределено;
		
	КонецЕсли;
	
	Если ТипПричиныНевыдачиПокупателю > 1
		И Дата >= '2014-03-01' Тогда
		
		Если НЕ ПодтверждаетсяГТД Тогда
			ЭлектронныйДокумент = Ложь;
		КонецЕсли; 
		
	    ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Ложь;
		
	КонецЕсли;
	
	Если Дата >= '2015-01-01' Тогда
		ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
		ЭлектронныйДокумент = Истина;
		
		Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.НеНДСОперации Тогда
			ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Ложь;
			ЭлектронныйДокумент = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипПричиныНевыдачиПокупателю > 0 Тогда
		// поставим флаг "Требует регистрация в реестре"
		// мы не управляем флажком ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных
		// для налоговых накладных, которые не выдаются покупателю
		// согласно разъяснению ЕБНЗ такие налоговые не должны регистрироваться в Едином реестре
		
	ИначеЕсли ЭлектронныйДокумент = Истина Тогда
		
		ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = истина;	
		
	Иначе
	
		ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Ложь;
		Если ВалютаДокумента = мВалютаРегламентированногоУчета Тогда
			НДСРегл = СуммаНДСДокумента;	
		Иначе 
			НДСРегл = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(СуммаНДСДокумента, ВалютаДокумента,
												мВалютаРегламентированногоУчета, 
												ЗаполнениеДокументов.КурсДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета), 
												1,
												ЗаполнениеДокументов.КратностьДокумента(ЭтотОбъект, мВалютаРегламентированногоУчета));
		КонецЕсли;
		Если Дата >= '20120101' Тогда
			// или сумма НДС в документе больше 10 000 грн
			Если НДСРегл > 10000 Тогда
				ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
				
			// или имеются подакцизные/импортированные товары
			// этот факт определим так - если в строке указан код УКТЗЭД - считаем что условие выполняется.
			ИначеЕсли   Товары.НайтиСтроки(Новый Структура("КодУКТВЭД", Справочники.КлассификаторУКТВЭД.ПустаяСсылка())).Количество() 	<> Товары.Количество()
					ИЛИ Прочее.НайтиСтроки(Новый Структура("КодУКТВЭД", Справочники.КлассификаторУКТВЭД.ПустаяСсылка())).Количество() 	<> Прочее.Количество() Тогда
				ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
			КонецЕсли;
		ИначеЕсли Дата >= '20110701' Тогда
			// сумма НДС в документе больше 100 000 грн
			Если НДСРегл > 100000 Тогда
				ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
			КонецЕсли;
		ИначеЕсли Дата >= '20110401' Тогда
			// сумма НДС в документе больше 500 000 грн
			Если НДСРегл > 500000 Тогда
				ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
			КонецЕсли;
		ИначеЕсли Дата >= '20110101' Тогда
			// сумма НДС в документе больше 1 000 000 грн
			Если НДСРегл > 1000000 Тогда
				ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если глЗначениеПеременной("ДатаНачалаИспользованияФормыННПоЛекарствам") <= Дата  Тогда
		// уже приняли новую форму, использование в спец. режиме особого значение - не допустимо.
		Если СпецРежимНалогообложения = 7 Тогда
			СпецРежимНалогообложения = 0;
		КонецЕсли;
	Иначе	
		// еще не приняли новую форму, для НН с НДС 7% нужно в спец. режиме указывать особое занчение (7)
		Отбор = Новый Структура("СтавкаНДС", Перечисления.СтавкиНДС.НДС7);
		Если ВДокументеЕстьСтавкаНДС7() Тогда
			СпецРежимНалогообложения = 7;
		Иначе	
			Если СпецРежимНалогообложения = 7 Тогда
				СпецРежимНалогообложения = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		ЭтотОбъект.ОбменДанными.Загрузка = Истина;
		ЭтотОбъект.Записать();
		ЭтотОбъект.ОбменДанными.Загрузка = Ложь;
		
		Если НЕ РеквизитыНомерСтрокиННАктуальны Тогда 
			// проверяем, а может и нормальная 
			РеквизитыНомерСтрокиННАктуальны = ПроверитьРеквизитыНомерСтрокиННАктуальны(Истина);
		КонецЕсли;
		
		Если НЕ РеквизитыНомерСтрокиННАктуальны Тогда 
			ПроизвестиУстановкуНомерСтрокиНН();
		КонецЕсли;
	КонецЕсли; 	
	
КонецПроцедуры // ПередЗаписью

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяПолитикаНеЗадана = Ложь;
	УчетнаяПолитика	= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(Дата, УчетнаяПолитикаНеЗадана, Организация, "Нал");
	Если УчетнаяПолитикаНеЗадана тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ 
		 И ПродажаНижеОбычнойЦены 
		 И (Дата >= '2015-01-01'
		    ИЛИ (	 Дата < '2015-01-01'
				   И НЕ УчетнаяПолитикаНеЗадана                                                        
				   И (УчетнаяПолитика.ВестиРаздельнуюНумерациюНалоговыхНакладныхПоОбычнымЦенам = Истина)))
		Тогда
	   
	   // установим в служебном документе ссылку на текущую накладную.
		Если ЗначениеЗаполнено(НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены) Тогда
			
			Док = НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены.ПолучитьОбъект();	
			
			Если НЕ Док.ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены = Ссылка Тогда
				Док.ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены = Ссылка;
				Док.ОбменДанными.Загрузка = Истина;
				Док.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	НалоговаяДляРезерваНомераПриПродажаНижеОбычнойЦены = Неопределено;	
	ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены = Неопределено;
	ВключенаВЕдиныйРеестрНалоговыхНакладных = Ложь;
	
КонецПроцедуры


Функция ПодготовитьСтруктуруШапкиДокумента(Отказ)
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента;

	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке      = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();

	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "ВалютаУправленческогоУчета"                  , "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы", "КурсВалютыУправленческогоУчета"              , "КурсВалютыУправленческогоУчета");

	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "Организация"                      , "ДоговорОрганизация");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВидДоговора"                      , "ВидДоговора");		
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "ДоговорыКонтрагентов", "ВалютаВзаиморасчетов"             , "ВалютаВзаиморасчетов");
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	// дополним структуру значением виртуального реквизита
	СтруктураШапкиДокумента.Вставить("ОтражатьВНалоговомУчете", Истина);
	
	Возврат СтруктураШапкиДокумента;
	
КонецФункции


Процедура ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим)
	
	
	ПогрешностиОкругления     		= Новый Соответствие;
	ПогрешностиОкругленияПревышение = Новый Соответствие;
	ПогрешностиОкругленияТара 		= Новый Соответствие;

	
	// ТОВАРЫ
	// Получим необходимые данные для проведения и проверки заполенения данные по табличной части "Товары".
	СтруктураПолей        = Новый Структура();
	СтруктураСложныхПолей = Новый Структура();
	
	СтруктураПолей.Вставить("НомерСтрокиНН"             , "НомерСтрокиНН");
	СтруктураСложныхПолей.Вставить("ИмяТЧ"           	, """Товары""");
	СтруктураПолей.Вставить("НомерСтрокиТЧ"    			, "НомерСтроки");

	СтруктураПолей.Вставить("Номенклатура"              , "Номенклатура.НаименованиеПолное");
	СтруктураПолей.Вставить("КодУКТВЭД"              	, "КодУКТВЭД");
	СтруктураПолей.Вставить("КодВид"              	    , "КодУКТВЭД.Вид");
	СтруктураПолей.Вставить("КодСХ"              	    , "КодУКТВЭД.КодСХДеятельности");
	СтруктураПолей.Вставить("НомерГТД"              	, "НомерГТД.Код");
	СтруктураПолей.Вставить("ДатаГТД"              	    , "НомерГТД.Дата");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"          , "ЕдиницаИзмерения.Наименование");
	СтруктураПолей.Вставить("ЕдиницаИзмеренияКод"       , "ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код");
	СтруктураПолей.Вставить("Количество"	           	, "Количество");	
	СтруктураПолей.Вставить("Цена"                      , "Цена");	
	СтруктураПолей.Вставить("Сумма"                     , "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС"                 , "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"                       , "СуммаНДС");
	СтруктураПолей.Вставить("ПроцентСкидкиНаценки"      , "ПроцентСкидкиНаценки");
	СтруктураПолей.Вставить("ПроцентАвтоСкидкиНаценки"  , "ПроцентАвтоматическихСкидок");
	СтруктураПолей.Вставить("Характеристика"			, "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("ДатаОтгрузкиОплаты"  		, "ДатаОтгрузкиОплаты");
	СтруктураПолей.Вставить("СтатьяКнигиПродаж"  		, "СтатьяКнигиПродаж");
	СтруктураПолей.Вставить("СуммаПревышения"           , "СуммаПревышения");
	СтруктураПолей.Вставить("СуммаНДСПревышения"        , "СуммаНДСПревышения");
	
	СтруктураПолей.Вставить("ТекстДляПечатиВКолонкеКоличество", "Номенклатура.ТекстДляПечатиВКолонкеКоличествоНалоговойНакладной");
	
	СтруктураПолей.Вставить("КодЛьготы"          , "Номенклатура.КодЛьготы");
	
	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей,СтруктураСложныхПолей);
	

	// Подготовим таблицу товаров для проведения.
	ТаблицаПоТоварам = ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);
	
	Если    ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации 
		ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
		Если Дата < '2015-01-01' Тогда
			ТаблицаПоТоварам.ЗаполнитьЗначения("", "Количество,ЕдиницаИзмерения,ЕдиницаИзмеренияКод, ЦенаМестаБезНДСБезСкидкиРегл");
		КонецЕсли;
	КонецЕсли;

	// УСЛУГИ
	// Получим необходимые данные для проведения и проверки заполенения данные 
	// по табличной части "Услуги".
	СтруктураПолей        = Новый Структура();
	СтруктураСложныхПолей = Новый Структура();
	
	СтруктураПолей.Вставить("НомерСтрокиНН"              , "НомерСтрокиНН");
	СтруктураСложныхПолей.Вставить("ИмяТЧ"           	, """Услуги""");
	СтруктураПолей.Вставить("НомерСтрокиТЧ"    			, "НомерСтроки");
	СтруктураПолей.Вставить("Номенклатура"              , "Содержание");
	СтруктураПолей.Вставить("КодУКТВЭД"					, "КодУКТВЭД");
	СтруктураПолей.Вставить("КодВид"              	    , "КодУКТВЭД.Вид");
	
	СтруктураСложныхПолей.Вставить("КодСХ"				  , """""");

	СтруктураСложныхПолей.Вставить("НомерГТД"           , """""");
	СтруктураСложныхПолей.Вставить("ДатаГТД"            , """""");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"          , "Номенклатура.БазоваяЕдиницаИзмерения.Наименование");
	СтруктураПолей.Вставить("ЕдиницаИзмеренияКод"          , "Номенклатура.БазоваяЕдиницаИзмерения.Код");
	СтруктураПолей.Вставить("Количество"            	, "Количество");
	СтруктураПолей.Вставить("Цена"                      , "Цена");		
	СтруктураПолей.Вставить("Сумма"                     , "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС"                 , "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"                       , "СуммаНДС");
	СтруктураПолей.Вставить("ПроцентСкидкиНаценки"      , "ПроцентСкидкиНаценки");
	СтруктураПолей.Вставить("ДатаОтгрузкиОплаты"  		, "ДатаОтгрузкиОплаты");
	СтруктураПолей.Вставить("СтатьяКнигиПродаж"  		, "СтатьяКнигиПродаж");	
	СтруктураПолей.Вставить("ТовароТранспортная"  		, "ТовароТранспортная");	
	СтруктураПолей.Вставить("СуммаПревышения"           , "СуммаПревышения");
	СтруктураПолей.Вставить("СуммаНДСПревышения"        , "СуммаНДСПревышения");
	
	СтруктураПолей.Вставить("ТекстДляПечатиВКолонкеКоличество", "Номенклатура.ТекстДляПечатиВКолонкеКоличествоНалоговойНакладной");
	
	СтруктураПолей.Вставить("КодЛьготы"          , "Номенклатура.КодЛьготы");
	
	РезультатЗапросаПоУслугам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Услуги", СтруктураПолей, СтруктураСложныхПолей);
	
	// Подготовим таблицу Услуг для проведения или печати
	ТаблицаПоУслугам = ПодготовитьТаблицуУслуг(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);

	
	// Прочее
	// Получим необходимые данные для проведения и проверки заполенения данные 
	// по табличной части "Прочее".
	СтруктураПолей        = Новый Структура();
	СтруктураСложныхПолей = Новый Структура();
	
	СтруктураПолей.Вставить("НомерСтрокиНН"             , "НомерСтрокиНН");
	СтруктураСложныхПолей.Вставить("ИмяТЧ"           	, """Прочее""");
	СтруктураПолей.Вставить("НомерСтрокиТЧ"    			, "НомерСтроки");
	
	СтруктураПолей.Вставить("Номенклатура"              , "Наименование");
	СтруктураПолей.Вставить("КодУКТВЭД"              	, "КодУКТВЭД");
	СтруктураПолей.Вставить("КодВид"              	    , "КодУКТВЭД.Вид");
	СтруктураСложныхПолей.Вставить("КодСХ"				  , """""");
	СтруктураПолей.Вставить("НомерГТД"              	, "НомерГТД.Код");
	СтруктураПолей.Вставить("ДатаГТД"              	    , "НомерГТД.Дата");
	СтруктураПолей.Вставить("ЕдиницаИзмерения"			, "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("ЕдиницаИзмеренияКод"       , "ЕдиницаИзмерения.Код");
	СтруктураПолей.Вставить("Количество"  				, "Количество");	
	СтруктураПолей.Вставить("Цена"                      , "Цена");			
	СтруктураПолей.Вставить("ПроцентСкидкиНаценки"		, "ПроцентСкидкиНаценки");
	СтруктураПолей.Вставить("Сумма"                     , "Сумма");
	СтруктураПолей.Вставить("СтавкаНДС"                 , "СтавкаНДС");
	СтруктураПолей.Вставить("НДС"                       , "СуммаНДС");
	СтруктураПолей.Вставить("ДатаОтгрузкиОплаты"  		, "ДатаОтгрузкиОплаты");
	СтруктураПолей.Вставить("СтатьяКнигиПродаж"  		, "СтатьяКнигиПродаж");	
	СтруктураПолей.Вставить("СуммаПревышения"           , "СуммаПревышения");
	СтруктураПолей.Вставить("СуммаНДСПревышения"        , "СуммаНДСПревышения");
	
	РезультатЗапросаПоПрочим = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Прочее", СтруктураПолей, СтруктураСложныхПолей);
	
	
	// Подготовим таблицу Основных Средств для проведения или печати
	ТаблицаПоПрочим = ПодготовитьТаблицуПрочие(РезультатЗапросаПоПрочим, СтруктураШапкиДокумента, ПогрешностиОкругления, ПогрешностиОкругленияПревышение);

	// ТАРА
	// Получим необходимые данные для проведения и проверки заполенения данные 
	// по табличной части "ВозвратнаяТара".
	СтруктураПолей        = Новый Структура();
	
	СтруктураПолей.Вставить("Сумма"         , "Сумма");
	
	РезультатЗапросаПоТаре = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ВозвратнаяТара", СтруктураПолей);

	// Подготовим таблицу тары для проведения или печати.
	ТаблицаПоТаре = ПодготовитьТаблицуТары(РезультатЗапросаПоТаре, СтруктураШапкиДокумента, ПогрешностиОкругленияТара);
	
КонецПроцедуры


Процедура ЗаполнитьСводнуюНаПревышенияБазыНадЦенойПоставки(ИмяТЧ) Экспорт
	 		
	Если ИмяТЧ = "Товары" Тогда
		ТекстЗапросаНоменклатуры = 
		"ВЫБРАТЬ
		|	НалоговаяНакладнаяТовары.Ссылка КАК ОсновнаяНН,
		|	НалоговаяНакладнаяТовары.Номенклатура,
		|	НалоговаяНакладнаяТовары.ХарактеристикаНоменклатуры,
		|	НалоговаяНакладнаяТовары.ЕдиницаИзмерения,
		|	НалоговаяНакладнаяТовары.Коэффициент,
		|	НалоговаяНакладнаяТовары.Количество,
		|	ВЫБОР
		|		КОГДА &СуммаВключаетНДС
		|			ТОГДА ВЫБОР
		|					КОГДА НалоговаяНакладнаяТовары.Ссылка.СуммаВключаетНДС
		|						ТОГДА НалоговаяНакладнаяТовары.Цена
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НалоговаяНакладнаяТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|								ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяТовары.Цена * 120 / 100 КАК ЧИСЛО(15, 2))
		|							КОГДА НалоговаяНакладнаяТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|								ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяТовары.Цена * 107 / 100 КАК ЧИСЛО(15, 2))
		|							ИНАЧЕ НалоговаяНакладнаяТовары.Цена
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ НалоговаяНакладнаяТовары.Ссылка.СуммаВключаетНДС
		|					ТОГДА НалоговаяНакладнаяТовары.Цена
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НалоговаяНакладнаяТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|							ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяТовары.Цена * 100 / 120 КАК ЧИСЛО(15, 2))
		|						КОГДА НалоговаяНакладнаяТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|							ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяТовары.Цена * 100 / 107 КАК ЧИСЛО(15, 2))
		|						ИНАЧЕ НалоговаяНакладнаяТовары.Цена
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА НЕ НалоговаяНакладнаяТовары.Ссылка.СуммаВключаетНДС
		|			ТОГДА НалоговаяНакладнаяТовары.Цена
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НалоговаяНакладнаяТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|					ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяТовары.Цена * 100 / 120 КАК ЧИСЛО(15, 2))
		|				КОГДА НалоговаяНакладнаяТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|					ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяТовары.Цена * 100 / 107 КАК ЧИСЛО(15, 2))
		|				ИНАЧЕ НалоговаяНакладнаяТовары.Цена
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаБезНДС,
		|	НалоговаяНакладнаяТовары.СуммаНДС,
		|	ВЫБОР
		|		КОГДА &СуммаВключаетНДС
		|			ТОГДА ВЫБОР
		|					КОГДА НалоговаяНакладнаяТовары.Ссылка.СуммаВключаетНДС
		|						ТОГДА НалоговаяНакладнаяТовары.Сумма
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НалоговаяНакладнаяТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|								ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяТовары.Сумма * 120 / 100 КАК ЧИСЛО(15, 2))
		|							КОГДА НалоговаяНакладнаяТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|								ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяТовары.Сумма * 107 / 100 КАК ЧИСЛО(15, 2))
		|							ИНАЧЕ НалоговаяНакладнаяТовары.Сумма
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ НалоговаяНакладнаяТовары.Ссылка.СуммаВключаетНДС
		|					ТОГДА НалоговаяНакладнаяТовары.Сумма
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НалоговаяНакладнаяТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|							ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяТовары.Сумма * 100 / 120 КАК ЧИСЛО(15, 2))
		|						КОГДА НалоговаяНакладнаяТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|							ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяТовары.Сумма * 100 / 107 КАК ЧИСЛО(15, 2))
		|						ИНАЧЕ НалоговаяНакладнаяТовары.Сумма
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Сумма,
		|	НалоговаяНакладнаяТовары.СтавкаНДС,
		|	НалоговаяНакладнаяТовары.ДатаОтгрузкиОплаты,
		|	НалоговаяНакладнаяТовары.СтатьяКнигиПродаж,
		|	НалоговаяНакладнаяТовары.КодУКТВЭД,
		|	НалоговаяНакладнаяТовары.НомерГТД
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	Документ.НалоговаяНакладная.Товары КАК НалоговаяНакладнаяТовары
		|ГДЕ
		|	НалоговаяНакладнаяТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НалоговаяНакладнаяТовары.Ссылка.Проведен
		|	И НалоговаяНакладнаяТовары.Ссылка.ВидОперации В(&ВидыОпераций)
		|	И НалоговаяНакладнаяТовары.Ссылка.Организация = &Организация
		|	И НалоговаяНакладнаяТовары.Ссылка.ОбособленноеПодразделение = &ОбособленноеПодразделение";
	Иначе
		ТекстЗапросаНоменклатуры =
		"ВЫБРАТЬ
		|	НалоговаяНакладнаяУслуги.Ссылка КАК ОсновнаяНН,
		|	НалоговаяНакладнаяУслуги.Номенклатура,
		|	НалоговаяНакладнаяУслуги.Содержание КАК Содержание,
		|	НалоговаяНакладнаяУслуги.Количество,
		|	ВЫБОР
		|		КОГДА &СуммаВключаетНДС
		|			ТОГДА ВЫБОР
		|					КОГДА НалоговаяНакладнаяУслуги.Ссылка.СуммаВключаетНДС
		|						ТОГДА НалоговаяНакладнаяУслуги.Цена
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НалоговаяНакладнаяУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|								ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяУслуги.Цена * 120 / 100 КАК ЧИСЛО(15, 2))
		|							КОГДА НалоговаяНакладнаяУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|								ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяУслуги.Цена * 107 / 100 КАК ЧИСЛО(15, 2))
		|							ИНАЧЕ НалоговаяНакладнаяУслуги.Цена
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ НалоговаяНакладнаяУслуги.Ссылка.СуммаВключаетНДС
		|					ТОГДА НалоговаяНакладнаяУслуги.Цена
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НалоговаяНакладнаяУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|							ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяУслуги.Цена * 100 / 120 КАК ЧИСЛО(15, 2))
		|						КОГДА НалоговаяНакладнаяУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|							ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяУслуги.Цена * 100 / 107 КАК ЧИСЛО(15, 2))
		|						ИНАЧЕ НалоговаяНакладнаяУслуги.Цена
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА НЕ НалоговаяНакладнаяУслуги.Ссылка.СуммаВключаетНДС
		|			ТОГДА НалоговаяНакладнаяУслуги.Цена
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НалоговаяНакладнаяУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|					ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяУслуги.Цена * 100 / 120 КАК ЧИСЛО(15, 2))
		|				КОГДА НалоговаяНакладнаяУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|					ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяУслуги.Цена * 100 / 107 КАК ЧИСЛО(15, 2))
		|				ИНАЧЕ НалоговаяНакладнаяУслуги.Цена
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаБезНДС,
		|	НалоговаяНакладнаяУслуги.СуммаНДС,
		|	ВЫБОР
		|		КОГДА &СуммаВключаетНДС
		|			ТОГДА ВЫБОР
		|					КОГДА НалоговаяНакладнаяУслуги.Ссылка.СуммаВключаетНДС
		|						ТОГДА НалоговаяНакладнаяУслуги.Сумма
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НалоговаяНакладнаяУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|								ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяУслуги.Сумма * 120 / 100 КАК ЧИСЛО(15, 2))
		|							КОГДА НалоговаяНакладнаяУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|								ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяУслуги.Сумма * 107 / 100 КАК ЧИСЛО(15, 2))
		|							ИНАЧЕ НалоговаяНакладнаяУслуги.Сумма
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ НалоговаяНакладнаяУслуги.Ссылка.СуммаВключаетНДС
		|					ТОГДА НалоговаяНакладнаяУслуги.Сумма
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НалоговаяНакладнаяУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
		|							ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяУслуги.Сумма * 100 / 120 КАК ЧИСЛО(15, 2))
		|						КОГДА НалоговаяНакладнаяУслуги.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
		|							ТОГДА ВЫРАЗИТЬ(НалоговаяНакладнаяУслуги.Сумма * 100 / 107 КАК ЧИСЛО(15, 2))
		|						ИНАЧЕ НалоговаяНакладнаяУслуги.Сумма
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Сумма,
		|	НалоговаяНакладнаяУслуги.СтавкаНДС,
		|	НалоговаяНакладнаяУслуги.ДатаОтгрузкиОплаты,
		|	НалоговаяНакладнаяУслуги.СтатьяКнигиПродаж,
		|	НалоговаяНакладнаяУслуги.КодУКТВЭД
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	Документ.НалоговаяНакладная.Услуги КАК НалоговаяНакладнаяУслуги
		|ГДЕ
		|	НалоговаяНакладнаяУслуги.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НалоговаяНакладнаяУслуги.Ссылка.Проведен
		|	И НалоговаяНакладнаяУслуги.Ссылка.ВидОперации В(&ВидыОпераций)
		|	И НалоговаяНакладнаяУслуги.Ссылка.Организация = &Организация
		|	И НалоговаяНакладнаяУслуги.Ссылка.ОбособленноеПодразделение = &ОбособленноеПодразделение";
	КонецЕсли;
	
	ТекстЗапросаЦеныПоставкиНижеБазы = "
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	|ПОМЕСТИТЬ ВТЦеныВалюты
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&КонецПериода,
	|			ТипЦен = &ТипЦен
	|				И Валюта = &ВалютаРегламентированногоУчета
	|				И Номенклатура В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ВТТовары.Номенклатура
	|					ИЗ
	|						ВТТовары КАК ВТТовары)) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТовары.ОсновнаяНН,
	|	ВТТовары.Номенклатура,
	|	ВТТовары.Количество,
	|	ВЫБОР
	|		КОГДА НЕ ВТЦеныВалюты.ЦенаВключаетНДС
	|			ТОГДА ВТЦеныВалюты.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|					ТОГДА ВЫРАЗИТЬ(ВТЦеныВалюты.Цена * 100 / 120 КАК ЧИСЛО(15, 2))
	|				КОГДА ВТТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|					ТОГДА ВЫРАЗИТЬ(ВТЦеныВалюты.Цена * 100 / 107 КАК ЧИСЛО(15, 2))
	|				ИНАЧЕ ВТЦеныВалюты.Цена
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦенаОбычная,
	|	ВТТовары.Цена,
	|	ВТТовары.СуммаНДС,
	|	ВТТовары.Сумма,
	|	ВТТовары.СтавкаНДС,
	|	ВТТовары.ДатаОтгрузкиОплаты,
	|	ВТТовары.СтатьяКнигиПродаж,
	|	ВТТовары.КодУКТВЭД,
	| //НесовпадающиеРеквизитыТЧ
	|ИЗ
	|	ВТЦеныВалюты КАК ВТЦеныВалюты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТовары КАК ВТТовары
	|		ПО ВТЦеныВалюты.Номенклатура = ВТТовары.Номенклатура
	|			И (ВТТовары.ЦенаБезНДС < ВЫБОР
	|				КОГДА НЕ ВТЦеныВалюты.ЦенаВключаетНДС
	|					ТОГДА ВТЦеныВалюты.Цена
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ВТТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
	|							ТОГДА ВЫРАЗИТЬ(ВТЦеныВалюты.Цена * 100 / 120 КАК ЧИСЛО(15, 2))
	|						КОГДА ВТТовары.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС7)
	|							ТОГДА ВЫРАЗИТЬ(ВТЦеныВалюты.Цена * 100 / 107 КАК ЧИСЛО(15, 2))
	|						ИНАЧЕ ВТЦеныВалюты.Цена
	|					КОНЕЦ
	|			КОНЕЦ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновнаяНН";
	
	ТекстЗапроса = ТекстЗапросаНоменклатуры + Символы.ПС + ";" + ТекстЗапросаЦеныПоставкиНижеБазы;
	
	Если ИмяТЧ = "Товары" Тогда
		НесовпадающиеРеквизитыТЧ = 
		"	ВТТовары.ЕдиницаИзмерения,
		|	ВТТовары.ХарактеристикаНоменклатуры,
		|	ВТТовары.Коэффициент,
		|	ВТТовары.НомерГТД";
	Иначе
		НесовпадающиеРеквизитыТЧ = 
		"	ВТТовары.Содержание";
	КонецЕсли; 
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//НесовпадающиеРеквизитыТЧ", НесовпадающиеРеквизитыТЧ);
	
	ВидыОпераций = Новый Массив;
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийНалоговаяНакладная.ОблагаемыеОперации);
	ВидыОпераций.Добавить(Перечисления.ВидыОперацийНалоговаяНакладная.РозницаКонрагентуОблагаемыеОперации);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОбособленноеПодразделение", ОбособленноеПодразделение);
	Запрос.УстановитьПараметр("ВидыОпераций", ВидыОпераций);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	Запрос.УстановитьПараметр("СуммаВключаетНДС", СуммаВключаетНДС);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", мВалютаРегламентированногоУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить(НСтр("ru = 'Нет данных для заполнения!'; uk = 'Немає даних для заповнення!'"));
		Возврат;
	КонецЕсли; 
	
	ТЧ = ЭтотОбъект[ИмяТЧ];
	ТЧ.Загрузить(РезультатЗапроса.Выгрузить());
	
	//Рассчитаем сумму превышения и НДС преаышения для заполненных строк
	Для каждого СтрокаТЧ Из ТЧ Цикл
		
		СтрокаТЧ.СуммаПревышения = Макс(0, СтрокаТЧ.ЦенаОбычная * СтрокаТЧ.Количество  - 
					?(УчитыватьНДС и СуммаВключаетНДС, СтрокаТЧ.Сумма - СтрокаТЧ.СуммаНДС, СтрокаТЧ.Сумма));
					
		СтрокаТЧ.СуммаНДСПревышения = НалоговыйУчет.РассчитатьСуммуНДС(СтрокаТЧ.СуммаПревышения,
		            Истина, Ложь, НалоговыйУчет.ПолучитьСтавкуНДС(СтрокаТЧ.СтавкаНДС));	
	КонецЦикла; 
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем СтруктураШапкиДокумента;
	Перем ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим;
	
	Если ЗначениеЗаполнено(ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены) Тогда
		Возврат;
	КонецЕсли;
	
	Если глЗначениеПеременной("ДатаНачалаИспользованияФормыННПоЛекарствам") > Дата  Тогда
		Если ВДокументеЕстьСтавкаНДС7ИДругиеСтавки() Тогда
			Отказ = Истина;			   
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	
	// Подготовим структуру шапки документа
	СтруктураШапкиДокумента = ПодготовитьСтруктуруШапкиДокумента(Отказ); 
	
	// При получении учетной политики произошли ошибки
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Подготовим таблицы
	ПодготовитьТаблицы(СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, ТаблицаПоУслугам, ТаблицаПоПрочим);
	
	// Проверить заполнение ТЧ .
	ПроверитьЗаполнениеТабличнойЧастиТовары			(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиУслуги			(ТаблицаПоУслугам, СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиВозвратнаяТара (ТаблицаПоТаре,    СтруктураШапкиДокумента, Отказ, Заголовок);
	ПроверитьЗаполнениеТабличнойЧастиПрочее			(ТаблицаПоПрочим,  СтруктураШапкиДокумента, Отказ, Заголовок);


	//Проверим на возможность проведения в БУ и НУ.
	УправлениеВзаиморасчетами.ПроверкаВозможностиПроведенияВ_БУ_НУ(ДоговорКонтрагента, ВалютаДокумента,
		                                     Истина, Истина, мВалютаРегламентированногоУчета, 
		                                     Ложь, Отказ, Заголовок, "", СтруктураШапкиДокумента.ВалютаВзаиморасчетов);

	
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре,
							ТаблицаПоУслугам, ТаблицаПоПрочим, Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

Процедура УстановитьТипПричиныНевыдачиПокупателюПоУмолчанию() Экспорт
	
	Если ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		Если глЗначениеПеременной("ДатаВступленияВСилуПриказа1379") > Дата  Тогда
			ТипПричиныНевыдачиПокупателю = 2;
		Иначе	
			ТипПричиныНевыдачиПокупателю = 14;
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.СводнаяНаПревышениеБазыНадЦенойПоставки Тогда
		
		ТипПричиныНевыдачиПокупателю = 15;
		
	ИначеЕсли  НЕ ВалютаДокумента = мВалютаРегламентированногоУчета
		И ДоговорКонтрагента.Внешнеэкономический
		И НЕ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.РаботыОтНерезидента Тогда
		
		ТипПричиныНевыдачиПокупателю = 7;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.УсловнаяПродажа Тогда
		
		Если глЗначениеПеременной("ДатаВступленияВСилуПриказа1379") > Дата  Тогда
			ТипПричиныНевыдачиПокупателю = 4;
		Иначе	
			ТипПричиныНевыдачиПокупателю = 13;
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОблагаемыеОперации 
		  ИЛИ ВидОперации = Перечисления.ВидыОперацийНалоговаяНакладная.ИтоговаяРозницаОсвобожденныеОперации Тогда
		
	    ТипПричиныНевыдачиПокупателю = 11;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Контрагент.ИНН)
   		    ИЛИ Найти("0123456789",Лев(СокрЛ(Контрагент.ИНН),1)) = 0 Тогда		
		
		ТипПричиныНевыдачиПокупателю = 2;
		
	Иначе	
		
		ТипПричиныНевыдачиПокупателю = 0;
		
	КонецЕсли;
	
	Если ТипПричиныНевыдачиПокупателю > 0 Тогда
		Если Дата < '2015-01-01' Тогда
			ТребуетВключенияВЕдиныйРеестрНалоговыхНакладных = Ложь;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

мВалютаРегламентированногоУчета   = Константы.ВалютаРегламентированногоУчета.Получить();
мВидОперацииДляЗаполнения = Неопределено;
мЗаполнятьВозвратнуюТару  = Истина;

мНеОткрыватьФормуДокумента = Ложь;
