
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ТелефонУжеУказан = ТелефонУжеВнесенВБазу(Объект.НомерТелефона);
	
	Если ТелефонУжеУказан Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru = 'Номер телефона уже указан в системе'; uk = 'Номер телефону вже вказаний в системі'"));
	КонецЕсли;
	
	Если Не СтрДлина(СокрЛП(Объект.НомерТелефона)) = 13 Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru = 'Не указан номер телефона'; uk = 'Не вказаний номер телефона'"));
	КонецЕсли;
	
	Если Объект.Email = "" Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru = 'Не указан Email'; uk = 'Не вказаний Email'"));
	КонецЕсли;
	
	Если Объект.Логин = "" Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru = 'Не указан Логин'; uk = 'Не вказаний Логін'"));
	КонецЕсли;
	
	Если Объект.Пароль = "" Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru = 'Не указан Пароль'; uk = 'Не вказаний Пароль'"));
	КонецЕсли;
	
	Если не Отказ Тогда
		РазрешитьЗакрытиеФормы = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТелефонУжеВнесенВБазу(НомерТелефона) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Клиенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.НомерТелефона = &НомерТелефона
		|	И Клиенты.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;  
	
	Возврат Ложь;

КонецФункции

&НаКлиенте
Процедура ПоказатьПарольПриИзменении(Элемент)
	Элементы.Пароль.РежимПароля = не ПоказатьПароль;
КонецПроцедуры
