
Процедура ПередЗаписью(Отказ)
	//+БП: d.matyash (02.10.2025) <>
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НП_КонтрагентыОтправителиОрганизации.Организация,
	                      |	НП_КонтрагентыОтправителиОрганизации.Ссылка
	                      |ИЗ
	                      |	Справочник.НП_КонтрагентыОтправители.Организации КАК НП_КонтрагентыОтправителиОрганизации
	                      |ГДЕ
	                      |	НП_КонтрагентыОтправителиОрганизации.Ссылка <> &Ссылка
	                      |	И НЕ НП_КонтрагентыОтправителиОрганизации.Ссылка.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ТЗОрганизаций = Запрос.Выполнить().Выгрузить(); 
	
	Для каждого Орг из Организации цикл
		НайденаяСтрока = ТЗОрганизаций.Найти(Орг.Организация,"Организация");
		Если НайденаяСтрока <> Неопределено	тогда
			Сообщить("Організація " + Строка(Орг.Организация) + " вже призначена для " + Строка(НайденаяСтрока.Ссылка)); 
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;            
	//-БП: d.matyash (02.10.2025) <>	
КонецПроцедуры
