Процедура ОтправкаСМСУведомленияПокупателю(ЗаказПокупателя) Экспорт
	//ОтправлятьСМС = Константы.РассылкаТТНСПомощьюСМС.Получить();
	//ОтправлятьЭлПисьма = Константы.РассылкаТТНСПомощьюЭлПочты.Получить();
	//
	//Если (ОтправлятьСМС ИЛИ ОтправлятьЭлПисьма) И ЗаказПокупателя.Контрагент.Родитель.ОтправлятьСМС Тогда
	//	
	//	Если ЗаказПокупателя.СтатусЗаказа.ОтправлятьСМСПоШаблону И ЗначениеЗаполнено(ЗаказПокупателя.СтатусЗаказа.ШаблонСМС) Тогда
	//		
	//		
	//		ВыбТекст = СокрЛП(ЗаказПокупателя.СтатусЗаказа.ШаблонСМС.Текст); //отправка смс по шаблону!
	//		ВыбТекст = ШаблонСМСВТекст(ВыбТекст,ЗаказПокупателя);
	//		Если ЗаказПокупателя.Контрагент.Родитель.СМСПоОсновномуТелефону 
	//			ИЛИ ЗаказПокупателя.Контрагент.Родитель.СМСПоОсновномуТелефону 
	//			ИЛИ ЗаказПокупателя.Контрагент.Родитель.Родитель.СМСПоОсновномуТелефону
	//			Тогда					
	//			ВыбНомер = ОбщегоНазначения.ТелефонКонтрагента(ЗаказПокупателя.Контрагент);
	//		Иначе
	//			ВыбНомер = ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент);
	//		КонецЕсли;
	//		
	//		Если СокрЛП(ВыбНомер) = "" Тогда
	//			ВыбНомер = ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент);
	//		КонецЕсли;
	//		
	//		// попытка №5
	//		Если СокрЛП(ВыбНомер) = "" Тогда
	//			ВыбНомер = ЗаказПокупателя.ТелефонКонтрагента;
	//		КонецЕсли;
	//		
	//		ОбщегоНазначения.ПоправитьТелефон(ВыбНомер);
	//		
	//		Если НЕ ЗначениеЗаполнено(ВыбНомер)  И ОтправлятьСМС   Тогда
	//			#Если Клиент Тогда
	//				Сообщить("Не указан номер телефона покупателя " + ЗаказПокупателя.Контрагент + ". SMS не отправлена.");
	//			#КонецЕсли
	//			//Возврат;
	//			ОтправлятьСМС = Ложь;
	//		КонецЕсли;
	//		
	//		// проверим отправляли мы уже этот шаблон или нет
	//		ШаблонОтправлен = ШаблонОтправили(ЗаказПокупателя);
	//		
	//		Если ШаблонОтправлен Тогда
	//			//ОтправлятьСМС = Ложь;
	//			//ОтправлятьЭлПисьма = ложь;
	//		Иначе
	//			МенеджерЗаписи = РегистрыСведений.ОтправленныеСообщения.СоздатьМенеджерЗаписи();
	//			МенеджерЗаписи.Период = ТекущаяДата();
	//			МенеджерЗаписи.Заказ = ЗаказПокупателя;
	//			МенеджерЗаписи.Шаблон = ЗаказПокупателя.СтатусЗаказа.ШаблонСМС;
	//			МенеджерЗаписи.Текст = ВыбТекст;
	//			МенеджерЗаписи.Телефон = ВыбНомер;
	//			МенеджерЗаписи.Записать();
	//		КонецЕсли;
	//		
	//		
	//		Если ОтправлятьЭлПисьма И ЗначениеЗаполнено(ЗаказПокупателя.АдресЭлектроннойПочтыКонтрагента) Тогда
	//			УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлПочты.Получить();
	//			УправлениеЭлектроннойПочтой.ОтправитьПисьмо1(УчетнаяЗапись,ВыбТекст,ЗаказПокупателя.АдресЭлектроннойПочтыКонтрагента,СокрЛП(ЗаказПокупателя));
	//		ИначеЕсли ОтправлятьСМС Тогда
	//			ИмяВходящегоФайла = "" + КаталогВременныхФайлов() + "outsms.txt";
	//			Текст = Новый ТекстовыйДокумент();
	//			login = Константы.ЛогинСМС.Получить();
	//			password = Константы.ПарольСМС.Получить();
	//			
	//			from = СокрЛП(ЗаказПокупателя.АльфаИмя.Наименование);
	//			
	//			Сервер = "www.smpp.smsclub.mobi";
	//			СтрокаПараметраПолучения = "/hfw_smpp_addon/httpsendsms.php?username=" + login + "&password=" + password; 
	//			СтрокаПолучения = СтрокаПараметраПолучения + "&from=" + from + "&to=" + СокрЛП(ВыбНомер) + "&text=" + Строка(base64_encode(СокрЛП(ВыбТекст)));
	//			
	//			ЗапросHTTP(СтрокаПолучения, Сервер, ИмяВходящегоФайла, Текст, ВыбНомер);
	//		КонецЕсли;
	//		Возврат; 
	//	КонецЕсли; 
	//	
	//	МенеджерЗаписи = РегистрыСведений.ЭкспортированныеОбъектыВИСПеревозчиков.СоздатьМенеджерЗаписи();
	//	МенеджерЗаписи.Объект = ЗаказПокупателя;
	//	МенеджерЗаписи.Прочитать();
	//	
	//	Если МенеджерЗаписи.Выбран() Тогда
	//		
	//		Если Не ПроверитьНомерТТН(МенеджерЗаписи.НомерДокумента) Тогда
	//			#Если Клиент Тогда
	//				Сообщить("При экспорте документа " + ЗаказПокупателя + " в Новую почту был получен некорректный номер ТТН. Сообщение не отправлено.");
	//			#КонецЕсли
	//			Возврат;
	//		КонецЕсли;
	//		
	//		ВыбНомер = ПолучитьНомерТелефонаКонтрагента(ЗаказПокупателя.Контрагент);
	//		Если ВыбНомер = Неопределено И ОтправлятьСМС Тогда
	//			#Если Клиент Тогда
	//				Сообщить("Не указан номер телефона покупателя " + ЗаказПокупателя.Контрагент + ". SMS не отправлена.");
	//			#КонецЕсли
	//			//Возврат;
	//			ОтправлятьСМС = Ложь;
	//		КонецЕсли;
	//		
	//		//ВыбТекст = "Ваш номер для получения посылки " + МенеджерЗаписи.НомерДокумента + ". Благодарим за покупку";
	//		ВыбТекст = Константы.ШаблонСообщения.Получить();
	//		ВыбТекст = СтрЗаменить(ВыбТекст, "[НомерТТН]", Строка(МенеджерЗаписи.НомерДокумента));
	//		
	//		// АА+ при отправке автоматом СМС отсылается тольком номер заказа2 при заполненном номере заказа1  
	//		ВыбТекст = СтрЗаменить(ВыбТекст, "[Сумма]", Формат(ЗаказПокупателя.Товары.Итог("Сумма"), "ЧДЦ=0"));
	//		ВыбТекст = СтрЗаменить(ВыбТекст,"[ДатаДоставки]",Формат(ЗаказПокупателя.ДатаДоставки,"ДФ=dd.MM.yyyy"));
	//		
	//		//ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа2]",
	//		//	?(ЗначениеЗаполнено(ЗаказПокупателя.НомерЗаказа2ССайта),"заказ на сайте №","")+СокрЛП(ЗаказПокупателя.НомерЗаказа2ССайта));
	//		//Если ЗначениеЗаполнено(ЗаказПокупателя.НомерЗаказа2ССайта) Тогда 	
	//		//	ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа]","");
	//		//Иначе	
	//		//	ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа]","заказ №"+СокрЛП(Формат(Число(ОбщийМодульПодписокНаСобытия.УдалитьВСтрокеВсеКромеЦифр(ЗаказПокупателя.Номер)),"ЧЦ=15; ЧРГ=''")));
	//		//КонецЕсли;
	//		ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа2]",СокрЛП(ЗаказПокупателя.НомерЗаказа2ССайта));
	//		Если ЗначениеЗаполнено(ЗаказПокупателя.НомерЗаказа2ССайта) Тогда 	
	//			ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа]","");
	//		Иначе	
	//			ВыбТекст = СтрЗаменить(ВыбТекст,"[НомерЗаказа]",СокрЛП(Формат(Число(ОбщийМодульПодписокНаСобытия.УдалитьВСтрокеВсеКромеЦифр(ЗаказПокупателя.Номер)),"ЧЦ=15; ЧРГ=''")));
	//		КонецЕсли;
	//		// [НомерЗаказа][НомерЗаказа2][НомерТТН][Сумма]
	//		// АА-
	//		
	//		Если ОтправлятьЭлПисьма И ЗначениеЗаполнено(ЗаказПокупателя.АдресЭлектроннойПочтыКонтрагента) Тогда
	//			УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлПочты.Получить();
	//			УправлениеЭлектроннойПочтой.ОтправитьПисьмо(УчетнаяЗапись, ВыбТекст, ЗаказПокупателя.АдресЭлектроннойПочтыКонтрагента);
	//		ИначеЕсли ОтправлятьСМС Тогда
	//			ИмяВходящегоФайла = "" + КаталогВременныхФайлов() + "outsms.txt";
	//			Текст = Новый ТекстовыйДокумент();
	//			login = Константы.ЛогинСМС.Получить();
	//			password = Константы.ПарольСМС.Получить();
	//			
	//			Если ЗначениеЗаполнено(ЗаказПокупателя.АльфаИмя) Тогда
	//				from = СокрЛП(ЗаказПокупателя.АльфаИмя.Наименование);
	//			Иначе
	//				Альфаимя = АльфаИмяПоУмолчанию();
	//				from = СокрЛП(АльфаИмя.Наименование);
	//			КонецЕсли;
	//			
	//			Сервер = "www.smpp.smsclub.mobi";
	//			СтрокаПараметраПолучения = "/hfw_smpp_addon/httpsendsms.php?username=" + login + "&password=" + password; 
	//			СтрокаПолучения = СтрокаПараметраПолучения + "&from=" + from + "&to=" + СокрЛП(ВыбНомер) + "&text=" + Строка(base64_encode(СокрЛП(ВыбТекст)));
	//			
	//			ЗапросHTTP(СтрокаПолучения, Сервер, ИмяВходящегоФайла, Текст, ВыбНомер);
	//		КонецЕсли;
	//		
	//	Иначе
	//		#Если Клиент Тогда
	//			Сообщить("Документ " + ЗаказПокупателя + " не экспортировался в новую почту. Сообщение не отправлено.");
	//		#КонецЕсли
	//	КонецЕсли;	
	//КонецЕсли;	
КонецПроцедуры
