Функция ВыборФайла(РежимДиалога) Экспорт

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалога);

	ДиалогВыбора.Фильтр     = "Файл данных (*.csv)|*.csv";
	ДиалогВыбора.Расширение = "csv";
	
	Если РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога Тогда
		ДиалогВыбора.Заголовок ="Выберите каталог";
	Иначе
		ДиалогВыбора.Заголовок ="Выберите файл";
	КонецЕсли;

	ДиалогВыбора.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбора.ИндексФильтра               = 0;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Ложь;

	Если ДиалогВыбора.Выбрать() Тогда
		Если РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога Тогда
			Если НЕ ЗначениеЗаполнено(ДиалогВыбора.ПолноеИмяФайла) Тогда
				ДатаБезПробелов  = СтрЗаменить(Формат(ТекущаяДата(), "ДЛФ=DT"), " ", "");
				ДатаБезТочек     = СтрЗаменить(ДатаБезПробелов, ".", "");
				ДатаБезТочек     = СтрЗаменить(ДатаБезПробелов, ".", "");
				ИмяФайла         = СтрЗаменить(ДатаБезТочек, ":", "") + ".csv";
				Возврат ДиалогВыбора.Каталог + "\" + ИмяФайла;
			Иначе
				Возврат ДиалогВыбора.ПолноеИмяФайла;
			КонецЕсли;
		Иначе
			Возврат ДиалогВыбора.ПолноеИмяФайла;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции
