
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		// Заполнение шапки
		Документ = ДанныеЗаполнения.Ссылка;
		ТипЦен = ДанныеЗаполнения.ТипЦен;
		ПунктПогрузки = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Документ.Организация,"Юридический");
		ПунктРазгрузки = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Документ.Контрагент,"Юридический");
	КонецЕсли;
КонецПроцедуры
