Функция ПолучитьМенеджераУКоторогоНаименьшнееКолВоПредЗаказовВСтатусеПропущенный() Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ГрафикРаботыМенеджеров.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТДокументГрафика
	               |ИЗ
	               |	Документ.ГрафикРаботыМенеджеров КАК ГрафикРаботыМенеджеров
	               |ГДЕ
	               |	НЕ ГрафикРаботыМенеджеров.ПометкаУдаления
	               |	И ГрафикРаботыМенеджеров.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(БП_ГрафикРаботыМенеджеровMagento.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТБП_ГрафикРаботыМенеджеровMagento
	               |ИЗ
	               |	Документ.БП_ГрафикРаботыМенеджеровMagento КАК БП_ГрафикРаботыМенеджеровMagento
	               |ГДЕ
	               |	НЕ БП_ГрафикРаботыМенеджеровMagento.ПометкаУдаления
	               |	И БП_ГрафикРаботыМенеджеровMagento.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ГрафикРаботыМенеджеров_Хорошоп.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТДокументГрафикаХорошоп
	               |ИЗ
	               |	Документ.ГрафикРаботыМенеджеров_Хорошоп КАК ГрафикРаботыМенеджеров_Хорошоп
	               |ГДЕ
	               |	НЕ ГрафикРаботыМенеджеров_Хорошоп.ПометкаУдаления
	               |	И ГрафикРаботыМенеджеров_Хорошоп.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Пользователи.Ссылка КАК Пользователь,
	               |	ПолучимКолВоПредЗаказов.КолВоПредзаказов КАК КолВоПредзаказов
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ГрафикРаботыМенеджеровМенеджера.Менеджер КАК Менеджер,
	               |		ГрафикРаботыМенеджеровМенеджера.Ссылка КАК Ссылка
	               |	ИЗ
	               |		Документ.ГрафикРаботыМенеджеров.Менеджера КАК ГрафикРаботыМенеджеровМенеджера,
	               |		ВТДокументГрафика КАК ВТДокументГрафика
	               |	ГДЕ
	               |		ВТДокументГрафика.Номер = ГрафикРаботыМенеджеровМенеджера.Ссылка.Номер) КАК ПолучимДокументГрафика
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Ссылка КАК Ссылка,
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Менеджер КАК Менеджер
	               |			ИЗ
	               |				ВТДокументГрафикаХорошоп КАК ВТГрафикХорошоп,
	               |				Документ.ГрафикРаботыМенеджеров_Хорошоп.Менеджера КАК ГрафикРаботыМенеджеров_ХорошопМенеджера
	               |			ГДЕ
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Ссылка.Номер = ВТГрафикХорошоп.Номер) КАК ПолучимДокументГрафикаХорошоп
	               |			ПО (ПолучимДокументГрафикаХорошоп.Менеджер = Пользователи.Ссылка)
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				БП_ГрафикРаботыМенеджеровMagentoМенеджера.Менеджер КАК Менеджер,
	               |				БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТБП_ГрафикРаботыМенеджеровMagento КАК ВТБП_ГрафикРаботыМенеджеровMagento,
	               |				Документ.БП_ГрафикРаботыМенеджеровMagento.Менеджера КАК БП_ГрафикРаботыМенеджеровMagentoМенеджера
	               |			ГДЕ
	               |				ВТБП_ГрафикРаботыМенеджеровMagento.Номер = БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Номер) КАК ПолучимДокументГрафикаМадженто
	               |			ПО Пользователи.Ссылка = ПолучимДокументГрафикаМадженто.Менеджер
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПредЗаказ.Ссылка) КАК КолВоПредзаказов,
	               |				ПредЗаказ.Ответственный КАК Ответственный
	               |			ИЗ
	               |				Документ.ПредЗаказ КАК ПредЗаказ
	               |			ГДЕ
	               |				ПредЗаказ.Статус.Код = ""000000072""
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ПредЗаказ.Ответственный) КАК ПолучимКолВоПредЗаказов
	               |			ПО Пользователи.Ссылка = ПолучимКолВоПредЗаказов.Ответственный
	               |		ПО ПолучимДокументГрафика.Менеджер = Пользователи.Ссылка
	               |ГДЕ
	               |	(НЕ ПолучимДокументГрафикаХорошоп.Ссылка ЕСТЬ NULL
	               |			ИЛИ НЕ ПолучимДокументГрафика.Ссылка ЕСТЬ NULL
	               |			ИЛИ НЕ ПолучимДокументГрафикаМадженто.Ссылка ЕСТЬ NULL)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КолВоПредзаказов";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0];
	КонецЕсли;   	
	Возврат Неопределено;
	
КонецФункции 

функция ПолучитьПоследнегоОтветсвенногоКтоКонтактировал(Номер) Экспорт   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ГрафикРаботыМенеджеров.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТДокументГрафика
	               |ИЗ
	               |	Документ.ГрафикРаботыМенеджеров КАК ГрафикРаботыМенеджеров
	               |ГДЕ
	               |	НЕ ГрафикРаботыМенеджеров.ПометкаУдаления
	               |	И ГрафикРаботыМенеджеров.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(БП_ГрафикРаботыМенеджеровMagento.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТБП_ГрафикРаботыМенеджеровMagento
	               |ИЗ
	               |	Документ.БП_ГрафикРаботыМенеджеровMagento КАК БП_ГрафикРаботыМенеджеровMagento
	               |ГДЕ
	               |	НЕ БП_ГрафикРаботыМенеджеровMagento.ПометкаУдаления
	               |	И БП_ГрафикРаботыМенеджеровMagento.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ГрафикРаботыМенеджеров_Хорошоп.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТДокументГрафикаХорошоп
	               |ИЗ
	               |	Документ.ГрафикРаботыМенеджеров_Хорошоп КАК ГрафикРаботыМенеджеров_Хорошоп
	               |ГДЕ
	               |	НЕ ГрафикРаботыМенеджеров_Хорошоп.ПометкаУдаления
	               |	И ГрафикРаботыМенеджеров_Хорошоп.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Пользователь
	               |ПОМЕСТИТЬ ВТОбщ
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ГрафикРаботыМенеджеровМенеджера.Менеджер КАК Менеджер,
	               |		ГрафикРаботыМенеджеровМенеджера.Ссылка КАК Ссылка
	               |	ИЗ
	               |		Документ.ГрафикРаботыМенеджеров.Менеджера КАК ГрафикРаботыМенеджеровМенеджера,
	               |		ВТДокументГрафика КАК ВТДокументГрафика
	               |	ГДЕ
	               |		ВТДокументГрафика.Номер = ГрафикРаботыМенеджеровМенеджера.Ссылка.Номер) КАК ПолучимДокументГрафика
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Ссылка КАК Ссылка,
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Менеджер КАК Менеджер
	               |			ИЗ
	               |				ВТДокументГрафикаХорошоп КАК ВТГрафикХорошоп,
	               |				Документ.ГрафикРаботыМенеджеров_Хорошоп.Менеджера КАК ГрафикРаботыМенеджеров_ХорошопМенеджера
	               |			ГДЕ
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Ссылка.Номер = ВТГрафикХорошоп.Номер) КАК ПолучимДокументГрафикаХорошоп
	               |			ПО (ПолучимДокументГрафикаХорошоп.Менеджер = Пользователи.Ссылка)
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				БП_ГрафикРаботыМенеджеровMagentoМенеджера.Менеджер КАК Менеджер,
	               |				БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТБП_ГрафикРаботыМенеджеровMagento КАК ВТБП_ГрафикРаботыМенеджеровMagento,
	               |				Документ.БП_ГрафикРаботыМенеджеровMagento.Менеджера КАК БП_ГрафикРаботыМенеджеровMagentoМенеджера
	               |			ГДЕ
	               |				ВТБП_ГрафикРаботыМенеджеровMagento.Номер = БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Номер) КАК ПолучимДокументГрафикаМадженто
	               |			ПО Пользователи.Ссылка = ПолучимДокументГрафикаМадженто.Менеджер
	               |		ПО ПолучимДокументГрафика.Менеджер = Пользователи.Ссылка
	               |ГДЕ
	               |	(НЕ ПолучимДокументГрафикаХорошоп.Ссылка ЕСТЬ NULL
	               |			ИЛИ НЕ ПолучимДокументГрафика.Ссылка ЕСТЬ NULL
	               |			ИЛИ НЕ ПолучимДокументГрафикаМадженто.Ссылка ЕСТЬ NULL)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Событие.Ответственный,
	               |	Событие.Ссылка
	               |ИЗ
	               |	Документ.Событие КАК Событие,
	               |	ВТОбщ КАК ВТОбщ
	               |ГДЕ
	               |	Событие.Э_ТелефонАбонента = &Э_ТелефонАбонента
	               |	И Событие.Ответственный В (ВТОбщ.Пользователь)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Событие.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Э_ТелефонАбонента",Номер);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ответственный");
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0];
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМассивАктивныхМенеджеров() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ГрафикРаботыМенеджеров.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТДокументГрафика
	               |ИЗ
	               |	Документ.ГрафикРаботыМенеджеров КАК ГрафикРаботыМенеджеров
	               |ГДЕ
	               |	НЕ ГрафикРаботыМенеджеров.ПометкаУдаления
	               |	И ГрафикРаботыМенеджеров.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(БП_ГрафикРаботыМенеджеровMagento.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТБП_ГрафикРаботыМенеджеровMagento
	               |ИЗ
	               |	Документ.БП_ГрафикРаботыМенеджеровMagento КАК БП_ГрафикРаботыМенеджеровMagento
	               |ГДЕ
	               |	НЕ БП_ГрафикРаботыМенеджеровMagento.ПометкаУдаления
	               |	И БП_ГрафикРаботыМенеджеровMagento.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ГрафикРаботыМенеджеров_Хорошоп.Номер) КАК Номер
	               |ПОМЕСТИТЬ ВТДокументГрафикаХорошоп
	               |ИЗ
	               |	Документ.ГрафикРаботыМенеджеров_Хорошоп КАК ГрафикРаботыМенеджеров_Хорошоп
	               |ГДЕ
	               |	НЕ ГрафикРаботыМенеджеров_Хорошоп.ПометкаУдаления
	               |	И ГрафикРаботыМенеджеров_Хорошоп.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Пользователь
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ГрафикРаботыМенеджеровМенеджера.Менеджер КАК Менеджер,
	               |		ГрафикРаботыМенеджеровМенеджера.Ссылка КАК Ссылка
	               |	ИЗ
	               |		Документ.ГрафикРаботыМенеджеров.Менеджера КАК ГрафикРаботыМенеджеровМенеджера,
	               |		ВТДокументГрафика КАК ВТДокументГрафика
	               |	ГДЕ
	               |		ВТДокументГрафика.Номер = ГрафикРаботыМенеджеровМенеджера.Ссылка.Номер) КАК ПолучимДокументГрафика
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Ссылка КАК Ссылка,
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Менеджер КАК Менеджер
	               |			ИЗ
	               |				ВТДокументГрафикаХорошоп КАК ВТГрафикХорошоп,
	               |				Документ.ГрафикРаботыМенеджеров_Хорошоп.Менеджера КАК ГрафикРаботыМенеджеров_ХорошопМенеджера
	               |			ГДЕ
	               |				ГрафикРаботыМенеджеров_ХорошопМенеджера.Ссылка.Номер = ВТГрафикХорошоп.Номер) КАК ПолучимДокументГрафикаХорошоп
	               |			ПО (ПолучимДокументГрафикаХорошоп.Менеджер = Пользователи.Ссылка)
	               |			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				БП_ГрафикРаботыМенеджеровMagentoМенеджера.Менеджер КАК Менеджер,
	               |				БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТБП_ГрафикРаботыМенеджеровMagento КАК ВТБП_ГрафикРаботыМенеджеровMagento,
	               |				Документ.БП_ГрафикРаботыМенеджеровMagento.Менеджера КАК БП_ГрафикРаботыМенеджеровMagentoМенеджера
	               |			ГДЕ
	               |				ВТБП_ГрафикРаботыМенеджеровMagento.Номер = БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Номер) КАК ПолучимДокументГрафикаМадженто
	               |			ПО Пользователи.Ссылка = ПолучимДокументГрафикаМадженто.Менеджер
	               |		ПО ПолучимДокументГрафика.Менеджер = Пользователи.Ссылка
	               |ГДЕ
	               |	(НЕ ПолучимДокументГрафикаХорошоп.Ссылка ЕСТЬ NULL
	               |			ИЛИ НЕ ПолучимДокументГрафика.Ссылка ЕСТЬ NULL
	               |			ИЛИ НЕ ПолучимДокументГрафикаМадженто.Ссылка ЕСТЬ NULL)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
КонецФункции

функция ПолучитьМассивМенеджеров() Экспорт  
	
Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка как Пользователь
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.Родитель.Наименование = ""Менеджера""";
	
	
Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");

КонецФункции
  
Функция ПолучитьMagentoТекущийМенеджер(ТипЦены,MagentoТекущийМенеджер) Экспорт
		
	ТекНомМенеджер = MagentoТекущийМенеджер.Получить();	
	Мен = ТекНомМенеджер+1;
	MagentoТекущийМенеджер.Установить(Мен);

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БП_ГрафикРаботыМенеджеровMagentoМенеджера.НомерСтроки,
	               |	БП_ГрафикРаботыМенеджеровMagentoМенеджера.Менеджер,
	               |	БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Ссылка,
	               |	БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Номер,
	               |	ПолучимДокумент.Номер КАК Номер1
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		МАКСИМУМ(БП_ГрафикРаботыМенеджеровMagento.Дата) КАК Дата,
	               |		БП_ГрафикРаботыМенеджеровMagento.Номер КАК Номер
	               |	ИЗ
	               |		Документ.БП_ГрафикРаботыМенеджеровMagento КАК БП_ГрафикРаботыМенеджеровMagento
	               |	ГДЕ
	               |		БП_ГрафикРаботыМенеджеровMagento.ТипЦены = &ТипЦены
	               |		И БП_ГрафикРаботыМенеджеровMagento.Проведен
	               |		И БП_ГрафикРаботыМенеджеровMagento.Дата <= &Дата
	               |		И БП_ГрафикРаботыМенеджеровMagento.ДатаПо >= &Дата
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		БП_ГрафикРаботыМенеджеровMagento.Номер) КАК ПолучимДокумент
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.БП_ГрафикРаботыМенеджеровMagento.Менеджера КАК БП_ГрафикРаботыМенеджеровMagentoМенеджера
	               |		ПО ПолучимДокумент.Дата = БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Дата
	               |			И ПолучимДокумент.Номер = БП_ГрафикРаботыМенеджеровMagentoМенеджера.Ссылка.Номер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	БП_ГрафикРаботыМенеджеровMagentoМенеджера.НомерСтроки";
	
	
	Запрос.УстановитьПараметр("ТипЦены",ТипЦены);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Менеджеры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Менеджер");	
			
	Кво = Менеджеры.Количество();
    Если Кво = 0 Тогда
        Сообщить("Нет менеджеров для типа цены!");
        Возврат Справочники.Пользователи.ПустаяСсылка();
    КонецЕсли;

    Поз = Мен-Цел(Мен/Кво)*Кво;
    Если Поз = 0 Тогда
        Поз = Кво;
    КонецЕсли;

    Возврат Менеджеры[Поз - 1]; // 0-based индекс

КонецФункции  

Функция ПолучитьТекущегоМенеджера() Экспорт
		
	ТекНомМенеджер = константы.ТекущийМенелдер.Получить();
	Константы.ТекущийМенелдер.Установить(ТекНомМенеджер+1);
	Мен = Константы.ТекущийМенелдер.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГрафикРаботыМенеджеровМенеджера.НомерСтроки,
	               |	ГрафикРаботыМенеджеровМенеджера.Менеджер,
	               |	ГрафикРаботыМенеджеровМенеджера.Ссылка.Номер
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		МИНИМУМ(ГрафикРаботыМенеджеров.Номер) КАК Номер
	               |	ИЗ
	               |		Документ.ГрафикРаботыМенеджеров КАК ГрафикРаботыМенеджеров
	               |	ГДЕ
	               |		ГрафикРаботыМенеджеров.Проведен
	               |		И ГрафикРаботыМенеджеров.Дата >= &Дата
	               |		И ГрафикРаботыМенеджеров.ДатаПо <= &Дата) КАК ПолучимДокумент
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГрафикРаботыМенеджеров.Менеджера КАК ГрафикРаботыМенеджеровМенеджера
	               |		ПО ПолучимДокумент.Номер = ГрафикРаботыМенеджеровМенеджера.Ссылка.Номер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГрафикРаботыМенеджеровМенеджера.НомерСтроки";
	
	
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Менеджеры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Менеджер");		
		
	Кво = Менеджеры.Количество();
    Если Кво = 0 Тогда
        Сообщить("Нет менеджеров для типа цены!");
        Возврат Справочники.Пользователи.ПустаяСсылка();
    КонецЕсли;

    Поз = Мен-Цел(Мен/Кво)*Кво;
    Если Поз = 0 Тогда
        Поз = Кво;
    КонецЕсли;

    Возврат Менеджеры[Поз - 1]; // 0-based индекс

КонецФункции