функция СоздатьПКО(ЗаказСсылка, СуммаОплаты,Комментарий, КассаКод, Проводить) Экспорт 

	ПКО = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	ПКО.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя;

	ПКО.Дата = ТекущаяДата();

	ПКО.Касса = Справочники.Кассы.НайтиПоКоду(КассаКод);							
	ПКО.Организация = ЗаказСсылка.Организация;
	ПКО.Контрагент = ЗаказСсылка.Контрагент;
	ПКО.ДоговорКонтрагента = ЗаказСсылка.ДоговорКонтрагента;
    ПКО.Оплачено = Истина;
	ПКО.ДокументОснование = ЗаказСсылка;
	ПКО.СуммаДокумента = СуммаОплаты;
	ПКО.Комментарий = Комментарий;  	
	ПКО.Подразделение = ЗаказСсылка.Подразделение;
	 
	Стр = ПКО.РасшифровкаПлатежа.Добавить();
	Стр.СуммаПлатежа = СуммаОплаты;
	Стр.СуммаВзаиморасчетов = СуммаОплаты;
	Стр.ДоговорКонтрагента = ЗаказСсылка.ДоговорКонтрагента;
	Стр.ДокументРасчетовСКонтрагентом = ЗаказСсылка;
	Стр.Сделка = ЗаказСсылка;
	
	

	ПКО.ОтражатьВУправленческомУчете = Истина;
	ПКО.ВалютаДокумента = ЗаказСсылка.ВалютаДокумента;
	ПКО.Ответственный = Справочники.Пользователи.НайтиПоНаименованию("Magento");
	Если Проводить тогда 
		ПКО.Записать(РежимЗаписиДокумента.Проведение);	
	КонецЕсли;

	Возврат ПКО;
КонецФункции                    