
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Если ДанныеЗаполнения = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	Склад = ДанныеЗаполнения.Склад;
	Контрагент = ДанныеЗаполнения.Контрагент;
	ДокументПриема = ДанныеЗаполнения;
	ДатаС = ДанныеЗаполнения.ДатаС;
	ДатаПо = ДанныеЗаполнения.ДатаПо;
	Для Каждого Стр из ДанныеЗаполнения.Товары Цикл
		Ст = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Ст,Стр);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ХранениеТовара.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ХранениеТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ДокументХранения = ДокументПриема;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	
КонецПроцедуры

// Возвращает доступные варианты печати документа.
//
// Вовращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	СтруктураМакетов = Новый Структура(); 
	//+БП: d.matyash (23.02.2025) <>
	//СтруктураМакетов.Вставить("АктПередачи", "Акт передачи");   
	//------------------------------ 
	СтруктураМакетов.Вставить("АктВозврата", "Акт повернення-передачі"); 
	//-БП: d.matyash (23.02.2025) <>
     
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьТаблицуПечатныхФорм()


Функция ПечатьАкта()

	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриемНаХранениеДоговор";
	
	Макет = ПолучитьМакет("МакетАкт");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Номер = ДокументПриема.Номер;
	ОбластьМакета.Параметры.ДатаВ = Формат(Дата,"ДЛФ=DD");
	
	ОбластьМакета.Параметры.ДатаПр = Формат(ДокументПриема.Дата,"ДЛФ=DD");
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Контрагент.НаименованиеПолное);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контр";
	ЗАпрос.УстановитьПараметр("Контр",Контрагент);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
	КонецЦикла;
	ОбластьМакета.Параметры.Адрес = Адрес;
	Паспорт = "";
	
	ТабДокумент.Вывести(ОбластьМакета);
	Для Каждого Стр из Товары Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Областьмакета.Параметры.Заполнить(Стр);
		//Областьмакета.Параметры.ДОТ = 
		ТабДокумент.Вывести(ОбластьМакета);
		
	конецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Низ");
	Областьмакета.Параметры.Количество = Товары.Итог("Количество");
	Областьмакета.Параметры.ЗалоговаяСтоимость = Товары.Итог("ЗалоговаяСтоимость");
	
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Контрагент.НаименованиеПолное);
	
	ОбластьМакета.Параметры.Количество = Товары.Итог("Количество");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контр";
	ЗАпрос.УстановитьПараметр("Контр",Контрагент);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
			Телефон = Рез.Представление;
		КонецЕслИ;
		
	КонецЦикла;
	ОбластьМакета.Параметры.Адрес = Адрес;
	ОбластьМакета.Параметры.Телефон = Телефон;
	Паспорт = "";
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьДокумента()    

Функция ПечатьАктВозврат()
    //+БП: d.matyash (23.02.2025) <>   
	ТабДокумент = Новый ТабличныйДокумент;

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВозвратТовараСХранения.Ссылка,
	                      |	ВозвратТовараСХранения.Номер,
	                      |	ВозвратТовараСХранения.Дата,
	                      |	ВозвратТовараСХранения.Контрагент,
	                      |	ВозвратТовараСХранения.ДатаС,
	                      |	ВозвратТовараСХранения.ДатаПо,
	                      |	ВозвратТовараСХранения.ДокументПриема,
	                      |	ВозвратТовараСХранения.ДокументПриема.Дата КАК ДатаПриема,
	                      |	ВозвратТовараСХранения.ДокументПриема.Номер КАК НомерПриема,
	                      |	ВозвратТовараСХранения.ДокументПриема.ОснованиеПервичное.Номер КАК НомерПриемаП,
	                      |	ВозвратТовараСХранения.ДокументПриема.ОснованиеПервичное.Дата КАК ДатаПриемаП,
	                      |	ВозвратТовараСХранения.Контрагент.ИНН КАК КонтрагентИНН,
	                      |	ВозвратТовараСХранения.ДокументПриема.Организация.КодПоЕДРПОУ КАК ОрганизацияКодПоЕДРПОУ,
	                      |	ВозвратТовараСХранения.ДокументПриема.Организация.ИНН КАК ОрганизацияИНН,
	                      |	ВозвратТовараСХранения.ДокументПриема.Организация.ОсновнойБанковскийСчет КАК ОрганизацияОсновнойБанковскийСчет,
	                      |	ВозвратТовараСХранения.ДокументПриема.Организация КАК Организация,
	                      |	ВозвратТовараСХранения.ДокументПриема.Организация.НаименованиеПолное КАК ОрганизацияПолное,
	                      |	ВозвратТовараСХранения.ДокументПриема.Организация.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	                      |	ВозвратТовараСХранения.Контрагент.КодПоЕДРПОУ
	                      |ИЗ
	                      |	Документ.ВозвратТовараСХранения КАК ВозвратТовараСХранения
	                      |ГДЕ
	                      |	ВозвратТовараСХранения.Ссылка = &Ссылка");   
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() тогда
		Сообщить("Не вдалося сформувати друковану форму!");
		Возврат ТабДокумент;
	КонецЕсли;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктВозврат";
	
	Макет = ПолучитьМакет("АктВозврата");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьМакета.Параметры.Заполнить(Выборка);
	//ОбластьМакета.Параметры.Номер = ?(ЗначениеЗаполнено(Выборка.НомерПриемаП),Выборка.НомерПриемаП,Выборка.НомерПриема);
	//ОбластьМакета.Параметры.Дата = Формат(?(ЗначениеЗаполнено(Выборка.ДатаПриемаП),Выборка.ДатаПриемаП,Выборка.ДатаПриема),"ДЛФ=DD");
	
	ОбластьМакета.Параметры.Номер = Выборка.Номер;
	ОбластьМакета.Параметры.Дата = Формат(Выборка.Дата,"ДЛФ=DD");
	
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Выборка.Контрагент.НаименованиеПолное);
	
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Выборка.Контрагент.НаименованиеПолное);
	ОбластьМакета.Параметры.КонтрагентКодПоЕДРПОУ = ?(ЗначениеЗаполнено(Выборка.КонтрагентКодПоЕДРПОУ), "ЄДРПОУ " + Выборка.КонтрагентКодПоЕДРПОУ, "");
	ОбластьМакета.Параметры.КонтрагентИНН = ?(ЗначениеЗаполнено(Выборка.КонтрагентИНН), "ІПН " + Выборка.КонтрагентИНН, "");    
	
	ОбластьМакета.Параметры.ОрганизацияКодПоЕДРПОУ = ?(ЗначениеЗаполнено(Выборка.ОрганизацияКодПоЕДРПОУ), "ЄДРПОУ " + Выборка.ОрганизацияКодПоЕДРПОУ, "");
	ОбластьМакета.Параметры.ОрганизацияИНН = ?(ЗначениеЗаполнено(Выборка.ОрганизацияИНН), "ІПН " + Выборка.ОрганизацияИНН, ""); 
	ОбластьМакета.Параметры.НомерСчета = ?(ЗначениеЗаполнено(Выборка.НомерСчета), "IBAN " + Выборка.НомерСчета, ""); 

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Контр";
	ЗАпрос.УстановитьПараметр("Контр",Контрагент);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
			Телефон = Рез.Представление;
		КонецЕслИ;
		
	КонецЦикла;
	ОбластьМакета.Параметры.КонтрагентАдрес = Адрес;
	ОбластьМакета.Параметры.КонтрагентНомер = Телефон;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Тип,
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Орг";
	ЗАпрос.УстановитьПараметр("Орг",Выборка.Организация);
	Рез = ЗАпрос.Выполнить().Выбрать();
	Адрес = "";
	Телефон = "";
	Пока Рез.Следующий() Цикл
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации Тогда
			Адрес = Рез.Представление;
		КонецЕслИ;
		Если Рез.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации Тогда
			Телефон = Рез.Представление;
		КонецЕслИ;
		
	КонецЦикла;
	ОбластьМакета.Параметры.ОрганизацияАдрес = Адрес;
	ОбластьМакета.Параметры.ОрганизацияНомер = Телефон;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо КАК Руководитель,
	               |	ОтветственныеЛицаОрганизацииСрезПоследних.Должность КАК ДолжностьРуководитель,
	               |	ФИОФизЛицСрезПоследних.Фамилия,
	               |	ФИОФизЛицСрезПоследних.Имя,
	               |	ФИОФизЛицСрезПоследних.Отчество
	               |ИЗ
	               |	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(
	               |			&Дата,
	               |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |				И ОтветственноеЛицо = &ОтветственноеЛицо) КАК ОтветственныеЛицаОрганизацииСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&Дата, ) КАК ФИОФизЛицСрезПоследних
	               |		ПО ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо";
	
	ЗАпрос.УстановитьПараметр("СтруктурнаяЕдиница",Выборка.Организация);
	ЗАпрос.УстановитьПараметр("Дата",Дата);
	ЗАпрос.УстановитьПараметр("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизации.Руководитель);

	Рез = ЗАпрос.Выполнить().Выбрать();
	ОрганизацияДиректор = "";
	Пока Рез.Следующий() Цикл
			ОрганизацияДиректор = Строка(Рез.ДолжностьРуководитель) + " " + Врег(Рез.Фамилия)  + " " + Строка(Рез.Имя)  + " " + Строка(Рез.Отчество);			
	КонецЦикла;

	ОбластьМакета.Параметры.ОрганизацияДиректор = ОрганизацияДиректор;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Для Каждого Стр из Товары Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Областьмакета.Параметры.Заполнить(Стр);
		
		Областьмакета.Параметры.СтоимостьЗаМесяц = Стр.Сумма / ?(СТр.Количество > 0, СТр.Количество, 1 ) / ?(СТр.КоличествоМесяцев > 0, СТр.КоличествоМесяцев, 1 );	

		//Областьмакета.Параметры.Период = Формат(Стр.ПериодС,"ДФ=dd.MM.yyyy") + " - " + Формат(Стр.ПериодПо,"ДФ=dd.MM.yyyy");	
		ТабДокумент.Вывести(ОбластьМакета);
		
	конецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	Областьмакета.Параметры.ИтогСумма = Товары.Итог("Сумма");	
	ОбластьМакета.Параметры.Контрагент = СокрЛП(Выборка.Контрагент.НаименованиеПолное);
	ОбластьМакета.Параметры.ОрганизацияПолное = СокрЛП(Выборка.ОрганизацияПолное);
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьДокумента()




// Процедура осуществляет печать документа. Можно направить печать на
// экран или принтер, а также распечатать необходмое количество копий.
// Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ИмяМакета = "АктПередачи" Тогда
		ТабДокумент = ПечатьАкта();          
	//+БП: d.matyash (23.02.2025) <>
	ИначеЕсли ИмяМакета = "АктВозврата" Тогда
		ТабДокумент = ПечатьАктВозврат();
	//-БП: d.matyash (23.02.2025) <>	
	ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли;
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);

КонецПроцедуры // Печать()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Заказ = ДокументПриема.Сделка;
КонецПроцедуры
