Функция ПолучитьЗаказы(Контрагент) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Дата,
	|	ЗаказПокупателя.Номер,
	|	ЗаказПокупателя.СуммаДокумента КАК Сумма,
	|	ЗаказПокупателя.ДатаОтгрузки КАК Отгрузка,
	|	ЗаказПокупателя.ДатаОплаты КАК Оплата,
	|	ЗаказПокупателя.ВалютаДокумента КАК Валюта,
	|	ЗаказПокупателя.Контрагент,
	|	ЗаказПокупателя.Телефон,
	|	ЗаказПокупателя.Статус,
	|	ЗаказПокупателя.Организация,
	|	ЗаказПокупателя.СкладГруппа,
	|	ЗаказПокупателя.АдресДоставки,
	|	ЗаказПокупателя.Подразделение,
	|	ЗаказПокупателя.Ответственный,
	|	ЗаказПокупателя.Комментарий,     
	|	ЗаказПокупателя.УсловиеПоставки,
	|	ЗаказПокупателя.ФормаРасчета,
	|	ЗаказПокупателя.УсловиеОплаты,
	|	ЗаказПокупателя.НП_ТТН КАК ТТН,
	|	ЗаказПокупателя.НП_Статус КАК СтатусНП,
	|	ЗаказПокупателя.НП_ГородПолучателя КАК ГородПолучателя,
	|	ЗаказПокупателя.НП_ОтделениеПолучения КАК ОтделениеПолучения
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Контрагент = &Контрагент ИЛИ &Контрагент = Неопределено
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПокупателя.Дата УБЫВ";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура ОткрытьЗаказ(Номер, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказПокупателя.Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Номер = &Номер
	|	И ЗаказПокупателя.Дата >= &НачалоДня
	|	И ЗаказПокупателя.Дата <= &КонецДня";  
	
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(Дата)); 
	
	Результат = Запрос.Выполнить().Выбрать();

	Если Результат.Следующий() Тогда
		
		ЗаказСсылка = Результат.Ссылка;
		ЗаказСсылка.ПолучитьФорму().Открыть();		
		Возврат;	
	КонецЕсли;
 
КонецПроцедуры

Функция ПолучитьЗаказыЗаявки(НП_Адресная_Заявка, Владелец) Экспорт
	
	// 1. Получаем данные (номера + даты)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.НП_ТТН
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.НП_Адресная_Заявка = &НП_Адресная_Заявка";

	Запрос.УстановитьПараметр("НП_Адресная_Заявка", НП_Адресная_Заявка);
	ТаблицаРезультатов = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаРезультатов.Количество() = 0 Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	МассивНомеров = ТаблицаРезультатов.ВыгрузитьКолонку("НП_ТТН");
	СписокНП_ТТН = Новый СписокЗначений;
	Для Каждого Номер Из МассивНомеров Цикл
		СписокНП_ТТН.Добавить(Номер);
	КонецЦикла;	
	  	
	// 2. Открываем форму списка
	ФормаСписка = Документы.ЗаказПокупателя.ПолучитьФормуСписка(,Владелец);	
	ФормаСписка.Отбор.Ответственный.Использование = Ложь;

	// 3. Добавляем условия отбора
	
	// Отбор по номеру  
	ФормаСписка.Отбор.НП_ТТН.ВидСравнения = ВидСравнения.ВСписке;
	ФормаСписка.Отбор.НП_ТТН.Значение = СписокНП_ТТН;
	ФормаСписка.Отбор.НП_ТТН.Использование = Истина;
		
	ФормаСписка.ЭлементыФормы.ДействияФормы.кнопки.НоваяПошта.Кнопки.УДалитьИзЗаявки.Доступность = Истина;   
	
	Если ФормаСписка.Открыта() Тогда
		ФормаСписка.Активизировать();
	Иначе
		ФормаСписка.ОткрытьМодально(); 
	КонецЕсли;
	
	//ФормаСписка.Отбор.Ответсвенный.Использование = Ложь;	
	//ФормаСписка.ЭлементыФормы.Список.ВыделенныеСтроки
	Возврат Истина;
КонецФункции

функция ПолучитьТелефонПолучателя(ТТН) Экспорт 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НП_ТТН",ТТН);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.НП_ТелефонПолучателя как ТелефонПолучателя
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.НП_ТТН = &НП_ТТН";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.следующий Цикл
		Возврат СокрЛП(Выборка.ТелефонПолучателя);
	КонецЦикла;
	
	Возврат ТТН;
КонецФункции     

Функция ПолучитьЗаказыДляОплатыТерминалом(НомерТелефона) Экспорт 
	
	НомерТелефона = ОбщегоНазначения.ПреобразоватьТелефон(НомерТелефона);

		
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Ссылка КАК Ссылка,
	               |	ЗаказПокупателя.Контрагент КАК СделкаКонтрагент,
	               |	ЗаказПокупателя.СуммаДокумента - ЕСТЬNULL(Взаиморасчеты.Оплата, 0) КАК СуммаКОплате,
	               |	ЕСТЬNULL(Взаиморасчеты.Отгрузка, 0) КАК Отгрузка,
	               |	ЕСТЬNULL(Взаиморасчеты.Оплата, 0) КАК Оплата,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	КонтактнаяИнформация.Объект КАК Объект
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка КАК Сделка,
	               |			СУММА(ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход, 0)) КАК Отгрузка,
	               |			СУММА(ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход, 0)) КАК Оплата
	               |		ИЗ
	               |			РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка) КАК Взаиморасчеты
	               |		ПО (Взаиморасчеты.Сделка = ЗаказПокупателя.Ссылка)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |		ПО (КонтактнаяИнформация.Объект = ЗаказПокупателя.Контрагент)
	               |ГДЕ
	               |	ЗаказПокупателя.Дата > &Дата
	               |	И КонтактнаяИнформация.CRM_НомерТелефона = &НомерТелефона
	               |	И ЗаказПокупателя.СуммаДокумента - ЕСТЬNULL(Взаиморасчеты.Оплата, 0) > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СделкаКонтрагент";
	
	Запрос.УстановитьПараметр("НомерТелефона" ,НомерТелефона); 
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 60 * 60 * 12 * 60);  
	
	Возврат  Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция ПолучитьОтветПоЗакамДляОплатыВТерминале(СтрЗаказ, Account) Экспорт
	
	СтрокиЗаказа = ПолучитьСтрокиЗаказаДляОплатыТерминалом(СтрЗаказ.Ссылка);
	
	OrderId = XMLСтрока(Строка(СтрЗаказ.Ссылка.УникальныйИдентификатор()));
	OrderNumber = XMLСтрока(СтрЗаказ.Ссылка.Номер);
	OrderDate = XMLСтрока(Формат(СтрЗаказ.Ссылка.Дата, "ДФ=yyyy-MM-dd HH:mm:ss"));
	CustomerPhone = XMLСтрока(Account);
	OrderAmount = XMLСтрока(Формат(СтрЗаказ.СуммаДокумента, "ЧГ=0;ЧДЦ=2;ЧРД=."));
	PrepaymentAmount = XMLСтрока(Формат(СтрЗаказ.Оплата, "ЧГ=0;ЧДЦ=2;ЧРД=."));
	AmountToPay = XMLСтрока(Формат(СтрЗаказ.СуммаКОплате, "ЧГ=0;ЧДЦ=2;ЧРД=."));
	Customer = XMLСтрока(СтрЗаказ.СделкаКонтрагент);
	
	OrdersXML = 
	"<Order>" +
	"<OrderId>" + OrderId + "</OrderId>" +
	"<OrderNumber>" + OrderNumber + "</OrderNumber>" +
	"<OrderDate>" + OrderDate + "</OrderDate>" +
	"<CustomerPhone>" + CustomerPhone + "</CustomerPhone>" +
	"<Customer>" + Customer + "</Customer>" +
	"<OrderAmount>" + OrderAmount + "</OrderAmount>" +
	"<PrepaymentAmount>" + PrepaymentAmount + "</PrepaymentAmount>" +
	"<AmountToPay>" + AmountToPay + "</AmountToPay>" +
	"<Items>";
	
	Для Каждого СтрТовар Из СтрокиЗаказа Цикл
		
		ProductId = "";
		Если ЗначениеЗаполнено(СтрТовар.ProductId) Тогда
			ProductId = XMLСтрока(Строка(СтрТовар.ProductId.УникальныйИдентификатор()));
		КонецЕсли;
		
		OrdersXML = OrdersXML +
		"<Item>" +
		"<LineNumber>" + XMLСтрока(Строка(СтрТовар.LineNumber)) + "</LineNumber>" +
		"<LineType>" + XMLСтрока(СтрТовар.LineType) + "</LineType>" +
		"<ProductId>" + ProductId + "</ProductId>" +
		"<ProductName>" + XMLСтрока(СтрТовар.ProductName) + "</ProductName>" +
		"<Quantity>" + XMLСтрока(Формат(СтрТовар.Quantity, "ЧГ=0;ЧДЦ=3;ЧРД=.")) + "</Quantity>" +
		"<Price>" + XMLСтрока(Формат(СтрТовар.Price, "ЧГ=0;ЧДЦ=2;ЧРД=.")) + "</Price>" +
		"<LineDiscount>" + XMLСтрока(Формат(СтрТовар.LineDiscount, "ЧГ=0;ЧДЦ=2;ЧРД=.")) + "</LineDiscount>" +
		"<LineAmountWithDiscount>" + XMLСтрока(Формат(СтрТовар.LineAmountWithDiscount, "ЧГ=0;ЧДЦ=2;ЧРД=.")) + "</LineAmountWithDiscount>" +
		"</Item>"; 
		
	КонецЦикла;
	
	OrdersXML = OrdersXML +
	"</Items>" +
	"</Order>";
	
	Возврат OrdersXML;
	
КонецФункции

Функция ПолучитьСтрокиЗаказаДляОплатыТерминалом(СсылкаЗаказа) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.НомерСтроки КАК LineNumber,
	|	Товары.Номенклатура КАК ProductId,
	|	Товары.Номенклатура.Наименование КАК ProductName,
	|	Товары.Количество КАК Quantity,
	|	Товары.Цена КАК Price,
	|	ЕСТЬNULL(Товары.ПроцентСкидкиНаценки, 0) КАК LineDiscount,
	|	Товары.Сумма КАК LineAmountWithDiscount,
	|	""Product"" КАК LineType
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Услуги.НомерСтроки КАК LineNumber,
	|	Услуги.Номенклатура КАК ProductId,
	|	Услуги.Номенклатура.Наименование КАК ProductName,
	|	Услуги.Количество КАК Quantity,
	|	Услуги.Цена КАК Price,
	|	ЕСТЬNULL(Услуги.ПроцентСкидкиНаценки, 0) КАК LineDiscount,
	|	Услуги.Сумма КАК LineAmountWithDiscount,
	|	""Service"" КАК LineType
	|ИЗ
	|	Документ.ЗаказПокупателя.Услуги КАК Услуги
	|ГДЕ
	|	Услуги.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	LineType,
	|	LineNumber";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаЗаказа);
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции

