функция ПолучитьДокументыДляПерепроведенияПослеИзмененияКурса() Экспорт   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УстановкаЦенНоменклатурыТовары.Ссылка.Ссылка
	               |ИЗ
	               |	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
	               |ГДЕ
	               |	УстановкаЦенНоменклатурыТовары.Валюта.Код = ""840""
	               |	И УстановкаЦенНоменклатурыТовары.Ссылка.Проведен
	               |	И НЕ УстановкаЦенНоменклатурыТовары.Ссылка.ПометкаУдаления
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УстановкаЦенНоменклатурыТовары.Ссылка.Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	 
КонецФункции