
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЦеныУслугШиномонтажа
	Движения.ЦеныУслугШиномонтажа.Записывать = Истина;
	Движения.ЦеныУслугШиномонтажа.Очистить();
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Если ЗначениеЗаполнено(ТекСтрокаУслуги.УслугаСсылка) Тогда
			Движение = Движения.ЦеныУслугШиномонтажа.Добавить();
			Движение.Период = Дата;
			Движение.ВидУслуги = ВидУслуги; 
			Движение.Подразделение = Подразделение;
			Движение.УслугаСсылка = ТекСтрокаУслуги.УслугаСсылка;
			Движение.Количество = ТекСтрокаУслуги.Количество;
			Движение.ЦенаПродажи = ТекСтрокаУслуги.ЦенаПродажи;
			Движение.ЦенаЗакупки = ТекСтрокаУслуги.ЦенаЗакупки;
			Движение.Диаметр = ТекСтрокаУслуги.Диаметр;
		Иначе
			Сообщить("По рядку №" + ТекСтрокаУслуги.НомерСтроки + " ціна не зафіксована, не вказано послугу");
		КонецЕсли;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
