функция выполнитьвсе(ДатаДок)  Экспорт
	
	обр = Обработки.СозданиеУЦ_По_ПравиламРасчета_СД.Создать();
	обр.ДатаДокументов = ДатаДок;
	обр.ВЫполнитьВсе();
	
	//+БП: d.matyash (01.08.2025) <>
	//ТЗ = обр.НоменклатураПоПравилу.ВыгрузитьКолонки("ПравилоРасчета,Номенклатура,ВидНоменклатуры,ТипЦеныРассчитанной,Приоритет,МІСТО,Поставщик,Остаток,Прибыль,ЦенаУЦ");
	//Для каждого СтрНом из обр.НоменклатураПоПравилу цикл
	//	Если Не СтрНом.УЦ тогда 
	//		Продолжить;
	//	КонецЕсли;
	//	НайденнаяСтрока = ТЗ.Найти(СтрНом.Номенклатура, "Номенклатура");
	//	Если  НайденнаяСтрока = Неопределено тогда
	//		НовСтрока = ТЗ.Добавить();
	//		ЗаполнитьЗначенияСвойств(НовСтрока,СтрНом);
	//	Иначе
	//		Если СтрНом.Приоритет > НайденнаяСтрока.Приоритет тогда
	//			ЗаполнитьЗначенияСвойств(НайденнаяСтрока,СтрНом);
	//		Иначе
	//			Продолжить;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Обработки.БП_РасчетРейтингаПоПравиламРанжировки.ВыполнитьВсе(ТЗ);   //розкоментувати!!! 
	Обработки.БП_НазначенияБейджиковПоПравилам.ВыполнитьВсе();   //розкоментувати!!!
	//-БП: d.matyash (01.08.2025) <>
КонецФункции	


функция выполнитьвсеСОтбором(ДатаДок, отборструкутра)  Экспорт
	
	обр = Обработки.СозданиеУЦ_По_ПравиламРасчета_СД.Создать();
	обр.ДатаДокументов = ДатаДок;
	обр.ВЫполнитьВсе(отборструкутра);
	
	//+БП: d.matyash (05.01.2026) <>
	//Обработки.БП_РасчетРейтингаПоПравиламРанжировки.ВыполнитьВсе(); 
	//-БП: d.matyash (05.01.2026) <>
	Обработки.БП_НазначенияБейджиковПоПравилам.ВыполнитьВсе();
КонецФункции	                               

Функция    выполнитьвсеУстановкаЦенНоменклатурыКонтрагентовСОтбором (Док)    Экспорт 
	
	флУспешно = Ложь;
	
	Попытка
		
		Если не ЗначениеЗаполнено(Док) тогда               
			
				//ЗаписьЖурналаРегистрации("СозданиеУЦ_По_ПравиламРасчета_СД.выполнитьвсеУстановкаЦенНоменклатурыКонтрагентовСОтбором",УровеньЖурналаРегистрации.Ошибка,Метаданные.Обработки.СозданиеУЦ_По_ПравиламРасчета_СД,Док,ОписаниеОшибки()); //bsoft (21.08.2024)
	
			Возврат флУспешно;
		КонецЕсли;	
		
		струкутраОтбора = Новый  Структура();
		если ЗначениеЗаполнено(Док.ВидНоменклутары) тогда
			струкутраОтбора.Вставить("ВидНоменклатуры",док.ВидНоменклутары);	
			
		КонецЕсли;
		
		если ЗначениеЗаполнено(док.Контрагент) тогда
			струкутраОтбора.Вставить("Контрагент",док.Контрагент);	
			
		КонецЕсли;
		
		//Обработки.СозданиеУЦ_По_ПравиламРасчета_СД.выполнитьвсеСОтбором(Дата,струкутраОтбора);
		
		обр = Обработки.СозданиеУЦ_По_ПравиламРасчета_СД.Создать();
		обр.ДатаДокументов = Док.Дата;
		обр.ВЫполнитьВсе(струкутраОтбора);
		
		флУспешно = Истина;
		
		//+БП: d.matyash (05.01.2026) <>
		//Обработки.БП_РасчетРейтингаПоПравиламРанжировки.ВыполнитьВсе();
		//-БП: d.matyash (05.01.2026) <>
	Исключение
		
		//ЗаписьЖурналаРегистрации("СозданиеУЦ_По_ПравиламРасчета_СД.выполнитьвсеУстановкаЦенНоменклатурыКонтрагентовСОтбором",УровеньЖурналаРегистрации.Ошибка,Метаданные.Обработки.СозданиеУЦ_По_ПравиламРасчета_СД,Док,ОписаниеОшибки()); //bsoft (21.08.2024)
		
	КонецПопытки;	
	
	возврат флУспешно;
	
	
КонецФункции   

Функция ПередатьНоменклатуруКРасчетуРейтинга() Экспорт 
	//+БП: d.matyash (16.07.2025) <>
	обр = Обработки.СозданиеУЦ_По_ПравиламРасчета_СД.Создать();
	обр.ДатаДокументов = ТекущаяДата();
	Возврат обр.ПередатьНоменклатуруКРасчетуРейтинга();	
	//-БП: d.matyash (16.07.2025) <>
КонецФункции  