перем _хранилище Экспорт ;

Функция ПЕчатьТЗ(ТПОтчета,Заголовок = "") Экспорт
	
	
	//ТПОтчета - Табличное поле с формы (Таблица значений) с данными
	ПострПечать = Новый ПостроительОтчета;
	ПострПечать.ТекстЗаголовка = Заголовок;
	ПострПечать.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТПОтчета);
	//ПострПечать.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Классика);
	
	
	//для каждого строкаКолонки из ПострПечать.Результат.Колонки цикл
	//	
	//	//Если Врег(	Лев(строкаКолонки.Имя,2) ) = "К_" тогда
	//	//	строкаКолонки.Ширина = 15;
	//	//КонецЕсли;	
	//	//Если Врег(Лев(строкаКолонки.Имя,2)) = "Т_" тогда
	//	//	строкаКолонки.Ширина = 30;
	//	//КонецЕсли;	
	//	
	//КонецЦикла;	
	//для каждого область из ПострПечать.МакетОформления.Области цикл
	//	Если Область.Имя = ""
	//	Область.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	//	Область.ШиринаКолонки = 1;
	//КонецЦикла;	
	//ПострПечать.ОформитьМакет();
	ПострПечать.Выполнить();
	//Для каждого Колонка Из ПострПечать.ВыбранныеПоля Цикл
	//	Колонка.Представление = сокрлп(ТПОтчета.Колонки[Колонка.Имя].Заголовок);
	//	
	//	
	//	
	//КонецЦикла; 
	
	//ПострПечать.ИзмеренияКолонки	
	
	
	
	
	//ПострПечать.Вывести(); 
	
	
	МакетТД = Новый ТабличныйДокумент;
	ПострПечать.Вывести(МакетТД);
	ОбластьТД = МакетТД.Область();
	
	ОбластьТД.АвтоОтступ = ЛОжь;
	ОбластьТД.лево = 5;
	ОбластьТД.Право = 5;
	ОбластьТД.ШиринаКолонки = 20;	
	//МакетТД.ТолькоПросмотр = Истина;
	//МакетТД.ФиксацияСверху = 4;
	МакетТД.ОтображатьЗаголовки = Истина;
	//ОбластьУдаления = МакетТД.Область(, 1, , 1);
	//Смещать = ТипСмещенияТабличногоДокумента.ПоГоризонтали;
	//МакетТД.УдалитьОбласть(ОбластьУдаления, Смещать);
	МакетТД.Показать();
	
	
	возврат истина;
КонецФункции	



Процедура ЗаполнитьПравила() Экспорт 
	
	ПравилаРасчета.Очистить();
	
	Запрос_Правила = новый Запрос;
	Запрос_Правила.Текст = "ВЫБРАТЬ
	|	ПравилаРасчетаЦен_СД.Ссылка КАК ПравилоРасчета,
	|	ПравилаРасчетаЦен_СД.Приоритет КАК Приоритет,
	|	ПравилаРасчетаЦен_СД.КонтрагентУЦ,
	|	ПравилаРасчетаЦен_СД.ТипЦеныРассчитанной
	|ИЗ
	|	Справочник.ПравилаРасчетаЦен_СД КАК ПравилаРасчетаЦен_СД
	|ГДЕ
	|	НЕ ПравилаРасчетаЦен_СД.ПометкаУдаления
	|	И НЕ ПравилаРасчетаЦен_СД.НеИспользуется
	|	И НЕ ПравилаРасчетаЦен_СД.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	Рез_Правила = Запрос_Правила.Выполнить().Выгрузить();
	
	
	ПравилаРасчета.Загрузить(Рез_Правила);
	
	
	//для каждого строкаТЗ из Рез_Правила цикл
	//	для каждого строкатз2 из строкаТЗ.ПравилоРасчета.ВидыНоменклатуры цикл
	//		новСтр = ДокументыУЦ.Добавить();
	//		новСтр.КонтрагентУЦ = строкаТЗ.КонтрагентУЦ;
	//		новСтр.ВидНоменклатуры = строкатз2.ВидНоменклатуры;
	//		
	//	КонецЦикла;;
	//	
	//КонецЦикла;;
	//		
	//	промтз  = ДокументыУЦ.Выгрузить();
	//	промтз.Свернуть("КонтрагентУЦ,ВидНоменклатуры");
	//	ДокументыУЦ.Загрузить(промтз);
КонецПроцедуры	


Процедура ЗаполнитьПравилаПоОтбору(отбор) Экспорт 
	
	ПравилаРасчета.Очистить();                 
	
	ИспользоватьОтбор_Контрагент = Ложь;    
	ИспользоватьОтбор_ВидНоменклатуры = Ложь;
	
	КонтрагентУЦ = Справочники.Контрагенты.ПустаяСсылка();
	ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПустаяСсылка();
	
	//отбор = Новый  Структура();
	//Если  тогда
	ИспользоватьОтбор_Контрагент = отбор.Свойство("Контрагент", КонтрагентУЦ ) ;
	
	//КонецЕсли;	
	
	
	//Если   тогда
	ИспользоватьОтбор_ВидНоменклатуры = отбор.Свойство("ВидНоменклатуры", ВидНоменклатуры );
	
	//КонецЕсли;	
	
	
	Запрос_Правила = новый Запрос;
	Запрос_Правила.Текст = "ВЫБРАТЬ
	|	ПравилаРасчетаЦен_СД.Ссылка КАК ПравилоРасчета
	|ПОМЕСТИТЬ тз
	|ИЗ
	|	Справочник.ПравилаРасчетаЦен_СД КАК ПравилаРасчетаЦен_СД
	|ГДЕ
	|	НЕ ПравилаРасчетаЦен_СД.ПометкаУдаления
	|	И НЕ ПравилаРасчетаЦен_СД.НеИспользуется
	|	И НЕ ПравилаРасчетаЦен_СД.ЭтоГруппа
	|	И ВЫБОР
	|			КОГДА &ИспользоватьОтбор_Контрагент
	|				ТОГДА ПравилаРасчетаЦен_СД.КонтрагентУЦ = &КонтрагентУЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ИспользоватьОтбор_ВидНоменклатуры
	|				ТОГДА ПравилаРасчетаЦен_СД.ВидыНоменклатуры.ВидНоменклатуры = &ВидНоменклатуры
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПравилаРасчетаЦен_СД.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тз.ПравилоРасчета,
	|	тз.ПравилоРасчета.КонтрагентУЦ КАК КонтрагентУЦ,
	|	тз.ПравилоРасчета.Приоритет КАК Приоритет
	|ИЗ
	|	тз КАК тз";   
	
	
	Запрос_Правила.УстановитьПараметр("ИспользоватьОтбор_Контрагент",ИспользоватьОтбор_Контрагент);
	Запрос_Правила.УстановитьПараметр("ИспользоватьОтбор_ВидНоменклатуры",ИспользоватьОтбор_ВидНоменклатуры);
	
	Запрос_Правила.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
	Запрос_Правила.УстановитьПараметр("КонтрагентУЦ",КонтрагентУЦ);
	
	Рез_Правила = Запрос_Правила.Выполнить().Выгрузить();
	
	
	ПравилаРасчета.Загрузить(Рез_Правила);
	
	
	//для каждого строкаТЗ из Рез_Правила цикл
	//	для каждого строкатз2 из строкаТЗ.ПравилоРасчета.ВидыНоменклатуры цикл
	//		новСтр = ДокументыУЦ.Добавить();
	//		новСтр.КонтрагентУЦ = строкаТЗ.КонтрагентУЦ;
	//		новСтр.ВидНоменклатуры = строкатз2.ВидНоменклатуры;
	//		
	//	КонецЦикла;;
	//	
	//КонецЦикла;;
	//		
	//	промтз  = ДокументыУЦ.Выгрузить();
	//	промтз.Свернуть("КонтрагентУЦ,ВидНоменклатуры");
	//	ДокументыУЦ.Загрузить(промтз);
КонецПроцедуры	




Процедура ЗаполнитьВсеНаСервере()   экспорт
	
	Перем новСтр, промтз, Рез_Правила, СтрокаТабличнойЧасти, строкаТЗ, строкатз2;
	
	ВывестиКоментарий("Все",,"{");
	
	
	ДокументыУЦ.Очистить();
	для каждого строкаТЗ из ПравилаРасчета цикл
		для каждого строкатз2 из строкаТЗ.ПравилоРасчета.ВидыНоменклатуры цикл
			новСтр = ДокументыУЦ.Добавить();
			новСтр.КонтрагентУЦ = строкаТЗ.ПравилоРасчета.КонтрагентУЦ;
			новСтр.ВидНоменклатуры = строкатз2.ВидНоменклатуры;
			
		КонецЦикла;;
		
	КонецЦикла;
	
	промтз  = ДокументыУЦ.Выгрузить();
	промтз.Свернуть("КонтрагентУЦ,ВидНоменклатуры");
	ДокументыУЦ.Загрузить(промтз);
	
	
	НоменклатураПоПравилу.Очистить();
	
	ПравилаРасчета.Сортировать("Приоритет");
	для  каждого СтрокаТабличнойЧасти из ПравилаРасчета цикл   
		
		//Сообщить(СтрокаТабличнойЧасти.ПравилоРасчета);         
		ЗапонитьВсюНоменклатуруПоПравилу(СтрокаТабличнойЧасти.ПравилоРасчета);
		Расчет_ВсюНоменклатуруПоПравилу(СтрокаТабличнойЧасти.ПравилоРасчета);
		
		
		
	КонецЦикла;	 
	//Сообщить("Все Завершение: " + СокрЛП(ТекущаяДата()));       
	ВывестиКоментарий("}","Все");
	
КонецПроцедуры


Процедура ВсюНоменклатуруПоВсемПравилам() Экспорт 
	
	НоменклатураПоПравилу.Очистить();
	для Каждого СтрПравило из ПравилаРасчета Цикл 
		
		Если не ЗначениеЗаполнено(СтрПравило.ПравилоРасчета) Тогда 
			Продолжить;
		КонецЕсли;	
		
		ВывестиКоментарий("Заполнение {" , СтрПравило.ПравилоРасчета , "{");
		
		РезНом = ВернутьТабНоменклатурыПоПравилу(СтрПравило.ПравилоРасчета);
		
		для Каждого СтрДоб из РезНом Цикл 
			НовСтр = НоменклатураПоПравилу.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, СтрДоб);
			НовСтр.ЦенаУЦ = ВернутьЦену(НовСтр);
		КонецЦикла;
		
		ВывестиКоментарий("} Заполнение" , СтрПравило.ПравилоРасчета );
		
		
	КонецЦикла;
КонецПроцедуры	

Процедура ВсюНоменклатуруПоПравилу(ПравилоРасчета) Экспорт 
	
	ВывестиКоментарий("Заполнение {" , ПравилоРасчета , "");
	
	СтруктУдалить = новый Структура;
	СтруктУдалить.Вставить("ПравилоРасчета", ПравилоРасчета);
	СтрокиУдалить = НоменклатураПоПравилу.НайтиСтроки(СтруктУдалить);
	для Каждого СтрУдалить из СтрокиУдалить Цикл  
		НоменклатураПоПравилу.Удалить(СтрУдалить);
	КонецЦикла;
	
	Если не ЗначениеЗаполнено(ПравилоРасчета) Тогда 
		Возврат;
	КонецЕсли;	
	РезНом = ВернутьТабНоменклатурыПоПравилу(ПравилоРасчета);
	для Каждого СтрДоб из РезНом Цикл 
		НовСтр = НоменклатураПоПравилу.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрДоб);
		НовСтр.ЦенаУЦ = ВернутьЦену(НовСтр);
	КонецЦикла;
	
	ВывестиКоментарий("} Заполнение" , ПравилоРасчета );
	
	
КонецПроцедуры	


Процедура ЗапонитьВсюНоменклатуруПоПравилу(ПравилоРасчета) Экспорт 
	
	ВывестиКоментарий("Заполнение {" , ПравилоРасчета , "{");
	
	СтруктУдалить = новый Структура;
	СтруктУдалить.Вставить("ПравилоРасчета", ПравилоРасчета);
	СтрокиУдалить = НоменклатураПоПравилу.НайтиСтроки(СтруктУдалить);
	для Каждого СтрУдалить из СтрокиУдалить Цикл  
		НоменклатураПоПравилу.Удалить(СтрУдалить);
	КонецЦикла;
	
	Если не ЗначениеЗаполнено(ПравилоРасчета) Тогда 
		Возврат;
	КонецЕсли;	
	РезНом = ВернутьТабНоменклатурыПоПравилу(ПравилоРасчета);   
	//РезНом.Свернуть("Номенлкатура,ПравилоРасчета");
	//НоменклатураПоПравилу.Загрузить(РезНом);
	//ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(	РезНом, НоменклатураПоПравилу);  
	
	// Заполним значения в совпадающих колонках.
	Для каждого СтрокаТаблицыИсточника Из РезНом Цикл
		
		СтрокаТаблицыПриемника = НоменклатураПоПравилу.Добавить();  
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточника.Номенклатура);
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыПриемника, СтрокаТаблицыИсточника);
		
		СтрокаТаблицыПриемника.ПолеДляПоиска =  СокрЛП(СтрокаТаблицыПриемника.Номенклатура) +   СокрЛП(СтрокаТаблицыПриемника.КонтрагентУЦ)+   СокрЛП(СтрокаТаблицыПриемника.ТипЦеныРассчитанной);			
		
	КонецЦикла;
	
	
	ВывестиКоментарий("} Заполнение" , ПравилоРасчета );
	
КонецПроцедуры	


Процедура ПодготовитьУцНаСервере()  Экспорт
	
	Перем _найден, _тз, отбор, отборГлавний, строкаНайдена, строкатабчасти;
	
	ВывестиКоментарий("Подготовка" ,,"{");
	
	
	для каждого ел из _хранилище цикл
		ел.Значение.Строкатз.уц = Истина;	
	КонецЦикла;	
	//отборГлавний = новый Структура();
	//отборГлавний.Вставить("УЦ", Истина);
	//_тз = НоменклатураПоПравилу.Выгрузить(отборГлавний); 
	//_тз.Индексы.Добавить("Номенклатура,КонтрагентУЦ,УЦ");
	//_тз.Сортировать("КонтрагентУЦ,Приоритет,Номенклатура");
	//
	//для каждого строкатабчасти  из _тз цикл  
	//	
	//	Если строкатабчасти.Уц = ложь тогда
	//		продолжить;	
	//	КонецЕсли;	
	//	
	//	отбор = новый структура();
	//	отбор.Вставить("УЦ",Истина);
	//	отбор.Вставить("КонтрагентУЦ",строкатабчасти.КонтрагентУЦ);
	//	отбор.Вставить("Номенклатура",строкатабчасти.Номенклатура);
	//	_найден = _тз.НайтиСтроки(отбор);	
	//	//для каждого
	//	
	//	
	//	Если _найден.Количество()  = 0 тогда
	//		
	//	ИначеЕсли _найден.Количество() = 1 тогда 
	//		_найден[0].УЦ = истина;
	//	Иначе	
	//		для каждого строкаНайдена из _найден цикл
	//			
	//			строкаНайдена.УЦ = Ложь;
	//		КонецЦИкла;	                     
	//		
	//		_найден[0].УЦ = истина;
	//		
	//	КонецЕсли;	
	//	
	//КонецЦИкла;                          
	//
	//_итог = _тз.Скопировать(отборГлавний);
	//НоменклатураПоПравилу.Загрузить(_итог);
	
	ВывестиКоментарий("} Подготовка" );
	
КонецПроцедуры



Процедура Расчет_ВсюНоменклатуруПоПравилу(ПравилоРасчета) Экспорт
	
	ВывестиКоментарий("Расчет {" , ПравилоРасчета ,"{");
	
	
	
	Если ложь тогда
		
		ПравилоРасчета = Справочники.ПравилаРасчетаЦен_СД.ПустаяСсылка();
	КонецЕсли;	
	
	стрТипыЦен = Расчет_ВсюНоменклатуруУстановитьПараметры(ПравилоРасчета);
	
	
	МВТЦены = Новый МенеджерВременныхТаблиц();
	
	
	
	
	для каждого ФУн из стрТипыЦен.МасивРасчетаЦен цикл
		
		Если  стрТипыЦен.МасивРасчетаЦен[фун.Ключ] = ЛОжь тогда
			Текст_сд = "РасчетПустая_" + СокрЛП(фун.Ключ)+ "(МВТЦены, стрТипыЦен);" ; 
		Иначе
			Текст_сд = "Расчет_" + СокрЛП(фун.Ключ)+ "(МВТЦены, стрТипыЦен);" ;

		КонецЕсли;   
	
	    Выполнить(Текст_сд) ;

		
		Если Отладка = истина тогда
			Сообщить(Текст_сд)
		конецЕсли;	
		
	КонецЦикла;	
	
	
	
	
	//РезультатЗапроса = РасчитатьВсюНоменклатуруВодномзапросе_старый(ПравилоРасчета, стрТипыЦен, ТипыЦен);
	//	
	//	ЦеныТипыЦенНоменклатурыПрочееЦенаСоскидкой
	//ЦеныТипыЦенНоменклатурыПрочееЦенаОпт
	//ЦеныТипыЦенНоменклатурыПрочееЦенаРекомендована
	//ЦеныТипыЦенНоменклатурыПрочееЦенаБН
	//ЦеныТипыЦенНоменклатурыПрочееРекОпт
	//ЦеныТипыЦенНоменклатурыПрочееРекОптБН
	//ЦеныТипыЦенНоменклатурыПрочееРекРозница
	//ЦеныТипыЦенНоменклатурыПрочееРекРозницаБН
	//ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная
	//ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд
	//ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд
	
	//ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд
	//ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд
	//ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд
	//ЦеныТипыЦенНоменклатурыПрочееСебестоимость
	
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст  =  "ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	1 КАК Поле1
	                 |ИЗ
	                 |	ЦеныНоменклатуры КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	2
	                 |ИЗ
	                 |	ЦеныНоменклатурыКонтрагентов КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочееЦенаСоскидкой КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочееЦенаОпт КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочееЦенаРекомендована КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочееЦенаБН КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочееРекОпт КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочееРекОптБН КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочееРекРозница КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочееРекРозницаБН КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд КАК Цены
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	Цены.Номенклатура,
	                 |	Цены.ТипЦен,
	                 |	Цены.Цена,
	                 |	NULL
	                 |ИЗ
	                 |	ЦеныТипыЦенНоменклатурыПрочееСебестоимость КАК Цены";
	РезультатЗапроса = Запрос.Выполнить();
	ТЗЦЕНЫ = РезультатЗапроса.Выгрузить();
	
	Если ТЗЦЕНЫ.Количество() = 0 тогда
		сообщить("пусто");
		Возврат;
	КонецЕсли;	
	
	ТЗЦЕНЫ.Индексы.Добавить("Номенклатура,ТипЦен");	
	
	
	Если Отладка = истина тогда
		ПЕчатьТЗ(ТЗЦЕНЫ,"ТЗЦЕНЫ " + сокрлп(ПравилоРасчета));
	КонецЕсли;	
	//
	НоменклатураПоПравилуНайдены = НоменклатураПоПравилу.НайтиСтроки(стрТипыЦен.стрОтборПравилоРасчета);     
	//НоменклатураПоПравилуНайдены = НоменклатураПоПравилу;
	
	для каждого строкатабчасти из НоменклатураПоПравилуНайдены цикл
		
		//отборТипЦЕн = новый Структура();
		//отборТипЦЕн.Вставить("Номенклатура", строкатабчасти.Номенклатура);		
		//отборТипЦЕн.Вставить("ТипЦен", строкатабчасти.ПравилоРасчета.ТипБазовойЦены);		
		//
		//
		//ТЗ = ТЗЦЕНЫ.НайтиСтроки(отборТипЦЕн);
		//Если не Тз.количество()= 0 тогда
		//	строкатабчасти.ЦенаБазовая = Тз[0].цена;
		//КонецЕсли;	
		//             
		строкатабчасти.ЦенаБазовая = _РасчитатьЦену(строкатабчасти.Номенклатура,  ТЗЦЕНЫ,  стрТипыЦен.ТипыЦен ,стрТипыЦен.ТипБазовойЦены,0);
		
		Если строкатабчасти.ЦенаБазовая = 0 тогда
			Продолжить;
		КонецЕсли ;
		
		//Если не ПравилоРасчета.НаценкаСуммой = 0 Тогда  
		//	строкатабчасти.Наценка = ПравилоРасчета.НаценкаСуммой;
		//Иначе
		//	Если не ПравилоРасчета.НаценкаПроцентом = 0 Тогда 
		//строкатабчасти.Наценка = строкатабчасти.ЦенаБазовая /100 * ПравилоРасчета.НаценкаПроцентом;
		//	КонецЕсли;
		//КонецЕсли;
		
		
		//НаценкаПроцент = строкатабчасти.ЦенаБазовая / 100 * ПравилоРасчета.НаценкаПроцентом;
		строкатабчасти.Наценка = _РасчитатьНаценкуБазова(строкатабчасти.ЦенаБазовая, ПравилоРасчета.НаценкаСуммой,ПравилоРасчета.НаценкаПроцентом);
		//ЦенаБазоваНаценкаПроцент  = строкатабчасти.ЦенаБазовая + строкатабчасти.Наценка;
		//ЦенаБазоваНаценкаСумой  = строкатабчасти.ЦенаБазовая + ПравилоРасчета.НаценкаСуммой;
		//
		строкатабчасти.ЦенаУЦ  = строкатабчасти.ЦенаБазовая + строкатабчасти.Наценка;
		
		
		//_РасчитатьЦену(строкатабчасти, ТЗЦЕНЫ, ТипыЦен);  
		//Если не ТипыЦен.НайтиПоЗначению(строкатабчасти.ПравилоРасчета.ЦенаРассчитанаНеМеньше)  = Неопределено тогда
		//
		//	отборТипЦЕн = новый Структура();
		//	отборТипЦЕн.Вставить("Номенклатура", строкатабчасти.Номенклатура);		
		//	отборТипЦЕн.Вставить("ТипЦен", строкатабчасти.ПравилоРасчета.ЦенаРассчитанаНеМеньше);		
		//	
		//	
		//	ТЗ = ТЗЦЕНЫ.НайтиСтроки(отборТипЦЕн);
		//	Если не Тз.количество()= 0 тогда
		//		строкатабчасти.ЦенаМин = Тз[0].цена;
		//	КонецЕсли;          
		//ИначеЕсли ТипЗнч(строкатабчасти.ПравилоРасчета.ЦенаРассчитанаНеМеньше) = Тип("Число") тогда
		//	строкатабчасти.ЦенаМин  = строкатабчасти.ЦенаБазовая + строкатабчасти.ПравилоРасчета.ЦенаРассчитанаНеМеньше 		
		//КонецЕсли;	   
		
		строкатабчасти.ЦенаМин = _РасчитатьЦену(строкатабчасти.Номенклатура,  ТЗЦЕНЫ,  стрТипыЦен.ТипыЦен ,стрТипыЦен.ЦенаРассчитанаНеМеньше,  строкатабчасти.ЦенаБазовая);
		НаценкаМИн = _РасчитатьНаценку(строкатабчасти.ЦенаМин, ПравилоРасчета.НаценкаСуммойЦенаРассчитанаНеМеньше,ПравилоРасчета.НаценкаПроцентомЦенаРассчитанаНеМеньше);
		строкатабчасти.ЦенаМин = строкатабчасти.ЦенаМин +НаценкаМИн;
		
		строкатабчасти.ЦенаМакс = _РасчитатьЦену(строкатабчасти.Номенклатура, ТЗЦЕНЫ,  стрТипыЦен.ТипыЦен ,стрТипыЦен.ЦенаРассчитанаНеБольше,  строкатабчасти.ЦенаБазовая);
		НаценкаМакс = _РасчитатьНаценку(строкатабчасти.ЦенаМакс, ПравилоРасчета.НаценкаСуммойЦенаРассчитанаНеБольше,ПравилоРасчета.НаценкаПроцентомЦенаРассчитанаНеБольше);
		
		строкатабчасти.ЦенаМакс = строкатабчасти.ЦенаМакс+ НаценкаМакс;
		
		ценаМин = строкатабчасти.ценаМин; //с.д. рижий 2024-02-19 
		
		Если ценаМин <= 0 тогда
			
			//с.д. рижий 2024-02-18 (
			Если ЗначениеЗаполнено(стрТипыЦен.ЦенаРассчитанаНеМеньшеПусто) тогда
			
				строкатабчасти.ЦенаРассчитанаНеМеньшеПусто = _РасчитатьЦену(строкатабчасти.Номенклатура, ТЗЦЕНЫ,  стрТипыЦен.ТипыЦен ,стрТипыЦен.ЦенаРассчитанаНеМеньшеПусто,  );
				наценкаЦенаРассчитанаНеМеньшеПусто = _РасчитатьНаценкуБазова(строкатабчасти.ЦенаРассчитанаНеМеньшеПусто,ПравилоРасчета.НаценкаСуммойЦенаРассчитанаНеМеньшеПусто,ПравилоРасчета.НаценкаПроцентомЦенаРассчитанаНеМеньшеПусто) ;
				строкатабчасти.ЦенаРассчитанаНеМеньшеПусто = строкатабчасти.ЦенаРассчитанаНеМеньшеПусто + наценкаЦенаРассчитанаНеМеньшеПусто;			
				//Если строкатабчасти.ЦенаУЦ < строкатабчасти.ЦенаГраничный  тогда
				//	строкатабчасти.ЦенаУЦ = строкатабчасти.ЦенаГраничный ;
				//	
				
				ценаМин = строкатабчасти.ЦенаРассчитанаНеМеньшеПусто;   ; //с.д. рижий 2024-02-19 
				//КонецЕсли;	
				//
			КонецЕсли;
		//с.д. рижий 2024-02-18 )
		
		КонецЕсли;	
		 
		 
		Если не ЦенаМин = 0 Тогда 
			Если строкатабчасти.ЦенаУЦ < ЦенаМин  Тогда 
				строкатабчасти.ЦенаУЦ = ЦенаМин;     
				//		флЦенаМенше = Истина;
			КонецЕсли;	     
			
		КонецЕсли;	   
		
		
		
		//Если флЦенаМенше = ложь тогда
		Если строкатабчасти.ЦенаМакс > 0  и   (ЦенаМин  < строкатабчасти.ЦенаМакс    ) Тогда      
			
			
			
			Если строкатабчасти.ЦенаУЦ > строкатабчасти.ЦенаМакс 	Тогда 
				//строкатабчасти.ЦенаУЦ = строкатабчасти.ЦенаБазовая +  ПравилоРасчета.НаценкаСуммой; 
				строкатабчасти.ЦенаУЦ = строкатабчасти.ЦенаМакс;
				
			КонецЕсли;	
			
		ИначеЕсли строкатабчасти.ЦенаМакс > 0  и   (ЦенаМин  > строкатабчасти.ЦенаМакс    ) и 	(строкатабчасти.ЦенаУЦ >= ЦенаМин  ) Тогда  
			
			
				Если строкатабчасти.ЦенаУЦ > строкатабчасти.ЦенаМакс 	Тогда 
				//строкатабчасти.ЦенаУЦ = строкатабчасти.ЦенаБазовая +  ПравилоРасчета.НаценкаСуммой; 
				строкатабчасти.ЦенаУЦ = строкатабчасти.ЦенаМакс;
				
			КонецЕсли;
			
		КонецЕсли;
		//конецЕсли;	 
		
		Если ЗначениеЗаполнено(стрТипыЦен.ЦенаГраничный) тогда
			
			строкатабчасти.ЦенаГраничный = _РасчитатьЦену(строкатабчасти.Номенклатура, ТЗЦЕНЫ,  стрТипыЦен.ТипыЦен ,стрТипыЦен.ЦенаГраничный,  );
			наценкаГраничный = _РасчитатьНаценкуБазова(строкатабчасти.ЦенаГраничный,ПравилоРасчета.НаценкаСуммойЦенаГраничный,ПравилоРасчета.НаценкаПроцентомЦенаГраничный) ;
			строкатабчасти.ЦенаГраничный = строкатабчасти.ЦенаГраничный + наценкаГраничный;			
			Если строкатабчасти.ЦенаУЦ < строкатабчасти.ЦенаГраничный  тогда
				строкатабчасти.ЦенаУЦ = строкатабчасти.ЦенаГраничный ;
				

			КонецЕсли;	
			
		КонецЕсли;
		
		
		
		
		строкатабчасти.Прибыль = строкатабчасти.ЦенаУЦ -  строкатабчасти.ЦенаБазовая;      
		строкатабчасти.ПрибыльПроцент =  строкатабчасти.Прибыль/   строкатабчасти.ЦенаБазовая *100; 
		
		Если не строкатабчасти.ЦенаУЦ = 0 тогда
			строкатабчасти.УЦ = ложь;   
			
			_структураХранилища = новый Структура();
			_структураХранилища.Вставить("Номенклатура",строкатабчасти.Номенклатура);
			_структураХранилища.Вставить("ЦенаУЦ",строкатабчасти.ЦенаУЦ);
			_структураХранилища.Вставить("Строкатз",строкатабчасти);  
			_структураХранилища.Вставить("НомерСтроки",строкатабчасти.НомерСтроки);
			
			_хранилище.Вставить(строкатабчасти.ПолеДляПоиска,_структураХранилища);
		Конецесли;	 
		
		
		
		//строкатабчасти.avg_price = строкатабчасти.Номенклатура.avg_price;
		//строкатабчасти.min_price = строкатабчасти.Номенклатура.min_price;
		//строкатабчасти.max_price = строкатабчасти.Номенклатура.max_price;
		//строкатабчасти.card_popularity = строкатабчасти.Номенклатура.card_popularity;
		//строкатабчасти.count_stores = строкатабчасти.Номенклатура.count_stores;
		//
		
		//строкатабчасти.avg_price_compared = строкатабчасти.Номенклатура.avg_price_compared;     
		Если  не  строкатабчасти.avg_price = 0 тогда
			строкатабчасти.VS_avg_price = строкатабчасти.ЦенаУЦ - строкатабчасти.avg_price;
			строкатабчасти.VS_avg_price_процент = строкатабчасти.VS_avg_price / (строкатабчасти.ЦенаУЦ/100) ;
			
		КонецЕсли;	                
		Если не  строкатабчасти.max_price = 0 тогда 
			строкатабчасти.VS_max_price = строкатабчасти.ЦенаУЦ - строкатабчасти.max_price;
			строкатабчасти.VS_max_price_процент = строкатабчасти.VS_max_price/ (строкатабчасти.ЦенаУЦ/100);
	
		Конецесли;
		
		Если не строкатабчасти.min_price = 0 тогда 
		
			строкатабчасти.VS_min_price = строкатабчасти.ЦенаУЦ - строкатабчасти.min_price; 
			строкатабчасти.VS_min_price_процент = строкатабчасти.VS_min_price/(строкатабчасти.ЦенаУЦ/100 ); 
		
		конецЕсли;
		
		Если не строкатабчасти.avg_price_compared = 0 тогда
			строкатабчасти.VS_avg_price_compared = строкатабчасти.ЦенаУЦ - строкатабчасти.avg_price_compared;
			строкатабчасти.VS_avg_price_compared_процент =  строкатабчасти.VS_avg_price_compared/ ( строкатабчасти.ЦенаУЦ/100);

		КонецЕсли;
		
		Если не  строкатабчасти.min_price_compared = 0 тогда
			строкатабчасти.VS_min_price_compared = строкатабчасти.ЦенаУЦ - строкатабчасти.min_price_compared; 
			строкатабчасти.VS_min_price_compared_процент = строкатабчасти.VS_min_price_compared/ (строкатабчасти.ЦенаУЦ/100);

		конеЦесли;
		
		Если не строкатабчасти.max_price_compared = 0 тогда
			строкатабчасти.VS_max_price_compared = строкатабчасти.ЦенаУЦ - строкатабчасти.max_price_compared;  
			строкатабчасти.VS_max_price_compared_процент =  строкатабчасти.VS_max_price_compared /(строкатабчасти.ЦенаУЦ/100);

		конецесли; 
		
		//СтараяЦена   
		УсловияСтаройЦены = стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.УсловияСтаройЦены;
		ТипСтаройЦены = стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.ТипСтаройЦены; 
		
		Если Не ЗначениеЗаполнено(ТипСтаройЦены) И УсловияСтаройЦены = "" тогда
			строкатабчасти.СтараяЦена = 0;
			Продолжить;
		Иначе
			
			Если УсловияСтаройЦены <> "" тогда
				Если строкатабчасти[УсловияСтаройЦены] >= стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.НаценкаСтаройЦеныОт И строкатабчасти[УсловияСтаройЦены] <= стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.НаценкаСтаройЦеныДо И НЕ строкатабчасти[УсловияСтаройЦены] = 0 тогда
					Если ЗначениеЗаполнено(ТипСтаройЦены) тогда
						ЦенаХотлайн = _РасчитатьЦену(строкатабчасти.Номенклатура,  ТЗЦЕНЫ,  стрТипыЦен.ТипыЦен , ТипСтаройЦены,0);
						
						//Если ЦенаХотлайн = Неопределено тогда
						//	строкатабчасти.СтараяЦена = строкатабчасти.ЦенаУЦ + _РасчитатьСтаруюЦену(строкатабчасти.ЦенаУЦ,стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.НаценкаСуммойСтаройЦены,стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.НаценкаПроцентомСтаройЦены); 	
						//КонецЕсли;
						//
						СтараяЦенаНаценка = _РасчитатьСтаруюЦену(строкатабчасти.ЦенаУЦ,стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.НаценкаСуммойСтаройЦены,стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.НаценкаПроцентомСтаройЦены);
						строкатабчасти.СтараяЦена = строкатабчасти.ЦенаУЦ + СтараяЦенаНаценка;
						
						строкатабчасти.СтараяЦена = Макс(ЦенаХотлайн,строкатабчасти.СтараяЦена);  
						
						//
						//строкатабчасти.СтараяЦена = строкатабчасти.ЦенаУЦ + _РасчитатьСтаруюЦену(строкатабчасти.ЦенаУЦ,стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.НаценкаСуммойСтаройЦены,стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.НаценкаПроцентомСтаройЦены);
						
						
						Если  строкатабчасти.СтараяЦена < строкатабчасти.ЦенаУЦ тогда
							строкатабчасти.СтараяЦена = 0;		
						КонецЕсли;
					Иначе
						  строкатабчасти.СтараяЦена = 0; 
						//строкатабчасти.СтараяЦена = строкатабчасти.ЦенаУЦ + _РасчитатьСтаруюЦену(строкатабчасти.ЦенаУЦ,стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.НаценкаСуммойСтаройЦены,стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.НаценкаПроцентомСтаройЦены);
					КонецЕсли;
				Иначе
					строкатабчасти.СтараяЦена = 0; 	
				КонецЕсли;
			Иначе
				строкатабчасти.СтараяЦена = строкатабчасти.ЦенаУЦ + _РасчитатьСтаруюЦену(строкатабчасти.ЦенаУЦ,стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.НаценкаСуммойСтаройЦены,стрТипыЦен.стрОтборПравилоРасчета.ПравилоРасчета.НаценкаПроцентомСтаройЦены);
			КонецЕсли;
			
		КонецЕсли;

		
	КонецЦикла;	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	ВывестиКоментарий("}Расчет" , ПравилоРасчета );
	
КонецПроцедуры


Функция  ЗапросЗаполнения_ВсюНоменклатуруУстановитьПараметры(ПравилоРасчета)
	
	Перем Использовать_ОтборПоГородам, Использовать_ОтборПоДоговорКонтрагента, Использовать_ОтборПоПоставщикам;
	
	
	
	Если ложь тогда
		ПравилоРасчета = Справочники.ПравилаРасчетаЦен_СД.ПустаяСсылка();
	КонецЕсли;	     
	
	
	ТипыЦен = НОвый СписокЗначений();  
	стрТипыЦен = Новый Структура();	                             
	
	
	
	//стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатуры", Ложь);   
	
	//МасивПараметровЗапонения  
	стрТипыЦен.Вставить("МасивРасчетаЦен",Новый Соответствие);
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыКонтрагентов", Ложь); 
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатуры", Ложь);
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ВНаличии", Ложь);
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_Номенклатура", ИстиНА);
	
	
	Если ТипЗнч(ПравилоРасчета.ТипБазовойЦены) = тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов")  тогда
		стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыКонтрагентов", иСТИНА); 
		стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_Номенклатура", ЛОЖЬ);
		
	КонецЕсли;   
	
	
	Если ТипЗнч(ПравилоРасчета.ТипБазовойЦены) = тип("СправочникСсылка.ТипыЦенНоменклатуры")  тогда
		стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатуры", иСТИНА); 
		стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_Номенклатура", ЛОЖЬ);
		
	КонецЕсли;   
	
	
	
	
	
	Если ЗначениеЗаполнено(ПравилоРасчета.ВНаличии)  или  ПравилоРасчета.Поставщики.Количество() или ПравилоРасчета.ДоговораКонтрагента.Количество() тогда 
		
		стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ВНаличии", истина);  
		стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_Номенклатура", ЛОЖЬ);
		
		
	КонецЕсли;
	
	
	Использовать_ОтборБУ		     = ?(ЗначениеЗаполнено(ПравилоРасчета.БУ), Истина, Ложь);
	Использовать_ОтборНоменклатура           = ?(ПравилоРасчета.Номенклатура.Количество() <> 0, Истина, Ложь);
	Использовать_ОтборПоТипуНоменклатуры     = ?(ПравилоРасчета.ТипыНоменклатуры.Количество() <> 0, Истина, Ложь);
	Использовать_ОтборПоДиаметру		     = ?(ПравилоРасчета.Диаметры.Количество() <> 0, Истина, Ложь);
	Использовать_ОтборПоСезону			     = ?(ПравилоРасчета.Сезоны.Количество() <> 0, Истина, Ложь);
	Использовать_ОтборПоПоставщикам		     = ?(ПравилоРасчета.Поставщики.Количество() <> 0, Истина, Ложь);
	Использовать_ОтборПоШирине			     = ?(ПравилоРасчета.Ширина.Количество() <> 0, Истина, Ложь);
	//с.д. рижий 2023-10-01 (
	//с.д. Рижий 2023-10-01 )
	Использовать_ОтборПоВысотеПрофиля	     = ?(ПравилоРасчета.ВысотаПрофиля.Количество() <> 0, Истина, Ложь);
	//Использовать_ОтборОстатокНеМеньше        = ?(ПравилоРасчета.ОстатокНаСкладеНеМеньше <> 0, Истина, Ложь);
	//Использовать_ОтборОстатокНеБольше        = ?(ПравилоРасчета.ОстатокНаСкладеНеБольше <> 0, Истина, Ложь);
	
	Использовать_ОтборОстаток		     = ?(ЗначениеЗаполнено(ПравилоРасчета.ВНаличии), Истина, Ложь);
	
	




	стрТипыЦен.Вставить("Использовать_ОтборОстаток",Использовать_ОтборОстаток );
	стрТипыЦен.Вставить("ВНаличии", ?(ПравилоРасчета.ВНаличии = Перечисления.ДаНет_сд.Да, Истина, Ложь));
	
	
	
	
	стрТипыЦен.Вставить("ТипЦен", ПравилоРасчета.ТипБазовойЦены);

	//                                                                                                 
	стрТипыЦен.Вставить("Использовать_ОтборНоменклатура", Использовать_ОтборНоменклатура);
	стрТипыЦен.Вставить("СписокНоменклатуры", ПравилоРасчета.Номенклатура.ВыгрузитьКолонку("Номенклатура"));
	
	стрТипыЦен.Вставить("Использовать_ОтборПоТипуНоменклатуры", Использовать_ОтборПоТипуНоменклатуры);
	стрТипыЦен.Вставить("СписокТиповНоменклатуры", ПравилоРасчета.ТипыНоменклатуры.ВыгрузитьКолонку("ТипНоменклатуры"));
	
	стрТипыЦен.Вставить("Использовать_ОтборПоДиаметру", Использовать_ОтборПоДиаметру);
	стрТипыЦен.Вставить("СписокДиаметров", ПравилоРасчета.Диаметры.ВыгрузитьКолонку("Диаметр"));
	
	стрТипыЦен.Вставить("Использовать_ОтборПоСезону", Использовать_ОтборПоСезону);
	стрТипыЦен.Вставить("СписокСезонов", ПравилоРасчета.Сезоны.ВыгрузитьКолонку("Сезон"));
	
	стрТипыЦен.Вставить("Использовать_ОтборПоПоставщикам", Использовать_ОтборПоПоставщикам);
	стрТипыЦен.Вставить("СписокПоставщиков", ПравилоРасчета.Поставщики.ВыгрузитьКолонку("Поставщик"));
	
	//с.д. рижий 2023-10-01 (   
	
	стрТипыЦен.Вставить("ДатаОст",ДатаДокументов);
	
	Использовать_ОтборПоВидуНоменлкатуры	 = ?(ПравилоРасчета.ВидыНоменклатуры.Количество() <> 0, Истина, Ложь);
	стрТипыЦен.Вставить("Использовать_ОтборПоВидуНоменлкатуры", Использовать_ОтборПоВидуНоменлкатуры);
	стрТипыЦен.Вставить("СписокВидыНоменклатуры", ПравилоРасчета.ВидыНоменклатуры.ВыгрузитьКолонку("ВидНоменклатуры"));
	
	
	стрТипыЦен.Вставить("Города", ПравилоРасчета.Города.ВыгрузитьКолонку("Город"));
	Использовать_ОтборПоГородам		     = ?(ПравилоРасчета.Города.Количество() <> 0, Истина, Ложь);
	стрТипыЦен.Вставить("Использовать_ОтборПоГородам", Использовать_ОтборПоГородам);
	
	
	стрТипыЦен.Вставить("Поставщики", ПравилоРасчета.Поставщики.ВыгрузитьКолонку("Поставщик"));   
	Использовать_ОтборПоПоставщикам		     = ?(ПравилоРасчета.Поставщики.Количество() <> 0, Истина, Ложь);
	стрТипыЦен.Вставить("Использовать_ОтборПоПоставщикам",Использовать_ОтборПоПоставщикам);   
	
	стрТипыЦен.Вставить("ПоставщикиТекст", ПравилоРасчета.ПоставщикиТекст.ВыгрузитьКолонку("Поставщик"));   
	Использовать_ОтборПоПоставщикамТекст		     = ?(ПравилоРасчета.ПоставщикиТекст.Количество() <> 0, Истина, Ложь);
	стрТипыЦен.Вставить("Использовать_ОтборПоПоставщикамТекст",Использовать_ОтборПоПоставщикамТекст);   
	
	
	стрТипыЦен.Вставить("СписокПроизводители", ПравилоРасчета.Производители.ВыгрузитьКолонку("Производитель"));   
	Использовать_ОтборПроизводители		     = ?(ПравилоРасчета.Производители.Количество() <> 0, Истина, Ложь);
	стрТипыЦен.Вставить("Использовать_ОтборПроизводители",Использовать_ОтборПроизводители);   
	
	
	стрТипыЦен.Вставить("Использовать_ПоставщикиТекстИсключение", ПравилоРасчета.ПоставщикиТекстИсключение);
	стрТипыЦен.Вставить("Использовать_ПроизводителиИсключение", ПравилоРасчета.ПроизводителиИсключение);
	стрТипыЦен.Вставить("Использовать_ГородИсключение", ПравилоРасчета.ГородИсключение);
	стрТипыЦен.Вставить("Использовать_НоменклатураИсключение", ПравилоРасчета.НоменклатураИсключение);
	
	
	
	стрТипыЦен.Вставить("ДоговораКонтрагента", ПравилоРасчета.ДоговораКонтрагента.ВыгрузитьКолонку("ДоговорКонтрагента"));   
	Использовать_ОтборПоДоговорКонтрагента	     = ?(ПравилоРасчета.ДоговораКонтрагента.Количество() <> 0, Истина, Ложь);
	стрТипыЦен.Вставить("Использовать_ОтборПоДоговорКонтрагента",Использовать_ОтборПоДоговорКонтрагента);   
	
	
	//с.д. рижий 2023-10-1    
	стрТипыЦен.Вставить("Использовать_ОтборБУ",Использовать_ОтборБУ );
	стрТипыЦен.Вставить("БУ", ?(ПравилоРасчета.БУ = Перечисления.ДаНет_сд.Да, Истина, Ложь));
	
	
	стрТипыЦен.Вставить("Использовать_ОтборПоШирине", Использовать_ОтборПоШирине);
	стрТипыЦен.Вставить("СписокШирины", ПравилоРасчета.Ширина.ВыгрузитьКолонку("Ширина"));
	
	стрТипыЦен.Вставить("Использовать_ОтборПоВысотеПрофиля", Использовать_ОтборПоВысотеПрофиля);
	стрТипыЦен.Вставить("СписокВысотПрофилей", ПравилоРасчета.ВысотаПрофиля.ВыгрузитьКолонку("Профиль"));
	
	//с.д. рижий 2023-10-05 (
	//стрТипыЦен.Вставить("Использовать_ОтборОстатокНеМеньше", Использовать_ОтборОстатокНеМеньше);
	//стрТипыЦен.Вставить("ОстатокНаСкладеНеМеньше", ПравилоРасчета.ОстатокНаСкладеНеМеньше);
	//
	//стрТипыЦен.Вставить("Использовать_ОтборОстатокНеБольше", Использовать_ОтборОстатокНеБольше);
	//стрТипыЦен.Вставить("ОстатокНаСкладеНеБольше", ПравилоРасчета.ОстатокНаСкладеНеБольше);
	//стрТипыЦен.Вставить("Использовать_ОтборОстаток", Использовать_ОтборОстатокНеМеньше);
	//с.д. рижий 2023-10-05 (
	//                                                                
	стрТипыЦен.Вставить("ТипЦеныРассчитанной", ПравилоРасчета.ТипЦеныРассчитанной);  
	стрТипыЦен.Вставить("ПравилоРасчета", ПравилоРасчета);  
	стрТипыЦен.Вставить("КонтрагентУЦ", ПравилоРасчета.КонтрагентУЦ);  
	стрТипыЦен.Вставить("Приоритет", ПравилоРасчета.Приоритет);
	стрТипыЦен.Вставить("УЦ", ложь);
	
	
	
	
	Возврат стрТипыЦен;
КонецФункции



Функция  Расчет_ВсюНоменклатуруУстановитьПараметры(ПравилоРасчета)
	
	Перем Использовать_ОтборПоГородам, Использовать_ОтборПоДоговорКонтрагента, Использовать_ОтборПоПоставщикам;
	
	
	
	Если ложь тогда
		ПравилоРасчета = Справочники.ПравилаРасчетаЦен_СД.ПустаяСсылка();
	КонецЕсли;	     
	
	
	ТипыЦен = НОвый СписокЗначений();  
	стрТипыЦен = Новый Структура();	                
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатуры", Ложь);   
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыКонтрагентов", Ложь);  
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_сд", ложь);  
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_СебестоимостьНаша_сд", ложь);  
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаСоСкидкой_сд", ложь);
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаРекомендованая_сд", ложь);
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаОпт_сд", ложь);
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаБН_сд", ложь);
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекРозницаБН_сд", ложь);
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекРозница_сд", ложь);
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекОптБН_сд", ложь);
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекОпт_сд", ложь);       
	
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд", ложь);
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд", ложь);
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд", ложь);
	
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд", ложь);
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд", ложь);
	стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд", ложь);
	
	стрТипыЦен.Вставить("МасивРасчетаЦен",Новый Соответствие);
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатуры", ложь);
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыКонтрагентов", ложь)  ;
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_СебестоимостьНаша_сд", ложь);
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаСоСкидкой_сд", ложь);
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекОпт_сд", ложь)            ;
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекОптБН_сд", ложь)         ;
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекРозница_сд", ложь)        ;
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекРозницаБН_сд", ложь)      ;
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаБН_сд", ложь)            ;
	
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаОпт_сд", ложь)           ;
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаРекомендованая_сд", ложь);
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд", ложь) ;
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд", ложь)  ;
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд", ложь)                ;
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд", ложь)           ;
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд", ложь)                ;
	
	стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд", ложь)                ;
	
	
	
	
	ТИпЦенСписок(ПравилоРасчета.ТипБазовойЦены, ТипыЦен,стрТипыЦен);
	ТИпЦенСписок(ПравилоРасчета.ЦенаРассчитанаНеБольше, ТипыЦен,стрТипыЦен);
	ТИпЦенСписок(ПравилоРасчета.ЦенаРассчитанаНеМеньше, ТипыЦен,стрТипыЦен);
	ТИпЦенСписок(ПравилоРасчета.ЦенаГраничный, ТипыЦен,стрТипыЦен);
	ТИпЦенСписок(ПравилоРасчета.ЦенаРассчитанаНеМеньшеПусто, ТипыЦен,стрТипыЦен);//с.д. рижий 2024-02-18
	//+БП: d.matyash (04.09.2025) <>     
	ТИпЦенСписок(ПравилоРасчета.ТипСтаройЦены, ТипыЦен,стрТипыЦен);
	//-БП: d.matyash (04.09.2025) <>
	
	стрТипыЦен.Вставить("ТипыЦен",ТипыЦен);
	
	стрОтборПравилоРасчета = Новый Структура();
	стрОтборПравилоРасчета.Вставить("ПравилоРасчета",ПравилоРасчета);
	стрТипыЦен.Вставить("ТаблицаНоменлкатура",  НоменклатураПоПравилу.Выгрузить(стрОтборПравилоРасчета,"Номенклатура") );
	стрТипыЦен.Вставить("ПравилоРасчета",ПравилоРасчета);
	стрТипыЦен.Вставить("стрОтборПравилоРасчета",стрОтборПравилоРасчета);
	
	
	стрТипыЦен.Вставить("ДатаДокументов", ДатаДокументов);
	
	стрТипыЦен.Вставить("Города", ПравилоРасчета.Города.ВыгрузитьКолонку("Город"));
	Использовать_ОтборПоГородам		     = ?(ПравилоРасчета.Города.Количество() <> 0, Истина, Ложь);
	стрТипыЦен.Вставить("Использовать_ОтборПоГородам", Использовать_ОтборПоГородам);
	
	стрТипыЦен.Вставить("Поставщики", ПравилоРасчета.Поставщики.ВыгрузитьКолонку("Поставщик"));   
	Использовать_ОтборПоПоставщикам		     = ?(ПравилоРасчета.Поставщики.Количество() <> 0, Истина, Ложь);
	стрТипыЦен.Вставить("Использовать_ОтборПоПоставщикам",Использовать_ОтборПоПоставщикам);   
	
	
	стрТипыЦен.Вставить("ДоговораКонтрагента", ПравилоРасчета.ДоговораКонтрагента.ВыгрузитьКолонку("ДоговорКонтрагента"));   
	Использовать_ОтборПоДоговорКонтрагента	     = ?(ПравилоРасчета.ДоговораКонтрагента.Количество() <> 0, Истина, Ложь);
	стрТипыЦен.Вставить("Использовать_ОтборПоДоговорКонтрагента",Использовать_ОтборПоДоговорКонтрагента);   
	
	
	//стрТипыЦен.Вставить("ТипыЦен", ТипыЦен);
	//стрТипыЦен.Вставить("ТаблицаНоменлкатура", НоменклатураПоПравилу.Выгрузить(стрОтборПравилоРасчета,"Номенклатура,ПравилоРасчета"));
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочееЦенаОпт", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаОпт);
	стрТипыЦен.Вставить("ТипБазовойЦены", ПравилоРасчета.ТипБазовойЦены);
	//+БП: d.matyash (04.09.2025) <>       
	стрТипыЦен.Вставить("ТипСтаройЦены", ПравилоРасчета.ТипСтаройЦены);
	//-БП: d.matyash (04.09.2025) <> 	  
	
	стрТипыЦен.Вставить("ЦенаРассчитанаНеМеньше", ПравилоРасчета.ЦенаРассчитанаНеМеньше);
	стрТипыЦен.Вставить("ЦенаРассчитанаНеБольше", ПравилоРасчета.ЦенаРассчитанаНеБольше);
	стрТипыЦен.Вставить("ТипЦеныРассчитанной", ПравилоРасчета.ТипЦеныРассчитанной); 
	стрТипыЦен.Вставить("ЦенаГраничный", ПравилоРасчета.ЦенаГраничный); 
	стрТипыЦен.Вставить("ЦенаРассчитанаНеМеньшеПусто", ПравилоРасчета.ЦенаРассчитанаНеМеньшеПусто);//с.д. рижий 2024-02-18 
	
	
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочееЦенаРекомендована", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаРекомендованая);
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочееЦенаСоскидкой", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаСоСкидкой);
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочееСебестоимость", Справочники.ТипыЦенНоменклатурыПрочее_сд.СебестоимостьНаша);
	
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочееЦенаБН", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаБН);
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочееРекОпт", Справочники.ТипыЦенНоменклатурыПрочее_сд.РекОпт);
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочееРекОптБН", Справочники.ТипыЦенНоменклатурыПрочее_сд.РекОптБН);
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочееРекРозница", Справочники.ТипыЦенНоменклатурыПрочее_сд.РекРозница);
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочееРекРозницаБН", Справочники.ТипыЦенНоменклатурыПрочее_сд.РекРозницаБН);
	стрТипыЦен.Вставить("ТипыЦенНачалоная", Справочники.ТипыЦенНоменклатурыПрочее_сд.ПустаяСсылка());
	
	
	
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнКонкурентыМаксимальная);
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнКонкурентыМинимальная);
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнКонкурентыСредняя);
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнМаксимальная);
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнСредняя);
	стрТипыЦен.Вставить("ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнМинимальная);
	
	
	стрТипыЦен.Вставить("Использовать_ПоставщикиТекстИсключение", ПравилоРасчета.ПоставщикиТекстИсключение);
	стрТипыЦен.Вставить("Использовать_ПроизводителиИсключение", ПравилоРасчета.ПроизводителиИсключение);
	стрТипыЦен.Вставить("Использовать_ГородИсключение", ПравилоРасчета.ГородИсключение);
	стрТипыЦен.Вставить("Использовать_НоменклатураИсключение", ПравилоРасчета.НоменклатураИсключение);
	
	
	Возврат стрТипыЦен;
КонецФункции


Функция РасчетПустая_Есть_ТипыЦенНоменклатуры(МВТЦены, Знач стрТипыЦен)
	
	
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныНоменклатуры
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции


Функция Расчет_Есть_ТипыЦенНоменклатуры(МВТЦены,стрТипыЦен)
	
	
	Запрос = Новый Запрос(); 
	
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен,
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ПОМЕСТИТЬ ЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаДокументов,
	|			ТипЦен В (&ТипыЦен)
	|				И Номенклатура В (&ТаблицаНоменлкатура)) КАК ЦеныНоменклатурыСрезПоследних";	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]);  
		
	конецЦикла;
	
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции


Функция РасчетПустая_Есть_ТипыЦенНоменклатурыКонтрагентов(МВТЦены, Знач стрТипыЦен)
	
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныНоменклатурыКонтрагентов
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
КонецФункции


Функция Расчет_Есть_ТипыЦенНоменклатурыКонтрагентов(МВТЦены, Знач стрТипыЦен)
	
	
	
	
	Запрос = новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыКонтрагентовСрезПоследних.ТипЦен,
	|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена
	|ПОМЕСТИТЬ ЦеныНоменклатурыКонтрагентов
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	|			&ДатаДокументов,
	|			ТипЦен В (&ТипыЦен)
	|				И Номенклатура В (&ТаблицаНоменлкатура)
	|				И ВЫБОР
	|					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	|						ТОГДА ТипЦен.Владелец В (&Поставщики)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	|							И &Использовать_ГородИсключение = ЛОЖЬ
	|						ТОГДА МІСТО В (&Города)
	|					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	|							И &Использовать_ГородИсключение = ИСТИНА
	|						ТОГДА НЕ МІСТО В (&Города)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних";	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции







Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_ЦенаСоСкидкой_сд(МВТЦены, Знач стрТипыЦен)    
	
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееЦенаСоскидкой
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
	
КонецФункции



Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_ЦенаСоСкидкой_сд(МВТЦены, Знач стрТипыЦен)
	
	
	Запрос = новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НоменклатураПоставщикаОстатки_СДСрезПоследних.НоменклатураПоставщика.Номенклатура КАК Номенклатура,
	               |	&ТипыЦенНоменклатурыПрочееЦенаСоскидкой КАК ТипЦен,
	               |	НоменклатураПоставщикаОстатки_СДСрезПоследних.ЦенаСоСкидкой КАК Цена
	               |ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееЦенаСоскидкой
	               |ИЗ
	               |	РегистрСведений.НоменклатураПоставщикаОстатки_СД.СрезПоследних(
	               |			&ДатаДокументов,
	               |			ВЫБОР
	               |					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	               |						ТОГДА НоменклатураПоставщика.Владелец В (&Поставщики)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И НоменклатураПоставщика.Номенклатура В (&ТаблицаНоменлкатура)) КАК НоменклатураПоставщикаОстатки_СДСрезПоследних" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции




Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_ЦенаОпт_сд(МВТЦены, Знач стрТипыЦен)    
	
	
	
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееЦенаОпт
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
	
КонецФункции



Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_ЦенаОпт_сд(МВТЦены, Знач стрТипыЦен)
	
	
	//еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаОпт_сд = Ложь ТОГДА   
	//Запрос.Текст = Запрос.Текст  +"
	//
	//
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ТЗНом.Номенклатура,
	//|	&ТипыЦенНоменклатурыПрочееЦенаОпт,
	//|	НоменклатураПоставщикаОстатки_СДСрезПоследних.ЦенаОпт
	//|ИЗ
	//|	ТЗНом КАК ТЗНом
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПоставщикаОстатки_СД.СрезПоследних(
	//|				&ДатаДокументов,
	//|				ВЫБОР
	//|					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	//|						ТОГДА НоменклатураПоставщика.Владелец В (&Поставщики)
	//|					ИНАЧЕ ИСТИНА
	//|				КОНЕЦ) КАК НоменклатураПоставщикаОстатки_СДСрезПоследних
	//|		ПО ТЗНом.Номенклатура = НоменклатураПоставщикаОстатки_СДСрезПоследних.НоменклатураПоставщика.Номенклатура
	//|";	
	//КОНЕЦеСЛИ;
	
	
	
	
	Запрос = новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НоменклатураПоставщикаОстатки_СДСрезПоследних.НоменклатураПоставщика.Номенклатура КАК Номенклатура,
	               |	&ТипыЦенНоменклатурыПрочееЦенаОпт КАК ТипЦен,
	               |	НоменклатураПоставщикаОстатки_СДСрезПоследних.ЦенаОпт КАК Цена
	               |ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееЦенаОпт
	               |ИЗ
	               |	РегистрСведений.НоменклатураПоставщикаОстатки_СД.СрезПоследних(
	               |			&ДатаДокументов,
	               |			ВЫБОР
	               |					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	               |						ТОГДА НоменклатураПоставщика.Владелец В (&Поставщики)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И НоменклатураПоставщика.Номенклатура В (&ТаблицаНоменлкатура)) КАК НоменклатураПоставщикаОстатки_СДСрезПоследних" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции


Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_ЦенаРекомендованая_сд(МВТЦены, Знач стрТипыЦен)    
	
	
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееЦенаРекомендована
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
	
КонецФункции



Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_ЦенаРекомендованая_сд(МВТЦены, Знач стрТипыЦен)
	
	//
	//	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаРекомендованая_сд = ИСТИНА ТОГДА
	//	Запрос.Текст = Запрос.Текст  +"
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ТЗНом.Номенклатура,
	//	|	&ТипыЦенНоменклатурыПрочееЦенаРекомендована,
	//	|	НоменклатураПоставщикаОстатки_СДСрезПоследних.ЦенаРекомендована
	//	|ИЗ
	//	|	ТЗНом КАК ТЗНом
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПоставщикаОстатки_СД.СрезПоследних(
	//	|				&ДатаДокументов,
	//	|				ВЫБОР
	//	|					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	//	|						ТОГДА НоменклатураПоставщика.Владелец В (&Поставщики)
	//	|					ИНАЧЕ ИСТИНА
	//	|				КОНЕЦ) КАК НоменклатураПоставщикаОстатки_СДСрезПоследних
	//	|		ПО ТЗНом.Номенклатура = НоменклатураПоставщикаОстатки_СДСрезПоследних.НоменклатураПоставщика.Номенклатура
	//	|";	
	//КОНЕЦеСЛИ;
	
	
	
	Запрос = новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НоменклатураПоставщикаОстатки_СДСрезПоследних.НоменклатураПоставщика.Номенклатура КАК Номенклатура,
	               |	&ТипыЦенНоменклатурыПрочееЦенаРекомендована КАК ТипЦен,
	               |	НоменклатураПоставщикаОстатки_СДСрезПоследних.ЦенаРекомендована КАК Цена
	               |ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееЦенаРекомендована
	               |ИЗ
	               |	РегистрСведений.НоменклатураПоставщикаОстатки_СД.СрезПоследних(
	               |			&ДатаДокументов,
	               |			ВЫБОР
	               |					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	               |						ТОГДА НоменклатураПоставщика.Владелец В (&Поставщики)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И НоменклатураПоставщика.Номенклатура В (&ТаблицаНоменлкатура)) КАК НоменклатураПоставщикаОстатки_СДСрезПоследних" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции


Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_ЦенаБН_сд(МВТЦены, Знач стрТипыЦен)    
	
	
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееЦенаБН
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
КонецФункции


Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_ЦенаБН_сд(МВТЦены, Знач стрТипыЦен)
	
	//
	//еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаБН_сд = ИСТИНА ТОГДА
	//	Запрос.Текст = Запрос.Текст  +"	
	//	
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ТЗНом.Номенклатура,
	//|	&ТипыЦенНоменклатурыПрочееЦенаБН,
	//|	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.ЦенаБН КАК ЧИСЛО)
	//|ИЗ
	//|	ТЗНом КАК ТЗНом
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	//|				&ДатаДокументов,
	//|				ТипЦен В (&ТипыЦен)
	//|					И ВЫБОР
	//|						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	//|							ТОГДА ТипЦен.Владелец В (&Поставщики)
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И ВЫБОР
	//|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	//|								И &Использовать_ГородИсключение = ЛОЖЬ
	//|							ТОГДА МІСТО В (&Города)
	//|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	//|								И &Использовать_ГородИсключение = ИСТИНА
	//|							ТОГДА НЕ МІСТО В (&Города)
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	//	|		ПО ТЗНом.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	//	|";	 
	
	
	
	//
	Запрос = новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
	               |	&ТипыЦенНоменклатурыПрочееЦенаБН КАК ТипЦен,
	               |	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.ЦенаБН КАК ЧИСЛО) КАК Цена
	               |ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееЦенаБН
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	               |			&ДатаДокументов,
	               |			ТипЦен В (&ТипыЦен)
	               |				И Номенклатура В (&ТаблицаНоменлкатура)
	               |				И ВЫБОР
	               |					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	               |						ТОГДА ТипЦен.Владелец В (&Поставщики)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	               |							И &Использовать_ГородИсключение = ЛОЖЬ
	               |						ТОГДА МІСТО В (&Города)
	               |					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	               |							И &Использовать_ГородИсключение = ИСТИНА
	               |						ТОГДА НЕ МІСТО В (&Города)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции    

Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_РекОпт_сд(МВТЦены, Знач стрТипыЦен)    
	
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееРекОпт
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
	
КонецФункции



Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_РекОпт_сд(МВТЦены, Знач стрТипыЦен)
	
	//еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_РекОпт_сд = ИСТИНА ТОГДА
	//Запрос.Текст = Запрос.Текст  +"	
	//
	//
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ТЗНом.Номенклатура,
	//|	&ТипыЦенНоменклатурыПрочееРекОпт,
	//|	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.РекОпт КАК ЧИСЛО)
	//|ИЗ
	//|	ТЗНом КАК ТЗНом
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	//|				&ДатаДокументов,
	//|				ТипЦен В (&ТипыЦен)
	//|					И ВЫБОР
	//|						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	//|							ТОГДА ТипЦен.Владелец В (&Поставщики)
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ
	//|					И ВЫБОР
	//|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	//|								И &Использовать_ГородИсключение = ЛОЖЬ
	//|							ТОГДА МІСТО В (&Города)
	//|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	//|								И &Использовать_ГородИсключение = ИСТИНА
	//|							ТОГДА НЕ МІСТО В (&Города)
	//|						ИНАЧЕ ИСТИНА
	//|					КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	//|		ПО ТЗНом.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	//|";	                                
	
	
	
	Запрос = новый Запрос();
	
	
	
	
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
	|	&ТипыЦенНоменклатурыПрочееРекОпт КАК ТипЦен,
	|	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.РекОпт КАК ЧИСЛО) КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееРекОпт
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	|			&ДатаДокументов,
	|			ТипЦен В (&ТипыЦен)
	|				И Номенклатура В (&ТаблицаНоменлкатура)
	|				И ВЫБОР
	|					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	|						ТОГДА ТипЦен.Владелец В (&Поставщики)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	|							И &Использовать_ГородИсключение = ЛОЖЬ
	|						ТОГДА МІСТО В (&Города)
	|					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	|							И &Использовать_ГородИсключение = ИСТИНА
	|						ТОГДА НЕ МІСТО В (&Города)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_РекОптБН_сд(МВТЦены, Знач стрТипыЦен)    
	
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееРекОптБН
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
	
КонецФункции


Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_РекОптБН_сд(МВТЦены, Знач стрТипыЦен)
	
	//	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_РекОптБН_сд = ИСТИНА ТОГДА
	//	Запрос.Текст = Запрос.Текст  +"	
	//	
	//	
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ТЗНом.Номенклатура,
	//	|	&ТипыЦенНоменклатурыПрочееРекОптБН,
	//	|	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.РекОптБН КАК ЧИСЛО)
	//	|ИЗ
	//	|	ТЗНом КАК ТЗНом
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	//	|				&ДатаДокументов,
	//	|				ТипЦен В (&ТипыЦен)
	//	|					И ВЫБОР
	//	|						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	//	|							ТОГДА ТипЦен.Владелец В (&Поставщики)
	//	|						ИНАЧЕ ИСТИНА
	//	|					КОНЕЦ
	//	|					И ВЫБОР
	//	|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	//	|								И &Использовать_ГородИсключение = ЛОЖЬ
	//	|							ТОГДА МІСТО В (&Города)
	//	|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	//	|								И &Использовать_ГородИсключение = ИСТИНА
	//	|							ТОГДА НЕ МІСТО В (&Города)
	//	|						ИНАЧЕ ИСТИНА
	//	|					КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	//	|		ПО ТЗНом.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	//	|";	       
	//КОНЕЦеСЛИ;
	
	
	//	
	
	Запрос = новый Запрос();
	
	
	
	
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
	               |	&ТипыЦенНоменклатурыПрочееРекОптБН КАК ТипЦен,
	               |	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.РекОптБН КАК ЧИСЛО) КАК Цена
	               |ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееРекОптБН
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	               |			&ДатаДокументов,
	               |			ТипЦен В (&ТипыЦен)
	               |				И Номенклатура В (&ТаблицаНоменлкатура)
	               |				И ВЫБОР
	               |					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	               |						ТОГДА ТипЦен.Владелец В (&Поставщики)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	               |							И &Использовать_ГородИсключение = ЛОЖЬ
	               |						ТОГДА МІСТО В (&Города)
	               |					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	               |							И &Использовать_ГородИсключение = ИСТИНА
	               |						ТОГДА НЕ МІСТО В (&Города)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции


Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_РекРозница_сд(МВТЦены, Знач стрТипыЦен)    
	
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееРекРозница
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
КонецФункции


Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_РекРозница_сд(МВТЦены, Знач стрТипыЦен)
	
	//еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_РекРозница_сд = ИСТИНА ТОГДА
	//	Запрос.Текст = Запрос.Текст  +"	
	//	
	//	
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ТЗНом.Номенклатура,
	//	|	&ТипыЦенНоменклатурыПрочееРекРозница,
	//	|	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.РекРозница КАК ЧИСЛО)
	//	|ИЗ
	//	|	ТЗНом КАК ТЗНом
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	//	|				&ДатаДокументов,
	//	|				ТипЦен В (&ТипыЦен)
	//	|					И ВЫБОР
	//	|						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	//	|							ТОГДА ТипЦен.Владелец В (&Поставщики)
	//	|						ИНАЧЕ ИСТИНА
	//	|					КОНЕЦ
	//	|					И ВЫБОР
	//	|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	//	|								И &Использовать_ГородИсключение = ЛОЖЬ
	//	|							ТОГДА МІСТО В (&Города)
	//	|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	//	|								И &Использовать_ГородИсключение = ИСТИНА
	//	|							ТОГДА НЕ МІСТО В (&Города)
	//	|						ИНАЧЕ ИСТИНА
	//	|					КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	//	|		ПО ТЗНом.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	//	|";	       
	//КОНЕЦеСЛИ; 	//	
	
	
	//	
	Запрос = новый Запрос();
	
	
	
	
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
	               |	&ТипыЦенНоменклатурыПрочееРекРозница КАК ТипЦен,
	               |	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.РекРозница КАК ЧИСЛО) КАК Цена
	               |ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееРекРозница
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	               |			&ДатаДокументов,
	               |			ТипЦен В (&ТипыЦен)
	               |				И Номенклатура В (&ТаблицаНоменлкатура)
	               |				И ВЫБОР
	               |					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	               |						ТОГДА ТипЦен.Владелец В (&Поставщики)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	               |							И &Использовать_ГородИсключение = ЛОЖЬ
	               |						ТОГДА МІСТО В (&Города)
	               |					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	               |							И &Использовать_ГородИсключение = ИСТИНА
	               |						ТОГДА НЕ МІСТО В (&Города)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции   

Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_РекРозницаБН_сд(МВТЦены, Знач стрТипыЦен)    
	
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееРекРозницаБН
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции



Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_РекРозницаБН_сд(МВТЦены, Знач стрТипыЦен)
	
	//	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_РекРозницаБН_сд = ИСТИНА ТОГДА
	//	Запрос.Текст = Запрос.Текст  +"	
	//	
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ТЗНом.Номенклатура,
	//	|	&ТипыЦенНоменклатурыПрочееРекРозницаБН,
	//	|	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.РекРозницаБН КАК ЧИСЛО)
	//	|ИЗ
	//	|	ТЗНом КАК ТЗНом
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	//	|				&ДатаДокументов,
	//	|				ТипЦен В (&ТипыЦен)
	//	|					И ВЫБОР
	//	|						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	//	|							ТОГДА ТипЦен.Владелец В (&Поставщики)
	//	|						ИНАЧЕ ИСТИНА
	//	|					КОНЕЦ
	//	|					И ВЫБОР
	//	|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	//	|								И &Использовать_ГородИсключение = ЛОЖЬ
	//	|							ТОГДА МІСТО В (&Города)
	//	|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	//	|								И &Использовать_ГородИсключение = ИСТИНА
	//	|							ТОГДА НЕ МІСТО В (&Города)
	//	|						ИНАЧЕ ИСТИНА
	//	|					КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	//	|		ПО ТЗНом.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	//	|";	       
	//КОНЕЦеСЛИ;   
	
	
	
	//	
	Запрос = новый Запрос();
	
	
	
	
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
	               |	&ТипыЦенНоменклатурыПрочееРекРозницаБН КАК ТипЦен,
	               |	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.РекРозницаБН КАК ЧИСЛО) КАК Цена
	               |ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееРекРозницаБН
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	               |			&ДатаДокументов,
	               |			ТипЦен В (&ТипыЦен)
	               |				И Номенклатура В (&ТаблицаНоменлкатура)
	               |				И ВЫБОР
	               |					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	               |						ТОГДА ТипЦен.Владелец В (&Поставщики)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	               |							И &Использовать_ГородИсключение = ЛОЖЬ
	               |						ТОГДА МІСТО В (&Города)
	               |					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	               |							И &Использовать_ГородИсключение = ИСТИНА
	               |						ТОГДА НЕ МІСТО В (&Города)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

Функция Расчетпустая_Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд(МВТЦены, Знач стрТипыЦен)    
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
КонецФункции

Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд(МВТЦены, Знач стрТипыЦен)
	//	
	//еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд = ИСТИНА ТОГДА
	//		Запрос.Текст = Запрос.Текст  +"
	//		|ОБЪЕДИНИТЬ ВСЕ
	//		|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//		|	ТЗНом.Номенклатура,
	//		|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная,
	//		|	ТЗНом.Номенклатура.max_price_compared КАК Цена
	//		|ИЗ
	//		|	ТЗНом КАК ТЗНом         ";	       
	//	КОНЕЦеСЛИ;   
	//		        
	
	
	//	
	Запрос = новый Запрос();
	
	
	
	
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд КАК ТипЦен,
	|	Номенклатура.max_price_compared КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&ТаблицаНоменлкатура)" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции


Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд(МВТЦены, Знач стрТипыЦен)    
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
КонецФункции


Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд(МВТЦены, Знач стрТипыЦен)
	//	
	//еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд = ИСТИНА ТОГДА
	//	Запрос.Текст = Запрос.Текст  +"
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ТЗНом.Номенклатура,
	//	|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд ,
	//	|	ТЗНом.Номенклатура.min_price_compared КАК Цена
	//	|ИЗ
	//	|	ТЗНом КАК ТЗНом   ";	       
	//КОНЕЦеСЛИ;    
	
	
	//	
	Запрос = новый Запрос();
	
	
	
	
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд КАК ТипЦен,
	|	Номенклатура.min_price_compared КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&ТаблицаНоменлкатура)" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции


Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд(МВТЦены, Знач стрТипыЦен)    
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
КонецФункции


Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд(МВТЦены, Знач стрТипыЦен)
	//	
	//	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд = ИСТИНА ТОГДА
	//	Запрос.Текст = Запрос.Текст  +"
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ТЗНом.Номенклатура,
	//	|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд ,
	//	|	ТЗНом.Номенклатура.avg_price_compared КАК Цена
	//	|ИЗ
	//	|	ТЗНом КАК ТЗНом";	       
	//КОНЕЦеСЛИ; 
	
	
	
	//	
	Запрос = новый Запрос();
	
	
	
	
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд КАК ТипЦен,
	|	Номенклатура.avg_price_compared КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&ТаблицаНоменлкатура)" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции         

Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд(МВТЦены, Знач стрТипыЦен)    
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции


Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд(МВТЦены, Знач стрТипыЦен)
	//	              
	
	//		еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд = ИСТИНА ТОГДА
	//		Запрос.Текст = Запрос.Текст  +"
	//		|ОБЪЕДИНИТЬ ВСЕ
	//		|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//		|	ТЗНом.Номенклатура,
	//		|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд ,
	//		|	ТЗНом.Номенклатура.max_price КАК Цена
	//		|ИЗ
	//		|	ТЗНом КАК ТЗНом";	       
	//	КОНЕЦеСЛИ;  
	
	
	////	
	Запрос = новый Запрос();
	
	
	
	
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд КАК ТипЦен,
	|	Номенклатура.max_price КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&ТаблицаНоменлкатура)" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции


Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд(МВТЦены, Знач стрТипыЦен)    
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
	
КонецФункции


Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд(МВТЦены, Знач стрТипыЦен)
	//	              
	
	//еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд = ИСТИНА ТОГДА
	//	Запрос.Текст = Запрос.Текст  +"
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ТЗНом.Номенклатура,
	//	|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд КАК ТипЦен,
	//	|	ТЗНом.Номенклатура.avg_price КАК Цена
	//	|ИЗ
	//	|	ТЗНом КАК ТЗНом";	       
	//КОНЕЦеСЛИ;   
	//	
	Запрос = новый Запрос();
	
	
	
	
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд КАК ТипЦен,
	|	Номенклатура.avg_price КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&ТаблицаНоменлкатура)" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд(МВТЦены, Знач стрТипыЦен)    
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
	
	
КонецФункции

Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд(МВТЦены, Знач стрТипыЦен)
	//	              
	
	//еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд = ИСТИНА ТОГДА
	//	Запрос.Текст = Запрос.Текст  +"
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ТЗНом.Номенклатура,
	//	|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд,
	//	|	ТЗНом.Номенклатура.min_price КАК Цена
	//	|ИЗ
	//	|	ТЗНом КАК ТЗНом";	       
	//КОНЕЦеСЛИ;   
	
	
	//	
	Запрос = новый Запрос();
	
	
	
	
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд КАК ТипЦен,
	|	Номенклатура.min_price КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&ТаблицаНоменлкатура)" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции


Функция РасчетПустая_Есть_ТипыЦенНоменклатурыПрочее_СебестоимостьНаша_сд(МВТЦены, Знач стрТипыЦен)    
	
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц =МВТЦены;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	"""" КАК ТипЦен,
	|	0 КАК Цена
	|ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееСебестоимость
	|ГДЕ
	|	ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
	
	
	
КонецФункции	

Функция Расчет_Есть_ТипыЦенНоменклатурыПрочее_СебестоимостьНаша_сд(МВТЦены, Знач стрТипыЦен)
	//	              
	
	//еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_СебестоимостьНаша_сд = ИСТИНА ТОГДА
	//	Запрос.Текст = Запрос.Текст  +"
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ТЗНом.Номенклатура,
	//	|	&ТипыЦенНоменклатурыПрочееСебестоимость,
	//	|	СУММА(ВЫБОР
	//	|			КОГДА ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток = 0
	//	|				ТОГДА 0
	//	|			ИНАЧЕ ПартииТоваровНаСкладахОстаткиИОбороты.СтоимостьКонечныйОстаток / ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток
	//	|		КОНЕЦ) КАК Поле1
	//	|ИЗ
	//	|	ТЗНом КАК ТЗНом
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.ОстаткиИОбороты(
	//	|				&ДатаДокументов,
	//	|				&ДатаДокументов,
	//	|				Авто,
	//	|				ДвиженияИГраницыПериода,
	//	|				ВЫБОР
	//	|						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	//	|							ТОГДА ДокументОприходования.Контрагент В (&Поставщики)
	//	|						ИНАЧЕ ИСТИНА
	//	|					КОНЕЦ
	//	|					И ВЫБОР
	//	|						КОГДА &Использовать_ОтборПоДоговорКонтрагента = ИСТИНА
	//	|							ТОГДА ДокументОприходования.ДоговорКонтрагента В (&ДоговораКонтрагента)
	//	|						ИНАЧЕ ИСТИНА
	//	|					КОНЕЦ) КАК ПартииТоваровНаСкладахОстаткиИОбороты
	//	|		ПО ТЗНом.Номенклатура = ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ТЗНом.Номенклатура"; 
	
	
	
	//	
	Запрос = новый Запрос();
	
	
	
	
	Запрос.МенеджерВременныхТаблиц = МВТЦены;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура,
	               |	&ТипыЦенНоменклатурыПрочееСебестоимость КАК ТипЦен,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПартииТоваровНаСкладахОстаткиИОбороты.СтоимостьКонечныйОстаток / ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток
	               |		КОНЕЦ) КАК цена
	               |ПОМЕСТИТЬ ЦеныТипыЦенНоменклатурыПрочееСебестоимость
	               |ИЗ
	               |	РегистрНакопления.ПартииТоваровНаСкладах.ОстаткиИОбороты(
	               |			&ДатаДокументов,
	               |			&ДатаДокументов,
	               |			Авто,
	               |			ДвиженияИГраницыПериода,
	               |			Номенклатура В (&ТаблицаНоменлкатура)
	               |				И ВЫБОР
	               |					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	               |						ТОГДА ДокументОприходования.Контрагент В (&Поставщики)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &Использовать_ОтборПоДоговорКонтрагента = ИСТИНА
	               |						ТОГДА ДокументОприходования.ДоговорКонтрагента В (&ДоговораКонтрагента)
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ) КАК ПартииТоваровНаСкладахОстаткиИОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура" ;	
	
	
	МасивПараметров = ЗАпрос.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		Запрос.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции


Функция РасчитатьВсюНоменклатуруВодномзапросе_старый(Знач ПравилоРасчета, Знач стрТипыЦен, ТипыЦен)
	
	Перем Запрос, Использовать_ОтборПоГородам, Использовать_ОтборПоДоговорКонтрагента, Использовать_ОтборПоПоставщикам, РезультатЗапроса;
	
	
	стрОтборПравилоРасчета = Новый Структура();
	стрОтборПравилоРасчета.Вставить("ПравилоРасчета",ПравилоРасчета);
	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНоменлкатура.Номенклатура,
	|	ТаблицаНоменлкатура.ПравилоРасчета
	|ПОМЕСТИТЬ ТЗНом
	|ИЗ
	|	&ТаблицаНоменлкатура КАК ТаблицаНоменлкатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗНом.Номенклатура,
	|	&ТипыЦенНачалоная КАК ТипЦен,
	|	0 КАК Цена
	|ИЗ
	|	ТЗНом КАК ТЗНом
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗНом.Номенклатура
	|";
	
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатуры = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ТипЦен,
		|	ЦеныНоменклатурыСрезПоследних.Цена
		|ИЗ
		|	ТЗНом КАК ТЗНом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаДокументов, ТипЦен В (&ТипыЦен)) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ТЗНом.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|";	
	КОНЕЦеСЛИ;
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыКонтрагентов = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"
		
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	ЦеныНоменклатурыКонтрагентовСрезПоследних.ТипЦен,
		|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена
		|ИЗ
		|	ТЗНом КАК ТЗНом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
		|				&ДатаДокументов,
		|				ТипЦен В (&ТипыЦен)
		|					И ВЫБОР
		|						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
		|							ТОГДА ТипЦен.Владелец В (&Поставщики)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И ВЫБОР
		|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
		|								И &Использовать_ГородИсключение = ЛОЖЬ
		|							ТОГДА МІСТО В (&Города)
		|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
		|								И &Использовать_ГородИсключение = ИСТИНА
		|							ТОГДА НЕ МІСТО В (&Города)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		|		ПО ТЗНом.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
		|";	
	КОНЕЦеСЛИ;
	
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаСоСкидкой_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочееЦенаСоскидкой,
		|	НоменклатураПоставщикаОстатки_СДСрезПоследних.ЦенаСоСкидкой
		|ИЗ
		|	ТЗНом КАК ТЗНом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПоставщикаОстатки_СД.СрезПоследних(
		|				&ДатаДокументов,
		|				ВЫБОР
		|					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
		|						ТОГДА НоменклатураПоставщика.Владелец В (&Поставщики)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК НоменклатураПоставщикаОстатки_СДСрезПоследних
		|		ПО ТЗНом.Номенклатура = НоменклатураПоставщикаОстатки_СДСрезПоследних.НоменклатураПоставщика.Номенклатура
		|";	
	КОНЕЦеСЛИ;
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаОпт_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"
		
		
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочееЦенаОпт,
		|	НоменклатураПоставщикаОстатки_СДСрезПоследних.ЦенаОпт
		|ИЗ
		|	ТЗНом КАК ТЗНом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПоставщикаОстатки_СД.СрезПоследних(
		|				&ДатаДокументов,
		|				ВЫБОР
		|					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
		|						ТОГДА НоменклатураПоставщика.Владелец В (&Поставщики)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК НоменклатураПоставщикаОстатки_СДСрезПоследних
		|		ПО ТЗНом.Номенклатура = НоменклатураПоставщикаОстатки_СДСрезПоследних.НоменклатураПоставщика.Номенклатура
		|";	
	КОНЕЦеСЛИ;
	
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаРекомендованая_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочееЦенаРекомендована,
		|	НоменклатураПоставщикаОстатки_СДСрезПоследних.ЦенаРекомендована
		|ИЗ
		|	ТЗНом КАК ТЗНом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураПоставщикаОстатки_СД.СрезПоследних(
		|				&ДатаДокументов,
		|				ВЫБОР
		|					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
		|						ТОГДА НоменклатураПоставщика.Владелец В (&Поставщики)
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК НоменклатураПоставщикаОстатки_СДСрезПоследних
		|		ПО ТЗНом.Номенклатура = НоменклатураПоставщикаОстатки_СДСрезПоследних.НоменклатураПоставщика.Номенклатура
		|";	
	КОНЕЦеСЛИ;
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаБН_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"	
		
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочееЦенаБН,
		|	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.ЦенаБН КАК ЧИСЛО)
		|ИЗ
		|	ТЗНом КАК ТЗНом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
		|				&ДатаДокументов,
		|				ТипЦен В (&ТипыЦен)
		|					И ВЫБОР
		|						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
		|							ТОГДА ТипЦен.Владелец В (&Поставщики)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И ВЫБОР
		|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
		|								И &Использовать_ГородИсключение = ЛОЖЬ
		|							ТОГДА МІСТО В (&Города)
		|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
		|								И &Использовать_ГородИсключение = ИСТИНА
		|							ТОГДА НЕ МІСТО В (&Города)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		|		ПО ТЗНом.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
		|";	
	КОНЕЦеСЛИ;
	
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_РекОпт_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"	
		
		
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочееРекОпт,
		|	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.РекОпт КАК ЧИСЛО)
		|ИЗ
		|	ТЗНом КАК ТЗНом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
		|				&ДатаДокументов,
		|				ТипЦен В (&ТипыЦен)
		|					И ВЫБОР
		|						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
		|							ТОГДА ТипЦен.Владелец В (&Поставщики)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И ВЫБОР
		|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
		|								И &Использовать_ГородИсключение = ЛОЖЬ
		|							ТОГДА МІСТО В (&Города)
		|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
		|								И &Использовать_ГородИсключение = ИСТИНА
		|							ТОГДА НЕ МІСТО В (&Города)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		|		ПО ТЗНом.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
		|";	
	КОНЕЦеСЛИ;
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_РекОптБН_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"	
		
		
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочееРекОптБН,
		|	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.РекОптБН КАК ЧИСЛО)
		|ИЗ
		|	ТЗНом КАК ТЗНом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
		|				&ДатаДокументов,
		|				ТипЦен В (&ТипыЦен)
		|					И ВЫБОР
		|						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
		|							ТОГДА ТипЦен.Владелец В (&Поставщики)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И ВЫБОР
		|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
		|								И &Использовать_ГородИсключение = ЛОЖЬ
		|							ТОГДА МІСТО В (&Города)
		|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
		|								И &Использовать_ГородИсключение = ИСТИНА
		|							ТОГДА НЕ МІСТО В (&Города)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		|		ПО ТЗНом.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
		|";	       
	КОНЕЦеСЛИ;
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_РекРозница_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"	
		
		
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочееРекРозница,
		|	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.РекРозница КАК ЧИСЛО)
		|ИЗ
		|	ТЗНом КАК ТЗНом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
		|				&ДатаДокументов,
		|				ТипЦен В (&ТипыЦен)
		|					И ВЫБОР
		|						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
		|							ТОГДА ТипЦен.Владелец В (&Поставщики)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И ВЫБОР
		|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
		|								И &Использовать_ГородИсключение = ЛОЖЬ
		|							ТОГДА МІСТО В (&Города)
		|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
		|								И &Использовать_ГородИсключение = ИСТИНА
		|							ТОГДА НЕ МІСТО В (&Города)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		|		ПО ТЗНом.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
		|";	       
	КОНЕЦеСЛИ;  
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_РекРозницаБН_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"	
		
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочееРекРозницаБН,
		|	ВЫРАЗИТЬ(ЦеныНоменклатурыКонтрагентовСрезПоследних.РекРозницаБН КАК ЧИСЛО)
		|ИЗ
		|	ТЗНом КАК ТЗНом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
		|				&ДатаДокументов,
		|				ТипЦен В (&ТипыЦен)
		|					И ВЫБОР
		|						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
		|							ТОГДА ТипЦен.Владелец В (&Поставщики)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И ВЫБОР
		|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
		|								И &Использовать_ГородИсключение = ЛОЖЬ
		|							ТОГДА МІСТО В (&Города)
		|						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
		|								И &Использовать_ГородИсключение = ИСТИНА
		|							ТОГДА НЕ МІСТО В (&Города)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		|		ПО ТЗНом.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
		|";	       
	КОНЕЦеСЛИ;   
	
	
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд,
		|	ТЗНом.Номенклатура.max_price_compared КАК Цена
		|ИЗ
		|	ТЗНом КАК ТЗНом         ";	       
	КОНЕЦеСЛИ;   
	
	
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд ,
		|	ТЗНом.Номенклатура.min_price_compared КАК Цена
		|ИЗ
		|	ТЗНом КАК ТЗНом   ";	       
	КОНЕЦеСЛИ;   
	
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд ,
		|	ТЗНом.Номенклатура.avg_price_compared КАК Цена
		|ИЗ
		|	ТЗНом КАК ТЗНом";	       
	КОНЕЦеСЛИ;   
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд ,
		|	ТЗНом.Номенклатура.max_price КАК Цена
		|ИЗ
		|	ТЗНом КАК ТЗНом";	       
	КОНЕЦеСЛИ;   
	
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд КАК ТипЦен,
		|	ТЗНом.Номенклатура.avg_price КАК Цена
		|ИЗ
		|	ТЗНом КАК ТЗНом";	       
	КОНЕЦеСЛИ;   
	
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд,
		|	ТЗНом.Номенклатура.min_price КАК Цена
		|ИЗ
		|	ТЗНом КАК ТЗНом";	       
	КОНЕЦеСЛИ;   
	
	
	еСЛИ стрТипыЦен.Есть_ТипыЦенНоменклатурыПрочее_СебестоимостьНаша_сд = ИСТИНА ТОГДА
		Запрос.Текст = Запрос.Текст  +"
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗНом.Номенклатура,
		|	&ТипыЦенНоменклатурыПрочееСебестоимость,
		|	СУММА(ВЫБОР
		|			КОГДА ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток = 0
		|				ТОГДА 0
		|			ИНАЧЕ ПартииТоваровНаСкладахОстаткиИОбороты.СтоимостьКонечныйОстаток / ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток
		|		КОНЕЦ) КАК Поле1
		|ИЗ
		|	ТЗНом КАК ТЗНом
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.ОстаткиИОбороты(
		|				&ДатаДокументов,
		|				&ДатаДокументов,
		|				Авто,
		|				ДвиженияИГраницыПериода,
		|				ВЫБОР
		|						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
		|							ТОГДА ДокументОприходования.Контрагент В (&Поставщики)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|					И ВЫБОР
		|						КОГДА &Использовать_ОтборПоДоговорКонтрагента = ИСТИНА
		|							ТОГДА ДокументОприходования.ДоговорКонтрагента В (&ДоговораКонтрагента)
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК ПартииТоваровНаСкладахОстаткиИОбороты
		|		ПО ТЗНом.Номенклатура = ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЗНом.Номенклатура"; 
	КОНЕЦеСЛИ;                  
	
	
	
	
	Расчет_ВсюНоменклатуруУстановитьПараметры_старые(Запрос, ПравилоРасчета, стрОтборПравилоРасчета, ТипыЦен);
	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура Расчет_ВсюНоменклатуруУстановитьПараметры_старые(Знач Запрос, Знач ПравилоРасчета, Знач стрОтборПравилоРасчета, ТипыЦен)
	
	Перем Использовать_ОтборПоГородам, Использовать_ОтборПоДоговорКонтрагента, Использовать_ОтборПоПоставщикам;
	
	Запрос.УстановитьПараметр("ДатаДокументов", ДатаДокументов);
	
	Запрос.УстановитьПараметр("Города", ПравилоРасчета.Города.ВыгрузитьКолонку("Город"));
	Использовать_ОтборПоГородам		     = ?(ПравилоРасчета.Города.Количество() <> 0, Истина, Ложь);
	Запрос.УстановитьПараметр("Использовать_ОтборПоГородам", Использовать_ОтборПоГородам);
	
	Запрос.УстановитьПараметр("Поставщики", ПравилоРасчета.Поставщики.ВыгрузитьКолонку("Поставщик"));   
	Использовать_ОтборПоПоставщикам		     = ?(ПравилоРасчета.Поставщики.Количество() <> 0, Истина, Ложь);
	Запрос.УстановитьПараметр("Использовать_ОтборПоПоставщикам",Использовать_ОтборПоПоставщикам);   
	
	
	Запрос.УстановитьПараметр("ДоговораКонтрагента", ПравилоРасчета.ДоговораКонтрагента.ВыгрузитьКолонку("ДоговорКонтрагента"));   
	Использовать_ОтборПоДоговорКонтрагента	     = ?(ПравилоРасчета.ДоговораКонтрагента.Количество() <> 0, Истина, Ложь);
	Запрос.УстановитьПараметр("Использовать_ОтборПоДоговорКонтрагента",Использовать_ОтборПоДоговорКонтрагента);   
	
	
	Запрос.УстановитьПараметр("ТипыЦен", ТипыЦен);
	Запрос.УстановитьПараметр("ТаблицаНоменлкатура", НоменклатураПоПравилу.Выгрузить(стрОтборПравилоРасчета,"Номенклатура,ПравилоРасчета"));
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочееЦенаОпт", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаОпт);
	Запрос.УстановитьПараметр("ТипБазовойЦены", ПравилоРасчета.ТипБазовойЦены);
	Запрос.УстановитьПараметр("ЦенаРассчитанаНеМеньше", ПравилоРасчета.ЦенаРассчитанаНеМеньше);
	Запрос.УстановитьПараметр("ЦенаРассчитанаНеБольше", ПравилоРасчета.ЦенаРассчитанаНеБольше);
	
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочееЦенаРекомендована", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаРекомендованая);
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочееЦенаСоскидкой", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаСоСкидкой);
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочееСебестоимость", Справочники.ТипыЦенНоменклатурыПрочее_сд.СебестоимостьНаша);
	
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочееЦенаБН", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаБН);
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочееРекОпт", Справочники.ТипыЦенНоменклатурыПрочее_сд.РекОпт);
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочееРекОптБН", Справочники.ТипыЦенНоменклатурыПрочее_сд.РекОптБН);
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочееРекРозница", Справочники.ТипыЦенНоменклатурыПрочее_сд.РекРозница);
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочееРекРозницаБН", Справочники.ТипыЦенНоменклатурыПрочее_сд.РекРозницаБН);
	Запрос.УстановитьПараметр("ТипыЦенНачалоная", Справочники.ТипыЦенНоменклатурыПрочее_сд.ПустаяСсылка());
	
	
	
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнКонкурентыМаксимальная);
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнКонкурентыМинимальная);
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнКонкурентыСредняя);
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнМаксимальная);
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнСредняя);
	Запрос.УстановитьПараметр("ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд", Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнМинимальная);
	
	
	Запрос.УстановитьПараметр("Использовать_ПоставщикиТекстИсключение", ПравилоРасчета.ПоставщикиТекстИсключение);
	Запрос.УстановитьПараметр("Использовать_ПроизводителиИсключение", ПравилоРасчета.ПроизводителиИсключение);
	Запрос.УстановитьПараметр("Использовать_ГородИсключение", ПравилоРасчета.ГородИсключение);
	Запрос.УстановитьПараметр("Использовать_НоменклатураИсключение", ПравилоРасчета.НоменклатураИсключение);
	
КонецПроцедуры

Функция _РасчитатьЦену(Номенклатура, Знач ТЗЦЕНЫ, Знач ТипыЦен , ЗначениеЦены = 0, ЦенаБазовая = 0)
	
	Перем отборТипЦЕн, ТЗ;
	
	Если не ТипыЦен.НайтиПоЗначению(ЗначениеЦены)  = Неопределено тогда
		отборТипЦЕн = новый Структура();
		отборТипЦЕн.Вставить("Номенклатура", Номенклатура);		
		отборТипЦЕн.Вставить("ТипЦен", ЗначениеЦены);		
		
		
		ТЗ = ТЗЦЕНЫ.НайтиСтроки(отборТипЦЕн);
		Если не Тз.количество()= 0 тогда
			РезультатФункции = Тз[0].цена;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗначениеЦены) = Тип("Число") тогда
		РезультатФункции  = ЦенаБазовая +  ЗначениеЦены	
	КонецЕсли;
	
	
	возврат РезультатФункции
КонецФункции //_РасчитатьЦену(Номенклатура, Знач ТЗЦЕНЫ, Знач ТипыЦен ,Знач цена = 0)


Функция _РасчитатьНаценку (ЦенаБазовая, НаценкаСуммой = 0, НаценкаПроцентом = 0)
	
	
	Если  НаценкаПроцентом <> 0   тогда
		Наценка = ЦенаБазовая / 100 * НаценкаПроцентом;    
	Иначе
		Наценка =  НаценкаСуммой;
	КонецЕсли;	
		
	
	//Наценка = Макс(НаценкаПроцент, НаценкаСуммой);
		
	
	возврат Наценка
КонецФункции //_РасчитатьЦену(Номенклатура, Знач ТЗЦЕНЫ, Знач ТипыЦен ,Знач цена = 0)


Функция _РасчитатьНаценкуБазова (ЦенаБазовая, НаценкаСуммой = 0, НаценкаПроцентом = 0)
	
	
	НаценкаПроцент = ЦенаБазовая / 100 * НаценкаПроцентом;    
	
	Наценка = Макс(НаценкаПроцент, НаценкаСуммой);
		
	
	возврат Наценка
КонецФункции //_РасчитатьЦену(Номенклатура, Знач ТЗЦЕНЫ, Знач ТипыЦен ,Знач цена = 0)



Функция  ТИпЦенСписок(Знач ТипЦен, Знач ТипыЦен = Неопределено , стрТипыЦен)
	
	
	
	Если ТипЗнч(ТипЦен) = ТИп("СправочникСсылка.ТипыЦенНоменклатуры") тогда
		ТипыЦен.Добавить( ТипЦен);
		
		стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатуры", Истина);  
		стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатуры", Истина)
		
	ИначеЕсли ТипЗнч(ТипЦен) = ТИп("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") тогда
		ТипыЦен.Добавить( ТипЦен);
		
		стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыКонтрагентов", Истина);
		стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыКонтрагентов", Истина)
		
		
	ИначеЕсли ТипЗнч(ТипЦен) = ТИп("СправочникСсылка.ТипыЦенНоменклатурыПрочее_сд") тогда
		ТипыЦен.Добавить( ТипЦен);
		Если ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.СебестоимостьНаша ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_СебестоимостьНаша_сд", Истина);  
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_СебестоимостьНаша_сд", Истина)
			
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.РекОпт ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекОпт_сд", Истина);  
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекОпт_сд", Истина)
			
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.РекОптБН ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекОптБН_сд", Истина); 
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекОптБН_сд", Истина)
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.РекРозница ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекРозница_сд", Истина);  
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекРозница_сд", Истина)
			
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.РекРозницаБН ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекРозницаБН_сд", Истина);   
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_РекРозницаБН_сд", Истина)
			
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаБН ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаБН_сд", Истина);   
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаБН_сд", Истина)
			
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаОпт ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаОпт_сд", Истина);
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаОпт_сд", Истина)
			
			
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаРекомендованая ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаРекомендованая_сд", Истина);
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаРекомендованая_сд", Истина)
			
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаСоСкидкой ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаСоСкидкой_сд", Истина);
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд", Истина)
			
			
			
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнКонкурентыМаксимальная ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд", Истина);
			
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМаксимальная_сд", Истина)
			
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнКонкурентыМинимальная ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд", Истина);  
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыМинимальная_сд", Истина)
			
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнКонкурентыСредняя ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд", Истина); 
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнКонкурентыСредняя_сд", Истина)
			
			
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнМаксимальная ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд", Истина);
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМаксимальная_сд", Истина)
			
			
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнМинимальная ТОГДА
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд", Истина);
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнМинимальная_сд", Истина)
			
			
		иначеЕсли ТипЦен = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаХотлайнСредняя ТОГДА
			
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд", Истина);
			
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_ЦенаХотлайнСредняя_сд", Истина)
			
			
		Иначе	
			стрТипыЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_сд", Истина);    
			стрТипыЦен.МасивРасчетаЦен.Вставить("Есть_ТипыЦенНоменклатурыПрочее_сд", Истина)
			
			
		конецЕсли;
	КонецЕсли;
	
	
КонецФункции



Функция ВернутьТабНоменклатурыПоПравилу(ПравилоРасчета) Экспорт 
	
	
	Если Ложь тогда
		ПравилоРасчета = Справочники.ПравилаРасчетаЦен_СД.ПустаяСсылка();
	КонецЕсли;                
	
	
	
	стрТипыЦен = ЗапросЗаполнения_ВсюНоменклатуруУстановитьПараметры(ПравилоРасчета);
	
	МВТ = Новый МенеджерВременныхТаблиц();	
	
	
	
	
	для каждого ФУн из стрТипыЦен.МасивРасчетаЦен цикл
		
		Если  стрТипыЦен.МасивРасчетаЦен[фун.Ключ] = ЛОжь тогда
			Текст_сд = "ЗапросЗаполнения_Пустая_" + СокрЛП(фун.Ключ)+ "(МВТ);" ; 
		Иначе
			Текст_сд = "ЗапросЗаполнения_" + СокрЛП(фун.Ключ)+ "(МВТ, стрТипыЦен);" ;

		КонецЕсли;   
	
	    Выполнить(Текст_сд) ;

		
		Если Отладка = истина тогда
			Сообщить(Текст_сд)
		конецЕсли;	
		
	КонецЦикла;	
	

	
	
	
	//Если стрТипыЦен.Есть_ТипыЦенНоменклатурыКонтрагентов = иСТИНА тогда
	//	
	//	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	//	// Даний фрагмент побудований конструктором.
	//	
	//	ЗапросЗаполнения_Номенклатура_ТипыЦенНоменклатурыКонтрагентов(МВТ,стрТипыЦен);
	//	
	//Иначе
	//	
	//	
	//	 ЗапросЗаполненияПустая_Номенклатура_ТипыЦенНоменклатурыКонтрагентов(МВТ);
	//	
	//	
	//КонецЕсли;	
	//
	//Если стрТипыЦен.Есть_ВНаличии = Истина  тогда
	//	
	//	 ЗапросЗаполнения_Партии(МВТ, стрТипыЦен) ;
	//	
	//	ЧтотоСработало = Истина	 ;
	//Иначе
	//	
	//	 ЗапросЗаполненияПустая_Партии(МВТ);
	//	
	//КонецЕсли;	                                          
	//
	//
	//Если стрТипыЦен.Есть_Номенклатура = Истина тогда 
	//	
	//	 ЗапросЗаполнения_Номенклатура(МВТ,стрТипыЦен);
	//Иначе
	//	
	//	 ЗапросЗаполненияПустая_Номенклатура(МВТ);
	//	
	//	
	//конецЕсли;
	
	
	
	РезНом =  ЗапросЗаполнения_ОбединитьНоменлкатуру(МВТ, стрТипыЦен);
	
	
	//Если Отладка = Истина тогда
	//	ПЕчатьТЗ( РезНом, "Номенклатура");
	//КонецЕсли;	
	Возврат РезНом.Выгрузить();       
	
КонецФункции

Функция  ЗапросЗаполнения_ОбединитьНоменлкатуру(Знач МВТ, стрТипыЦен)
	
	Перем Запрос, РезНом;
	
	Запрос = новый Запрос(); 
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Запрос.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                 |	ЦеныНоменклатурыКонтрагента.Номенклатура,
	                 |	ЦеныНоменклатурыКонтрагента.Остаток,
	                 |	ЦеныНоменклатурыКонтрагента.МІСТО,
	                 |	ЦеныНоменклатурыКонтрагента.Поставщик
	                 |ПОМЕСТИТЬ тзНом
	                 |ИЗ
	                 |	ЦеныНоменклатурыКонтрагента КАК ЦеныНоменклатурыКонтрагента
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ
	                 |	СправочникНоменклатура.Номенклатура,
	                 |	СправочникНоменклатура.Остаток,
	                 |	"""",
	                 |	""""
	                 |ИЗ
	                 |	СправочникНоменклатура КАК СправочникНоменклатура
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                 |	ПартииТоваров.Номенклатура,
	                 |	ПартииТоваров.Остаток,
	                 |	"""",
	                 |	""""
	                 |ИЗ
	                 |	ПартииТоваров КАК ПартииТоваров
	                 |
	                 |ОБЪЕДИНИТЬ ВСЕ
	                 |
	                 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                 |	ЦеныНоменклатуры.Номенклатура,
	                 |	ЦеныНоменклатуры.Остаток,
	                 |	"""",
	                 |	""""
	                 |ИЗ
	                 |	ЦеныНоменклатуры КАК ЦеныНоменклатуры
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                 |	тзНом.Номенклатура,
	                 |	&ПравилоРасчета,
	                 |	&КонтрагентУЦ,
	                 |	&Приоритет,
	                 |	&УЦ,
	                 |	&ТипЦеныРассчитанной,
	                 |	МАКСИМУМ(тзНом.Остаток) КАК Остаток,
	                 |	тзНом.МІСТО,
	                 |	тзНом.Поставщик
	                 |ИЗ
	                 |	тзНом КАК тзНом
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	тзНом.Номенклатура,
	                 |	тзНом.МІСТО,
	                 |	тзНом.Поставщик";
	
	Запрос.УстановитьПараметр("ТипЦеныРассчитанной", стрТипыЦен.ТипЦеныРассчитанной);  
	Запрос.УстановитьПараметр("ПравилоРасчета", стрТипыЦен.ПравилоРасчета);  
	Запрос.УстановитьПараметр("КонтрагентУЦ", стрТипыЦен.КонтрагентУЦ);  
	Запрос.УстановитьПараметр("Приоритет", стрТипыЦен.Приоритет);
	Запрос.УстановитьПараметр("УЦ", ложь);
	
	РезНом = Запрос.Выполнить();
	Возврат РезНом;
	
КонецФункции

Процедура  ЗапросЗаполнения_Пустая_Есть_Номенклатура(Знач МВТ)
	
	Перем ЗапросСправочникНоменклатура, РезНом;
	
	ЗапросСправочникНоменклатура = новый Запрос(); 
	ЗапросСправочникНоменклатура.МенеджерВременныхТаблиц = МВТ;
	
	ЗапросСправочникНоменклатура.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	0 КАК Остаток
	|ПОМЕСТИТЬ СправочникНоменклатура
	|ГДЕ
	|	ЛОЖЬ";
	
	РезНом = ЗапросСправочникНоменклатура.Выполнить();
	
КонецПроцедуры

Процедура  ЗапросЗаполнения_Пустая_Есть_ВНаличии(Знач МВТ)
	
	Перем ЗапросПартииТоваров, РезНом;
	
	ЗапросПартииТоваров = новый Запрос(); 
	ЗапросПартииТоваров.МенеджерВременныхТаблиц = МВТ;
	
	ЗапросПартииТоваров.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	0 КАК Остаток
	|ПОМЕСТИТЬ ПартииТоваров
	|ГДЕ
	|	ЛОЖЬ";
	
	РезНом = ЗапросПартииТоваров.Выполнить();
	
КонецПроцедуры

Процедура  ЗапросЗаполнения_Пустая_Есть_ТипыЦенНоменклатурыКонтрагентов(Знач МВТ)
	
	Перем ЗапросЦеныНоменклатурыКонтрагента, РезНом;
	
	ЗапросЦеныНоменклатурыКонтрагента = новый Запрос(); 
	ЗапросЦеныНоменклатурыКонтрагента.МенеджерВременныхТаблиц = МВТ;
	
	ЗапросЦеныНоменклатурыКонтрагента.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                                            |	"""" КАК Номенклатура,
	                                            |	0 КАК Остаток,
	                                            |	"""" КАК МІСТО,
	                                            |	"""" КАК Поставщик
	                                            |ПОМЕСТИТЬ ЦеныНоменклатурыКонтрагента
	                                            |ГДЕ
	                                            |	ЛОЖЬ";
	
	РезНом = ЗапросЦеныНоменклатурыКонтрагента.Выполнить();
	
КонецПроцедуры



Функция  ЗапросЗаполнения_Есть_Номенклатура(МВТ,стрТипыЦен)
	
		
	
	ЗапросНом = новый запрос();
	
	ЗапросНом.Текст = "ВЫБРАТЬ
	                  |	НоменклатураВся.Ссылка КАК Номенклатура,
	                  |	ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток КАК Остаток
	                  |ПОМЕСТИТЬ СправочникНоменклатура
	                  |ИЗ
	                  |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&ДатаОст, &ДатаОст, Авто, ДвиженияИГраницыПериода, ) КАК ТоварыНаСкладахОстаткиИОбороты
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураВся
	                  |		ПО ТоварыНаСкладахОстаткиИОбороты.Номенклатура = НоменклатураВся.Ссылка
	                  |ГДЕ
	                  |	НЕ НоменклатураВся.Ссылка.ПометкаУдаления
	                  |	И НЕ НоменклатураВся.Ссылка.ЭтоГруппа
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборНоменклатура
	                  |					И НЕ &Использовать_НоменклатураИсключение
	                  |				ТОГДА НоменклатураВся.Ссылка В (&СписокНоменклатуры)
	                  |			КОГДА &Использовать_ОтборНоменклатура
	                  |					И &Использовать_НоменклатураИсключение
	                  |				ТОГДА НЕ НоменклатураВся.Ссылка В (&СписокНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоТипуНоменклатуры
	                  |				ТОГДА НоменклатураВся.Тип В (&СписокТиповНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоДиаметру
	                  |				ТОГДА НоменклатураВся.ДиаметрДиска В (&СписокДиаметров)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоСезону
	                  |				ТОГДА НоменклатураВся.Сезонность В (&СписокСезонов)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоПоставщикам
	                  |				ТОГДА НоменклатураВся.ОсновнойПоставщик В (&СписокПоставщиков)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоВидуНоменлкатуры
	                  |				ТОГДА НоменклатураВся.ВидНоменклатуры В (&СписокВидыНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоШирине
	                  |				ТОГДА НоменклатураВся.Ширина В (&СписокШирины)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоВысотеПрофиля
	                  |				ТОГДА НоменклатураВся.ВысотаПрофиля В (&СписокВысотПрофилей)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборБУ
	                  |				ТОГДА НоменклатураВся.БУ = &БУ
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПроизводители
	                  |					И НЕ &Использовать_ПроизводителиИсключение
	                  |				ТОГДА НоменклатураВся.Производитель В (&СписокПроизводители)
	                  |			КОГДА &Использовать_ОтборПроизводители
	                  |					И &Использовать_ПроизводителиИсключение
	                  |				ТОГДА НЕ НоменклатураВся.Производитель В (&СписокПроизводители)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	НоменклатураВся.Ссылка,
	                  |	ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток";
	
	
	МасивПараметров = ЗапросНом.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		ЗапросНом.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;

	ЗапросНом.МенеджерВременныхТаблиц = МВТ;	
	ЗапросНом.УстановитьПараметр("ДатаОст", ДатаДокументов);
	РезНом = ЗапросНом.Выполнить();
	Возврат РезНом;
	
КонецФункции	



Функция ЗапросЗаполнения_Есть_ТипыЦенНоменклатуры(МВТ,стрТипыЦен)
	
		
	
	
	ЗапросНом = новый запрос();
	
	ЗапросНом.Текст = "ВЫБРАТЬ
	                  |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура
	                  |ПОМЕСТИТЬ ЦеныНоменклатуры
	                  |ИЗ
	                  |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                  |			КОНЕЦПЕРИОДА(&ДатаОст, ДЕНЬ),
	                  |			Цена <> 0
	                  |				И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	                  |ГДЕ
	                  |	ВЫБОР
	                  |			КОГДА &Использовать_ОтборНоменклатура
	                  |					И НЕ &Использовать_НоменклатураИсключение
	                  |				ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура В (&СписокНоменклатуры)
	                  |			КОГДА &Использовать_ОтборНоменклатура
	                  |					И &Использовать_НоменклатураИсключение
	                  |				ТОГДА НЕ ЦеныНоменклатурыСрезПоследних.Номенклатура В (&СписокНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоТипуНоменклатуры
	                  |				ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.Тип В (&СписокТиповНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоДиаметру
	                  |				ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.ДиаметрДиска В (&СписокДиаметров)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоСезону
	                  |				ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.Сезонность В (&СписокСезонов)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоВидуНоменлкатуры
	                  |				ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.ВидНоменклатуры В (&СписокВидыНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоШирине
	                  |				ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.Ширина В (&СписокШирины)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоВысотеПрофиля
	                  |				ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.ВысотаПрофиля В (&СписокВысотПрофилей)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборБУ
	                  |				ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.БУ = &БУ
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПроизводители
	                  |					И НЕ &Использовать_ПроизводителиИсключение
	                  |				ТОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.Производитель В (&СписокПроизводители)
	                  |			КОГДА &Использовать_ОтборПроизводители
	                  |					И &Использовать_ПроизводителиИсключение
	                  |				ТОГДА НЕ ЦеныНоменклатурыСрезПоследних.Номенклатура.Производитель В (&СписокПроизводители)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ЦеныНоменклатурыСрезПоследних.Цена <> 0";
	
	//КонецЕсли;
		МасивПараметров = ЗапросНом.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		ЗапросНом.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
		
	
	ЗапросНом.МенеджерВременныхТаблиц = МВТ;	
	ЗапросНом.УстановитьПараметр("ДатаОст", ДатаДокументов);
	РезНом = ЗапросНом.Выполнить();
	Возврат РезНом;
	
КонецФункции	



Процедура  ЗапросЗаполнения_Пустая_Есть_ТипыЦенНоменклатуры(Знач МВТ)
	
	Перем ЗапросСправочникНоменклатура, РезНом;
	
	ЗапросСправочникНоменклатура = новый Запрос(); 
	ЗапросСправочникНоменклатура.МенеджерВременныхТаблиц = МВТ;
	
	ЗапросСправочникНоменклатура.Текст =   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	"""" КАК Номенклатура,
	|	0 КАК Остаток
	|ПОМЕСТИТЬ ЦеныНоменклатуры
	|ГДЕ
	|	ЛОЖЬ";
	
	РезНом = ЗапросСправочникНоменклатура.Выполнить();
	
КонецПроцедуры



Функция ЗапросЗаполнения_Есть_ТипыЦенНоменклатурыКонтрагентов(МВТ,стрТипыЦен)
	
		
	
	
	ЗапросНом = новый запрос();
	
	ЗапросНом.Текст = "ВЫБРАТЬ
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура КАК Номенклатура,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Остаток КАК Остаток,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.МІСТО,
	                  |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Поставщик
	                  |ПОМЕСТИТЬ ЦеныНоменклатурыКонтрагента
	                  |ИЗ
	                  |	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	                  |			КОНЕЦПЕРИОДА(&ДатаОст, ДЕНЬ),
	                  |			ТипЦен = &ТипЦен
	                  |				И ВЫБОР
	                  |					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	                  |						ТОГДА ТипЦен.Владелец В (&Поставщики)
	                  |					ИНАЧЕ ИСТИНА
	                  |				КОНЕЦ
	                  |				И ВЫБОР
	                  |					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	                  |							И &Использовать_ГородИсключение = ЛОЖЬ
	                  |						ТОГДА МІСТО В (&Города)
	                  |					КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	                  |							И &Использовать_ГородИсключение = ИСТИНА
	                  |						ТОГДА НЕ МІСТО В (&Города)
	                  |					ИНАЧЕ ИСТИНА
	                  |				КОНЕЦ
	                  |				И ВЫБОР
	                  |					КОГДА &Использовать_ОтборПоПоставщикамТекст = ИСТИНА
	                  |							И &Использовать_ПоставщикиТекстИсключение = ЛОЖЬ
	                  |						ТОГДА Поставщик В (&ПоставщикиТекст)
	                  |					КОГДА &Использовать_ОтборПоПоставщикамТекст = ИСТИНА
	                  |							И &Использовать_ПоставщикиТекстИсключение = ИСТИНА
	                  |						ТОГДА НЕ Поставщик В (&ПоставщикиТекст)
	                  |					ИНАЧЕ ИСТИНА
	                  |				КОНЕЦ
	                  |				И Цена <> 0) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	                  |ГДЕ
	                  |	ВЫБОР
	                  |			КОГДА &Использовать_ОтборНоменклатура
	                  |					И НЕ &Использовать_НоменклатураИсключение
	                  |				ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура В (&СписокНоменклатуры)
	                  |			КОГДА &Использовать_ОтборНоменклатура
	                  |					И &Использовать_НоменклатураИсключение
	                  |				ТОГДА НЕ ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура В (&СписокНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоТипуНоменклатуры
	                  |				ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Тип В (&СписокТиповНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоДиаметру
	                  |				ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ДиаметрДиска В (&СписокДиаметров)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоСезону
	                  |				ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Сезонность В (&СписокСезонов)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоВидуНоменлкатуры
	                  |				ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ВидНоменклатуры В (&СписокВидыНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоШирине
	                  |				ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Ширина В (&СписокШирины)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоВысотеПрофиля
	                  |				ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ВысотаПрофиля В (&СписокВысотПрофилей)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборБУ
	                  |				ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.БУ = &БУ
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПроизводители
	                  |					И НЕ &Использовать_ПроизводителиИсключение
	                  |				ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Производитель В (&СписокПроизводители)
	                  |			КОГДА &Использовать_ОтборПроизводители
	                  |					И &Использовать_ПроизводителиИсключение
	                  |				ТОГДА НЕ ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Производитель В (&СписокПроизводители)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ";
	
	//КонецЕсли;
		МасивПараметров = ЗапросНом.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		ЗапросНом.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;
	
		
	
	ЗапросНом.МенеджерВременныхТаблиц = МВТ;	
	ЗапросНом.УстановитьПараметр("ДатаОст", ДатаДокументов);
	РезНом = ЗапросНом.Выполнить();
	Возврат РезНом;
	
КонецФункции	


// Функция - Запрос партии
//
// Параметры:
//  МВТ				 - 	 - 
//  ПравилоРасчета	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция  ЗапросЗаполнения_Есть_ВНаличии(МВТ, стрТипыЦен)
		
	
	
	ЗапросНом = новый запрос();
	
	ЗапросНом.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                  |	ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура КАК Номенклатура,
	                  |	ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток КАК Остаток
	                  |ПОМЕСТИТЬ ПартииТоваров
	                  |ИЗ
	                  |	РегистрНакопления.ПартииТоваровНаСкладах.ОстаткиИОбороты(
	                  |			КОНЕЦПЕРИОДА(&ДатаОст, ДЕНЬ),
	                  |			КОНЕЦПЕРИОДА(&ДатаОст, ДЕНЬ),
	                  |			Авто,
	                  |			ДвиженияИГраницыПериода,
	                  |			ВЫБОР
	                  |					КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	                  |						ТОГДА ДокументОприходования.Контрагент В (&Поставщики)
	                  |					ИНАЧЕ ИСТИНА
	                  |				КОНЕЦ
	                  |				И ВЫБОР
	                  |					КОГДА &Использовать_ОтборПоДоговорКонтрагента = ИСТИНА
	                  |						ТОГДА ДокументОприходования.ДоговорКонтрагента В (&ДоговораКонтрагента)
	                  |					ИНАЧЕ ИСТИНА
	                  |				КОНЕЦ) КАК ПартииТоваровНаСкладахОстаткиИОбороты
	                  |ГДЕ
	                  |	ВЫБОР
	                  |			КОГДА &Использовать_ОтборНоменклатура
	                  |					И НЕ &Использовать_НоменклатураИсключение
	                  |				ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура В (&СписокНоменклатуры)
	                  |			КОГДА &Использовать_ОтборНоменклатура
	                  |					И &Использовать_НоменклатураИсключение
	                  |				ТОГДА НЕ ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура В (&СписокНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоТипуНоменклатуры
	                  |				ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.Тип В (&СписокТиповНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоДиаметру
	                  |				ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.ДиаметрДиска В (&СписокДиаметров)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоСезону
	                  |				ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.Сезонность В (&СписокСезонов)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоВидуНоменлкатуры
	                  |				ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.ВидНоменклатуры В (&СписокВидыНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоШирине
	                  |				ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.Ширина В (&СписокШирины)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоВысотеПрофиля
	                  |				ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.ВысотаПрофиля В (&СписокВысотПрофилей)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборБУ
	                  |				ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.БУ = &БУ
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборОстаток
	                  |				ТОГДА ВЫБОР
	                  |						КОГДА &ВНаличии
	                  |							ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток > 0
	                  |						КОГДА &ВНаличии = ЛОЖЬ
	                  |							ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток < 0
	                  |						ИНАЧЕ ИСТИНА
	                  |					КОНЕЦ
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПроизводители
	                  |					И НЕ &Использовать_ПроизводителиИсключение
	                  |				ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.Производитель В (&СписокПроизводители)
	                  |			КОГДА &Использовать_ОтборПроизводители
	                  |					И &Использовать_ПроизводителиИсключение
	                  |				ТОГДА НЕ ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.Производитель В (&СписокПроизводители)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ";
	
	//КонецЕсли;
	
	
		МасивПараметров = ЗапросНом.НайтиПараметры();
	
	для каждого строкаСтр из МасивПараметров цикл				
		
		ЗапросНом.УстановитьПараметр(строкаСтр.Имя, стрТипыЦен[строкаСтр.Имя]); 
		
	конецЦикла;

	
	ЗапросНом.МенеджерВременныхТаблиц = МВТ;	
	
	ЗапросНом.УстановитьПараметр("ДатаОст", ДатаДокументов);
	РезНом = ЗапросНом.Выполнить();
	Возврат РезНом;
	
КонецФункции	



Функция Удалить_ЗапросВсе_старый(ПравилоРасчета)
	
	Перем ЗапросНом, Использовать_ОтборБУ, Использовать_ОтборНоменклатура, Использовать_ОтборОстаток, Использовать_ОтборПоВидуНоменлкатуры, Использовать_ОтборПоВысотеПрофиля, Использовать_ОтборПоГородам, Использовать_ОтборПоДиаметру, Использовать_ОтборПоДоговорКонтрагента, Использовать_ОтборПоПоставщикам, Использовать_ОтборПоПоставщикамТекст, Использовать_ОтборПоСезону, Использовать_ОтборПоТипуНоменклатуры, Использовать_ОтборПоШирине, Использовать_ОтборПроизводители, РезНом;
	
	Использовать_ОтборБУ		     = ?(ЗначениеЗаполнено(ПравилоРасчета.БУ), Истина, Ложь);
	Использовать_ОтборНоменклатура           = ?(ПравилоРасчета.Номенклатура.Количество() <> 0, Истина, Ложь);
	Использовать_ОтборПоТипуНоменклатуры     = ?(ПравилоРасчета.ТипыНоменклатуры.Количество() <> 0, Истина, Ложь);
	Использовать_ОтборПоДиаметру		     = ?(ПравилоРасчета.Модель.Количество() <> 0, Истина, Ложь);
	Использовать_ОтборПоСезону			     = ?(ПравилоРасчета.Сезоны.Количество() <> 0, Истина, Ложь);
	Использовать_ОтборПоПоставщикам		     = ?(ПравилоРасчета.Поставщики.Количество() <> 0, Истина, Ложь);
	Использовать_ОтборПоШирине			     = ?(ПравилоРасчета.Ширина.Количество() <> 0, Истина, Ложь);
	//с.д. рижий 2023-10-01 (
	//с.д. Рижий 2023-10-01 )
	Использовать_ОтборПоВысотеПрофиля	     = ?(ПравилоРасчета.ВысотаПрофиля.Количество() <> 0, Истина, Ложь);
	//Использовать_ОтборОстатокНеМеньше        = ?(ПравилоРасчета.ОстатокНаСкладеНеМеньше <> 0, Истина, Ложь);
	//Использовать_ОтборОстатокНеБольше        = ?(ПравилоРасчета.ОстатокНаСкладеНеБольше <> 0, Истина, Ложь);
	
	Использовать_ОтборОстаток		     = ?(ЗначениеЗаполнено(ПравилоРасчета.ВНаличии), Истина, Ложь);
	
	
	
	ЗапросНом = новый запрос();
	
	ЗапросНом.Текст = "ВЫБРАТЬ
	                  |	ВложенныйЗапрос.Номенклатура_
	                  |ПОМЕСТИТЬ НоменклатураСОтбором
	                  |ИЗ
	                  |	(ВЫБРАТЬ
	                  |		ЦеныНоменклатурыКонтрагентов.Номенклатура КАК Номенклатура_
	                  |	ИЗ
	                  |		ЦеныНоменклатурыКонтрагентов КАК ЦеныНоменклатурыКонтрагентов
	                  |	
	                  |	СГРУППИРОВАТЬ ПО
	                  |		ЦеныНоменклатурыКонтрагентов.Номенклатура
	                  |	
	                  |	ОБЪЕДИНИТЬ ВСЕ
	                  |	
	                  |	ВЫБРАТЬ
	                  |		ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	                  |	ИЗ
	                  |		РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	                  |				КОНЕЦПЕРИОДА(&ДатаОст, ДЕНЬ),
	                  |				ВЫБОР
	                  |						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	                  |							ТОГДА ТипЦен.Владелец В (&Поставщики)
	                  |						ИНАЧЕ ИСТИНА
	                  |					КОНЕЦ
	                  |					И ВЫБОР
	                  |						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	                  |								И &Использовать_ГородИсключение = ЛОЖЬ
	                  |							ТОГДА МІСТО В (&Города)
	                  |						КОГДА &Использовать_ОтборПоГородам = ИСТИНА
	                  |								И &Использовать_ГородИсключение = ИСТИНА
	                  |							ТОГДА НЕ МІСТО В (&Города)
	                  |						ИНАЧЕ ИСТИНА
	                  |					КОНЕЦ
	                  |					И ВЫБОР
	                  |						КОГДА &Использовать_ОтборПоПоставщикамТекст = ИСТИНА
	                  |								И &Использовать_ПоставщикиТекстИсключение = ЛОЖЬ
	                  |							ТОГДА Поставщик В (&ПоставщикиТекст)
	                  |						КОГДА &Использовать_ОтборПоПоставщикамТекст = ИСТИНА
	                  |								И &Использовать_ПоставщикиТекстИсключение = ИСТИНА
	                  |							ТОГДА НЕ Поставщик В (&ПоставщикиТекст)
	                  |						ИНАЧЕ ИСТИНА
	                  |					КОНЕЦ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	                  |	ГДЕ
	                  |		ВЫБОР
	                  |				КОГДА &Использовать_ОтборНоменклатура
	                  |						И НЕ &Использовать_НоменклатураИсключение
	                  |					ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура В (&СписокНоменклатуры)
	                  |				КОГДА &Использовать_ОтборНоменклатура
	                  |						И &Использовать_НоменклатураИсключение
	                  |					ТОГДА НЕ ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура В (&СписокНоменклатуры)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборПоТипуНоменклатуры
	                  |					ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Тип В (&СписокТиповНоменклатуры)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборПоДиаметру
	                  |					ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ДиаметрДиска В (&СписокДиаметров)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборПоСезону
	                  |					ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Сезонность В (&СписокСезонов)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборПоВидуНоменлкатуры
	                  |					ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ВидНоменклатуры В (&СписокВидыНоменклатуры)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборПоШирине
	                  |					ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Ширина В (&СписокШирины)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборПоВысотеПрофиля
	                  |					ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.ВысотаПрофиля В (&СписокВысотПрофилей)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборБУ
	                  |					ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.БУ = &БУ
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборПроизводители
	                  |						И НЕ &Использовать_ПроизводителиИсключение
	                  |					ТОГДА ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Производитель В (&СписокПроизводители)
	                  |				КОГДА &Использовать_ОтборПроизводители
	                  |						И &Использовать_ПроизводителиИсключение
	                  |					ТОГДА НЕ ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура.Производитель В (&СписокПроизводители)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |	
	                  |	ОБЪЕДИНИТЬ ВСЕ
	                  |	
	                  |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	                  |		ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура
	                  |	ИЗ
	                  |		РегистрНакопления.ПартииТоваровНаСкладах.ОстаткиИОбороты(
	                  |				КОНЕЦПЕРИОДА(&ДатаОст, ДЕНЬ),
	                  |				КОНЕЦПЕРИОДА(&ДатаОст, ДЕНЬ),
	                  |				Авто,
	                  |				ДвиженияИГраницыПериода,
	                  |				ВЫБОР
	                  |						КОГДА &Использовать_ОтборПоПоставщикам = ИСТИНА
	                  |							ТОГДА ДокументОприходования.Контрагент В (&Поставщики)
	                  |						ИНАЧЕ ИСТИНА
	                  |					КОНЕЦ
	                  |					И ВЫБОР
	                  |						КОГДА &Использовать_ОтборПоДоговорКонтрагента = ИСТИНА
	                  |							ТОГДА ДокументОприходования.ДоговорКонтрагента В (&ДоговораКонтрагента)
	                  |						ИНАЧЕ ИСТИНА
	                  |					КОНЕЦ) КАК ПартииТоваровНаСкладахОстаткиИОбороты
	                  |	ГДЕ
	                  |		ВЫБОР
	                  |				КОГДА &Использовать_ОтборНоменклатура
	                  |					ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура В (&СписокНоменклатуры)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборПоТипуНоменклатуры
	                  |					ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.Тип В (&СписокТиповНоменклатуры)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборПоДиаметру
	                  |					ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.ДиаметрДиска В (&СписокДиаметров)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборПоСезону
	                  |					ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.Сезонность В (&СписокСезонов)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборПоВидуНоменлкатуры
	                  |					ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.ВидНоменклатуры В (&СписокВидыНоменклатуры)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборПоШирине
	                  |					ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.Ширина В (&СписокШирины)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборПоВысотеПрофиля
	                  |					ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.ВысотаПрофиля В (&СписокВысотПрофилей)
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ
	                  |		И ВЫБОР
	                  |				КОГДА &Использовать_ОтборБУ
	                  |					ТОГДА ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура.БУ = &БУ
	                  |				ИНАЧЕ ИСТИНА
	                  |			КОНЕЦ) КАК ВложенныйЗапрос
	                  |ГДЕ
	                  |	ВЫБОР
	                  |			КОГДА &Использовать_ОтборНоменклатура
	                  |					И НЕ &Использовать_НоменклатураИсключение
	                  |				ТОГДА ВложенныйЗапрос.Номенклатура_.Ссылка В (&СписокНоменклатуры)
	                  |			КОГДА &Использовать_ОтборНоменклатура
	                  |					И &Использовать_НоменклатураИсключение
	                  |				ТОГДА НЕ ВложенныйЗапрос.Номенклатура_.Ссылка В (&СписокНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоТипуНоменклатуры
	                  |				ТОГДА ВложенныйЗапрос.Номенклатура_.Тип В (&СписокТиповНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПроизводители
	                  |					И НЕ &Использовать_ПроизводителиИсключение
	                  |				ТОГДА ВложенныйЗапрос.Номенклатура_.Производитель В (&СписокПроизводители)
	                  |			КОГДА &Использовать_ОтборПроизводители
	                  |					И &Использовать_ПроизводителиИсключение
	                  |				ТОГДА НЕ ВложенныйЗапрос.Номенклатура_.Производитель В (&СписокПроизводители)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоДиаметру
	                  |				ТОГДА ВложенныйЗапрос.Номенклатура_.ДиаметрДиска В (&СписокДиаметров)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоСезону
	                  |				ТОГДА ВложенныйЗапрос.Номенклатура_.Сезонность В (&СписокСезонов)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоШирине
	                  |				ТОГДА ВложенныйЗапрос.Номенклатура_.Ширина В (&СписокШирины)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоВысотеПрофиля
	                  |				ТОГДА ВложенныйЗапрос.Номенклатура_.ВысотаПрофиля В (&СписокВысотПрофилей)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборБУ
	                  |				ТОГДА ВложенныйЗапрос.Номенклатура_.БУ = &БУ
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И ВЫБОР
	                  |			КОГДА &Использовать_ОтборПоВидуНоменлкатуры
	                  |				ТОГДА ВложенныйЗапрос.Номенклатура_.ВидНоменклатуры В (&СписокВидыНоменклатуры)
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	ВложенныйЗапрос.Номенклатура_
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	ВложенныйЗапрос.Номенклатура_ КАК Номенклатура,
	                  |	ВложенныйЗапрос.КоличествоОстаток КАК Остаток,
	                  |	&ПравилоРасчета,
	                  |	&КонтрагентУЦ,
	                  |	&Приоритет,
	                  |	&УЦ,
	                  |	ВложенныйЗапрос.Номенклатура_.ВидНоменклатуры КАК ВидНоменклатуры,
	                  |	&ТипЦеныРассчитанной,
	                  |	ВложенныйЗапрос.Номенклатура_.avg_price КАК avg_price,
	                  |	ВложенныйЗапрос.Номенклатура_.min_price КАК min_price,
	                  |	ВложенныйЗапрос.Номенклатура_.max_price КАК max_price,
	                  |	ВложенныйЗапрос.Номенклатура_.count_stores КАК count_stores,
	                  |	ВложенныйЗапрос.Номенклатура_.min_price_compared КАК min_price_compared,
	                  |	ВложенныйЗапрос.Номенклатура_.max_price_compared КАК max_price_compared,
	                  |	ВложенныйЗапрос.Номенклатура_.card_popularity КАК card_popularity,
	                  |	ВложенныйЗапрос.Номенклатура_.url_path КАК url_path,
	                  |	ВложенныйЗапрос.Номенклатура_.Url КАК url
	                  |ИЗ
	                  |	(ВЫБРАТЬ
	                  |		НоменклатураСОтбором.Номенклатура_ КАК Номенклатура_,
	                  |		СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
	                  |	ИЗ
	                  |		НоменклатураСОтбором КАК НоменклатураСОтбором
	                  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	                  |					КОНЕЦПЕРИОДА(&ДатаОст, ДЕНЬ),
	                  |					Номенклатура В
	                  |						(ВЫБРАТЬ
	                  |							НоменклатураСОтбором.Номенклатура_
	                  |						ИЗ
	                  |							НоменклатураСОтбором)) КАК ТоварыНаСкладахОстатки
	                  |			ПО НоменклатураСОтбором.Номенклатура_ = ТоварыНаСкладахОстатки.Номенклатура
	                  |	
	                  |	СГРУППИРОВАТЬ ПО
	                  |		НоменклатураСОтбором.Номенклатура_) КАК ВложенныйЗапрос
	                  |ГДЕ
	                  |	ВЫБОР
	                  |			КОГДА &Использовать_ОтборОстаток
	                  |				ТОГДА ВЫБОР
	                  |						КОГДА &ВНаличии
	                  |							ТОГДА ВложенныйЗапрос.КоличествоОстаток > 0
	                  |						КОГДА &ВНаличии = ЛОЖЬ
	                  |							ТОГДА ВложенныйЗапрос.КоличествоОстаток < 0
	                  |						ИНАЧЕ ИСТИНА
	                  |					КОНЕЦ
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ";
	
	//КонецЕсли;
	
	ЗапросНом.УстановитьПараметр("Использовать_ОтборОстаток",Использовать_ОтборОстаток );
	ЗапросНом.УстановитьПараметр("ВНаличии", ?(ПравилоРасчета.ВНаличии = Перечисления.ДаНет_сд.Да, Истина, Ложь));
	
	
	
	//                                                                                                 
	ЗапросНом.УстановитьПараметр("Использовать_ОтборНоменклатура", Использовать_ОтборНоменклатура);
	ЗапросНом.УстановитьПараметр("СписокНоменклатуры", ПравилоРасчета.Номенклатура.ВыгрузитьКолонку("Номенклатура"));
	
	ЗапросНом.УстановитьПараметр("Использовать_ОтборПоТипуНоменклатуры", Использовать_ОтборПоТипуНоменклатуры);
	ЗапросНом.УстановитьПараметр("СписокТиповНоменклатуры", ПравилоРасчета.ТипыНоменклатуры.ВыгрузитьКолонку("ТипНоменклатуры"));
	
	ЗапросНом.УстановитьПараметр("Использовать_ОтборПоДиаметру", Использовать_ОтборПоДиаметру);
	ЗапросНом.УстановитьПараметр("СписокДиаметров", ПравилоРасчета.Модель.ВыгрузитьКолонку("Диаметр"));
	
	ЗапросНом.УстановитьПараметр("Использовать_ОтборПоСезону", Использовать_ОтборПоСезону);
	ЗапросНом.УстановитьПараметр("СписокСезонов", ПравилоРасчета.Сезоны.ВыгрузитьКолонку("Сезон"));
	
	ЗапросНом.УстановитьПараметр("Использовать_ОтборПоПоставщикам", Использовать_ОтборПоПоставщикам);
	ЗапросНом.УстановитьПараметр("СписокПоставщиков", ПравилоРасчета.Поставщики.ВыгрузитьКолонку("Поставщик"));
	
	//с.д. рижий 2023-10-01 (    
	Использовать_ОтборПоВидуНоменлкатуры	 = ?(ПравилоРасчета.ВидыНоменклатуры.Количество() <> 0, Истина, Ложь);
	ЗапросНом.УстановитьПараметр("Использовать_ОтборПоВидуНоменлкатуры", Использовать_ОтборПоВидуНоменлкатуры);
	ЗапросНом.УстановитьПараметр("СписокВидыНоменклатуры", ПравилоРасчета.ВидыНоменклатуры.ВыгрузитьКолонку("ВидНоменклатуры"));
	
	
	ЗапросНом.УстановитьПараметр("Города", ПравилоРасчета.Города.ВыгрузитьКолонку("Город"));
	Использовать_ОтборПоГородам		     = ?(ПравилоРасчета.Города.Количество() <> 0, Истина, Ложь);
	ЗапросНом.УстановитьПараметр("Использовать_ОтборПоГородам", Использовать_ОтборПоГородам);
	
	
	ЗапросНом.УстановитьПараметр("Поставщики", ПравилоРасчета.Поставщики.ВыгрузитьКолонку("Поставщик"));   
	Использовать_ОтборПоПоставщикам		     = ?(ПравилоРасчета.Поставщики.Количество() <> 0, Истина, Ложь);
	ЗапросНом.УстановитьПараметр("Использовать_ОтборПоПоставщикам",Использовать_ОтборПоПоставщикам);   
	
	ЗапросНом.УстановитьПараметр("ПоставщикиТекст", ПравилоРасчета.ПоставщикиТекст.ВыгрузитьКолонку("Поставщик"));   
	Использовать_ОтборПоПоставщикамТекст		     = ?(ПравилоРасчета.ПоставщикиТекст.Количество() <> 0, Истина, Ложь);
	ЗапросНом.УстановитьПараметр("Использовать_ОтборПоПоставщикамТекст",Использовать_ОтборПоПоставщикамТекст);   
	
	
	ЗапросНом.УстановитьПараметр("СписокПроизводители", ПравилоРасчета.Производители.ВыгрузитьКолонку("Производитель"));   
	Использовать_ОтборПроизводители		     = ?(ПравилоРасчета.Производители.Количество() <> 0, Истина, Ложь);
	ЗапросНом.УстановитьПараметр("Использовать_ОтборПроизводители",Использовать_ОтборПроизводители);   
	
	
	ЗапросНом.УстановитьПараметр("Использовать_ПоставщикиТекстИсключение", ПравилоРасчета.ПоставщикиТекстИсключение);
	ЗапросНом.УстановитьПараметр("Использовать_ПроизводителиИсключение", ПравилоРасчета.ПроизводителиИсключение);
	ЗапросНом.УстановитьПараметр("Использовать_ГородИсключение", ПравилоРасчета.ГородИсключение);
	ЗапросНом.УстановитьПараметр("Использовать_НоменклатураИсключение", ПравилоРасчета.НоменклатураИсключение);
	
	
	
	ЗапросНом.УстановитьПараметр("ДоговораКонтрагента", ПравилоРасчета.ДоговораКонтрагента.ВыгрузитьКолонку("ДоговорКонтрагента"));   
	Использовать_ОтборПоДоговорКонтрагента	     = ?(ПравилоРасчета.ДоговораКонтрагента.Количество() <> 0, Истина, Ложь);
	ЗапросНом.УстановитьПараметр("Использовать_ОтборПоДоговорКонтрагента",Использовать_ОтборПоДоговорКонтрагента);   
	
	
	//с.д. рижий 2023-10-1    
	ЗапросНом.УстановитьПараметр("Использовать_ОтборБУ",Использовать_ОтборБУ );
	ЗапросНом.УстановитьПараметр("БУ", ?(ПравилоРасчета.БУ = Перечисления.ДаНет_сд.Да, Истина, Ложь));
	
	
	ЗапросНом.УстановитьПараметр("Использовать_ОтборПоШирине", Использовать_ОтборПоШирине);
	ЗапросНом.УстановитьПараметр("СписокШирины", ПравилоРасчета.Ширина.ВыгрузитьКолонку("Ширина"));
	
	ЗапросНом.УстановитьПараметр("Использовать_ОтборПоВысотеПрофиля", Использовать_ОтборПоВысотеПрофиля);
	ЗапросНом.УстановитьПараметр("СписокВысотПрофилей", ПравилоРасчета.ВысотаПрофиля.ВыгрузитьКолонку("Профиль"));
	
	//с.д. рижий 2023-10-05 (
	//ЗапросНом.УстановитьПараметр("Использовать_ОтборОстатокНеМеньше", Использовать_ОтборОстатокНеМеньше);
	//ЗапросНом.УстановитьПараметр("ОстатокНаСкладеНеМеньше", ПравилоРасчета.ОстатокНаСкладеНеМеньше);
	//
	//ЗапросНом.УстановитьПараметр("Использовать_ОтборОстатокНеБольше", Использовать_ОтборОстатокНеБольше);
	//ЗапросНом.УстановитьПараметр("ОстатокНаСкладеНеБольше", ПравилоРасчета.ОстатокНаСкладеНеБольше);
	//ЗапросНом.УстановитьПараметр("Использовать_ОтборОстаток", Использовать_ОтборОстатокНеМеньше);
	//с.д. рижий 2023-10-05 (
	//                                                                
	ЗапросНом.УстановитьПараметр("ТипЦеныРассчитанной", ПравилоРасчета.ТипЦеныРассчитанной);  
	ЗапросНом.УстановитьПараметр("ПравилоРасчета", ПравилоРасчета);  
	ЗапросНом.УстановитьПараметр("КонтрагентУЦ", ПравилоРасчета.КонтрагентУЦ);  
	ЗапросНом.УстановитьПараметр("Приоритет", ПравилоРасчета.Приоритет);
	ЗапросНом.УстановитьПараметр("УЦ", ложь);
	
	
	
	ЗапросНом.УстановитьПараметр("ДатаОст", ДатаДокументов);
	РезНом = ЗапросНом.Выполнить();
	Возврат РезНом;
	
КонецФункции	




//с.д. Рижий 2023-10-01 (
Функция РачитатьЦену(Номенклатура, _ПравилоРасчета_)
	
	Результат = 0;
	
	Если ТипЗнч(_ПравилоРасчета_) = Тип("Число") Тогда 
		
		Результат = _ПравилоРасчета_;    
		
	ИначеЕсли ТипЗнч(_ПравилоРасчета_) = Тип("Строка") Тогда 
		//[ЦенаСоСкидкой]
		//[ЦенаОпт]
		//[ЦенаРекомендована]
		НайдЦенаСтрокой = Найти(_ПравилоРасчета_, "[ЦенаСоСкидкой]");
		Если НайдЦенаСтрокой = 0 Тогда 
			НайдЦенаСтрокой = Найти(_ПравилоРасчета_, "[ЦенаОпт]");
			Если НайдЦенаСтрокой = 0 Тогда 
				НайдЦенаСтрокой = Найти(_ПравилоРасчета_, "[ЦенаРекомендована]");
				Если НайдЦенаСтрокой <> 0 Тогда
					Результат = ВернутьЦенуПоставщика(Номенклатура,Номенклатура.ОсновнойПоставщик, "ЦенаРекомендована");
				КонецЕсли;	
			Иначе
				Результат = ВернутьЦенуПоставщика(Номенклатура,Номенклатура.ОсновнойПоставщик, "ЦенаОпт");
			КонецЕсли;	
		Иначе
			Результат = ВернутьЦенуПоставщика(Номенклатура,Номенклатура.ОсновнойПоставщик, "ЦенаСоСкидкой");
		КонецЕсли;	
		
	ИначеЕсли _ПравилоРасчета_ = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаРекомендованая Тогда 
		//[ЦенаСоСкидкой]
		//[ЦенаОпт]
		//[ЦенаРекомендована]
		Результат = ВернутьЦенуПоставщика(Номенклатура,Номенклатура.ОсновнойПоставщик, "ЦенаРекомендована");
		
	ИначеЕсли _ПравилоРасчета_ = Справочники.ТипыЦенНоменклатурыПрочее_сд.СебестоимостьНаша Тогда 
		//[ЦенаСоСкидкой]
		//[ЦенаОпт]
		//[ЦенаРекомендована]
		Результат = ВернутьСебестоимостьПоставщика(Номенклатура,Поставщики.ВыгрузитьКолонку("Поставщик"));
		
		
	ИначеЕсли _ПравилоРасчета_ = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаОпт Тогда 
		//[ЦенаСоСкидкой]
		//[ЦенаОпт]
		//[ЦенаРекомендована]
		Результат = ВернутьЦенуПоставщика(Номенклатура,Номенклатура.ОсновнойПоставщик, "ЦенаОпт");     
		//ИначеЕсли ПравилоРасчета_.ЦенаРассчитанаНеМеньше = Справочники.ТипыЦенНоменклатурыПрочее_сд.цен Тогда 
		//	//[ЦенаСоСкидкой]
		//	//[ЦенаОпт]
		//	//[ЦенаРекомендована]
		//	ЦенаМин = ВернутьЦенуПоставщика(Строка_, "ЦенаЗакупки");     
		//	
	ИначеЕсли _ПравилоРасчета_ = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаСоСкидкой Тогда 
		//[ЦенаСоСкидкой]
		//[ЦенаОпт]
		//[ЦенаРекомендована]
		Результат = ВернутьЦенуПоставщика(Номенклатура,Номенклатура.ОсновнойПоставщик, "ЦенаСоСкидкой");
		
	ИначеЕсли ТипЗнч(_ПравилоРасчета_) = Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
		ОтборСрезаН = новый Структура;
		ОтборСрезаН.Вставить("ТипЦен", _ПравилоРасчета_);
		ОтборСрезаН.Вставить("Номенклатура", Номенклатура);
		СрезЦенПоБазовН = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(ДатаДокументов, ОтборСрезаН);
		Если СрезЦенПоБазовН.Количество() <> 0 Тогда 
			Результат = СрезЦенПоБазовН[0].Цена;
		КонецЕсли;
	ИначеЕсли ТипЗнч(_ПравилоРасчета_) = Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
		ОтборСрезаН = новый Структура;
		ОтборСрезаН.Вставить("ТипЦен", _ПравилоРасчета_);
		ОтборСрезаН.Вставить("Номенклатура", Номенклатура);
		СрезЦенПоБазовН = РегистрыСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(ДатаДокументов, ОтборСрезаН);
		Если СрезЦенПоБазовН.Количество() <> 0 Тогда 
			Результат = СрезЦенПоБазовН[0].Цена;
		КонецЕсли;
	КонецЕсли;	
	
	
	возврат Результат;
	
КонецФункции	

функция ВернутьЦену(Строка_)
	//Ціна по кожній номенклатурі рахується за такою формулою :
	//[ціна] = [тип базової ціни].Ціна  + [Націнка сумою]  
	//якщо [Націнка сумою] = 0 тоді [Знижка сумою] = [тип базової ціни].Ціна /100*[Знижка відсотком] 
	//якщо [ціна] <= [ціна розрахована не менше ] то встановлюмо [ціна] = [ціна розрахована не менше ] . 
	//Якщо [ціна розрахована не менше ]  = 0 то не перевіряємо цю умову
	//якщо [ціна] >=  [ціна розрахована не більше]   то встановлюмо [ціна] =  [ціна розрахована не більше] . 
	//Якщо  [ціна розрахована не більше]    = 0 то не перевіряємо цю умову
	//замість  
	//[Знижка відсотком]  тра    [Націнка  відсотком  ] 
	//[Знижка сумою]     тра   [Націнка сумою] 	Цена_ = 0;
	ПравилоРасчета_ = Строка_.ПравилоРасчета;
	Если ЗначениеЗаполнено(ПравилоРасчета_.ТипБазовойЦены) Тогда 
		//ОтборСреза = новый Структура;
		//ОтборСреза.Вставить("ТипЦен", ПравилоРасчета_.ТипБазовойЦены);
		//ОтборСреза.Вставить("Номенклатура", Строка_.Номенклатура);
		//СрезЦенПоБазов = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(ДатаДокументов, ОтборСреза);
		ЦенаПоБазовойЦене = 0;
		Наценка_ 		  = 0;
		Строка_.ЦенаМин 		  = 0;
		Строка_.ЦенаМакс 		  = 0;
		//Если СрезЦенПоБазов.Количество() <> 0 Тогда 
		//	ЦенаПоБазовойЦене = СрезЦенПоБазов[0].Цена;     
		ЦенаПоБазовойЦене = РачитатьЦену(Строка_.Номенклатура,ПравилоРасчета_.ТипБазовойЦены);
		//КонецЕсли;
		Если не ПравилоРасчета_.НаценкаСуммой = 0 Тогда  
			Наценка_ = ПравилоРасчета_.НаценкаСуммой;
		Иначе
			Если не ПравилоРасчета_.НаценкаПроцентом = 0 Тогда 
				Наценка_ = ЦенаПоБазовойЦене /100 * ПравилоРасчета_.НаценкаПроцентом;
			КонецЕсли;
		КонецЕсли;
		
		Цена_ = ЦенаПоБазовойЦене + Наценка_;
		
		//ЦенаМин
		//Если ЗначениеЗаполнено(ПравилоРасчета_.ЦенаРассчитанаНеМеньше) Тогда 
		//	Если ТипЗнч(ПравилоРасчета_.ЦенаРассчитанаНеМеньше) = Тип("Число") Тогда 
		//		ЦенаМин = ПравилоРасчета_.ЦенаРассчитанаНеМеньше;
		//	ИначеЕсли ТипЗнч(ПравилоРасчета_.ЦенаРассчитанаНеМеньше) = Тип("Строка") Тогда 
		//		//[ЦенаСоСкидкой]
		//		//[ЦенаОпт]
		//		//[ЦенаРекомендована]
		//		НайдЦенаСтрокой = Найти(ПравилоРасчета_.ЦенаРассчитанаНеМеньше, "[ЦенаСоСкидкой]");
		//		Если НайдЦенаСтрокой = 0 Тогда 
		//			НайдЦенаСтрокой = Найти(ПравилоРасчета_.ЦенаРассчитанаНеМеньше, "[ЦенаОпт]");
		//			Если НайдЦенаСтрокой = 0 Тогда 
		//				НайдЦенаСтрокой = Найти(ПравилоРасчета_.ЦенаРассчитанаНеМеньше, "[ЦенаРекомендована]");
		//				Если НайдЦенаСтрокой <> 0 Тогда
		//					ЦенаМин = ВернутьЦенуПоставщика(Строка_, "ЦенаРекомендована");
		//				КонецЕсли;	
		//			Иначе
		//				ЦенаМин = ВернутьЦенуПоставщика(Строка_, "ЦенаОпт");
		//			КонецЕсли;	
		//		Иначе
		//			ЦенаМин = ВернутьЦенуПоставщика(Строка_, "ЦенаСоСкидкой");
		//		КонецЕсли;	
		//		
		//	ИначеЕсли ПравилоРасчета_.ЦенаРассчитанаНеМеньше = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаРекомендованая Тогда 
		//		//[ЦенаСоСкидкой]
		//		//[ЦенаОпт]
		//		//[ЦенаРекомендована]
		//		ЦенаМин = ВернутьЦенуПоставщика(Строка_, "ЦенаРекомендована");
		//		
		//	ИначеЕсли ПравилоРасчета_.ЦенаРассчитанаНеМеньше = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаЗакупки Тогда 
		//		//[ЦенаСоСкидкой]
		//		//[ЦенаОпт]
		//		//[ЦенаРекомендована]
		//		ЦенаМин = ВернутьЦенуПоставщика(Строка_, "ЦенаЗакупки");     
		//		
		//	ИначеЕсли ПравилоРасчета_.ЦенаРассчитанаНеМеньше = Справочники.ТипыЦенНоменклатурыПрочее_сд.ЦенаСоСкидкой Тогда 
		//		//[ЦенаСоСкидкой]
		//		//[ЦенаОпт]
		//		//[ЦенаРекомендована]
		//		ЦенаМин = ВернутьЦенуПоставщика(Строка_, "ЦенаСоСкидкой");
		//		
		//	ИначеЕсли ТипЗнч(ПравилоРасчета_.ЦенаРассчитанаНеМеньше) = Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
		//		ОтборСрезаН = новый Структура;
		//		ОтборСрезаН.Вставить("ТипЦен", ПравилоРасчета_.ЦенаРассчитанаНеМеньше);
		//		ОтборСрезаН.Вставить("Номенклатура", Строка_.Номенклатура);
		//		СрезЦенПоБазовН = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(ДатаДокументов, ОтборСрезаН);
		//		Если СрезЦенПоБазовН.Количество() <> 0 Тогда 
		//			ЦенаМин = СрезЦенПоБазовН[0].Цена;
		//		КонецЕсли;
		//	ИначеЕсли ТипЗнч(ПравилоРасчета_.ЦенаРассчитанаНеМеньше) = Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
		//		ОтборСрезаН = новый Структура;
		//		ОтборСрезаН.Вставить("ТипЦен", ПравилоРасчета_.ЦенаРассчитанаНеМеньше);
		//		ОтборСрезаН.Вставить("Номенклатура", Строка_.Номенклатура);
		//		СрезЦенПоБазовН = РегистрыСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(ДатаДокументов, ОтборСрезаН);
		//		Если СрезЦенПоБазовН.Количество() <> 0 Тогда 
		//			ЦенаМин = СрезЦенПоБазовН[0].Цена;
		//		КонецЕсли;
		//	КонецЕсли;	
		//КонецЕсли; 
		
		ЦенаМин = РачитатьЦену(Строка_.Номенклатура, ПравилоРасчета_.ЦенаРассчитанаНеМеньше);
		//ЦенаМакс
		//Если ЗначениеЗаполнено(ПравилоРасчета_.ЦенаРассчитанаНеБольше) Тогда 
		//	Если ТипЗнч(ПравилоРасчета_.ЦенаРассчитанаНеБольше) = Тип("Число") Тогда 
		//		ЦенаМакс = ПравилоРасчета_.ЦенаРассчитанаНеБольше;
		//	ИначеЕсли ТипЗнч(ПравилоРасчета_.ЦенаРассчитанаНеБольше) = Тип("Строка") Тогда 
		//		//[ЦенаСоСкидкой]
		//		//[ЦенаОпт]
		//		//[ЦенаРекомендована]
		//		НайдЦенаСтрокой = Найти(ПравилоРасчета_.ЦенаРассчитанаНеБольше, "[ЦенаСоСкидкой]");
		//		Если НайдЦенаСтрокой = 0 Тогда 
		//			НайдЦенаСтрокой = Найти(ПравилоРасчета_.ЦенаРассчитанаНеБольше, "[ЦенаОпт]");
		//			Если НайдЦенаСтрокой = 0 Тогда 
		//				НайдЦенаСтрокой = Найти(ПравилоРасчета_.ЦенаРассчитанаНеБольше, "[ЦенаРекомендована]");
		//				Если НайдЦенаСтрокой <> 0 Тогда
		//					ЦенаМакс = ВернутьЦенуПоставщика(Строка_, "ЦенаРекомендована");
		//				КонецЕсли;	
		//			Иначе
		//				ЦенаМакс = ВернутьЦенуПоставщика(Строка_, "ЦенаОпт");
		//			КонецЕсли;	
		//		Иначе
		//			ЦенаМакс = ВернутьЦенуПоставщика(Строка_, "ЦенаСоСкидкой");
		//		КонецЕсли;
		//	ИначеЕсли ТипЗнч(ПравилоРасчета_.ЦенаРассчитанаНеБольше) = Тип("СправочникСсылка.ТипыЦенНоменклатуры") Тогда
		//		ОтборСрезаН = новый Структура;
		//		ОтборСрезаН.Вставить("ТипЦен", ПравилоРасчета_.ЦенаРассчитанаНеБольше);
		//		ОтборСрезаН.Вставить("Номенклатура", Строка_.Номенклатура);
		//		СрезЦенПоБазовН = РегистрыСведений.ЦеныНоменклатуры.СрезПоследних(ДатаДокументов, ОтборСрезаН);
		//		Если СрезЦенПоБазовН.Количество() <> 0 Тогда 
		//			ЦенаМакс = СрезЦенПоБазовН[0].Цена;
		//		КонецЕсли;
		//	ИначеЕсли ТипЗнч(ПравилоРасчета_.ЦенаРассчитанаНеБольше) = Тип("СправочникСсылка.ТипыЦенНоменклатурыКонтрагентов") Тогда
		//		ОтборСрезаН = новый Структура;
		//		ОтборСрезаН.Вставить("ТипЦен", ПравилоРасчета_.ЦенаРассчитанаНеБольше);
		//		ОтборСрезаН.Вставить("Номенклатура", Строка_.Номенклатура);
		//		СрезЦенПоБазовН = РегистрыСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(ДатаДокументов, ОтборСрезаН);
		//		Если СрезЦенПоБазовН.Количество() <> 0 Тогда 
		//			ЦенаМакс = СрезЦенПоБазовН[0].Цена;
		//		КонецЕсли;
		//	КонецЕсли;	
		//КонецЕсли;
		Строка_.ЦенаМакс = РачитатьЦену(Строка_.Номенклатура, ПравилоРасчета_.ЦенаРассчитанаНеБольше);
		
		
		Если не Строка_.ЦенаМин = 0 Тогда 
			Если Цена_ < Строка_.ЦенаМин Тогда 
				Цена_ = Строка_.ЦенаМин;
			КонецЕсли;	
		КонецЕсли;	
		
		Если не Строка_.ЦенаМакс = 0 Тогда 
			Если Цена_ > Строка_.ЦенаМакс Тогда 
				Цена_ = Строка_.ЦенаМакс;
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Цена_;
	
КонецФункции	

Функция ВернутьСебестоимостьПоставщика(Номенклатура,Поставщик)
	
	ЦенаПост = 0;
	ЗапросНомПост = новый запрос;
	ЗапросНомПост.Текст = "ВЫБРАТЬ
	|	СУММА(ПартииТоваровНаСкладахОстаткиИОбороты.СтоимостьКонечныйОстаток) КАК СтоимостьКонечныйОстаток,
	|	СУММА(ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток = 0
	|				ТОГДА 0
	|			ИНАЧЕ ПартииТоваровНаСкладахОстаткиИОбороты.СтоимостьКонечныйОстаток / ПартииТоваровНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток
	|		КОНЕЦ) КАК Себестоимость,
	|	ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладах.ОстаткиИОбороты(
	|			&ДатаДокументов,
	|			&ДатаДокументов,
	|			Авто,
	|			ДвиженияИГраницыПериода,
	|			Номенклатура = &Номенклатура
	|				И ВЫБОР
	|					КОГДА &Использовать_ОтборПоПоставщикам
	|						ТОГДА ДокументОприходования.Контрагент В (&Поставщик)    иначе Истина
	|				КОНЕЦ) КАК ПартииТоваровНаСкладахОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровНаСкладахОстаткиИОбороты.Номенклатура";
	ЗапросНомПост.УстановитьПараметр("ДатаДокументов", ДатаДокументов); 
	Использовать_ОтборПоПоставщикам		     = ?(Поставщик.Количество() <> 0, Истина, Ложь);
	
	
	ЗапросНомПост.УстановитьПараметр("Использовать_ОтборПоПоставщикам", Использовать_ОтборПоПоставщикам);
	
	ЗапросНомПост.УстановитьПараметр("Поставщик", Поставщик);
	
	ЗапросНомПост.УстановитьПараметр("Номенклатура", Номенклатура);
	РезНомПост = ЗапросНомПост.Выполнить().Выгрузить();
	Если РезНомПост.Количество() <> 0 Тогда 
		
		//Если РезНомПост.Количество() <> 0 Тогда 
		ЦенаПост = РезНомПост[0].Себестоимость;
		//КонецЕсли;
		
	КонецЕсли;
	Возврат ЦенаПост;
	
КонецФункции	



Функция ВернутьЦенуПоставщика(Номенклатура,Поставщик, ЦенаСтрокой)
	
	ЦенаПост = 0;
	ЗапросНомПост = новый запрос;
	ЗапросНомПост.Текст = "ВЫБРАТЬ
	|	НоменклатураПоставщика.Ссылка
	|ИЗ
	|	Справочник.НоменклатураПоставщика КАК НоменклатураПоставщика
	|ГДЕ
	|	НоменклатураПоставщика.Владелец = &Владелец
	|	И НоменклатураПоставщика.Номенклатура = &Номенклатура
	|	И НЕ НоменклатураПоставщика.ПометкаУдаления";
	ЗапросНомПост.УстановитьПараметр("Владелец", Поставщик);
	ЗапросНомПост.УстановитьПараметр("Номенклатура", Номенклатура);
	РезНомПост = ЗапросНомПост.Выполнить().Выгрузить();
	Если РезНомПост.Количество() <> 0 Тогда 
		
		ОтборСрезаМин = новый Структура;
		ОтборСрезаМин.Вставить("НоменклатураПоставщика", РезНомПост[0].Ссылка);
		СрезЦенПоБазов = РегистрыСведений.НоменклатураПоставщикаОстатки_СД.СрезПоследних(ДатаДокументов, ОтборСрезаМин);
		Если СрезЦенПоБазов.Количество() <> 0 Тогда 
			ЦенаПост = СрезЦенПоБазов[0][ЦенаСтрокой];
		КонецЕсли;
		
	КонецЕсли;
	Возврат ЦенаПост;
	
КонецФункции	

Процедура СоздатьДокументы() Экспорт    
	
	
	
	НоменклатураПоПравилу.Сортировать("УЦ УБЫВ,Номенклатура");
	
	ДатаДокументаУЦ = ДатаДокументов;
	Для Каждого Стр_Правило из  ДокументыУЦ Цикл   
		
		
		//Для Каждого ЕлКонтрагент из масивКонтрагенты Цикл 
		ВывестиКоментарий("УЦ {" ,Стр_Правило.КонтрагентУЦ,"{");
		
		//
		
		СтруктПрав = новый Структура;
		СтруктПрав.Вставить("КонтрагентУЦ", Стр_Правило.КонтрагентУЦ);
		СтруктПрав.Вставить("ВидНоменклатуры", Стр_Правило.ВидНоменклатуры);  
		СтруктПрав.Вставить("УЦ", Истина);
		
		
		Строки_ПоПравилу = НоменклатураПоПравилу.НайтиСтроки(СтруктПрав);
		
		Если Строки_ПоПравилу.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;	      
		
		
		СоздатьДокументыКонтрагентФрагмент(Стр_Правило , Строки_ПоПравилу,ДатаДокументаУЦ);
		
		ВывестиКоментарий("} УЦ",Стр_Правило.КонтрагентУЦ);
		ДатаДокументаУЦ  = ДатаДокументаУЦ + 1;
		//конецЦикла;	
		
		
	КонецЦикла;
	
КонецПроцедуры

//Процедура СоздатьДокументыФрагмент(Знач Стр_Правило, Знач СтрвидНоменклатуры, Знач Строки_ПоПравилу, Знач ТипЦен_)
//	
//	Перем ДокументОбъект, НовыйТовар, СтрокаТиповЦен, СтрокаТовара;
//	
//	ДокументОбъект = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
//	
//	ДокументОбъект.ВидНоменклатуры = СтрвидНоменклатуры.ВидНоменклатуры;
//	
//	ДокументОбъект.Дата = ТекущаяДата();
//	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
//	ДокументОбъект.НеПроводитьНулевыеЗначения = Истина;
//	
//	СтрокаТиповЦен = ДокументОбъект.ТипыЦен.Найти(ТипЦен_, "ТипЦен");
//	
//	Если СтрокаТиповЦен = Неопределено Тогда
//		СтрокаТиповЦен = ДокументОбъект.ТипыЦен.Добавить();
//		СтрокаТиповЦен.ТипЦен = ТипЦен_;
//	КонецЕсли;
//	
//	
//	Для Каждого СтрокаТовара Из Строки_ПоПравилу Цикл
//		Если СтрокаТовара.ЦенаУЦ = 0 Тогда
//			Продолжить;
//		КонецЕсли;             
//		
//		//СтруктураПоиска = Новый Структура;
//		//СтруктураПоиска.Вставить("Номенклатура", СтрокаТовара.Номенклатура);
//		//СтруктураПоиска.Вставить("ТипЦен", ТипЦен_);
//		
//		//НовыйТовар = ОбработкаТабличныхЧастей.НайтиСтрокуТабЧасти(ДокументОбъект.Товары, СтруктураПоиска);
//		//
//		//Если НовыйТовар = Неопределено Тогда
//		НовыйТовар 							= ДокументОбъект.Товары.Добавить();
//		НовыйТовар.Номенклатура 			= СтрокаТовара.Номенклатура;
//		НовыйТовар.ТипЦен 					= ТипЦен_;
//		НовыйТовар.ИндексСтрокиТаблицыЦен 	= 0;
//		//КонецЕсли;
//		//
//		НовыйТовар.Цена 						= СтрокаТовара.ЦенаУЦ;
//		НовыйТовар.Валюта 						= ТипЦен_.ВалютаЦены;
//		НовыйТовар.ЕдиницаИзмерения 			= СтрокаТовара.Номенклатура.ЕдиницаХраненияОстатков;
//		//НовыйТовар.ПроцентСкидкиНаценки 		= ТипЦен.ПроцентСкидкиНаценки;
//		//НовыйТовар.СпособРасчетаЦены 			= ТипЦен.СпособРасчетаЦены;
//	КонецЦикла;			
//	
//	Попытка
//		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
//		//Сообщить("Записан документ: " + ДокументОбъект);
//		Стр_Правило.ДокУЦ = ДокументОбъект.Ссылка;
//	Исключение
//		Сообщить("Не удалось записать документ установки цен: " + ОписаниеОшибки(), СтатусСообщения.Важное);
//	КонецПопытки;
//	
//КонецПроцедуры

Процедура СоздатьДокументыКонтрагентФрагмент(Стр_Правило, Знач Строки_ПоПравилу, ДатаДокументаУЦ)
	
	Перем ДокументОбъект, НовыйТовар, СтрокаТиповЦен, СтрокаТовара;
	
	ДокументОбъект = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	ДокументОбъект.КонтрагентРасчета = Стр_Правило.КонтрагентУЦ;	
	ДокументОбъект.ВидНоменклатуры = Стр_Правило.ВидНоменклатуры;
	
	ДокументОбъект.Дата = ДатаДокументаУЦ;
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъект, глЗначениеПеременной("глТекущийПользователь"));
	ДокументОбъект.НеПроводитьНулевыеЗначения = Истина;
	
	//+БП: d.matyash (22.09.2025) <>
	ДокументОбъектСтараяЦена = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	ДокументОбъектСтараяЦена.КонтрагентРасчета = Стр_Правило.КонтрагентУЦ;	
	ДокументОбъектСтараяЦена.ВидНоменклатуры = Стр_Правило.ВидНоменклатуры;
	
	ДокументОбъектСтараяЦена.Дата = ДатаДокументаУЦ;
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокументОбъектСтараяЦена, глЗначениеПеременной("глТекущийПользователь"));
	ДокументОбъектСтараяЦена.НеПроводитьНулевыеЗначения = Истина;
	//-БП: d.matyash (22.09.2025) <>
	
	Для Каждого СтрокаТовара Из Строки_ПоПравилу Цикл
		
		
		
		
		Если СтрокаТовара.ЦенаУЦ = 0 Тогда
			Продолжить;
		КонецЕсли;             
		
		
		СтрокаТиповЦен = ДокументОбъект.ТипыЦен.Найти(СтрокаТовара.ТипЦеныРассчитанной, "ТипЦен");
		
		Если СтрокаТиповЦен = Неопределено Тогда
			СтрокаТиповЦен = ДокументОбъект.ТипыЦен.Добавить();
			СтрокаТиповЦен.ТипЦен = СтрокаТовара.ТипЦеныРассчитанной;  
			
		КонецЕсли;
		
		//Если не контрагенты = Неопределено тогда
		
		//для каждого СтрокаКонтрагент из контрагенты цикл
		
		//СтруктураПоиска = Новый Структура;
		//СтруктураПоиска.Вставить("Номенклатура", СтрокаТовара.Номенклатура);
		//СтруктураПоиска.Вставить("ТипЦен", ТипЦен_);
		
		//НовыйТовар = ОбработкаТабличныхЧастей.НайтиСтрокуТабЧасти(ДокументОбъект.Товары, СтруктураПоиска);
		//
		//Если НовыйТовар = Неопределено Тогда
		НовыйТовар 							= ДокументОбъект.Товары.Добавить();
		НовыйТовар.Номенклатура 			= СтрокаТовара.Номенклатура;
		НовыйТовар.ТипЦен 					= СтрокаТовара.ТипЦеныРассчитанной;
		НовыйТовар.ИндексСтрокиТаблицыЦен 	= 0;
		//КонецЕсли;
		//
		НовыйТовар.Цена 						= СтрокаТовара.ЦенаУЦ;
		НовыйТовар.Валюта 						= СтрокаТовара.ТипЦеныРассчитанной.ВалютаЦены;
		НовыйТовар.ЕдиницаИзмерения 			= СтрокаТовара.Номенклатура.ЕдиницаХраненияОстатков;   
		НовыйТовар.Поставщик 				=  Стр_Правило.КонтрагентУЦ;
		//НовыйТовар.ПроцентСкидкиНаценки 		= ТипЦен.ПроцентСкидкиНаценки;
		//НовыйТовар.СпособРасчетаЦены 			= ТипЦен.СпособРасчетаЦены;
		//КонецЦикла;	
		
		//	КонецЕсли;	
		
		
		//+БП: d.matyash (22.09.2025) <>
		//------------------Старая Цена
		//      
		//Если СтрокаТовара.СтараяЦена <> 0 тогда
			СтрокаТиповЦен = ДокументОбъектСтараяЦена.ТипыЦен.Найти(СтрокаТовара.ТипЦеныРассчитанной.ТипСтаройЦены, "ТипЦен");
			
			Если СтрокаТиповЦен = Неопределено Тогда
				СтрокаТиповЦен = ДокументОбъектСтараяЦена.ТипыЦен.Добавить();
				СтрокаТиповЦен.ТипЦен = СтрокаТовара.ТипЦеныРассчитанной.ТипСтаройЦены;  
				
			КонецЕсли;
			
			НовыйТовар 							= ДокументОбъектСтараяЦена.Товары.Добавить();
			НовыйТовар.Номенклатура 			= СтрокаТовара.Номенклатура;
			НовыйТовар.ТипЦен 					= СтрокаТовара.ТипЦеныРассчитанной.ТипСтаройЦены;
			НовыйТовар.ИндексСтрокиТаблицыЦен 	= 0;
			//КонецЕсли;
			//
			НовыйТовар.Цена 						= СтрокаТовара.СтараяЦена;
			НовыйТовар.Валюта 						= СтрокаТовара.ТипЦеныРассчитанной.ВалютаЦены;
			НовыйТовар.ЕдиницаИзмерения 			= СтрокаТовара.Номенклатура.ЕдиницаХраненияОстатков;   
			НовыйТовар.Поставщик 				=  Стр_Правило.КонтрагентУЦ;
		//КонецЕсли;
        //-БП: d.matyash (22.09.2025) <>
		
	КонецЦикла;			
	
	ДокументОбъект.Товары.Сортировать("Номенклатура");
	ДокументОбъект.Комментарий = "Создано автоматом по правилам с.д.";
	
	//+БП: d.matyash (22.09.2025) <> 
	ДокументОбъектСтараяЦена.Товары.Сортировать("Номенклатура");
	ДокументОбъектСтараяЦена.Комментарий = "Создано автоматом по правилам с.д.";
	//-БП: d.matyash (22.09.2025) <>
	
	Попытка            
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		//Сообщить("Записан документ: " + ДокументОбъект);
		Стр_Правило.ДокУЦ = ДокументОбъект.Ссылка;
	Исключение         
		#Если клиент тогда
			Сообщить(ДокументОбъект);
			Сообщить("Не удалось записать документ установки цен: " + ОписаниеОшибки(), СтатусСообщения.Важное);
		#конецесли
		//ЗаписьЖурналаРегистрации("СозданиеУЦ_По_ПравиламРасчета_СД.СоздатьДокументыКонтрагентФрагмент",УровеньЖурналаРегистрации.Ошибка, Метаданные.Обработки.СозданиеУЦ_По_ПравиламРасчета_СД,Стр_Правило.ДокУЦ,ОписаниеОшибки()); //bsoft (21.08.2024)
		
		
	КонецПопытки; 
	
	//+БП: d.matyash (22.09.2025) <> 
	Попытка            
		
		ДокументОбъектСтараяЦена.Записать(РежимЗаписиДокумента.Запись);
		//Сообщить("Записан документ: " + ДокументОбъект);
		Стр_Правило.ДокУЦСтараяЦена = ДокументОбъектСтараяЦена.Ссылка;
	Исключение         
		#Если клиент тогда
			Сообщить(ДокументОбъектСтараяЦена);
			Сообщить("Не удалось записать документ установки цен: " + ОписаниеОшибки(), СтатусСообщения.Важное);
		#конецесли
		//ЗаписьЖурналаРегистрации("СозданиеУЦ_По_ПравиламРасчета_СД.СоздатьДокументыКонтрагентФрагмент",УровеньЖурналаРегистрации.Ошибка, Метаданные.Обработки.СозданиеУЦ_По_ПравиламРасчета_СД,Стр_Правило.ДокУЦ,ОписаниеОшибки()); //bsoft (21.08.2024)
		
		
	КонецПопытки;
	//-БП: d.matyash (22.09.2025) <>
	
	Если ПроводитьДокументУЦ тогда   
		
		Попытка          
			#Если клиент тогда
				
				Сообщить(ДокументОбъект);
				
			#конецесли
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//Сообщить("Записан документ: " + ДокументОбъект);
			//	Стр_Правило.ДокУЦ = ДокументОбъект.Ссылка;
		Исключение
			Сообщить("Не удалось провести документ установки цен: " + ОписаниеОшибки(), СтатусСообщения.Важное);
			//ЗаписьЖурналаРегистрации("СозданиеУЦ_По_ПравиламРасчета_СД.СоздатьДокументыКонтрагентФрагмент",УровеньЖурналаРегистрации.Ошибка, Метаданные.Обработки.СозданиеУЦ_По_ПравиламРасчета_СД,Стр_Правило.ДокУЦ,ОписаниеОшибки()); //bsoft (21.08.2024)
			
		КонецПопытки;    
		
		//+БП: d.matyash (22.09.2025) <> 
		Попытка          
			#Если клиент тогда
				
				Сообщить(ДокументОбъектСтараяЦена);
				
			#конецесли
			ДокументОбъектСтараяЦена.Записать(РежимЗаписиДокумента.Проведение);
			//Сообщить("Записан документ: " + ДокументОбъект);
			//	Стр_Правило.ДокУЦ = ДокументОбъект.Ссылка;
		Исключение
			Сообщить("Не удалось провести документ установки цен: " + ОписаниеОшибки(), СтатусСообщения.Важное);
			//ЗаписьЖурналаРегистрации("СозданиеУЦ_По_ПравиламРасчета_СД.СоздатьДокументыКонтрагентФрагмент",УровеньЖурналаРегистрации.Ошибка, Метаданные.Обработки.СозданиеУЦ_По_ПравиламРасчета_СД,Стр_Правило.ДокУЦ,ОписаниеОшибки()); //bsoft (21.08.2024)
			
		КонецПопытки;
		//-БП: d.matyash (22.09.2025) <>
		
		
	КонецЕсли;	
	
КонецПроцедуры    

Функция  	отменитьУцНаСервера() Экспорт
	
	
	ВывестиКоментарий("УЦ отмена","","{");
	
	МАсивДок = ДокументыУЦ.ВыгрузитьКолонку("ДокУЦ");
	
	//+БП: d.matyash (24.09.2025) <> 
	Для каждого Стр из ДокументыУЦ цикл  
		Если Не ЗначениеЗаполнено(Стр.ДокУЦСтараяЦена) тогда 
			Продолжить;
		КонецЕсли;
		МАсивДок.Добавить(Стр.ДокУЦСтараяЦена);	
	КонецЦикла;
	//-БП: d.matyash (24.09.2025) <>
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЦенНоменклатуры.Ссылка,
	|	УстановкаЦенНоменклатуры.ВидНоменклатуры,
	|	УстановкаЦенНоменклатуры.КонтрагентРасчета КАК Контрагент
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	|ГДЕ
	|	НЕ УстановкаЦенНоменклатуры.Ссылка В (&Список)
	|	И УстановкаЦенНоменклатуры.Проведен = ИСТИНА
	|	И УстановкаЦенНоменклатуры.Комментарий ПОДОБНО &Комментарий";
	
	Запрос.УстановитьПараметр("Комментарий", "Создано автоматом по правилам с.д.");
	Запрос.УстановитьПараметр("Список", МАсивДок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	
	для каждого ДокУц из ДокументыУЦ цикл
		
		Если не ДокУц.ДокУЦ.Проведен = истина тогда
			Продолжить;	
		Конецесли;
		
		
		_ОтборУЦ = новый Структура();
		_ОтборУЦ.Вставить("ВидНоменклатуры", ДокУц.ВидНоменклатуры);
		_ОтборУЦ.Вставить("Контрагент", ДокУц.КонтрагентУЦ);
		
		_докыУЦОтмена = ВыборкаДетальныеЗаписи.НайтиСтроки(_ОтборУЦ); 
		для каждого _докУЦОтмена из _докыУЦОтмена цикл
			докел  = _докУЦОтмена.ссылка.ПолучитьОбъект();
			//докел  = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
			докел.УстановитьПометкуУдаления(истина);
			//докел.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//докел.ЗАпи
		конецЦИкла;	
	конецЦикла;	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
	
	ВывестиКоментарий("} УЦ отмена");
	
	
конецФункции	


Функция ВЫполнитьВсе(отборструкутра = Неопределено) Экспорт
	
	//ДатаДокументов = ДатаДок;  
	#Если Клиент тогда
		Сообщить("{" + СокрЛП(ТекущаяДата()));
	#конецЕсли
	
	Если отборструкутра = Неопределено тогда
		ЗаполнитьПравила();
	Иначе
		ЗаполнитьПравилаПоОтбору(отборструкутра);
	КонецЕсли;
	
	ПроводитьДокументУЦ = Истина;
	
	ЗаполнитьВсеНаСервере();
	
	
	ПодготовитьУцНаСервере();
	
	СоздатьДокументы();      
	отменитьУцНаСервера();
	#Если Клиент тогда
		
		Сообщить("}" + СокрЛП(ТекущаяДата())); 
	#конецЕсли    
	
	//+БП: d.matyash (01.08.2025) <>
	//ТЗ = НоменклатураПоПравилу.ВыгрузитьКолонки("ПравилоРасчета,Номенклатура,ВидНоменклатуры,ТипЦеныРассчитанной,Приоритет,МІСТО,Поставщик,Остаток,Прибыль,ЦенаУЦ");
	//Для каждого СтрНом из НоменклатураПоПравилу цикл
	//	Если Не СтрНом.УЦ тогда 
	//		Продолжить;
	//	КонецЕсли;
	//	НайденнаяСтрока = ТЗ.Найти(СтрНом.Номенклатура, "Номенклатура");
	//	Если  НайденнаяСтрока = Неопределено тогда
	//		НовСтрока = ТЗ.Добавить();
	//		ЗаполнитьЗначенияСвойств(НовСтрока,СтрНом);
	//	Иначе
	//		Если СтрНом.Приоритет > НайденнаяСтрока.Приоритет тогда
	//			ЗаполнитьЗначенияСвойств(НайденнаяСтрока,СтрНом);
	//		Иначе
	//			Продолжить;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	
	//Обработки.БП_РасчетРейтингаПоПравиламРанжировки.ВыполнитьВсе(ТЗ);
	//-БП: d.matyash (01.08.2025) <>
КонецФункции


Функция ВывестиКоментарий(Префикс = "", Текст ="", Суфикс = "") Экспорт
	
	Если Отладка тогда
		
		сообщить(Префикс +" " + СокрЛП(Текст) + " "+Суфикс+ " " + СокрЛП(ТекущаяДата()));
		
	конецЕсли;
КонецФункции	

Функция ПередатьНоменклатуруКРасчетуРейтинга() Экспорт 
	//+БП: d.matyash (16.07.2025) <>
	ЗаполнитьПравила();
	ЗаполнитьВсеНаСервере();
	ПодготовитьУцНаСервере();
	ТЗ = НоменклатураПоПравилу.ВыгрузитьКолонки("ПравилоРасчета,Номенклатура,ВидНоменклатуры,ТипЦеныРассчитанной,Приоритет,МІСТО,Поставщик,Остаток,Прибыль,ЦенаУЦ,СтараяЦена,ПрибыльПроцент");
	Для каждого СтрНом из НоменклатураПоПравилу цикл
		Если Не СтрНом.УЦ тогда 
			Продолжить;
		КонецЕсли;                      
		
		Отбор = Новый Структура("Номенклатура, ТипЦеныРассчитанной", СтрНом.Номенклатура, СтрНом.ТипЦеныРассчитанной);
		Строки = ТЗ.НайтиСтроки(Отбор);
		Если  НЕ Строки.Количество() тогда
			НовСтрока = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,СтрНом);
		Иначе
			НайденнаяСтрока = Строки[0];	
			Если СтрНом.Приоритет > НайденнаяСтрока.Приоритет тогда
				ЗаполнитьЗначенияСвойств(НайденнаяСтрока,СтрНом);
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат ТЗ;
	//-БП: d.matyash (16.07.2025) <> 
КонецФункции

Функция _РасчитатьСтаруюЦену (ЦенаБазовая, НаценкаСуммой = 0, НаценкаПроцентом = 0)
	
	
	НаценкаПроцент = ЦенаБазовая / 100 * НаценкаПроцентом;    
	
	Наценка = Макс(НаценкаПроцент, НаценкаСуммой);
		
	
	возврат Наценка
КонецФункции //_РасчитатьЦену(Номенклатура, Знач ТЗЦЕНЫ, Знач ТипыЦен ,Знач цена = 0)

_хранилище = новый Соответствие();
