функция ВыполнитьВсе(ТЗНоменклатура = Неопределено)  Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		МассивПараметров = Новый Массив;
		ФоновыеЗадания.Выполнить("БП_ОбщийМодуль.БП_ЗапускНазначенияБейджиков", МассивПараметров,,"НазначенияБейджиков");
		Сообщить("Вібувся запуск фонового завдання по призначенню бейджиків.");
	Исключение    
		Сообщить(ОписаниеОшибки());
		Сообщить("Не вдалося запустити призначення бейджиків. Зверніться до адміністратора!");
	КонецПопытки;
	
КонецФункции

функция ВыполнитьВсеСФона()  Экспорт
	УстановитьПривилегированныйРежим(Истина);
	обр = Обработки.БП_НазначенияБейджиковПоПравилам.Создать();
	обр.ДатаДокументов = ТекущаяДата();
	обр.ПроводитьДокументУР = Истина;
	обр.Критический = Истина;
	обр.ВыполнитьВсе(,Истина);	
КонецФункции 

функция ВыполнитьНЕКритическийВсеСФона()  Экспорт
	УстановитьПривилегированныйРежим(Истина);
	обр = Обработки.БП_НазначенияБейджиковПоПравилам.Создать();
	обр.ДатаДокументов = ТекущаяДата();
	обр.ПроводитьДокументУР = Истина;
	обр.Критический = Истина;
	//обр.ВыполнитьВсе(,Ложь);
	обр.ВыполнитьВсе(,Истина);
КонецФункции


 