
Процедура ЗаполнитьПоШаблону() Экспорт 
	
	ПоПочте = Истина;
	
	Если НЕ ЗначениеЗаполнено(ГруппаДоговоров) или не ЗначениеЗаполнено(Поставщик)Тогда
		#Если Клиент Тогда
			Предупреждение("Укажите Поставщика и Группу договоров!");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Поставщик) и ЗначениеЗаполнено(ГруппаДоговоров) Тогда 
		отбСр = новый Структура("Поставщик", Поставщик);
		отбСр.Вставить("ГруппаДоговоров", ГруппаДоговоров);
		ШаблонСрез = РегистрыСведений.ШаблоныЗагрузкиОстатковПоставщиков_СД.СрезПоследних(ДатаПродажи, отбСр);
		Если не ШаблонСрез.Количество() = 0 Тогда 
			
			ЭтотОбъект.УчетнаяЗаписьЭлектроннойПочты = ШаблонСрез[0].УчетнаяЗаписьЭлектроннойПочты;
			ЭтотОбъект.ПочтаПоставщика 				 = ШаблонСрез[0].ПочтаПоставщика;
			
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры	

Процедура ЗаполнитьПродажи() Экспорт 
	
	Если не ЗначениеЗаполнено(ДатаПродажи) Тогда 
		#Если Клиент Тогда
			Предупреждение("Укажите Дату продажи!");
		#КонецЕсли
		Возврат;
	КонецЕсли;	
	
	ЗапрсоПрод = Новый запрос;
	ЗапрсоПрод.Текст = "ВЫБРАТЬ
	                   |	МАКСИМУМ(НоменклатураПоставщика.Ссылка) КАК Ссылка,
	                   |	НоменклатураПоставщика.Номенклатура
	                   |ПОМЕСТИТЬ НоменклатураПоставщика_врем
	                   |ИЗ
	                   |	Справочник.НоменклатураПоставщика КАК НоменклатураПоставщика
	                   |ГДЕ
	                   |	НоменклатураПоставщика.Владелец = &Контрагент
	                   |	И НЕ НоменклатураПоставщика.ПометкаУдаления
	                   |
	                   |СГРУППИРОВАТЬ ПО
	                   |	НоменклатураПоставщика.Номенклатура
	                   |;
	                   |
	                   |////////////////////////////////////////////////////////////////////////////////
	                   |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                   |	ВложенныйЗапрос.Номенклатура,
	                   |	ВложенныйЗапрос.Количество,
	                   |	ВложенныйЗапрос.Стоимость,
	                   |	ВЫРАЗИТЬ(ВЫБОР
	                   |			КОГДА ВложенныйЗапрос.Количество = 0
	                   |				ТОГДА 0
	                   |			ИНАЧЕ ВложенныйЗапрос.Стоимость / ВложенныйЗапрос.Количество
	                   |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК Цена,
	                   |	ЕСТЬNULL(НоменклатураПоставщика_врем.Ссылка, ЗНАЧЕНИЕ(справочник.номенклатурапоставщика.ПустаяСсылка)) КАК НоменклатураПоставщика
	                   |ИЗ
	                   |	(ВЫБРАТЬ
	                   |		ПродажиСебестоимостьОбороты.Номенклатура КАК Номенклатура,
	                   |		СУММА(ПродажиСебестоимостьОбороты.КоличествоОборот) КАК Количество,
	                   |		СУММА(ПродажиСебестоимостьОбороты.СтоимостьОборот) КАК Стоимость
	                   |	ИЗ
	                   |		РегистрНакопления.ПродажиСебестоимость.Обороты(
	                   |				НАЧАЛОПЕРИОДА(&ДатаПродаж, ДЕНЬ),
	                   |				КОНЕЦПЕРИОДА(&ДатаПродаж, ДЕНЬ),
	                   |				,
	                   |				ДокументОприходования.ДоговорКонтрагента В (&ДоговорКонтрагента)
	                   |					И ДокументОприходования.Контрагент = &Контрагент) КАК ПродажиСебестоимостьОбороты
	                   |	
	                   |	СГРУППИРОВАТЬ ПО
	                   |		ПродажиСебестоимостьОбороты.Номенклатура) КАК ВложенныйЗапрос
	                   |		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураПоставщика_врем КАК НоменклатураПоставщика_врем
	                   |		ПО ВложенныйЗапрос.Номенклатура = НоменклатураПоставщика_врем.Номенклатура";
	
 	ЗапрсоПрод.УстановитьПараметр("ДатаПродаж", ДатаПродажи);
 	ЗапрсоПрод.УстановитьПараметр("Контрагент", Поставщик);
 	ЗапрсоПрод.УстановитьПараметр("ДоговорКонтрагента", ГруппаДоговоров.Договора.ВыгрузитьКолонку("Договор"));
	
	РезПрод = ЗапрсоПрод.Выполнить().Выгрузить();
	
	Продажи.Очистить();
	
	для Каждого СтрПрод из РезПрод Цикл 
		
		НовСтр = Продажи.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрПрод);
		
	КонецЦикла;	
КонецПроцедуры	

Процедура ОтправитьПоставщику() Экспорт 
	
	Если Продажи.Количество() = 0 Тогда 
		#Если Клиент Тогда   			
			Предупреждение("Продажи не заполнены!");
		#КонецЕсли
		Возврат;
	КонецЕсли;	
	
	
	Если ЗначениеЗаполнено(УчетнаяЗаписьЭлектроннойПочты) и ЗначениеЗаполнено(СокрЛП(ПочтаПоставщика)) Тогда  	 
		Каталог = КаталогВременныхФайлов();
		ИмяФайла = Каталог+""+СокрЛП(Поставщик.Наименование) + "" +"_Продаж_" + Формат(ДатаПродажи, "ДФ=dd.MM.yyyy")+".xls";
		ВыгрузитьВXLS(ИмяФайла);
		ИнтернетПочта = Новый ИнтернетПочта;
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗаписьЭлектроннойПочты);
		
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.ИмяОтправителя = Профиль.Пользователь;
		Сообщение.Отправитель = Профиль.Пользователь;
		Сообщение.Тема = "Продаж за " + Формат(ДатаПродажи,"ДФ='dd.MM.yyyy'" );
		Сообщение.Получатели.Добавить(СокрЛП(ПочтаПоставщика));  
		
		текстПисьма = "";
		//НомерПП = 1;
		//для Каждого СтрНоНом из СписокНовыхНоменклатураПоставщика Цикл 
		//	текстПисьма = текстПисьма + НомерПП + ". " + Символы.Таб + СтрНоНом.НоменклатураПоставщика.Наименование + Символы.ПС;
		//	НомерПП = НомерПП + 1;
		//КонецЦикла;	
		ВалУпр = Константы.ВалютаУправленческогоУчета.Получить();
		текстПисьма = "Всього продано на суму = " + Строка(Продажи.Итог("Стоимость")) + " " + НРег(ВалУпр.Наименование) + ". У кількості = " + Строка(Продажи.Итог("Количество"))+" . ";
		Сообщение.Тексты.Добавить(текстПисьма);
		
		Сообщение.Вложения.Добавить(ИмяФайла, );
		
		Попытка
			//Состояние("Отправка почтового сообщения...");
			ИнтернетПочта.Подключиться(Профиль);
			ИнтернетПочта.Послать(Сообщение);
			#Если Клиент Тогда   			
				Предупреждение("Сообщение успешно отправлено!");
			#КонецЕсли
		Исключение
			#Если Клиент Тогда   			
				Сообщить("Ошибка ...",СтатусСообщения.ОченьВажное);
				Сообщить(""+ОписаниеОшибки());
			#КонецЕсли
		КонецПопытки;
		
		ИнтернетПочта.Отключиться(); 
		Попытка
			УдалитьФайлы(ИмяФайла);  				
		Исключение	
		КонецПопытки;
	КонецЕсли;
	
	СоздатьЗаказПоставщику();//С.Д. Сеня 15,08,23 +
КонецПроцедуры	
                                     
Процедура СоздатьЗаказПоставщику() Экспорт   
	
	//с.д. рижий 2023-09-11 (
	Если не ЗначениеЗаполнено(ДатаЗаказПоставщика) тогда
		ДатаЗаказПоставщика = ТекущаяДата()
	КонецЕсли;	
	//с.д. Рижий 2023-09 11 )
	//Завданя:
	//[4]. в обробці по відправці даних про продажі (із задачі[3]) додати механізм створення Документа [замовленя постачальнику]
	//по кожному контрагенту та договору  якому відправили  і заповнюється номенклатурою , к-сть, собівартістю, , та коментар з словом авто. створений дозаказ. 
	Если ЗначениеЗаполнено(Поставщик) и ЗначениеЗаполнено(ГруппаДоговоров) и Продажи.Количество() <> 0 Тогда 
		
		УжеСоздан = УжеБылСозданЗаказПоставщику(ДатаЗаказПоставщика, "Створений автоматично обробкою продажи за " + Формат(ДатаПродажи,"ДФ=dd.MM.yyyy") );	//с.д. рижий 2023-09-11 
		Если УжеСоздан Тогда 
			Возврат;
		КонецЕсли;	
		мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
		ДокЗаказПост = Документы.ЗаказПоставщику.СоздатьДокумент(); 	
		ДокЗаказПост.Дата = ДатаЗаказПоставщика;//ТекущаяДата();
		ДокЗаказПост.Контрагент = Поставщик;
		//ДокЗаказПост.ДоговорКонтрагента = ГруппаДоговоров;//С.Д. Сеня 29,08,23 договор не заполняем 
		ДокЗаказПост.Комментарий = "Створений автоматично обробкою продажи за "+ Формат(ДатаПродажи,"ДФ=dd.MM.yyyy") ; 	//с.д. рижий 2023-09-11 
		ДокЗаказПост.Организация = ГруппаДоговоров.Договора[0].Договор.Организация;
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокЗаказПост, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, "Покупка");
		//УправлениеЗаказами.УстановитьДатуОплатыПоДоговору(ДокЗаказПост);
		
		// Зададим, какие реквизиты надо редактировать.
		СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(ДокЗаказПост);
		//СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов;
		//ЗаполнениеДокументов.ПриИзмененииЗначенияДоговора(ДокЗаказПост, ГруппаДоговоров.ВалютаВзаиморасчетов, мВалютаРегламентированногоУчета, СпособЗаполненияЦен, СтруктураРеквизитовДокумента, "Покупка", "Товары", ДокЗаказПост.ДоговорКонтрагента);
		
		ДокЗаказПост.Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");
		ДокЗаказПост.УчитыватьНДС 		= Истина;
		ДокЗаказПост.СуммаВключаетНДС 	= Ложь;
		//Очищаем товары
		ДокЗаказПост.Товары.Очистить();
		для Каждого СтрТ из Продажи Цикл 
			новСтр = ДокЗаказПост.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(новСтр, СтрТ);
			//Заполняем реквизиты табличной части.
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НовСтр, ДокЗаказПост, "Приобретение");
			СтруктураШапкиДокумента = Новый Структура("Контрагент, ТипЦен, ДоговорКонтрагента, ДатаДокумента, ВалютаДокумента, УчитыватьНДС, СуммаВключаетНДС",
			ДокЗаказПост.Контрагент, ДокЗаказПост.ТипЦен, ДокЗаказПост.ДоговорКонтрагента, ДокЗаказПост.Дата, ДокЗаказПост.ВалютаДокумента, ДокЗаказПост.УчитыватьНДС, ДокЗаказПост.СуммаВключаетНДС);
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПокупкиТабЧасти(НовСтр, ДокЗаказПост, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
			
			новСтр.Количество = СтрТ.Количество;
			новСтр.Цена = СтрТ.Цена;
			// Рассчитать реквизиты табличной части.
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(новСтр, ДокЗаказПост);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(новСтр, ДокЗаказПост);
			
		КонецЦикла;	
		
		Попытка
			ДокЗаказПост.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			//ДокЗаказПост.Записать(РежимЗаписиДокумента.Запись);
			#Если Клиент Тогда 
				Сообщить("Не удалось создать Заказ поставщику по причине - "+ОписаниеОшибки());
			#КонецЕсли
		КонецПопытки;
		
	КонецЕсли;
	
	
КонецПроцедуры	

Функция УжеБылСозданЗаказПоставщику(ДатаЗаказа, Комментарий) Экспорт 
	
	ЗапросПроверки = новый Запрос;
	ЗапросПроверки.Текст = "ВЫБРАТЬ
	                       |	ЗаказПоставщику.Ссылка
	                       |ИЗ
	                       |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	                       |ГДЕ
	                       |	НЕ ЗаказПоставщику.ПометкаУдаления
	                       |	И НАЧАЛОПЕРИОДА(ЗаказПоставщику.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	                       |	И ЗаказПоставщику.Контрагент = &Контрагент
	                       //|	И ЗаказПоставщику.ДоговорКонтрагента = &ДоговорКонтрагента
	                       |	И (ВЫРАЗИТЬ(ЗаказПоставщику.Комментарий КАК СТРОКА(100))) = &Комментарий";
	ЗапросПроверки.УстановитьПараметр("Дата", ДатаЗаказа);
	ЗапросПроверки.УстановитьПараметр("Контрагент", Поставщик);
	//ЗапросПроверки.УстановитьПараметр("ДоговорКонтрагента", Справочники.ДоговорыКонтрагентов.ПустаяСсылка()); //С.Д. Сеня 29,08,23 договор пустой +
	ЗапросПроверки.УстановитьПараметр("Комментарий", Комментарий);
	РезПроверки = ЗапросПроверки.Выполнить().Выгрузить();
	
	Если не РезПроверки.Количество() = 0 Тогда 
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции	
 Процедура ВыгрузитьВXLS(ИмяФайла) 
	 
	 ТаблицаЗначений = Продажи.Выгрузить(,"НоменклатураПоставщика,Количество,Цена,Стоимость");
	 ТЗвТДивЕксель(ТаблицаЗначений, ИмяФайла)
     
 КонецПроцедуры
 
Процедура ТЗвТДивЕксель (ТаблицаЗначений, ИмяФайла)
	
	ТД = Новый ТабличныйДокумент;
    КолонокВсего = ТаблицаЗначений.Колонки.Количество();
	Для Колонка = 1 По КолонокВсего Цикл
		Если ТаблицаЗначений.Колонки[Колонка - 1].Заголовок = "Номенклатура поставщика" Тогда 
       		ТД.Область(1, Колонка).Текст = "Номенклатура";
		Иначе	 
       		ТД.Область(1, Колонка).Текст = ТаблицаЗначений.Колонки[Колонка - 1].Заголовок;
		КонецЕсли;	
		ТД.Область(1, Колонка).Обвести(Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1), Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1),Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1),Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1));
	КонецЦикла;
    Строка = 1;
    Для Каждого ТаблицаСтрока Из ТаблицаЗначений Цикл
        Строка = Строка + 1;
		Для Колонка = 1 По КолонокВсего Цикл
			
            ТД.Область(Строка, Колонка).Текст = ТаблицаСтрока.Получить(Колонка - 1);
			ТД.Область(Строка, Колонка).Обвести(Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1), Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1),Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1),Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1));
		КонецЦикла;
    КонецЦикла;
    ТД.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.XLS);       
    
КонецПроцедуры
