Функция ПолучитьБаланс(НастройкиПодключений)Экспорт 
	Рез = Новый Структура;
	Рез.Вставить("Успешно",Ложь);
	Рез.Вставить("Сообщение","");
	Рез.Вставить("Баланс",0);


	
	Если ЗначениеЗаполнено(НастройкиПодключений.ПапкаФайлаЛога) и ФайлСуществует(НастройкиПодключений.ПапкаФайлаЛога) Тогда
		ИмяФайлаОтвета = НастройкиПодключений.ПапкаФайлаЛога + "\answ_balance.json";
	Иначе
		ИмяФайлаОтвета = КаталогВременныхФайлов() + "answ_balance.json";
	КонецЕсли;

	
	Соединение = СоздатьHTTPСоединение(НастройкиПодключений);
		
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept-Charset","UTF-8");
	Заголовки.Вставить("Authorization","Basic " + НастройкиПодключений.API_ключ);
	Заголовки.Вставить("Content-Type","application/json");

	ЗапросHTTP = Новый HTTPЗапрос(НастройкиПодключений.МетодДляПроверкиБаланса,Заголовки);
	
	ОтветСервера = Соединение.ОтправитьДляОбработки(ЗапросHTTP,ИмяФайлаОтвета);

	ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяФайлаОтвета);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		Иначе
			Т = "Получен пустой ответ сервера.";
			//Сообщить(Т);
			Рез.Вставить("Успешно",Ложь);
			Рез.Вставить("Сообщение",Т);
			Рез.Вставить("Баланс",0);
			Возврат Рез;
		КонецЕсли;	
		
	Иначе	
		Т = "Ответ сервера не получен.";
		//Сообщить(Т);
		Рез.Вставить("Успешно",Ложь);
		Рез.Вставить("Сообщение",Т);
		Рез.Вставить("Баланс",0);
		Возврат Рез;
	КонецЕсли;
	
	
	ЧтениеДЖС = Новый ЧтениеJSON;
	ЧтениеДЖС.ОткрытьФайл(ИмяФайлаОтвета);
	Записи = ПрочитатьJSON(ЧтениеДЖС);
	Статус = ""; МассивОтвет = Новый Массив;
	Для Каждого Запись Из Записи Цикл
		Если Запись.Ключ = "response_status" Тогда
			Статус = Запись.Значение;
		КонецЕсли;
		Если Запись.Ключ = "response_result" Тогда
			МассивОтвет = Запись.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если Не Статус = "OK" Тогда
		Рез.Вставить("Успешно",Ложь);
		Рез.Вставить("Сообщение",Статус);
		Рез.Вставить("Баланс",0);
		Возврат Рез;
	Иначе
		Баланс = 0;
		Для каждого Стр_Б из МассивОтвет Цикл
			Если Стр_Б.Ключ = "balance" Тогда
				Баланс = Стр_Б.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Рез.Вставить("Успешно",Истина);
		Рез.Вставить("Сообщение","");
		Рез.Вставить("Баланс",Баланс);
	КонецЕсли;

	

	
	Возврат Рез;
КонецФункции

Функция ОтправитьСообщение(НастройкиПодключений,НомерПолучателя,ТекстСообщения)Экспорт 
	Рез = Новый Структура;
	Рез.Вставить("Успешно",Ложь);
	Рез.Вставить("Сообщение","");


	Если ЗначениеЗаполнено(НастройкиПодключений.ПапкаФайлаЛога) и ФайлСуществует(НастройкиПодключений.ПапкаФайлаЛога) Тогда
		ИмяИсходящегоФайла = НастройкиПодключений.ПапкаФайлаЛога + "\send.json";
	Иначе
		ИмяИсходящегоФайла = КаталогВременныхФайлов() + "send.json";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиПодключений.ПапкаФайлаЛога) и ФайлСуществует(НастройкиПодключений.ПапкаФайлаЛога) Тогда
		ИмяФайлаОтвета = НастройкиПодключений.ПапкаФайлаЛога + "\answ_send.json";
	Иначе
		ИмяФайлаОтвета = КаталогВременныхФайлов() + "answ_send.json";
	КонецЕсли;

	
	Соединение = СоздатьHTTPСоединение(НастройкиПодключений);
	
	
	ЗаписьДЖС = Новый ЗаписьJSON;
	ЗаписьДЖС.ПроверятьСтруктуру = Истина;
	ПараметрыЗаписиДЖС = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	ЗаписьДЖС.ОткрытьФайл(ИмяИсходящегоФайла,КодировкаТекста.UTF8,Ложь,ПараметрыЗаписиДЖС);
	
	ЗаписьДЖС.ЗаписатьНачалоОбъекта();
	ЗаписьДЖС.ЗаписатьИмяСвойства("sender");
	ЗаписьДЖС.ЗаписатьЗначение(НастройкиПодключений.ИмяОтправителя);
	ЗаписьДЖС.ЗаписатьИмяСвойства("recipients");
	ЗаписьДЖС.ЗаписатьНачалоМассива();
	ЗаписьДЖС.ЗаписатьЗначение(НомерПолучателя);
	ЗаписьДЖС.ЗаписатьКонецМассива();
	Если НастройкиПодключений.ОтправлятьСМС Тогда
		ЗаписьДЖС.ЗаписатьИмяСвойства("sms");
		ЗаписьДЖС.ЗаписатьНачалоОбъекта();
		ЗаписьДЖС.ЗаписатьИмяСвойства("text");
		ЗаписьДЖС.ЗаписатьЗначение(ТекстСообщения);
		ЗаписьДЖС.ЗаписатьКонецОбъекта();
	КонецЕсли;
	Если НастройкиПодключений.ОтправлятьViber Тогда
		ЗаписьДЖС.ЗаписатьИмяСвойства("viber");
		ЗаписьДЖС.ЗаписатьНачалоОбъекта();
		ЗаписьДЖС.ЗаписатьИмяСвойства("text");
		ЗаписьДЖС.ЗаписатьЗначение(ТекстСообщения);
		ЗаписьДЖС.ЗаписатьКонецОбъекта();
	КонецЕсли;
		
		
	ЗаписьДЖС.ЗаписатьКонецОбъекта();
	ЗаписьДЖС.Закрыть();

	
		
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept-Charset","UTF-8");
	Заголовки.Вставить("Authorization","Basic " + НастройкиПодключений.API_ключ);
	Заголовки.Вставить("Content-Type","application/json");

	
	ОтветСервера = Соединение.ОтправитьДляОбработки(ИмяИсходящегоФайла, НастройкиПодключений.МетодДляОтправки, ИмяФайлаОтвета, Заголовки);

	
	ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяФайлаОтвета);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		Иначе
			Т = "Получен пустой ответ сервера.";
			//Сообщить(Т);
			Рез.Вставить("Успешно",Ложь);
			Рез.Вставить("Сообщение",Т);
			Возврат Рез;
		КонецЕсли;	
		
	Иначе	
		Т = "Ответ сервера не получен.";
		//Сообщить(Т);
		Рез.Вставить("Успешно",Ложь);
		Рез.Вставить("Сообщение",Т);
		Возврат Рез;
	КонецЕсли;
	
	
	ЧтениеДЖС = Новый ЧтениеJSON;
	ЧтениеДЖС.ОткрытьФайл(ИмяФайлаОтвета);
	Записи = ПрочитатьJSON(ЧтениеДЖС);
	Статус = ""; МассивОтвет = Новый Массив;
	Для Каждого Запись Из Записи Цикл
		Если Запись.Ключ = "response_status" Тогда
			Статус = Запись.Значение;
		КонецЕсли;
		Если Запись.Ключ = "response_result" Тогда
			МассивОтвет = Запись.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если Не Статус = "SUCCESS_MESSAGE_SENT" Тогда
		Рез.Вставить("Успешно",Ложь);
		Рез.Вставить("Сообщение",Статус);
		Возврат Рез;
	Иначе
		СтатусОтправки = "";message_id = ""; 
		Для каждого Стр_Б из МассивОтвет Цикл
			СтатусОтправки = Стр_Б.response_status;
			message_id = Стр_Б.message_id;
		КонецЦикла;
		
		Рез.Вставить("Успешно",Истина);
		Рез.Вставить("Сообщение",""+СтатусОтправки);
		Рез.Вставить("message_id",message_id);
	КонецЕсли;

	

	
	Возврат Рез;

КонецФункции

Функция ПолучитьСтатусСообщения(НастройкиПодключений,ИД_сообщения)Экспорт 
	Рез = Новый Структура;
	Рез.Вставить("Успешно",Ложь);
	Рез.Вставить("Сообщение","");
	Рез.Вставить("Статус","");


	Если ЗначениеЗаполнено(НастройкиПодключений.ПапкаФайлаЛога) и ФайлСуществует(НастройкиПодключений.ПапкаФайлаЛога) Тогда
		ИмяИсходящегоФайла = НастройкиПодключений.ПапкаФайлаЛога + "\status.json";
	Иначе
		ИмяИсходящегоФайла = КаталогВременныхФайлов() + "status.json";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиПодключений.ПапкаФайлаЛога) и ФайлСуществует(НастройкиПодключений.ПапкаФайлаЛога) Тогда
		ИмяФайлаОтвета = НастройкиПодключений.ПапкаФайлаЛога + "\answ_status.json";
	Иначе
		ИмяФайлаОтвета = КаталогВременныхФайлов() + "answ_status.json";
	КонецЕсли;

	
	Соединение = СоздатьHTTPСоединение(НастройкиПодключений);
	
	
	ЗаписьДЖС = Новый ЗаписьJSON;
	ЗаписьДЖС.ПроверятьСтруктуру = Истина;
	ПараметрыЗаписиДЖС = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	ЗаписьДЖС.ОткрытьФайл(ИмяИсходящегоФайла,КодировкаТекста.UTF8,Ложь,ПараметрыЗаписиДЖС);
	
	ЗаписьДЖС.ЗаписатьНачалоОбъекта();
	ЗаписьДЖС.ЗаписатьИмяСвойства("messages");
	ЗаписьДЖС.ЗаписатьНачалоМассива();
	ЗаписьДЖС.ЗаписатьЗначение(ИД_сообщения);
	ЗаписьДЖС.ЗаписатьКонецМассива();
			
		
	ЗаписьДЖС.ЗаписатьКонецОбъекта();
	ЗаписьДЖС.Закрыть();

	
		
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept-Charset","UTF-8");
	Заголовки.Вставить("Authorization","Basic " + НастройкиПодключений.API_ключ);
	Заголовки.Вставить("Content-Type","application/json");

	
	ОтветСервера = Соединение.ОтправитьДляОбработки(ИмяИсходящегоФайла, НастройкиПодключений.МетодДляПроверкиСтатусаДостаки, ИмяФайлаОтвета, Заголовки);

	
	ФайлОтвета = Новый Файл(ИмяФайлаОтвета);
	
	Если ФайлОтвета.Существует() Тогда
		
		ТекстОтвета = Новый ТекстовыйДокумент();
		ТекстОтвета.Прочитать(ИмяФайлаОтвета);
		Если ТекстОтвета.КоличествоСтрок()>0 Тогда
			ОтветСервера = ТекстОтвета.ПолучитьТекст();	
		Иначе
			Т = "Получен пустой ответ сервера.";
			//Сообщить(Т);
			Рез.Вставить("Успешно",Ложь);
			Рез.Вставить("Сообщение",Т);
			Рез.Вставить("Статус","");
			Возврат Рез;
		КонецЕсли;	
		
	Иначе	
		Т = "Ответ сервера не получен.";
		//Сообщить(Т);
		Рез.Вставить("Успешно",Ложь);
		Рез.Вставить("Сообщение",Т);
		Рез.Вставить("Статус","");
		Возврат Рез;
	КонецЕсли;
	
	
	ЧтениеДЖС = Новый ЧтениеJSON;
	ЧтениеДЖС.ОткрытьФайл(ИмяФайлаОтвета);
	Записи = ПрочитатьJSON(ЧтениеДЖС);
	Статус = ""; МассивОтвет = Новый Массив;
	Для Каждого Запись Из Записи Цикл
		Если Запись.Ключ = "response_status" Тогда
			Статус = СтрЗаменить(Запись.Значение,"Delivered","Доставлено");
		КонецЕсли;
		Если Запись.Ключ = "response_result" Тогда
			МассивОтвет = Запись.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если Не Статус = "OK" Тогда
		Рез.Вставить("Успешно",Ложь);
		Рез.Вставить("Сообщение",Статус);
		Рез.Вставить("Статус","");
		Возврат Рез;
	Иначе
		СтатусОтправки = ""; 
		Для каждого Стр_Б из МассивОтвет Цикл
			СтатусОтправки = Стр_Б.status;
		КонецЦикла;
		
		Рез.Вставить("Успешно",Истина);
		Рез.Вставить("Сообщение","");
		Рез.Вставить("Статус",СтатусОтправки);
	КонецЕсли;

	

	
	Возврат Рез;

КонецФункции

Функция СоздатьHTTPСоединение(НастройкиПодключений)
	Если НастройкиПодключений.ЗащищенноеСоединение Тогда
		Порт    = 443;
		ЗС 		= Новый ЗащищенноеСоединениеOpenSSL; 
	Иначе
		Порт    = 80;
		ЗС 		= Неопределено; 
	КонецЕсли;
	
	Адрес          = НастройкиПодключений.АдресДляПодключения;
	ИнтернетПрокси = Неопределено;
	
	Соединение = Новый HTTPСоединение(Адрес, Порт, , , ИнтернетПрокси,,ЗС);
	
	Возврат Соединение;  
КонецФункции

Функция ФайлСуществует(Знач ПутьКФайлу) Экспорт
	
	Файл = Новый Файл(ПутьКФайлу);
	Возврат Файл.Существует();
	
КонецФункции

Функция ПолучитьТекстСМС(ШаблонСМС,ДокЗаказ) Экспорт 
	ТекстШаблон = ШаблонСМС.ШаблонСМС;
	
	ТекстШаблон = СтрЗаменить(ТекстШаблон,"[ДатаЗаказ]",Формат(ДокЗаказ.Дата,"ЧЦ=15; ЧДЦ=2"));
	ТекстШаблон = СтрЗаменить(ТекстШаблон,"[НомерЗаказ]",ДокЗаказ.Номер);

	Если ЗначениеЗаполнено(ДокЗаказ.ПредЗаказ) Тогда
		ТекстШаблон = СтрЗаменить(ТекстШаблон,"[ДатаПредЗаказ]",Формат(ДокЗаказ.ПредЗаказ.Дата,"ЧЦ=15; ЧДЦ=2"));
		ТекстШаблон = СтрЗаменить(ТекстШаблон,"[НомерЗаказ]",ДокЗаказ.ПредЗаказ.Номер);
	Иначе
		ТекстШаблон = СтрЗаменить(ТекстШаблон,"[ДатаПредЗаказ]","");
		ТекстШаблон = СтрЗаменить(ТекстШаблон,"[НомерЗаказ]","");
	КонецЕсли;
	
	ТекстШаблон = СтрЗаменить(ТекстШаблон,"[Контрагент]",ДокЗаказ.Контрагент);
	ТекстШаблон = СтрЗаменить(ТекстШаблон,"[СуммаЗаказа]",Формат(ДокЗаказ.СуммаДокумента,"ЧЦ=15; ЧДЦ=2"));
	ТекстШаблон = СтрЗаменить(ТекстШаблон,"[Ответственный]",ДокЗаказ.Ответственный);
	ТекстШаблон = СтрЗаменить(ТекстШаблон,"[ТТН_НП]",ДокЗаказ.НП_ТТН);
	ТекстШаблон = СтрЗаменить(ТекстШаблон,"[URL_инвойс_ПолнаяОплата]",ДокЗаказ.Wayforpay_url_INVOICE);
	ТекстШаблон = СтрЗаменить(ТекстШаблон,"[URL_инвойс_Предоплата]",ДокЗаказ.Wayforpay_url_INVOICE_предоплата);
	ТекстШаблон = СтрЗаменить(ТекстШаблон,"[СуммаПредоплата]",Формат(ДокЗаказ.НП_ОплатаНаКарту,"ЧЦ=15; ЧДЦ=2"));
	ТекстШаблон = СтрЗаменить(ТекстШаблон,"[СуммаПредоплатаДодТекст]",?(ДокЗаказ.НП_ОплатаНаКарту=0,"","Предоплата : "+Формат(ДокЗаказ.НП_ОплатаНаКарту,"ЧЦ=15; ЧДЦ=2")+"грн."));
	
	ТоварСтрока = "";
	Сч = 1;
	Для каждого Стр из ДокЗаказ.Товары Цикл
		ТоварСтрока = ТоварСтрока + ?(Не Сч = 1,Символы.ПС,"") + "" + стр.Номенклатура + " " + стр.Количество + "" + стр.ЕдиницаИзмерения;
		Сч = Сч + 1;
	КонецЦикла;
	ТекстШаблон = СтрЗаменить(ТекстШаблон,"[Товары]",ТоварСтрока);
	
	Возврат ТекстШаблон

КонецФункции