
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Табличка = Новый Таблицазначений;
	
	Табличка.Колонки.Добавить("Номенклатура");
	Табличка.Колонки.Добавить("Кво");
	Для Каждого Стр из Номенклатура Цикл
		Ст = Табличка.Добавить();
		Ст.Номенклатура = Стр.Товар;
		Ст.Кво = 1;
	КонецЦикла;
	Табличка.Свернуть("Номенклатура","Кво");
	Для каждого Стр из Табличка Цикл
		Если Стр.кво > 1 Тогда
			 Сообщить(Стр.номенклатура.Наименование + " введен "+Строка(Стр.Кво)+" раз");
			 Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
