
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПараметрыСеанса.ТекущийКлиент = Объект.Ссылка;
	
	МенеджерЗаписи = РегистрыСведений.НастройкиОтображенияФильтров.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Клиент = Объект.Ссылка;
	МенеджерЗаписи.ОтборВысота = Истина;
	МенеджерЗаписи.ОтборШирина = Истина;
	МенеджерЗаписи.ОтборДиаметр = Истина;
	МенеджерЗаписи.ОтборСезон = Истина;
	МенеджерЗаписи.ОтборПроизводитель = Истина;
	МенеджерЗаписи.ОтборМодель = Истина;
	МенеджерЗаписи.отборУсиление = Истина;
	МенеджерЗаписи.ОтборИндексСкорости = Истина;
	МенеджерЗаписи.ОтборИндексНагрузки = Истина;
	МенеджерЗаписи.отборДопПараметры = Истина;
	МенеджерЗаписи.ОтборБУ = Истина; 
	МенеджерЗаписи.ОтборШипы = Истина;
	МенеджерЗаписи.отборТипПротектора = Истина;
	МенеджерЗаписи.ОтборВНаличие = Истина;
	
	МенеджерЗаписи.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Логин = Объект.Наименование;
	
	УстановитьСтатус();
	
	ТелефонУжеУказан = ТелефонУжеВнесенВБазу(Объект.НомерТелефона);
	
	Если ТелефонУжеУказан Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru = 'Номер телефона уже указан в системе'; uk = 'Номер телефону вже вказаний в системі'"));
	КонецЕсли;
	
	Если Не СтрДлина(СокрЛП(Объект.НомерТелефона)) = 13 Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru = 'Не указан номер телефона'; uk = 'Не вказаний номер телефона'"));
	КонецЕсли;
	
	Если Объект.Email = "" Тогда
		Отказ = Истина;
		Сообщить(НСтр("ru = 'Не указан Email'; uk = 'Не вказаний Email'"));
	КонецЕсли;
	Если не Отказ Тогда
		РазрешитьЗакрытиеФормы = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РазрешитьЗакрытиеФормы = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = не РазрешитьЗакрытиеФормы;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	РазрешитьЗакрытиеФормы = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	РазрешитьЗакрытиеФормы = Истина;
	Закрыть();
	//ОткрытьФорму("Обработка.АвторизацияКлиента.Форма.Форма_Авторизация");
КонецПроцедуры

&НаСервере
Функция ТелефонУжеВнесенВБазу(НомерТелефона) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Клиенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.НомерТелефона = &НомерТелефона";
	
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;  
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура УстановитьСтатус()
	Объект.СтатусКлиента = Перечисления.СтатусыКлиентов.Новый;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОткрытьФорму("Обработка.АвторизацияКлиента.Форма.Форма_Авторизация");
КонецПроцедуры

&НаКлиенте
Процедура ОбластьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("РежимВыбора",Истина);
	
	ОткрытьФорму("Справочник.Областя.Форма.ФормаВыбора",ПараметрыФормы,ЭтаФорма);
	Элементы.Область.РедактированиеТекста = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Справочник.Областя.Форма.ФормаВыбора" Тогда
		Объект.Область = ВыбранноеЗначение;
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.Города.Форма.ФормаВыбора" Тогда
		Объект.Город = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГородНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Область) и ТипЗнч(Объект.Область) = Тип("СправочникСсылка.Областя") Тогда
		ПараметрыОтбора.Вставить("Владелец", Объект.Область);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора); ///Добавляем отбор в параметры формы
	КонецЕсли;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	
	ОткрытьФорму("Справочник.Города.Форма.ФормаВыбора",ПараметрыФормы,Элемент);
	Элементы.Город.РедактированиеТекста = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбластьОчистка(Элемент, СтандартнаяОбработка)
	Элементы.Область.РедактированиеТекста = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГородОчистка(Элемент, СтандартнаяОбработка)
	Элементы.Город.РедактированиеТекста = Истина;
КонецПроцедуры
