Процедура ЗаполнитьСкриптыХорошоп() Экспорт
	АдресСкрипта                  = "api/";
	АдресСкриптаАутентификация    = "api/auth/";
	АдресСкриптаЗагрузкаЗаказов   = "api/orders/get/";
	АдресСкриптаВыгрузкаТоваров   = "api/catalog/import/";
	АдресСкриптаВыгрузкаЦен       = "api/catalog/importPrices/";
	АдресСкриптаВыгрузкаОстатков  = "api/catalog/importResidues/";
	АдресСкриптаЗагрузкаКатегорий = "api/pages/export/";
	АдресСкриптаЗагрузкаТоваров   = "api/catalog/export/";
	АдресСкриптаЗагрузкаКонтрагентов  = "api/users/export/";
	АдресСкриптаВыгрузкаКонтрагентов = "api/users/import/";
КонецПроцедуры