Перем СписП;
Процедура ЗаполнитьЗаказы() Экспорт
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ЗаказыПокупателейОстатки.КоличествоОстаток,
	 |	ЗаказыПокупателейОстатки.ЗаказПокупателя,
	 |	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовПриход, 0) КАК Поле1,
	 |	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОбороты.СуммаВзаиморасчетовРасход, 0) КАК Поле2
	 |ИЗ
	 |	РегистрНакопления.ЗаказыПокупателей.Остатки(, ЗаказПокупателя.ДатаОтгрузки <= &ДатаПроверки) КАК ЗаказыПокупателейОстатки
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты КАК ВзаиморасчетыСКонтрагентамиОбороты
	 |		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ВзаиморасчетыСКонтрагентамиОбороты.Сделка";
	 ЗАпрос.УстановитьПараметр("ДатаПроверки",Дата-1*24*60*60);
	 ЗапросРн = Новый Запрос;
	 ЗапросРН.Текст = "ВЫБРАТЬ
	 |	РеализацияТоваровУслуг.Ссылка
	 |ИЗ
	 |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	 |ГДЕ
	 |	РеализацияТоваровУслуг.ПометкаУдаления = Ложь
	 |	И РеализацияТоваровУслуг.Сделка = &Заказ";
	 
	 Рез = ЗАпрос.Выполнить().Выбрать();
	 Заказы.Очистить();
	 Пока Рез.Следующий() Цикл
		 если Рез.ЗаказПокупателя.Статус <> Справочники.Статусы.Создан и ЗначениеЗаполнено(Рез.ЗаказПокупателя.Статус) Тогда
			 Продолжить;
		 КонецеслИ;
		 Если Рез.Поле1 <> 0 или Рез.Поле2 <> 0 Тогда
			 Продолжить;
		 КонецЕсли;
		 ЗапросРН.УстановитьПараметр("Заказ",Рез.ЗаказПокупателя);
		 РезРн = ЗапросРн.Выполнить().Выбрать();
		 ЕстьРН = Ложь;
		 Пока РезРн.Следующий() Цикл
			 ЕстьРН = Истина;
			 Прервать;
		 КонецЦикла;
		 если естьРН Тогда
			 Продолжить;
		 КонецЕсли;
		 ЕстьРезервПоПоставщику = Ложь;
		 Для Каждого СтрТовары Из Рез.ЗаказПокупателя.Товары Цикл
			 Если ТипЗнч(СтрТовары.Размещение) = Тип("ДокументСсылка.ЗаказПокупателя")  Тогда
				 ЕстьРезервПоПоставщику = Истина;
			 КонецЕсли;
		 КонецЦикла;
		 если ЕстьРезервПоПоставщику Тогда
			 Продолжить;
		 КонецЕсли;
		 
		 Ст = Заказы.Добавить();
		 Ст.Заказ = Рез.ЗаказПокупателя;
		 Ст.ДатаОтгрузки = Рез.ЗаказПокупателя.ДатаОтгрузки;
		 Ст.Сумма = Рез.ЗаказПокупателя.СуммаДокумента;
		 Ст.Ответственный = Рез.ЗаказПокупателя.Ответственный;
	 КонецЦикла;
 КонецПроцедуры
 
 Функция ЕстьПеремещение(Зак)
	 Снимаем = 0;
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ПеремещениеТоваров.ВнутреннийЗаказ,
	 |	ПеремещениеТоваров.Ссылка
	 |ИЗ
	 |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	 |ГДЕ
	 |	ПеремещениеТоваров.ПометкаУдаления = Ложь
	 |	И ПеремещениеТоваров.ВнутреннийЗаказ = &Заказ";
	 Запрос.УстановитьПараметр("Заказ",Зак);
	 Рез = Запрос.Выполнить().Выбрать();
	 СписП = Новый СписокЗначений;
	 
	 Пока Рез.Следующий() Цикл
		 Снимаем = Истина;
		 СписП.Добавить(Рез.Ссылка);
	 КонецЦикла;
	 Если СписП.Количество() > 0 или Снимаем = 0 Тогда
		 Снимаем = Истина;
	 Иначе
		 Снимаем = ЛОЖЬ;
	 КонецеслИ;
	 Возврат Снимаем;
 КонецФункции
 
  Функция ЕстьЭкспедиторка(Зак)
	 Снимаем = Истина;
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ПеремещениеТоваров.ВнутреннийЗаказ,
	 |	ПеремещениеТоваров.Ссылка
	 |ИЗ
	 |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	 |ГДЕ
	 |	ПеремещениеТоваров.ПометкаУдаления = Ложь
	 |	И ПеремещениеТоваров.ВнутреннийЗаказ = &Заказ";
	 Запрос.УстановитьПараметр("Заказ",Зак);
	 Рез = Запрос.Выполнить().Выбрать();
	 СписП = Новый СписокЗначений;
	 
	 Пока Рез.Следующий() Цикл
		 Снимаем = Ложь;
		 СписП.Добавить(Рез.Ссылка);
	 КонецЦикла;
	 Возврат Снимаем;
 КонецФункции


 Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	 ЛогСнятия = "";
	 Для Каждого Строка Из Заказы Цикл
		 Если ЕстьПеремещение(Строка.Заказ) Тогда
			 Зак = Строка.Заказ.Ссылка.ПолучитьОбъект();
			 Зак.Статус = Справочники.Статусы.НайтиПоКоду("000000008");
			 Зак.записать(РежимЗаписиДокумента.ОтменаПроведения);
			 ЛогСнятия = ЛогСнятия + Зак.Ссылка+Символы.ПС;
			 к = 0;
			 Пока К<=СписП.Количество()-1 Цикл
				 Пер = СписП[к].Значение.Ссылка.ПолучитьОбъект();
				 Пер.Статус = Справочники.Статусы.НайтиПоКоду("000000008");
				 Пер.записать(РежимЗаписиДокумента.ОтменаПроведения);
				 К = К + 1;
			 КонецЦикла;
		 КонецЕсли;
		 Если Не ЕстьЭкспедиторка(Строка.Заказ) Тогда
		 КонецЕсли;
		 
	 КонецЦикла;
 КонецПроцедуры
