Процедура ОбновлениеСтатусовНП_СД() Экспорт
	//КлючAPI = Константы.КлючAPI_НП_СД.Получить();
	
	//Форма_СД = ПолучитьОбщуюФорму("ФормаВыбораПериода_СД");
	//Форма_СД.ОткрытьМодально();
	
	//мПотверждено = Форма_СД.мПотверждено;
	мНачПериода = НачалоДня(ТекущаяДата()) - 60 * 60 * 24 * 30;
	мКонПериода = КонецДня(ТекущаяДата());;
	
	//Если не мПотверждено Тогда
	//	Возврат;
	//КонецЕсли;
	
	//ТаблицаКлючейAPI = МодульНовойПошты_СД.ПолучитьСписокКлючейЗаПериод(мНачПериода,мКонПериода);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.НП_APIКлюч
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.НП_ДатаНакладной МЕЖДУ &Дата1 И &Дата2
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателя.НП_APIКлюч";
	
	Запрос.УстановитьПараметр("Дата1", мНачПериода);
	Запрос.УстановитьПараметр("Дата2", мКонПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаКлючейAPI = РезультатЗапроса.Выгрузить();
	


	
	СтрСчетчик = 0;
	Для каждого СтрКлючей из ТаблицаКлючейAPI Цикл
		
		КлючAPI = СтрКлючей.НП_APIКлюч;
		//мНачПериода = СтрКлючей.Период;
		//Попытка
		//	мКонПериода = ТаблицаКлючейAPI[СтрСчетчик + 1].Период;
		//Исключение
		//	мКонПериода = КонецДня(ТекущаяДата());
		//КонецПопытки;
		СтрСчетчик = СтрСчетчик + 1;
		Если СокрЛП(КлючAPI) = "" Тогда
			//МодульНовойПошты_СД.СообщитьПользователю("Не внесен ключ API, функционал недоступен!");
			Продолжить;;
		КонецЕсли;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка,
		|	ЗаказПокупателя.НП_ТТН КАК НомерДок
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.НП_ДатаНакладной МЕЖДУ &Дата1 И &Дата2
		|	И ЗаказПокупателя.Проведен
		|	И ЗаказПокупателя.НП_APIКлюч = &НП_APIКлюч";
		
		Запрос.УстановитьПараметр("Дата1", НачалоДня(мНачПериода));
		Запрос.УстановитьПараметр("Дата2", КонецДня(мКонПериода));
		Запрос.УстановитьПараметр("НП_APIКлюч", КлючAPI);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТабРеф = РезультатЗапроса.Выгрузить();	
		Сч = 0;
		КолСтрок = 0;
		Для каждого Стр из ТабРеф Цикл
			//Пока Сч < 100 Цикл
				КолСтрок = КолСтрок + 1;
				Если Сч = 0 тогда
					ТабЗаказов = Новый ТаблицаЗначений;
					ТабЗаказов.Колонки.Добавить("Ссылка");
					ТабЗаказов.Колонки.Добавить("НомерДок");
				КонецЕсли;
				
				Если не Стр.НомерДок = "" Тогда
					НоваяСтрока = ТабЗаказов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
					Сч = Сч + 1;
				КонецЕсли;
				
				Если СЧ = 99 или КолСтрок = ТабРеф.Количество() и не ТабЗаказов.Количество() = 0 Тогда
					ТекущийКлюч = КлючAPI;
					ПараметрыМетода = Новый Структура;
					ПараметрыМетода.Вставить("API20",ТекущийКлюч);
					ПараметрыМетода.Вставить("ТабРеф",ТабЗаказов);
					ТекстЗапроса = МодульНовойПошты_СД.ПолучитьЗапрос_getStatusDocuments(ПараметрыМетода);
					ДокументДом  = МодульНовойПошты_СД.ПолучитьОтветДОМ(МодульНовойПошты_СД.ПолучитьТочкуВхода(),ТекстЗапроса,КлючAPI,Ложь);
					Если  ДокументДом = Неопределено тогда
						МодульНовойПошты_СД.СообщитьПользователю("Ошибка при получении ответа, метод: getStatusDocuments");
					КонецЕсли;
					Если не  МодульНовойПошты_СД.ЭтоУспех(ДокументДом) тогда
						ТекстИсключения = МодульНовойПошты_СД.ВернутьЕрор(ДокументДом);
						МодульНовойПошты_СД.СообщитьПользователю(ТекстИсключения+" getStatusDocuments");
					КонецЕсли;
					лВыполняемаяобработка = МодульНовойПошты_СД.ПолучитьПроцедуруПоМетоду("getStatusDocuments");
					Если не ЗначениеЗаполнено(лВыполняемаяобработка) тогда
						МодульНовойПошты_СД.СообщитьПользователю(ТекстИсключения = "Не назначен обработчик методу: getStatusDocuments");
					КонецЕсли;
					Результат = новый Структура();
					МодульНовойПошты_СД.РаспарситьОтвет(лВыполняемаяобработка, ДокументДом,Результат, "getStatusDocuments",ПараметрыМетода,ТекущийКлюч,Ложь);
					Сч = 0;
				КонецЕсли;
			//КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Процедура ОбновлениеОтделенийНП_СД() Экспорт
	Метод = "getWarehouses";
	ТаблицаМетодов = Новый ТаблицаЗначений;
	ТаблицаМетодов.Колонки.Добавить("Метод");
	Строка = ТаблицаМетодов.Добавить();
	Строка.Метод = Метод;
	МодульНовойПошты_СД.ЗаполнитьСправочникиНП(ТаблицаМетодов,ТекущаяДата()); 
КонецПроцедуры

Процедура ЗаписатьИзмененияДляКабинетаКлиента_СДПриЗаписи(Источник, Отказ) Экспорт
	
	Если не Отказ Тогда
		Если ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
			//Если Источник.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоКоду("000000002") Тогда
			Если Источник.ЭтоГруппа Тогда
				Возврат;
			КонецЕсли;
			
			НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
			
			НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Источник.Ссылка);
			НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Номенклатура");
			
			НоваяЗапись1 = НаборЗаписей1.Добавить();
			
			НоваяЗапись1.период = ТекущаяДата();
			НоваяЗапись1.ОбъектОбмена=Источник.Ссылка;
			НоваяЗапись1.Тип ="СправочникСсылка.Номенклатура";
			
			НаборЗаписей1.Записать();          
			//КонецЕсли;
		//ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Статусы") Тогда 
		//	Если  Источник.ТипДокумента = Перечисления.ТипыДокументовДляСтатусов.ПредЗаказ Тогда
		//		НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
		//		
		//		НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Источник.Ссылка);
		//		НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Статусы");
		//		
		//		НоваяЗапись1 = НаборЗаписей1.Добавить();
		//		
		//		НоваяЗапись1.период = ТекущаяДата();
		//		НоваяЗапись1.ОбъектОбмена=Источник.Ссылка;
		//		НоваяЗапись1.Тип ="СправочникСсылка.Статусы";
		//		
		//		НаборЗаписей1.Записать();
		//	ИначеЕсли Источник.ТипДокумента = Перечисления.ТипыДокументовДляСтатусов.ЗаказПокупателя Тогда 
		//		НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
		//		
		//		НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Источник.Ссылка);
		//		НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Статусы_ЗаказПокупателя");
		//		
		//		НоваяЗапись1 = НаборЗаписей1.Добавить();
		//		
		//		НоваяЗапись1.период = ТекущаяДата();
		//		НоваяЗапись1.ОбъектОбмена=Источник.Ссылка;
		//		НоваяЗапись1.Тип ="СправочникСсылка.Статусы_ЗаказПокупателя";
		//		
		//		НаборЗаписей1.Записать();  			
		//	КонецЕсли;
		ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.УсловияОплаты") Тогда
			НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
			
			НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Источник.Ссылка);
			НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.УсловияОплаты");
			
			НоваяЗапись1 = НаборЗаписей1.Добавить();
			
			НоваяЗапись1.период = ТекущаяДата();
			НоваяЗапись1.ОбъектОбмена=Источник.Ссылка;
			НоваяЗапись1.Тип ="СправочникСсылка.УсловияОплаты";
			
			НаборЗаписей1.Записать();
			
		ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Склады") Тогда 
			Если Источник.ЭтоГруппа Тогда
				Возврат;
			КонецЕсли;
			НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
			
			НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Источник.Ссылка);
			НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Склады");
			
			НоваяЗапись1 = НаборЗаписей1.Добавить();
			
			НоваяЗапись1.период = ТекущаяДата();
			НоваяЗапись1.ОбъектОбмена=Источник.Ссылка;
			НоваяЗапись1.Тип ="СправочникСсылка.Склады";
			
			НаборЗаписей1.Записать();
			
		ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.УсловияПоставки") Тогда
			НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
			
			НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Источник.Ссылка);
			НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.УсловияПоставки");
			
			НоваяЗапись1 = НаборЗаписей1.Добавить();
			
			НоваяЗапись1.период = ТекущаяДата();
			НоваяЗапись1.ОбъектОбмена=Источник.Ссылка;
			НоваяЗапись1.Тип ="СправочникСсылка.УсловияПоставки";
			
			НаборЗаписей1.Записать();
		ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("СправочникСсылка.Клиенты") Тогда
			НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
			
			НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Источник.Ссылка);
			НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Клиенты");
			
			НоваяЗапись1 = НаборЗаписей1.Добавить();
			
			НоваяЗапись1.период = ТекущаяДата();
			НоваяЗапись1.ОбъектОбмена=Источник.Ссылка;
			НоваяЗапись1.Тип ="СправочникСсылка.Клиенты";
			
			НаборЗаписей1.Записать(); 
		ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
			//Если не Источник.Проведен Тогда
			//	Возврат;
			//КонецЕсли;   
			
			Для каждого Стр из Источник.Товары Цикл
				НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Стр.Номенклатура);
				НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Остаток_Номенклатура");
				
				НоваяЗапись1 = НаборЗаписей1.Добавить();
				
				НоваяЗапись1.период = ТекущаяДата();
				НоваяЗапись1.ОбъектОбмена=Стр.Номенклатура;
				НоваяЗапись1.Тип ="СправочникСсылка.Остаток_Номенклатура";
				
				НаборЗаписей1.Записать();
				
			КонецЦикла;  	
			
			
			
			Если не ЗначениеЗаполнено(Источник.ПредЗаказ) Тогда
				Возврат;
			КонецЕсли; 
			
			Если Источник.ПредЗаказ.НомерКабинет = "" Тогда
				Возврат;
			КонецЕсли;
			НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
			
			НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Источник.ПредЗаказ.Ссылка);
			НаборЗаписей1.Отбор.Тип.Установить("ДокументСсылка.ПредЗаказ");
			
			НоваяЗапись1 = НаборЗаписей1.Добавить();
			
			НоваяЗапись1.период = ТекущаяДата();
			НоваяЗапись1.ОбъектОбмена=Источник.ПредЗаказ.Ссылка;
			НоваяЗапись1.Тип ="ДокументСсылка.ПредЗаказ";
			
			НаборЗаписей1.Записать();
		ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПредЗаказ") и не Источник.ПометкаУдаления Тогда
			НайденКлиентОпт = Справочники.Клиенты.НайтиПоРеквизиту("Контрагент",Источник.Контрагент);
			Если Не НайденКлиентОпт = Справочники.Клиенты.ПустаяСсылка() Тогда 
				Если Источник.НомерКабинет = "" тогда
					НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
					
					НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Источник.Ссылка);
					НаборЗаписей1.Отбор.Тип.Установить("ДокументСсылка.НовыйПредЗаказ");
					
					НоваяЗапись1 = НаборЗаписей1.Добавить();
					
					НоваяЗапись1.период = ТекущаяДата();
					НоваяЗапись1.ОбъектОбмена=Источник.Ссылка;
					НоваяЗапись1.Тип ="ДокументСсылка.НовыйПредЗаказ";
					НаборЗаписей1.Записать();
				//Иначе
				//	НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				//	
				//	НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Источник.Ссылка);
				//	НаборЗаписей1.Отбор.Тип.Установить("ДокументСсылка.Изменения_ПредЗаказ");
				//	
				//	НоваяЗапись1 = НаборЗаписей1.Добавить();
				//	
				//	НоваяЗапись1.период = ТекущаяДата();
				//	НоваяЗапись1.ОбъектОбмена=Источник.Ссылка;
				//	НоваяЗапись1.Тип ="ДокументСсылка.Изменения_ПредЗаказ";
				//	НаборЗаписей1.Записать();
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
			или ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
			или ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") 
			или ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
			или ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			или ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СписаниеТоваров") Тогда	
			Для каждого Стр из Источник.Товары Цикл
				НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Стр.Номенклатура);
				НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Остаток_Номенклатура");
				
				НоваяЗапись1 = НаборЗаписей1.Добавить();
				
				НоваяЗапись1.период = ТекущаяДата();
				НоваяЗапись1.ОбъектОбмена=Стр.Номенклатура;
				НоваяЗапись1.Тип ="СправочникСсылка.Остаток_Номенклатура";
				
				НаборЗаписей1.Записать();
				
			КонецЦикла;
		ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.УстановкаЦенНоменклатуры") Тогда 
			//Если не Источник.Проведен Тогда
			//	Возврат;
			//КонецЕсли;   
			
			//Для каждого Стр из Источник.Товары Цикл
				НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Источник.Ссылка);
				НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Цена_Номенклатура");
				
				НоваяЗапись1 = НаборЗаписей1.Добавить();
				
				НоваяЗапись1.период = ТекущаяДата();
				НоваяЗапись1.ОбъектОбмена=Источник.Ссылка;
				НоваяЗапись1.Тип ="СправочникСсылка.Цена_Номенклатура";
				
				НаборЗаписей1.Записать();
				
			//КонецЦикла;

		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписьРегистровДляКабинетаКлиента_СДПередЗаписью(Источник, Отказ, Замещение) Экспорт
	Если ТипЗнч(Источник) = Тип("РегистрНакопленияНаборЗаписей.ТоварыНаСкладах") Тогда
		Для каждого Стр из Источник Цикл
			НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
			
			НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Стр.Номенклатура);
			НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Остаток_Номенклатура");
			
			НоваяЗапись1 = НаборЗаписей1.Добавить();
			
			НоваяЗапись1.период = ТекущаяДата();
			НоваяЗапись1.ОбъектОбмена=Стр.Номенклатура;
			НоваяЗапись1.Тип ="СправочникСсылка.Остаток_Номенклатура";
			
			НаборЗаписей1.Записать();
		КонецЦикла; 
	ИначеЕсли 	ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ЦеныНоменклатуры") Тогда 
		//ТаблЦенДо = ПолучитьЦенуКабинетаДо(Источник.Отбор.Регистратор.Значение.Дата - 1);
		//ОптоваяЦена = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000006");
		//Для каждого Стр из Источник Цикл
		//	Если стр.ТипЦен = ОптоваяЦена Тогда//Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000006") Тогда 
		//		
		//		//НайденаЦена = ТаблЦенДо.найти(Стр.Номенклатура);
		//		//Если Не НайденаЦена = Неопределено Тогда
		//		//	Если НайденаЦена.Цена = Стр.Цена Тогда
		//		//		Продолжить;
		//		//	КонецЕсли;
		//		//КонецЕсли;
		//		
		//		НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
		//		
		//		НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Стр.Номенклатура);
		//		НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Цена_Номенклатура");
		//		
		//		НоваяЗапись1 = НаборЗаписей1.Добавить();
		//		
		//		НоваяЗапись1.период = ТекущаяДата();
		//		НоваяЗапись1.ОбъектОбмена=Стр.Номенклатура;
		//		НоваяЗапись1.Тип ="СправочникСсылка.Цена_Номенклатура";
		//		
		//		НаборЗаписей1.Записать();
		//	КонецЕсли;
		//КонецЦикла;
	КонецЕсли;
КонецПроцедуры  

Функция  ПолучитьЦенуКабинетаДо(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Цены.Цена,
		|	Цены.Номенклатура
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|		ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|	ИЗ
		|		РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				&Дата,
		|				ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних) КАК Цены";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000006"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Возврат ВыборкаДетальныеЗаписи;
КонецФункции

/////////////////////////////////ОБМЕН ОПТОВЫЙ КАБИНЕТ
Процедура ОбменСОптовымКабинетом_Заказы_СД() Экспорт
	Параметры = "Srvr=""app1"";Ref=""test"";Usr=""Obmen"";Pwd=""CDE#45^YHN"";";
	V82COMConnector= Новый COMОбъект("V83.COMConnector");
	Попытка
		Base1С = V82COMConnector.Connect(Параметры);
		ОбменВ_КабинетКлиента_заказы(Base1С);
		ОбменИзКабинета_Заказ(Base1С);
	Исключение 
		#Если Клиент Тогда
		Предупреждение ("Ошибка подключения!");
		#КонецЕсли
	КонецПопытки;  
КонецПроцедуры  

Процедура ОбменВ_КабинетКлиента_заказы(Base1С) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыДляОбмена.ОбъектОбмена,
	|	ОбъектыДляОбмена.Тип
	|ИЗ
	|	РегистрСведений.ОбъектыДляОбмена КАК ОбъектыДляОбмена";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		Если ВыборкаДетальныеЗаписи.Тип = "ДокументСсылка.НовыйПредЗаказ" Тогда 
			НомерНовогоЗаказа = "";    
			
			ЗаказСсылка = Документы.ЗаказПокупателя.НайтиПоРеквизиту("ПредЗаказ",ВыборкаДетальныеЗаписи.ОбъектОбмена.ссылка);
			
			КодСтатуса = "";
			Если не ЗаказСсылка = Документы.ЗаказПокупателя.ПустаяСсылка() тогда
				КодСтатуса = ЗаказСсылка.Статус.Код;
			КонецЕсли;
			
			Base1С.МодульОбмена_Сервер.СоздатьЗаказИзОсновнойБазы(ВыборкаДетальныеЗаписи.ОбъектОбмена,ВыборкаДетальныеЗаписи.ОбъектОбмена.Контрагент.Код,КодСтатуса,НомерНовогоЗаказа);
			
			Если не НомерНовогоЗаказа = "" Тогда  
				ПолДок = ВыборкаДетальныеЗаписи.ОбъектОбмена.Ссылка.ПолучитьОбъект();
				ПолДок.НомерКабинет = НомерНовогоЗаказа;
				ПолДок.ДатаКабинет = ПолДок.Дата;
				ПолДок.Записать(РежимЗаписиДокумента.Запись);
				
				НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
				НаборЗаписей1.Отбор.Тип.Установить("ДокументСсылка.НовыйПредЗаказ");
				НаборЗаписей1.Записать();	     
			КонецЕсли; 
		ИначеЕсли ВыборкаДетальныеЗаписи.Тип = "ДокументСсылка.Изменения_ПредЗаказ" Тогда 
			НомерНовогоЗаказа = "";    
			
			ЗаказСсылка = Документы.ЗаказПокупателя.НайтиПоРеквизиту("ПредЗаказ",ВыборкаДетальныеЗаписи.ОбъектОбмена.ссылка);
			
			КодСтатуса = "";
			Если не ЗаказСсылка = Документы.ЗаказПокупателя.ПустаяСсылка() тогда
				КодСтатуса = ЗаказСсылка.Статус.Код;
			КонецЕсли;
			
			Base1С.МодульОбмена_Сервер.ОбновитьЗаказИзОсновнойБазы(ВыборкаДетальныеЗаписи.ОбъектОбмена,ВыборкаДетальныеЗаписи.ОбъектОбмена.Контрагент.Код,КодСтатуса,НомерНовогоЗаказа);
			
			Если не НомерНовогоЗаказа = "" Тогда  								
				НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
				НаборЗаписей1.Отбор.Тип.Установить("ДокументСсылка.Изменения_ПредЗаказ");
				НаборЗаписей1.Записать();	     
			КонецЕсли;
		ИначеЕсли ВыборкаДетальныеЗаписи.Тип = "ДокументСсылка.ПредЗаказ" Тогда
			Попытка
				
				Запрос1 = Новый Запрос;
				Запрос1.Текст = 
				"ВЫБРАТЬ
				|	ЗаказПокупателя.Ссылка,
				|	ЗаказПокупателя.Статус,
				|	ЗаказПокупателя.Номер
				|ИЗ
				|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
				|ГДЕ
				|	ЗаказПокупателя.ПредЗаказ = &ПредЗаказ";
				
				Запрос1.УстановитьПараметр("ПредЗаказ", ВыборкаДетальныеЗаписи.ОбъектОбмена);
				
				РезультатЗапроса1 = Запрос1.Выполнить();
				
				ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
				
				Статус = Неопределено; 
				НомерЗаказа = Неопределено;
				Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
					Статус = ВыборкаДетальныеЗаписи1.Статус;
					НомерЗаказа = ВыборкаДетальныеЗаписи1.Номер;
				КонецЦикла;
				
				
				Base1С.МодульОбмена_Сервер.ОбменПредЗаказ(ВыборкаДетальныеЗаписи.ОбъектОбмена,Статус,НомерЗаказа);
				НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
				НаборЗаписей1.Отбор.Тип.Установить("ДокументСсылка.ПредЗаказ");
				НаборЗаписей1.Записать(); 
			Исключение  
				#Если Клиент Тогда
					Сообщить(""+ ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОбменИзКабинета_Заказ(Base1С)
	
	Запрос = Base1С.NewObject("Запрос");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыДляОбмена.ОбъектОбмена,
	|	ОбъектыДляОбмена.Тип
	|ИЗ
	|	РегистрСведений.ОбъектыДляОбмена КАК ОбъектыДляОбмена";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Тип = "СправочникСсылка.Клиенты" Тогда
            Попытка
				ОбменКлиентыИзКабинета(Base1С,ВыборкаДетальныеЗаписи.ОбъектОбмена);
				
				НаборЗаписей1 = Base1С.РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
				НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Клиенты");
				НаборЗаписей1.Записать(); 
			Исключение 
				#Если Клиент Тогда
				Сообщить(""+ ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки;
		ИначеЕсли ВыборкаДетальныеЗаписи.Тип = "ДокументСсылка.Заказ" Тогда
			Попытка
				ОбменЗаказыИзКабинета(Base1С,ВыборкаДетальныеЗаписи.ОбъектОбмена);
				
				НаборЗаписей1 = Base1С.РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
				НаборЗаписей1.Отбор.Тип.Установить(ВыборкаДетальныеЗаписи.Тип);
				НаборЗаписей1.Записать(); 
			Исключение 
				#Если Клиент Тогда
				Сообщить(""+ ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки;			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 

Процедура ОбменСОптовымКабинетом_СД() Экспорт
	Параметры = "Srvr=""app1"";Ref=""test"";Usr=""Obmen"";Pwd=""CDE#45^YHN"";";
	V82COMConnector= Новый COMОбъект("V83.COMConnector");
	Попытка
		Base1С = V82COMConnector.Connect(Параметры);
		ОбменВ_КабинетКлиента(Base1С);
		ОбменИзКабинета(Base1С);
	Исключение 
		#Если Клиент Тогда
		Предупреждение ("Ошибка подключения!");
		#КонецЕсли
	КонецПопытки;  
КонецПроцедуры  

Процедура ОбменВ_КабинетКлиента(Base1С)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыДляОбмена.ОбъектОбмена,
	|	ОбъектыДляОбмена.Тип
	|ИЗ
	|	РегистрСведений.ОбъектыДляОбмена КАК ОбъектыДляОбмена";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Тип = "СправочникСсылка.Номенклатура" Тогда
			Попытка
				ОбменНоменклатурой(Base1С,ВыборкаДетальныеЗаписи.ОбъектОбмена); 
				
				НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
				НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Номенклатура");
				НаборЗаписей1.Записать();
			Исключение
				#Если Клиент Тогда
				Сообщить(""+ ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки;
		ИначеЕсли ВыборкаДетальныеЗаписи.Тип = "СправочникСсылка.Склады" Тогда
			Попытка
				ОбменСклады(Base1С,ВыборкаДетальныеЗаписи.ОбъектОбмена);
				
				НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
				НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Склады");
				НаборЗаписей1.Записать(); 
			Исключение
				#Если Клиент Тогда
				Сообщить(""+ ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки	
		ИначеЕсли ВыборкаДетальныеЗаписи.Тип = "СправочникСсылка.Статусы" Тогда
			Попытка
				ОбменСтатусами(Base1С,ВыборкаДетальныеЗаписи.ОбъектОбмена);
				
				НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
				НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Статусы");
				НаборЗаписей1.Записать(); 
			Исключение
				#Если Клиент Тогда
				Сообщить(""+ ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки; 
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Тип = "СправочникСсылка.Статусы_ЗаказПокупателя" Тогда
			Попытка
				ОбменСтатусы_ЗаказПокупателя(Base1С,ВыборкаДетальныеЗаписи.ОбъектОбмена);
				
				НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
				НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Статусы_ЗаказПокупателя");
				НаборЗаписей1.Записать(); 
			Исключение
				#Если Клиент Тогда
				Сообщить(""+ ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки;

			
		ИначеЕсли ВыборкаДетальныеЗаписи.Тип = "СправочникСсылка.УсловияОплаты" Тогда
			Попытка
				ОбменУсловияОплаты(Base1С,ВыборкаДетальныеЗаписи.ОбъектОбмена);
				
				НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
				НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.УсловияОплаты");
				НаборЗаписей1.Записать(); 
			Исключение
				#Если Клиент Тогда
				Сообщить(""+ ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Тип = "СправочникСсылка.УсловияПоставки" Тогда
			Попытка
				ОбменУсловияДоставки(Base1С,ВыборкаДетальныеЗаписи.ОбъектОбмена);
				
				НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
				НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.УсловияПоставки");
				НаборЗаписей1.Записать(); 
			Исключение
				#Если Клиент Тогда
				Сообщить(""+ ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Тип = "СправочникСсылка.Клиенты" Тогда
			Попытка
				//ОбменКлиенты(Base1С,ВыборкаДетальныеЗаписи.ОбъектОбмена);
				Base1С.МодульОбмена_Сервер.ОбменКлиенты(ВыборкаДетальныеЗаписи.ОбъектОбмена,Перечисления.СтатусыКлиентов.Индекс(ВыборкаДетальныеЗаписи.ОбъектОбмена.СтатусКлиента));
				НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
				НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Клиенты");
				НаборЗаписей1.Записать(); 
			Исключение  
				#Если Клиент Тогда
				Сообщить(""+ ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки;
		//ИначеЕсли ВыборкаДетальныеЗаписи.Тип = "ДокументСсылка.ПредЗаказ" Тогда
		//	Попытка
		//		
		//		Запрос1 = Новый Запрос;
		//		Запрос1.Текст = 
		//		"ВЫБРАТЬ
		//		|	ЗаказПокупателя.Ссылка,
		//		|	ЗаказПокупателя.Статус,
		//		|	ЗаказПокупателя.Номер
		//		|ИЗ
		//		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		//		|ГДЕ
		//		|	ЗаказПокупателя.ПредЗаказ = &ПредЗаказ";
		//		
		//		Запрос1.УстановитьПараметр("ПредЗаказ", ВыборкаДетальныеЗаписи.ОбъектОбмена);
		//		
		//		РезультатЗапроса1 = Запрос1.Выполнить();
		//		
		//		ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
		//		
		//		Статус = Неопределено; 
		//		НомерЗаказа = Неопределено;
		//		Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
		//			Статус = ВыборкаДетальныеЗаписи1.Статус;
		//			НомерЗаказа = ВыборкаДетальныеЗаписи1.Номер;
		//		КонецЦикла;
		//		
		//		
		//		Base1С.МодульОбмена_Сервер.ОбменПредЗаказ(ВыборкаДетальныеЗаписи.ОбъектОбмена,Статус,НомерЗаказа);
		//		НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
		//		НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
		//		НаборЗаписей1.Отбор.Тип.Установить("ДокументСсылка.ПредЗаказ");
		//		НаборЗаписей1.Записать(); 
		//	Исключение  
		//		#Если Клиент Тогда
		//			Сообщить(""+ ОписаниеОшибки());
		//		#КонецЕсли
		//	КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	
	
	
	
	//выгрузка цен 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыДляОбмена.ОбъектОбмена,
	|	ОбъектыДляОбмена.Тип
	|ИЗ
	|	РегистрСведений.ОбъектыДляОбмена КАК ОбъектыДляОбмена
	|ГДЕ
	|	ОбъектыДляОбмена.Тип В(&Тип)";
	
	Запрос.УстановитьПараметр("Тип","СправочникСсылка.Цена_Номенклатура");
	РезультатЗапроса = Запрос.Выполнить();
	ТаблНом_цены = РезультатЗапроса.Выгрузить();
	
	ТаблНом_Цена_Отбор = Новый ТаблицаЗначений;
	ТаблНом_Цена_Отбор.Колонки.Добавить("Товар");
	
	ОптоваяЦена = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000006");

	Для каждого Стр_Обмен из ТаблНом_цены Цикл 
		ТаблЦенДо = ПолучитьЦенуКабинетаДо(Стр_Обмен.ОбъектОбмена.Дата - 1);
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.Номенклатура,
		|	ЦеныНоменклатуры.Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|ГДЕ
		|	ЦеныНоменклатуры.Регистратор = &Регистратор
		|	И ЦеныНоменклатуры.ТипЦен = &ТипЦен";
		
		Запрос.УстановитьПараметр("Регистратор", Стр_Обмен.ОбъектОбмена); 
		Запрос.УстановитьПараметр("ТипЦен", ОптоваяЦена);
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТаблТов_установкаЦен = РезультатЗапроса.Выгрузить();	
		
		
		Для каждого Стр из ТаблТов_установкаЦен Цикл
			//Если не стр.ТипЦен = ОптоваяЦена Тогда
			//	Продолжить;	
			//КонецЕсли;
			НайденаЦена = ТаблЦенДо.найти(Стр.Номенклатура);
			Если Не НайденаЦена = Неопределено Тогда
				Если НайденаЦена.Цена = Стр.Цена Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока = ТаблНом_Цена_Отбор.Добавить();
			НоваяСтрока.Товар = Стр.Номенклатура;
		КонецЦикла;
	КонецЦикла;
	ТаблНом_Цена_Отбор.Свернуть("Товар");
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
		"ВЫБРАТЬ
		|	Цены.Цена * (СписокКурсов.Курс / СписокКурсов.Кратность) КАК Цена,
		|	СписокНом.Код,
		|	Цены.Валюта
		|ИЗ
		|	(ВЫБРАТЬ
		|		Номенклатура.Ссылка КАК Ссылка,
		|		Номенклатура.Код КАК Код
		|	ИЗ
		|		Справочник.Номенклатура КАК Номенклатура
		|	ГДЕ
		|		Номенклатура.Ссылка В(&Номенклатура)) КАК СписокНом
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|			ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|			ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта
		|		ИЗ
		|			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|					,
		|					Номенклатура В (&Номенклатура)
		|						И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних) КАК Цены
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|				КурсыВалютСрезПоследних.Курс КАК Курс,
		|				КурсыВалютСрезПоследних.Кратность КАК Кратность
		|			ИЗ
		|				РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних) КАК СписокКурсов
		|			ПО Цены.Валюта = СписокКурсов.Валюта
		|		ПО СписокНом.Ссылка = Цены.Номенклатура";
	
	Запрос1.УстановитьПараметр("Номенклатура", ТаблНом_Цена_Отбор.ВыгрузитьКолонку("Товар"));
	Запрос1.УстановитьПараметр("ТипЦен", Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000006"));
	//Запрос1.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса1 = Запрос1.Выполнить();
	
	СписокНомЦен = РезультатЗапроса1.Выгрузить();	
	
	Если СписокНомЦен.Количество() = 0 Тогда
		ЦеныОбновлены = истина;	
	Иначе 
		ЦеныОбновлены = Base1С.МодульОбмена_Сервер.ЗагрузкаЦен(СписокНомЦен);
	КонецЕсли;
	Если ЦеныОбновлены Тогда
		Для каждого Стр из ТаблНом_цены Цикл
			НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
			НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Стр.ОбъектОбмена);
			НаборЗаписей1.Отбор.Тип.Установить(Стр.Тип);
			НаборЗаписей1.Записать();	
		КонецЦикла;
	КонецЕсли;   
	
	
	//выгрузка остатков
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыДляОбмена.ОбъектОбмена,
	|	ОбъектыДляОбмена.Тип
	|ИЗ
	|	РегистрСведений.ОбъектыДляОбмена КАК ОбъектыДляОбмена
	|ГДЕ
	|	ОбъектыДляОбмена.Тип В(&Тип)";
	
	Запрос.УстановитьПараметр("Тип","СправочникСсылка.Остаток_Номенклатура");
	РезультатЗапроса = Запрос.Выполнить();
    ТаблНом_остаток = РезультатЗапроса.Выгрузить(); 
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
		"ВЫБРАТЬ
		|	Остатки.Количество КАК Остаток,
		|	СписокНом.Код,
		|	ЕСТЬNULL(Остатки.Склад.Код, """") КАК СкладКод,
		|	ЕСТЬNULL(СтранаИДатаПроизводства.Дата, """") КАК Дата,
		|	ЕСТЬNULL(СтранаИДатаПроизводства.Страна, """") КАК Страна
		|ИЗ
		|	(ВЫБРАТЬ
		|		Номенклатура.Ссылка КАК Ссылка,
		|		Номенклатура.Код КАК Код
		|	ИЗ
		|		Справочник.Номенклатура КАК Номенклатура
		|	ГДЕ
		|		Номенклатура.Ссылка В(&Номенклатура)) КАК СписокНом
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТоварыНаСкладахОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|			СУММА(ЕСТЬNULL(ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток, 0) - ЕСТЬNULL(ВложенныйЗапрос.Количество, 0)) КАК Количество,
		|			ТоварыНаСкладахОстаткиИОбороты.Склад КАК Склад
		|		ИЗ
		|			РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&ТекущаяДата, &ТекущаяДата, , , Номенклатура В (&Номенклатура)) КАК ТоварыНаСкладахОстаткиИОбороты
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ТоварыВРезервеНаСкладахОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|					СУММА(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток, 0)) КАК Количество,
		|					ТоварыВРезервеНаСкладахОстаткиИОбороты.Склад КАК Склад
		|				ИЗ
		|					РегистрНакопления.ТоварыВРезервеНаСкладах.ОстаткиИОбороты(&ТекущаяДата, &ТекущаяДата, , , Номенклатура В (&Номенклатура)) КАК ТоварыВРезервеНаСкладахОстаткиИОбороты
		|				
		|				СГРУППИРОВАТЬ ПО
		|					ТоварыВРезервеНаСкладахОстаткиИОбороты.Номенклатура,
		|					ТоварыВРезервеНаСкладахОстаткиИОбороты.Склад) КАК ВложенныйЗапрос
		|				ПО ТоварыНаСкладахОстаткиИОбороты.Склад = ВложенныйЗапрос.Склад
		|					И ТоварыНаСкладахОстаткиИОбороты.Номенклатура = ВложенныйЗапрос.Номенклатура
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
		|			ТоварыНаСкладахОстаткиИОбороты.Склад) КАК Остатки
		|		ПО СписокНом.Ссылка = Остатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(ДатыПроизводстваСрезПоследних.ДатаПроизводства) КАК Дата,
		|			МАКСИМУМ(ДатыПроизводстваСрезПоследних.Страна) КАК Страна,
		|			ДатыПроизводстваСрезПоследних.Номенклатура КАК Номенклатура
		|		ИЗ
		|			РегистрСведений.ДатыПроизводства.СрезПоследних(, Поставщик ССЫЛКА Справочник.Склады) КАК ДатыПроизводстваСрезПоследних
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ДатыПроизводстваСрезПоследних.Номенклатура) КАК СтранаИДатаПроизводства
		|		ПО СписокНом.Ссылка = СтранаИДатаПроизводства.Номенклатура";
	
	Запрос1.УстановитьПараметр("Номенклатура", ТаблНом_остаток.ВыгрузитьКолонку("ОбъектОбмена"));
	Запрос1.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()));
	
	РезультатЗапроса1 = Запрос1.Выполнить();
	
	СписокНомОстатков = РезультатЗапроса1.Выгрузить();
	Если СписокНомОстатков.Количество() = 0 Тогда
		ОстаткиОбновлены = истина;	
	Иначе 
		Если СписокНомОстатков.Количество()=0 Тогда
			ОстаткиОбновлены = истина;	
		Иначе
			ОстаткиОбновлены = Base1С.МодульОбмена_Сервер.ЗагрузкаОстатков(СписокНомОстатков);
		КонецЕсли;
	КонецЕсли;
	Если ОстаткиОбновлены Тогда
		Для каждого Стр из ТаблНом_остаток Цикл
			НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
			НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Стр.ОбъектОбмена);
			НаборЗаписей1.Отбор.Тип.Установить(Стр.Тип);
			НаборЗаписей1.Записать();	
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбменНоменклатурой(Base1С,НомСсылка) Экспорт 
	КлючПоиска         = СокрЛП(НомСсылка.Код);
	//
	
	РезПоиска = Base1С.Справочники.Номенклатура.НайтиПоРеквизиту("ВнешнийКод",КлючПоиска); 
	
	Если РезПоиска =  Base1С.Справочники.Номенклатура.ПустаяСсылка() Тогда
		НовыйОбъект = Base1С.Справочники.Номенклатура.СоздатьЭлемент();
	Иначе
		НовыйОбъект = РезПоиска.ПОлучитьОбъект();
	КонецЕсли;	 
	НовыйОбъект.ВидНоменклатуры = ПолучитьВидНоменклатуры(Base1С,НомСсылка.ВидНоменклатуры);
	НовыйОбъект.Наименование = НомСсылка.Наименование;
	НовыйОбъект.ВнешнийКод = НомСсылка.Код; 
	НовыйОбъект.Артикул = НомСсылка.Артикул;
	НовыйОбъект.Ширина = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраШирина",НомСсылка.Ширина.Наименование);
	НовыйОбъект.Высота = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраВысота",НомСсылка.ВысотаПрофиля.Наименование);
	НовыйОбъект.Диаметр = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраДиаметр",НомСсылка.ДиаметрДиска.Наименование);
	НовыйОбъект.Сезон = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраСезон",Строка(НомСсылка.Сезонность));
	НовыйОбъект.Производитель = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраПроизводитель",НомСсылка.Производитель.Наименование);
	НовыйОбъект.Модель = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраМодель",НомСсылка.Модель.Наименование,НомСсылка.Модель.Владелец.Наименование);
	НовыйОбъект.Усиление = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраУсиление",НомСсылка.СпециальныйИндекс.Наименование);
	НовыйОбъект.Шипы = ?(ЗначениеЗаполнено(НомСсылка.Шипы),истина,Ложь);
	НовыйОбъект.ИндексСкорости = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраИндексСкорости",НомСсылка.ИндексСкорости.Наименование);
	НовыйОбъект.ИндексНагрузки = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраИндексНагрузки",НомСсылка.ИндексНагрузки.Наименование);
	НовыйОбъект.ДополнительныеПараметры = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраДополнительныеПараметры",НомСсылка.ДополнительныеПараметры.Наименование);
	НовыйОбъект.ТипПротектора = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраТипПротектора",НомСсылка.РисункиПротектора.Наименование);
	
	
	НовыйОбъект.МежболтовоерасстояниеPCD1 = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраМежболтовоерасстояниеPCD",НомСсылка.МежболтовоерасстояниеPCD1.Наименование);
	НовыйОбъект.ВылетДисков = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраВылетДисков",НомСсылка.ВылетДисков.Наименование);
	НовыйОбъект.Покраска = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраПокраска",НомСсылка.Покраска.Наименование);
	НовыйОбъект.РисункиПротектора = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраРисункиПротектора",НомСсылка.РисункиПротектора.Наименование);
	НовыйОбъект.МежболтовоерасстояниеPCD2 = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраМежболтовоерасстояниеPCD",НомСсылка.МежболтовоерасстояниеPCD2.Наименование);
	НовыйОбъект.Ступица = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраСтупица",НомСсылка.Ступица.Наименование);
	НовыйОбъект.МаркаАвтомобиля = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраМаркаАвтомобиля",НомСсылка.МаркаАвтомобиля.Наименование);
	НовыйОбъект.МодельАвтомобиля = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраМодельАвтомобиля",НомСсылка.Материал.Наименование);
	НовыйОбъект.Материал = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраМатериал",НомСсылка.СалонБагажник.Наименование);
	НовыйОбъект.СалонБагажник = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраСалонБагажник",НомСсылка.Емкость.Наименование);
	НовыйОбъект.Емкость = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраЕмкость",НомСсылка.РисункиПротектора.Наименование);
	НовыйОбъект.ПусковойТок = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраПусковойТок",НомСсылка.ПусковойТок.Наименование);
	НовыйОбъект.Полярность = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраПолярность",НомСсылка.Полярность.Наименование);
	НовыйОбъект.Длинна = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраДлинна",НомСсылка.Длинна.Наименование);
	НовыйОбъект.ШиринаАкумулятора = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраШиринаАкумулятора",НомСсылка.ШиринаАкумулятора.Наименование);
	НовыйОбъект.Крепеж = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраКрепеж",НомСсылка.Крепеж.Наименование);
	НовыйОбъект.Износ = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраИзнос",НомСсылка.Износ.Наименование);
	НовыйОбъект.ТипСекреток = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраТипСекреток",НомСсылка.ТипСекреток.Наименование);
	НовыйОбъект.РезьбаСекретки = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраРезьбаСекретки",НомСсылка.РезьбаСекретки.Наименование);
	НовыйОбъект.ВысотаСекретки = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраВысотаСекретки",НомСсылка.ВысотаСекретки.Наименование);
	НовыйОбъект.ВидСекретки = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраВидСекретки",НомСсылка.ВидСекретки.Наименование);
	НовыйОбъект.ПрижимнаяПоверхность = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраПрижимнаяПоверхность",НомСсылка.ПрижимнаяПоверхность.Наименование);
	НовыйОбъект.Покрытие = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраПокрытие",НомСсылка.Покрытие.Наименование);
	НовыйОбъект.Ключ = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраКлюч",НомСсылка.Ключ.Наименование);
	НовыйОбъект.ДопПараметрСекреток = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраДопПараметрСекреток",НомСсылка.ДопПараметрСекреток.Наименование);
	НовыйОбъект.ТипПроставки = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраТипПроставки",НомСсылка.ТипПроставки.Наименование);
	НовыйОбъект.Сверловка1 = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраКрепежныеОтверствия",НомСсылка.Сверловка1.Наименование);
	НовыйОбъект.Сверловка2 = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраКрепежныеОтверствия",НомСсылка.Сверловка2.Наименование);
	НовыйОбъект.Ступица1 = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраСтупица",НомСсылка.Ступица1.Наименование);
	НовыйОбъект.Ступица2 = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраСтупица",НомСсылка.Ступица2.Наименование);
	НовыйОбъект.ТолщинаПроставки = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраТолщиныПроставок",НомСсылка.ТолщинаПроставки.Наименование);
	НовыйОбъект.КреплениеКДиску = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраКрепленияКДискуПроставок",НомСсылка.КреплениеКДиску.Наименование);
	НовыйОбъект.ДопПараметрПроставок = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраДопПараметрыПроставок",НомСсылка.ДопПараметрПроставок.Наименование);
	НовыйОбъект.МатериалЦентровочногоКольца = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраМатериалыЦентровочныхКолец",НомСсылка.МатериалЦентровочногоКольца.Наименование);
	НовыйОбъект.ДопПараметрыЦентровочныхКолец = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраДопПараметрыЦентровочныхКолец",НомСсылка.ДопПараметрыЦентровочныхКолец.Наименование);
	НовыйОбъект.ТипШпильки = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраТипыШпилек",НомСсылка.ТипШпильки.Наименование);
	НовыйОбъект.ДиаметрЗабивки = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраДиаметрыЗабивки",НомСсылка.ДиаметрЗабивки.Наименование);
	НовыйОбъект.ОбщаяДлина = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраОбщаяДлинаШпильки",НомСсылка.ОбщаяДлина.Наименование);
	НовыйОбъект.ДопПараметыШпильки = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраДопПараметрыШпилек",НомСсылка.ДопПараметыШпильки.Наименование);
	НовыйОбъект.тип = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраТип",НомСсылка.Тип.Наименование);

	НовыйОбъект.БУ = НомСсылка.БУ;
	
	
	НовыйОбъект.Записать();	
	
КонецПроцедуры

Функция ПолучитьВидНоменклатуры(Base1С,ВидНоменклатуры)
	НайденВид = Base1С.справочники.ВидНоменклатуры.НайтиПоРеквизиту("ВнешнийКод",ВидНоменклатуры.Код);
	Если НайденВид = Base1С.справочники.ВидНоменклатуры.ПустаяСсылка() Тогда
		НовыйВид = Base1С.справочники.ВидНоменклатуры.СоздатьЭлемент();
		НовыйВид.Наименование = ВидНоменклатуры.Наименование; 
		НовыйВид.ВнешнийКод = ВидНоменклатуры.Код;
        НовыйВид.Записать();
		Возврат НовыйВид.Ссылка;
	Иначе
		Возврат НайденВид.ссылка;
	КонецЕсли;
КонецФункции

Процедура ОбменСклады(Base1С,НомСклад)
	КлючПоиска         = СокрЛП(НомСклад.Код);
	//
	
	РезПоиска = Base1С.Справочники.Склады.НайтиПоРеквизиту("ВнешнийКод",КлючПоиска); 
	
	Если РезПоиска =  Base1С.Справочники.Склады.ПустаяСсылка() Тогда
		НовыйОбъект = Base1С.Справочники.Склады.СоздатьЭлемент(); 
		НовыйОбъект.Наименование = НомСклад.Наименование;
	Иначе
		НовыйОбъект = РезПоиска.ПОлучитьОбъект();
	КонецЕсли;
	
	НовыйОбъект.ВнешнийКод = НомСклад.Код; 
		
	
	НовыйОбъект.Записать();	
	
КонецПроцедуры

Процедура ОбменСтатусами(Base1С,НомСсылка)
	КлючПоиска         = СокрЛП(НомСсылка.Код);
	//
	
	РезПоиска = Base1С.Справочники.Статусы.НайтиПоРеквизиту("ВнешнийКод",КлючПоиска); 
	
	Если РезПоиска =  Base1С.Справочники.Статусы.ПустаяСсылка() Тогда
		НовыйОбъект = Base1С.Справочники.Статусы.СоздатьЭлемент();
		НовыйОбъект.Наименование = НомСсылка.Наименование;
	Иначе
		НовыйОбъект = РезПоиска.ПОлучитьОбъект();
	КонецЕсли;	
	НовыйОбъект.ВнешнийКод = НомСсылка.Код; 
		
	
	НовыйОбъект.Записать();	
	
КонецПроцедуры 

Процедура ОбменСтатусы_ЗаказПокупателя(Base1С,НомСсылка)
	КлючПоиска         = СокрЛП(НомСсылка.Код);
	//
	
	РезПоиска = Base1С.Справочники.Статусы_ЗаказПокупателя.НайтиПоРеквизиту("ВнешнийКод",КлючПоиска); 
	
	Если РезПоиска =  Base1С.Справочники.Статусы_ЗаказПокупателя.ПустаяСсылка() Тогда
		НовыйОбъект = Base1С.Справочники.Статусы_ЗаказПокупателя.СоздатьЭлемент();
	Иначе
		НовыйОбъект = РезПоиска.ПОлучитьОбъект();
	КонецЕсли;	
	НовыйОбъект.Наименование = НомСсылка.Наименование;
	НовыйОбъект.ВнешнийКод = НомСсылка.Код; 
		
	
	НовыйОбъект.Записать();	
	
КонецПроцедуры 

Процедура ОбменУсловияОплаты(Base1С,НомСсылка)
	КлючПоиска         = СокрЛП(НомСсылка.Код);
	//
	
	РезПоиска = Base1С.Справочники.УсловияОплаты.НайтиПоРеквизиту("ВнешнийКод",КлючПоиска); 
	
	Если РезПоиска =  Base1С.Справочники.УсловияОплаты.ПустаяСсылка() Тогда
		НовыйОбъект = Base1С.Справочники.УсловияОплаты.СоздатьЭлемент();
	Иначе
		НовыйОбъект = РезПоиска.ПОлучитьОбъект();
	КонецЕсли;	
	НовыйОбъект.Наименование = НомСсылка.Наименование;
	НовыйОбъект.ВнешнийКод = НомСсылка.Код; 
		
	
	НовыйОбъект.Записать();	
	
КонецПроцедуры

Процедура ОбменУсловияДоставки(Base1С,НомСсылка)
	КлючПоиска         = СокрЛП(НомСсылка.Код);
	//
	
	РезПоиска = Base1С.Справочники.УсловияДоставки.НайтиПоРеквизиту("ВнешнийКод",КлючПоиска); 
	
	Если РезПоиска =  Base1С.Справочники.УсловияДоставки.ПустаяСсылка() Тогда
		НовыйОбъект = Base1С.Справочники.УсловияДоставки.СоздатьЭлемент();
	Иначе
		НовыйОбъект = РезПоиска.ПОлучитьОбъект();
	КонецЕсли;	
	НовыйОбъект.Наименование = НомСсылка.Наименование;
	НовыйОбъект.ВнешнийКод = НомСсылка.Код; 
	
	НовыйОбъект.Записать();	
	
КонецПроцедуры 

Функция СоздатьОбновитьСвойство(Base1С,СправочникПоиска,ЗначениеПоиска, МодельПроизводтель = "")
	
	Если ЗначениеПоиска = "" Тогда
		Возврат Base1С.Справочники[СправочникПоиска].ПустаяСсылка();	
	КонецЕсли;
	
	РезПоиска =  Base1С.Справочники[СправочникПоиска].ПустаяСсылка();
	Попытка	
		Запрос = Base1С.NewObject("Запрос");
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СправочникПоиска.Ссылка
		|ИЗ
		|	Справочник."+СправочникПоиска+" КАК СправочникПоиска
		|ГДЕ
		|	СправочникПоиска.НаименованиеУТ = &НаименованиеУТ";
		
		Запрос.УстановитьПараметр("НаименованиеУТ",ЗначениеПоиска);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			РезПоиска = ВыборкаДетальныеЗаписи.ссылка;
		КонецЦикла;
	Исключение	
		РезПоиска = Base1С.Справочники[СправочникПоиска].НайтиПоНаименованию(ЗначениеПоиска,истина);
	КонецПопытки;
	Если РезПоиска =  Base1С.Справочники[СправочникПоиска].ПустаяСсылка() Тогда
		НовыйОбъект = Base1С.Справочники[СправочникПоиска].СоздатьЭлемент();
		НовыйОбъект.Наименование = ЗначениеПоиска;
		НовыйОбъект.НаименованиеУТ = ЗначениеПоиска;
		
		Если не МодельПроизводтель = "" Тогда 
			НовыйОбъект.Производитель = СоздатьОбновитьСвойство(Base1С,"ЗначениеПараметраПроизводитель",МодельПроизводтель);	
		КонецЕсли;
		
		НовыйОбъект.Записать();
		Возврат НовыйОбъект.Ссылка;
	Иначе
		Возврат РезПоиска.ссылка;
	КонецЕсли;	

КонецФункции

Функция ПолучитьЗначенияСвойств()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект,
		|	ЗначенияСвойствОбъектов.Свойство,
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Возврат ВыборкаДетальныеЗаписи;
КонецФункции
//////////////---------------------------------------------------------------------------------------

Процедура ОбменИзКабинета(Base1С)
	
	Запрос = Base1С.NewObject("Запрос");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыДляОбмена.ОбъектОбмена,
	|	ОбъектыДляОбмена.Тип
	|ИЗ
	|	РегистрСведений.ОбъектыДляОбмена КАК ОбъектыДляОбмена";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Тип = "СправочникСсылка.Клиенты" Тогда
            Попытка
				ОбменКлиентыИзКабинета(Base1С,ВыборкаДетальныеЗаписи.ОбъектОбмена);
				
				НаборЗаписей1 = Base1С.РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
				НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
				НаборЗаписей1.Отбор.Тип.Установить("СправочникСсылка.Клиенты");
				НаборЗаписей1.Записать(); 
			Исключение 
				#Если Клиент Тогда
				Сообщить(""+ ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки;
		//ИначеЕсли ВыборкаДетальныеЗаписи.Тип = "ДокументСсылка.Заказ" Тогда
		//	Попытка
		//		ОбменЗаказыИзКабинета(Base1С,ВыборкаДетальныеЗаписи.ОбъектОбмена);
		//		
		//		НаборЗаписей1 = Base1С.РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
		//		НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.ОбъектОбмена);
		//		НаборЗаписей1.Отбор.Тип.Установить(ВыборкаДетальныеЗаписи.Тип);
		//		НаборЗаписей1.Записать(); 
		//	Исключение 
		//		#Если Клиент Тогда
		//		Сообщить(""+ ОписаниеОшибки());
		//		#КонецЕсли
		//	КонецПопытки;			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры    

Процедура ОбменКлиентыИзКабинета(Base1С,НомСсылка)
	КлючПоиска         = СокрЛП(НомСсылка.Код);
	//
	
	РезПоиска = Справочники.Клиенты.НайтиПоРеквизиту("ВнешнийКод",КлючПоиска); 
	
	Если РезПоиска =  Справочники.Клиенты.ПустаяСсылка() Тогда
		НовыйОбъект = Справочники.Клиенты.СоздатьЭлемент();
	Иначе
		НовыйОбъект = РезПоиска.ПОлучитьОбъект();
	КонецЕсли;	
	НовыйОбъект.Наименование = НомСсылка.Наименование;
	НовыйОбъект.ВнешнийКод = НомСсылка.Код; 
	НовыйОбъект.НомерТелефона = НомСсылка.НомерТелефона;
	
	НовыйОбъект.Сайт = НомСсылка.Сайт;
	НовыйОбъект.Email = НомСсылка.Email;
	НовыйОбъект.Комментарий = НомСсылка.Комментарий;
	НовыйОбъект.Пароль = НомСсылка.Пароль;
	
	НовыйОбъект.Город = НомСсылка.Город;
	НовыйОбъект.Область = НомСсылка.Область;
	
	Попытка
	НовыйОбъект.Контрагент = ?(ЗначениеЗаполнено(НомСсылка.Контрагент.код),Справочники.Контрагенты.НайтиПоКоду(НомСсылка.Контрагент.код),Справочники.Контрагенты.ПустаяСсылка()); 
	Исключение КонецПопытки;
	НовыйОбъект.Логин = НомСсылка.Логин;
	НовыйОбъект.ВидДеятельности = НомСсылка.ВидДеятельности.Наименование;
	
	НовыйОбъект.СтатусКлиента = Перечисления.СтатусыКлиентов.Получить(Base1С.Перечисления.СтатусыКлиентов.Индекс(НомСсылка.СтатусКлиента));
		
	
	НовыйОбъект.Записать();	
	
КонецПроцедуры

Процедура ОбменЗаказыИзКабинета(Base1С,ЗакаСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредЗаказ.Ссылка
		|ИЗ
		|	Документ.ПредЗаказ КАК ПредЗаказ
		|ГДЕ
		|	ПредЗаказ.НомерКабинет = &НомерКабинет
		|	И НачалоПериода(ПредЗаказ.ДатаКабинет,День) = НачалоПериода(&ДатаКабинет,День)";
	
	Запрос.УстановитьПараметр("НомерКабинет", ЗакаСсылка.Номер);
	Запрос.УстановитьПараметр("ДатаКабинет", ЗакаСсылка.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	обновление = Ложь;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовыйДокумент = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект(); 
		обновление = Истина;
	КонецЦикла; 
	
	Если Не обновление Тогда
		НовыйДокумент = Документы.ПредЗаказ.СоздатьДокумент();
		НовыйДокумент.НомерКабинет = ЗакаСсылка.Номер;
		НовыйДокумент.ДатаКабинет = ЗакаСсылка.Дата;
		НовыйДокумент.ТипЦены = Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000006");
		НовыйДокумент.Организация = НовыйДокумент.ТипЦены.Организация;
		НовыйДокумент.Дата = ЗакаСсылка.Дата;	
		НовыйДокумент.Клиент = Справочники.Клиенты.НайтиПоРеквизиту("ВнешнийКод",ЗакаСсылка.Клиент.Код);
		НовыйДокумент.Контрагент = НовыйДокумент.Клиент.Контрагент;
		НовыйДокумент.ДоговорКонтрагента = ПолучитьДоговор(НовыйДокумент.Контрагент,НовыйДокумент.Организация);
		НовыйДокумент.ЮрФизЛицо = НовыйДокумент.Контрагент.ЮрФизЛицо;
		НовыйДокумент.Телефон = НовыйДокумент.Клиент.НомерТелефона;  
		НовыйДокумент.ВремяПоступленияЗаявки = ЗакаСсылка.Дата;
		НовыйДокумент.ФормаРасчета = Справочники.ФормыРасчета.Наличныйрасчетвточкепродажи;
		//+БП: d.matyash (03.12.2024) <> 
		БП_ОбщийМодуль.ИзменитьОрганизацию(НовыйДокумент, Истина);
		//-БП: d.matyash (03.12.2024) <>
		НовыйДокумент.УсловиеПриема = Справочники.УсловияПриема.НайтиПоКоду("0006"); 
		НовыйДокумент.ДатаОтгрузки = КонецДня(ТекущаяДата()) + 1;
		//Если ЗначениеЗаполнено(ЗакаСсылка.УсловиеОплаты) Тогда
		//НовыйДокумент.УсловиеОплаты = Справочники.УсловияПоставки.НайтиПоКоду(ЗакаСсылка.УсловиеДоставки.ВнешнийКод);
		//КонецЕсли;
		
		ТекНомМенеджер = константы.ТекущийМенеджерОПТ_СД.Получить();
		Константы.ТекущийМенеджерОПТ_СД.Установить(ТекНомМенеджер+1);
		Мен = Константы.ТекущийМенеджерОПТ_СД.Получить();
		Док = Документы.ГрафикРаботыМенеджеров_Опт.Выбрать(ТекущаяДата()-90*24*60*60,ТекущаяДата()+90*24*60*60);
		Пока Док.Следующий() Цикл
			Если Док.Проведен Тогда
				Если Док.ДатаПо >= ТекущаяДата() и Док.Дата <= ТекущаяДата()  Тогда
					
					Кво = Док.Менеджера.Количество();
					Поз = Мен-Цел(Мен/Кво)*Кво;
					Если Поз = 0 Тогда
						Поз = Кво;
					КонецЕсли; 
					НовыйДокумент.Ответственный = Док.Менеджера.Получить(Поз-1).Менеджер;
					НовыйДокумент.ОтветственныйМенеджер = Док.Менеджера.Получить(Поз-1).Менеджер;
					
					ПрерватЬ;
				КонецЕсли; 
			КонецЕсли; 	
		КонецЦикла; 
		
		
	
		
		
		//НовыйДокумент.Ответственный = ОператорСсылка;
		//НовыйДокумент.ОтветственныйМенеджер = НастройкиПользователя.ОтветственныйМенеджер;
		НовыйДокумент.Подразделение = Справочники.Подразделения.НайтиПоКоду("Г00000031"); 
		Если не ЗакаСсылка.СкладОтгрузки.ВнешнийКод = "" Тогда
			НовыйДокумент.Склад = Справочники.Склады.НайтиПоКоду(ЗакаСсылка.СкладОтгрузки.ВнешнийКод);
		КонецЕсли;
		НовыйДокумент.АдресДоставки = ЗакаСсылка.Адрес;
		НовыйДокумент.Статус = Справочники.Статусы.НайтиПоКоду(ЗакаСсылка.статус.ВнешнийКод);
		НовыйДокумент.Комментарий = ЗакаСсылка.Комментарий;
		Если ЗначениеЗаполнено(ЗакаСсылка.УсловиеДоставки.ВнешнийКод) Тогда
			НовыйДокумент.УсловияДоставки = Справочники.УсловияПоставки.НайтиПоКоду(ЗакаСсылка.УсловиеДоставки.ВнешнийКод);
		КонецЕсли;
		//НовыйДокумент.ДатаОтгрузки = ТекущаяДата();
		
		Для каждого Стр из ЗакаСсылка.товары Цикл
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Стр.Номенклатура.ВнешнийКод);
			НоваяСтрока.Цена = стр.Цена;
			НоваяСтрока.Количество = стр.количество;
			НоваяСтрока.Сумма = стр.Сумма;
			НоваяСтрока.СуммаСоСкидкой = стр.Сумма;
			Если не стр.Склад.ВнешнийКод = "" Тогда
				НоваяСтрока.Контрагент = Справочники.Склады.НайтиПоКоду(стр.Склад.ВнешнийКод);
			КонецЕсли; 
			НоваяСтрока.ДатаПроизводства = Стр.ДатаПроизводства;
			НоваяСтрока.Страна = Стр.Страна;
		КонецЦикла; 
		НовыйДокумент.ВыводитьОповищениеОптовыйКабинет = Истина;
	иначе  
		НовыйДокумент.Дата = ТекущаяДата();
		НовыйДокумент.АдресДоставки = ЗакаСсылка.Адрес;
		НовыйДокумент.Статус = Справочники.Статусы.НайтиПоКоду(ЗакаСсылка.статус.ВнешнийКод);
		НовыйДокумент.Комментарий = ЗакаСсылка.Комментарий;
		Если ЗначениеЗаполнено(ЗакаСсылка.УсловиеДоставки.ВнешнийКод) Тогда
			НовыйДокумент.УсловияДоставки = Справочники.УсловияПоставки.НайтиПоКоду(ЗакаСсылка.УсловиеДоставки.ВнешнийКод);
		КонецЕсли;  
		НовыйДокумент.ВыводитьОповищениеОптовыйКабинет = Истина;
	КонецЕсли;
	НовыйДокумент.ИсторияИзменений.Очистить();
	Для каждого СтрИстирия из ЗакаСсылка.ИсторияИзменений Цикл
		НоваяСтрокаИстория = НовыйДокумент.ИсторияИзменений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаИстория,СтрИстирия);
	КонецЦикла;
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	Если не обновление Тогда
		СоздатьЗаказНаОснованииПредЗаказа(НовыйДокумент);
		
	Иначе
		Если НовыйДокумент.Статус = Справочники.Статусы.НайтиПоКоду("000000025") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказПокупателя.Ссылка
			|ИЗ
			|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
			|ГДЕ
			|	ЗаказПокупателя.ПредЗаказ = &ПредЗаказ";
			
			Запрос.УстановитьПараметр("ПредЗаказ", НовыйДокумент.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ПолДок = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				ПолДок.Статус = Справочники.Статусы.НайтиПоКоду("000000008");    				
				ПолДок.Записать(?(ПолДок.Проведен,РежимЗаписиДокумента.ОтменаПроведения,РежимЗаписиДокумента.Запись)); 
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка.ПредЗаказ) Тогда
					ПолПредЗаказ = ВыборкаДетальныеЗаписи.Ссылка.ПредЗаказ.Ссылка.ПолучитьОбъект();
					НоваяСтрока = ПолПредЗаказ.ИсторияИзменений.Добавить();
					НоваяСтрока.Дата = ТекущаяДата();
					НоваяСтрока.КтоИзменил = ПараметрыСеанса.ТекущийПользователь.Наименование;
					НоваяСтрока.НовоеЗначение = Строка(ВыборкаДетальныеЗаписи.Ссылка.Статус);
					НоваяСтрока.ЧтоИзменилось = "Статус заказа";
					ПолПредЗаказ.Записать(РежимЗаписиДокумента.Запись);
					
					
					НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
					
					НаборЗаписей1.Отбор.ОбъектОбмена.Установить(ВыборкаДетальныеЗаписи.Ссылка.ПредЗаказ.Ссылка);
					НаборЗаписей1.Отбор.Тип.Установить("ДокументСсылка.ПредЗаказ");
					
					НоваяЗапись1 = НаборЗаписей1.Добавить();
					
					НоваяЗапись1.период = ТекущаяДата();
					НоваяЗапись1.ОбъектОбмена=ВыборкаДетальныеЗаписи.Ссылка.ПредЗаказ.Ссылка;
					НоваяЗапись1.Тип ="ДокументСсылка.ПредЗаказ";
					
					НаборЗаписей1.Записать();
					
				КонецЕсли;

			КонецЦикла;			
		КонецЕсли;
	КонецЕсли;
 КонецПроцедуры   
 
 Процедура СоздатьЗаказНаОснованииПредЗаказа(ПредЗаказ)
	ЗаказПокупателя = Документы.ЗаказПокупателя.СоздатьДокумент();
	ЗаказПокупателя.Дата = ТекущаяДата();
	//ЗаказПокупателя.ДатаОтгрузки = КонецДня(ТекущаяДата()) + 1;
	ЗаказПокупателя.АдресДоставки = ПредЗаказ.АдресДоставки;
	ЗаказПокупателя.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	ЗаказПокупателя.ДатаОтгрузки = ПредЗаказ.ДатаОтгрузки;
	ЗаказПокупателя.ДоговорКонтрагента = ПредЗаказ.ДоговорКонтрагента;
	ЗаказПокупателя.Контрагент = ПредЗаказ.Контрагент;
	ЗаказПокупателя.КратностьВзаиморасчетов = 1;
	ЗаказПокупателя.КурсВзаиморасчетов = 1;
	ЗаказПокупателя.Организация = ПредЗаказ.Организация;
	ЗаказПокупателя.Ответственный = ПредЗаказ.Ответственный;
	ЗаказПокупателя.ОтветственныйМенеджер = ПредЗаказ.ОтветственныйМенеджер;
	ЗаказПокупателя.СкладГруппа = ПредЗаказ.Склад;
	ЗаказПокупателя.СуммаВключаетНДС = Истина;
	ЗаказПокупателя.СуммаДокумента = ПредЗаказ.Товары.Итог("Сумма");
	ЗаказПокупателя.ТипЦен = ПредЗаказ.ТипЦены;
	ЗаказПокупателя.УчитыватьНДС = Истина;
	ЗаказПокупателя.ДополнениеКАдресуДоставки = ПредЗаказ.ДополнениеКАдресуДоставки;
	ЗаказПокупателя.УсловиеПоставки = ПредЗаказ.УсловияДоставки;
	ЗаказПокупателя.ФормаРасчета = ПредЗаказ.ФормаРасчета; 
	//+БП: d.matyash (03.12.2024) <> 
	ЗаказПокупателя.БП_Марка = ПредЗаказ.БП_Марка;
	ЗаказПокупателя.БП_ТипАвто = ПредЗаказ.БП_ТипАвто;
	ЗаказПокупателя.БП_Модель = ПредЗаказ.БП_Модель;
	ЗаказПокупателя.БП_НомерВинКода = ПредЗаказ.БП_НомерВинКода;
	ЗаказПокупателя.БП_НомернойЗнак = ПредЗаказ.БП_НомернойЗнак; 
	//+БП: @Cvet_kov (02.09.2026) <>
	// Организация выбирается по сумме заказа - таблица ОрганизацииПоСумме в форме расчёта.
	БП_ОбщийМодуль.ИзменитьОрганизацию(ЗаказПокупателя, Истина, Истина, Ложь, ПредЗаказ.Товары.Итог("Сумма"));
	//-БП: @Cvet_kov (02.09.2026) <>
	//-БП: d.matyash (03.12.2024) <>
	ЗаказПокупателя.УсловиеОплаты = Справочники.УсловияОплаты.Оплатапофактупоставки;
	ЗаказПокупателя.УсловиеПриема = ПредЗаказ.УсловиеПриема;
	ЗаказПокупателя.ВремяС = ПредЗаказ.ВремяС;
	ЗаказПокупателя.ВремяПо = ПредЗаказ.ВремяПо;
	ЗаказПокупателя.Создал = параметрыСеанса.ТекущийПользователь;
	ЗаказПокупателя.Комментарий = ПредЗаказ.Комментарий;
	ЗаказПокупателя.ДатаСоздания = ТекущаяДата();
	ЗаказПокупателя.Телефон = ПредЗаказ.Телефон;
	ЗаказПокупателя.Статус = Справочники.Статусы.НайтиПоКоду("000000067");
	ЗаказПокупателя.Подразделение = ПредЗаказ.Подразделение;
	//с.д.(
	ЗаказПокупателя.ЗаполнитьНП_APIКлюч();
	ЗаказПокупателя.НП_КонтрольОплаты = ПредЗаказ.НП_КонтрольОплаты;
	ЗаказПокупателя.НП_ГородПолучателя = ПредЗаказ.НП_ГородПолучателя;
	ЗаказПокупателя.НП_ОтделениеПолучения = ПредЗаказ.НП_ОтделениеПолучения;
	ЗаказПокупателя.НП_ОплатаНаКарту = ПредЗаказ.НП_ОплатаНаКарту;
	Если СтрДлина(ПредЗаказ.Телефон) = 13 Тогда
		ЗаказПокупателя.НП_ТелефонПолучателя = Прав(ПредЗаказ.Телефон,12);
	иначеЕсли СтрДлина(ПредЗаказ.Телефон) = 10 Тогда
		ЗаказПокупателя.НП_ТелефонПолучателя = "38"+ПредЗаказ.Телефон; 
	КонецЕсли;

	
	НП_Фамилия = "";
	НП_Имя = "";
	НП_Отчество = "";
	
	Если не ТипЗнч(ПредЗаказ.Контрагент) = Тип("Строка") Тогда
		СтрокаПоиска = ПредЗаказ.Контрагент.наименование;
		ДлинаСтроки = СтрДлина(СтрокаПоиска);
		Сч = 1;
		
		ПервыйПробел = 0;
		ВторойПробел = 0;
		Пока Сч<=ДлинаСтроки Цикл
			ТекСимвол = Сред(СтрокаПоиска, Сч, 1);
			
			Если ТекСимвол = " " тогда
				Если ПервыйПробел = 0 и ВторойПробел = 0 Тогда
					ПервыйПробел = сч;
				ИначеЕсли не ПервыйПробел = 0 и ВторойПробел = 0 Тогда
					ВторойПробел = сч;
				КонецЕсли;				
			КонецЕсли;
			
			Сч = Сч+1;
		КонецЦикла;
		
		НП_Фамилия = СокрЛП(Лев(СтрокаПоиска,ПервыйПробел));
		Если ВторойПробел = 0 Тогда
			НП_Имя = СокрЛП(СтрЗаменить(СтрокаПоиска,НП_Фамилия,""));
		Иначе
			НП_Имя = СокрЛП(Сред(СтрокаПоиска,ПервыйПробел+1,ВторойПробел-ПервыйПробел));
			НП_Отчество = СокрЛП(Прав(СтрокаПоиска,СтрДлина(СтрокаПоиска)-ВторойПробел+1));
		КонецЕсли;
	КонецЕсли;
	ЗаказПокупателя.НП_Фамилия = НП_Фамилия;
	ЗаказПокупателя.НП_Имя = НП_Имя;
	ЗаказПокупателя.НП_Отчество = НП_Отчество;
	//с.д.)
	Если ПредЗаказ.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		ЗаказПокупателя.УчитыватьНДС = Истина;
		ЗаказПокупателя.АвторасчетНДС = Истина;
		ЗаказПокупателя.СуммаВключаетНДС = Ложь;
	КонецЕсли;
	
	Для Каждого Стр из ПредЗаказ.Товары Цикл
		СтрН = ЗаказПокупателя.Товары.Добавить();
		ЗаполнитьЗначенияСвойств (СтрН,Стр);
		СтрН.Размещение = Стр.Контрагент;
		СтрН.ПроцентСкидкиНаценки = Стр.Скидка;
		СтрН.Сумма = Стр.СуммаСоСкидкой;
		СтрН.ЕдиницаИзмерения = СтрН.Номенклатура.ЕдиницаХраненияОстатков;
		СтрН.Коэффициент = СтрН.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент;
		Если ПредЗаказ.Организация = Справочники.Организации.НайтиПоКоду("000000001").Ссылка Тогда
			СтрН.СтавкаНДС = перечисления.СтавкиНДС.НДС20;
			СтрН.Цена = СтрН.Цена / 1.20;
			СтрН.Сумма = СтрН.Сумма / 1.20;
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрН, ЗаказПокупателя);	
		Иначе
			//			СтрН.Цена = СтрН.Цена;
			//			СтрН.Сумма = СтрН.Цена * СтрН.Количество;
			СтрН.СтавкаНДС = перечисления.СтавкиНДС.БезНДС;
		конецесли;
		//	ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрН, ЗаказПокупателя);
		
		//Если СтрН.Количество <>0 Тогда
		//	СтрН.Цена = СтрН.Сумма/СтрН.Количество;
		//КонецЕслИ;  
		
		СтрН.Страна = стр.Страна;
		СтрН.ДатаПроизводства = стр.ДатаПроизводства;

		
		Если Не ЗначениеЗаполнено(СтрН.Размещение)  Тогда
			СтрН.Размещение = 0;
		КонецЕсли;
		
	КонецЦикла;
	
		
	
	ЗаказПокупателя.КОплате = ЗаказПокупателя.СуммаДокумента;
	ЗаказПокупателя.ПредЗаказ = ПредЗаказ.Ссылка;
	//ЗаказПокупателя.Подразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновноеПодразделение");
	//с.д.(
	ЗаказПокупателя.НП_СуммаОбратнойДоставки = ЗаказПокупателя.Товары.Итог("Сумма") + ?(ЗаказПокупателя.СуммаВключаетНДС,0, ЗаказПокупателя.Товары.Итог("СуммаНДС"))- ЗаказПокупателя.НП_ОплатаНаКарту;//?(СуммаДокумента = 0,(Товары.Итог("Сумма")),СуммаДокумента) - НП_ОплатаНаКарту;
	ЗаказПокупателя.НП_ЗаявленаяСтоимость = ЗаказПокупателя.Товары.Итог("Сумма")+?(ЗаказПокупателя.СуммаВключаетНДС,0, ЗаказПокупателя.Товары.Итог("СуммаНДС"));//?(СуммаДокумента = 0,(Товары.Итог("Сумма")),СуммаДокумента);//НП_СуммаОбратнойДоставки;
	ЗаказПокупателя.НП_СуммаКонтрольОплаты = ЗаказПокупателя.НП_СуммаОбратнойДоставки;
    //с.д.)   
	Попытка
		ЗаказПокупателя.Записать(РежимЗаписиДокумента.Проведение);
	Исключение   
		ЗаказПокупателя.Записать(РежимЗаписиДокумента.Запись);
	КонецПопытки;   
	
	Если ЗначениеЗаполнено(ЗаказПокупателя.ПредЗаказ) Тогда
		ПолПредЗаказ = ЗаказПокупателя.ПредЗаказ.Ссылка.ПолучитьОбъект();
		НоваяСтрока = ПолПредЗаказ.ИсторияИзменений.Добавить();
		НоваяСтрока.Дата = ТекущаяДата();
		НоваяСтрока.КтоИзменил = ПараметрыСеанса.ТекущийПользователь.Наименование;
		НоваяСтрока.НовоеЗначение = Строка(ЗаказПокупателя.Статус);
		НоваяСтрока.ЧтоИзменилось = "Статус заказа";
		ПолПредЗаказ.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	

//	НаборЗаписей1 = РегистрыСведений.ОбъектыДляОбмена.СоздатьНаборЗаписей();
//	
//	НаборЗаписей1.Отбор.ОбъектОбмена.Установить(Источник.Ссылка);
//	НаборЗаписей1.Отбор.Тип.Установить("ДокументСсылка.ПредЗаказ");
//	
//	НоваяЗапись1 = НаборЗаписей1.Добавить();
//	
//	НоваяЗапись1.период = ТекущаяДата();
//	НоваяЗапись1.ОбъектОбмена=ПредЗаказ.Ссылка;
//	НоваяЗапись1.Тип ="ДокументСсылка.ПредЗаказ";
//	
//	НаборЗаписей1.Записать();
КонецПроцедуры

Функция ПолучитьДоговор(Контрагент,Организация) 
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.Организация = &Организация
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ссылка;
	КонецЦикла;                               
	
	Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции

/////////////////////////////////ОБМЕН ОПТОВЫЙ КАБИНЕТ

//С.Д. Сеня 18,08,23 +
Процедура ЗагрузкаОстаткаИЦенПоставщика_СД() Экспорт
	
	ЗапросШаблоны = новый запрос;
	ЗапросШаблоны.Текст = "ВЫБРАТЬ
	                      |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.Поставщик,
	                      |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.ГруппаДоговоров
	                      |ИЗ
	                      |	РегистрСведений.ШаблоныЗагрузкиОстатковПоставщиков_СД.СрезПоследних(&ДатаСреза, ) КАК ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.ГруппаДоговоров,
	                      |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.Поставщик";
	
	ЗапросШаблоны.УстановитьПараметр("ДатаСреза", ТекущаяДата());
	РезШаблоны = ЗапросШаблоны.Выполнить().Выгрузить();
	для Каждого СтрШ из РезШаблоны Цикл 
		НовОбработка = Обработки.ЗагрузкаОстаткаИЦенПоставщика_СД.Создать();
		//НовОбработка.ПоПочте = Истина;
		НовОбработка.Поставщик = СтрШ.Поставщик;
		НовОбработка.ГруппаДоговоров = СтрШ.ГруппаДоговоров;
		Попытка
			НовОбработка.прочитатьИОбработатьИОтправить(); 		
		Исключение
	        ЗаписьЖурналаРегистрации("ЗагрузкаОстаткаИЦенПоставщика_СД.прочитатьИОбработатьИОтправить()" ,УровеньЖурналаРегистрации.Ошибка,Метаданные.Обработки.ЗагрузкаОстаткаИЦенПоставщика_СД,ОписаниеОшибки(), ОписаниеОшибки());
		КонецПопытки;             
		
		
	//	ЗапросШаблоныПереоценка = новый запрос;
	//	ЗапросШаблоныПереоценка.Текст = "ВЫБРАТЬ
	//	                                |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.Поставщик,
	//	                                |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.ГруппаДоговоров
	//	                                |ИЗ
	//	                                |	РегистрСведений.ШаблоныЗагрузкиОстатковПоставщиков_СД.СрезПоследних(&ДатаСреза, ) КАК ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних
	//	                                |ГДЕ
	//	                                |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.Поставщик = &Поставщик
	//	                                |
	//	                                |СГРУППИРОВАТЬ ПО
	//	                                |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.ГруппаДоговоров,
	//	                                |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.Поставщик";
	//
	//	ЗапросШаблоныПереоценка.УстановитьПараметр("Поставщик",  СтрШ.Поставщик);          
	//	ЗапросШаблоныПереоценка.УстановитьПараметр("ДатаСреза", ТекущаяДата());

	//	РезШаблоныПереоценка = ЗапросШаблоныПереоценка.Выполнить().Выгрузить();
	//	для Каждого СтрШПЕреоценка из РезШаблоныПереоценка Цикл 

			ТабПериоценить = новый ТаблицаЗначений;
			ТабПериоценить.Колонки.Добавить("Номенклатура");
			ТабПериоценить.Колонки.Добавить("ЦенаПартииНовая");
			ТабПериоценить.Колонки.Добавить("ДоговорПоставщика");

			для Каждого СтрПер из НовОбработка.ТабТовары Цикл 
				
				Если ЗначениеЗаполнено(СтрПер.НоменклатураПоставщика) Тогда 
					Если ЗначениеЗаполнено(СтрПер.НоменклатураПоставщика.Номенклатура) Тогда 
						Если СтрПер.Загружать Тогда 
							//С.Д. Сеня 21,08,23 +
							//Было
							//Если СтрПер.ЦенаСоСкидкой <> СтрПер.ЦенаСоСкидкойДоЗагрузки и ЗначениеЗаполнено(СтрПер.ЦенаСоСкидкой) Тогда 
							//	НовПер = ТабПериоценить.Добавить();
							//	НовПер.Номенклатура    = СтрПер.НоменклатураПоставщика.Номенклатура;
							//	НовПер.ЦенаПартииНовая = СтрПер.ЦенаСоСкидкой;
							//КонецЕсли;	
							
							//Стало
							ЗапросОст = новый запрос;
							ЗапросОст.Текст = "ВЫБРАТЬ
							|	ВложенныйЗапрос.Номенклатура,
							|	ВложенныйЗапрос.Склад,
							|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
							|	ВложенныйЗапрос.СерияНоменклатуры,
							|	ВложенныйЗапрос.ДокументОприходования,
							|	ВложенныйЗапрос.СтатусПартии,
							|	ВложенныйЗапрос.Заказ,
							|	ВложенныйЗапрос.Качество,
							|	ВложенныйЗапрос.КоличествоОстаток КАК Количество,
							|	ВложенныйЗапрос.СтоимостьОстаток КАК Стоимость,
							|	&ЦенаПартииНовая КАК ЦенаПартииНовая,
							|	ВложенныйЗапрос.КоличествоОстаток * &ЦенаПартииНовая КАК СтоимостьНовая,
							|	ВложенныйЗапрос.КоличествоОстаток * &ЦенаПартииНовая - ВложенныйЗапрос.СтоимостьОстаток КАК СтоимостьОтличие
							|ИЗ
							|	(ВЫБРАТЬ
							|		ПартииТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
							|		ПартииТоваровНаСкладахОстатки.Склад КАК Склад,
							|		ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
							|		ПартииТоваровНаСкладахОстатки.СерияНоменклатуры КАК СерияНоменклатуры,
							|		ПартииТоваровНаСкладахОстатки.ДокументОприходования КАК ДокументОприходования,
							|		ПартииТоваровНаСкладахОстатки.СтатусПартии КАК СтатусПартии,
							|		ПартииТоваровНаСкладахОстатки.Заказ КАК Заказ,
							|		ПартииТоваровНаСкладахОстатки.Качество КАК Качество,
							|		СУММА(ПартииТоваровНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
							|		СУММА(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток) КАК СтоимостьОстаток
							|	ИЗ
							|		РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
							|				&ДатаОст,
							|				ДокументОприходования.Контрагент = &Контрагент
							|					И ДокументОприходования.ДоговорКонтрагента В( &ДоговорКонтрагента)
							|					И Номенклатура = &Номенклатура) КАК ПартииТоваровНаСкладахОстатки
							|	
							|	СГРУППИРОВАТЬ ПО
							|		ПартииТоваровНаСкладахОстатки.Заказ,
							|		ПартииТоваровНаСкладахОстатки.Склад,
							|		ПартииТоваровНаСкладахОстатки.Номенклатура,
							|		ПартииТоваровНаСкладахОстатки.ХарактеристикаНоменклатуры,
							|		ПартииТоваровНаСкладахОстатки.Качество,
							|		ПартииТоваровНаСкладахОстатки.СерияНоменклатуры,
							|		ПартииТоваровНаСкладахОстатки.СтатусПартии,
							|		ПартииТоваровНаСкладахОстатки.ДокументОприходования) КАК ВложенныйЗапрос
							|ГДЕ
							|	ВложенныйЗапрос.КоличествоОстаток > 0
							|	И &ЦенаПартииНовая <> 0
							|	И ВложенныйЗапрос.КоличествоОстаток * &ЦенаПартииНовая - ВложенныйЗапрос.СтоимостьОстаток <> 0";
							
							ЗапросОст.УстановитьПараметр("ДатаОст", ТекущаяДата());
							ЗапросОст.УстановитьПараметр("Контрагент", СтрШ.Поставщик);
							ЗапросОст.УстановитьПараметр("ДоговорКонтрагента", СтрШ.ГруппаДоговоров.Договора.ВыгрузитьКолонку("Договор"));
							ЗапросОст.УстановитьПараметр("Номенклатура", СтрПер.НоменклатураПоставщика.Номенклатура);
							ЗапросОст.УстановитьПараметр("ЦенаПартииНовая", СтрПер.ЦенаСоСкидкой);
							РезОст = ЗапросОст.Выполнить().Выгрузить();     
							
							Если РезОст.Количество() <> 0 Тогда 
								
								НовПер = ТабПериоценить.Добавить();
								НовПер.Номенклатура    = СтрПер.НоменклатураПоставщика.Номенклатура;
								НовПер.ЦенаПартииНовая = СтрПер.ЦенаСоСкидкой; 
								НовПер.ДоговорПоставщика = РезОст[0].ДокументОприходования.ДоговорКонтрагента; 
								
							КонецЕсли;
							//С.Д. Сеня 21,08,23 -
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
			//тра зробити в регламентному завдані до першого завданя щоб перебивало всі записи шаблону
			//і по кожному створювало переоцінку та заповнювало  по контрагенту та договору та записувало
			ТабДоговора = ТабПериоценить.Скопировать();
			ТабДоговора.Свернуть("ДоговорПоставщика");
			Если ТабДоговора.Количество() <> 0 Тогда 
				для Каждого СтрТабДог из ТабДоговора Цикл 
					ДокПереоценка = Документы.ПереоценкаЗапасов_СД.СоздатьДокумент();
					ДокПереоценка.Дата = ТекущаяДата();
					ДокПереоценка.ДоговорКонтрагента = СтрТабДог.ДоговорПоставщика;
					ДокПереоценка.Контрагент         = СтрШ.Поставщик;
					ОТборСтрок = новый Структура("ДоговорПоставщика", СтрТабДог.ДоговорПоставщика);
					ТабПериоценить_Дог_Найд = ТабПериоценить.НайтиСтроки(ОТборСтрок);
					ДокПереоценка.Записать(РежимЗаписиДокумента.Запись);
					для Каждого СтрПер из ТабПериоценить_Дог_Найд Цикл 
						НовСтрП = ДокПереоценка.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтрП, СтрПер);
						ДокПереоценка.ЗаполнитьОстаткамиПоТекущейНоменклатуре(НовСтрП,ложь);
					КонецЦикла;	
					Если ДокПереоценка.Товары.Количество() > 0 Тогда 
						Попытка
							ДокПереоценка.Записать(РежимЗаписиДокумента.Проведение);
						Исключение	
							ДокПереоценка.Записать(РежимЗаписиДокумента.Запись);
							ЗаписьЖурналаРегистрации("Документы.ПереоценкаЗапасов_СД" ,УровеньЖурналаРегистрации.Ошибка,Метаданные.Обработки.ЗагрузкаОстаткаИЦенПоставщика_СД,ОписаниеОшибки(), ОписаниеОшибки());
						КонецПопытки;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		//КонецЦикла;	              
	КонецЦикла;	              
			
КонецПроцедуры

Процедура ОтправкаПродаажПоставщиу_сд() Экспорт
	// Вставити вміст обробника.
	
	
		
	ЗапросШаблоны = новый запрос;
	ЗапросШаблоны.Текст = "ВЫБРАТЬ
	                      |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.Поставщик,
	                      |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.ГруппаДоговоров
	                      |ИЗ
	                      |	РегистрСведений.ШаблоныЗагрузкиОстатковПоставщиков_СД.СрезПоследних(&ДатаСреза, ) КАК ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.ГруппаДоговоров,
	                      |	ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.Поставщик";
	
	ЗапросШаблоны.УстановитьПараметр("ДатаСреза", ТекущаяДата());
	РезШаблоны = ЗапросШаблоны.Выполнить().Выгрузить();
	для Каждого СтрШ из РезШаблоны Цикл 
		
		
		НовОбработка = Обработки.ОтправитьПродажиНаПочту_СД.Создать();
		//НовОбработка.ПоПочте = Истина;
		НовОбработка.Поставщик = СтрШ.Поставщик;
		НовОбработка.ГруппаДоговоров = СтрШ.ГруппаДоговоров; 
		//с.д. Рижий 2023-09-11 (
		//НовОбработка.ДатаПродажи = ТекущаяДата() ;  
		
		НовОбработка.ДатаПродажи = НачалоДня(ТекущаяДата()) -1 ;  
		НовОбработка.ДатаЗаказПоставщика = ТекущаяДата();
		//с.д. Рижий 2023-09-11 )
		
		Попытка
			НовОбработка.ЗаполнитьПоШаблону(); 		
			НовОбработка.ЗаполнитьПродажи(); 
			НовОбработка.ОтправитьПоставщику(); 
			НовОбработка.СоздатьЗаказПоставщику();
			
		Исключение
	        ЗаписьЖурналаРегистрации("ОтправитьПродажиНаПочту_СД." ,УровеньЖурналаРегистрации.Ошибка,Метаданные.Обработки.ОтправитьПродажиНаПочту_СД,ОписаниеОшибки(), ОписаниеОшибки());
		КонецПопытки;
	
	конецЦикла;	
	
	
КонецПроцедуры
//С.Д. Сеня 18,08,23 - 

//С.Д. Сеня 13,12,23 +
Процедура Регсистры_Взаиморасчеты_Основные_СДПередЗаписью(Источник, Отказ, Замещение) Экспорт
	Регистратор_ = Источник.Отбор.Регистратор.Значение;
	ТипЗначенияИсточника = ТипЗнч(Источник);    
	ТипЗначенияРегистратор_ = ТипЗнч(Регистратор_);    
	МетаданныеРегистратор_ = Метаданные.НайтиПоТипу(ТипЗначенияРегистратор_);
	МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗначенияИсточника);
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОсновнойДокументРасчетовСКонтрагентом_СД", МетаданныеРегистратор_) Тогда 		
		Если ТипЗначенияИсточника = Тип("РегистрНакопленияНаборЗаписей.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов") Тогда
			Если ЗначениеЗаполнено(Регистратор_.ОсновнойДокументРасчетовСКонтрагентом_СД) Тогда 
				для Каждого СтрПров из Источник Цикл 
					СтрПров.ДокументРасчетовСКонтрагентом = Регистратор_.ОсновнойДокументРасчетовСКонтрагентом_СД;	
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Основной_Контрагент_СД", МетаданныеРегистратор_) Тогда 
		для Каждого СтрПров из Источник Цикл    
			Если ЗначениеЗаполнено(Регистратор_.Основной_Контрагент_СД) Тогда 
				СтрПров.Контрагент = Регистратор_.Основной_Контрагент_СД;
			КонецЕсли;	  
			Если ЗначениеЗаполнено(Регистратор_.ОсновнойДоговорКонтрагента_СД) Тогда 
				СтрПров.ДоговорКонтрагента = Регистратор_.ОсновнойДоговорКонтрагента_СД;
			КонецЕсли;				
			Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОсновнаяСделка_СД", МетаданныеРегистратор_) Тогда  
				Если ЗначениеЗаполнено(Регистратор_.ОсновнаяСделка_СД) Тогда 
					СтрПров.Сделка = Регистратор_.ОсновнаяСделка_СД;
				КонецЕсли;				
            КонецЕсли;
		КонецЦикла; 
		//+БП: d.matyash (27.06.2024) <> 
		Если ТипЗнч(Регистратор_) = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") И Источник.Количество() > 0 тогда	
			БП_РасшифровкаПлатежа = Регистратор_.БП_РасшифровкаПлатежа;
			Если БП_РасшифровкаПлатежа.Количество() > 1 И Регистратор_.РасшифровкаПлатежа.Количество() = 1  тогда
				ПервыйОбход = Истина; 
				
				Для каждого РасшифровкаПлатежа из БП_РасшифровкаПлатежа цикл
					Если ПервыйОбход тогда
						СтрПров.Сделка = РасшифровкаПлатежа.ОсновнаяСделка_СД; 
						СтрПров.СуммаВзаиморасчетов = РасшифровкаПлатежа.СуммаПлатежа;
						СтрПров.СуммаУпр = РасшифровкаПлатежа.СуммаПлатежа;
						ПервыйОбход = Ложь;
						Продолжить;
					КонецЕсли;
					
					Проводка = Источник.Добавить(); 
					ЗаполнитьЗначенияСвойств(Проводка, СтрПров);
					Проводка.Сделка = РасшифровкаПлатежа.ОсновнаяСделка_СД; 
					Проводка.СуммаВзаиморасчетов = РасшифровкаПлатежа.СуммаПлатежа;
					Проводка.СуммаУпр = РасшифровкаПлатежа.СуммаПлатежа;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли; 
		//-БП: d.matyash (27.06.2024) <> 
	КонецЕсли;
	
КонецПроцедуры
//С.Д. Сеня 13,12,23 -

//С.Д. Сеня 18,12,23 +
Процедура ОброботкаЗаполнения_СДОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ТипЗначенияИсточник_ = ТипЗнч(Источник);    
	МетаданныеИсточник_ = Метаданные.НайтиПоТипу(ТипЗначенияИсточник_);   
	
	ТипЗначенияДанныеЗаполнения_ = ТипЗнч(ДанныеЗаполнения);    
	МетаданныеДанныеЗаполнения_ = Метаданные.НайтиПоТипу(ТипЗначенияДанныеЗаполнения_);   

	Если МетаданныеДанныеЗаполнения_ = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Основной_Контрагент_СД", МетаданныеИсточник_) 
		и ОбщегоНазначения.ЕстьРеквизитДокумента("Основной_Контрагент_СД", МетаданныеДанныеЗаполнения_) Тогда 
		  Источник.Основной_Контрагент_СД = ДанныеЗаполнения.Основной_Контрагент_СД;
	КонецЕсли;    
	  
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОсновнойДоговорКонтрагента_СД", МетаданныеИсточник_) 
		и ОбщегоНазначения.ЕстьРеквизитДокумента("ОсновнойДоговорКонтрагента_СД", МетаданныеДанныеЗаполнения_) Тогда 
		  Источник.ОсновнойДоговорКонтрагента_СД = ДанныеЗаполнения.ОсновнойДоговорКонтрагента_СД;
	КонецЕсли;   
	  
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОсновнаяСделка_СД", МетаданныеИсточник_) 
		и ОбщегоНазначения.ЕстьРеквизитДокумента("ОсновнаяСделка_СД", МетаданныеДанныеЗаполнения_) Тогда 
		  Источник.ОсновнаяСделка_СД = ДанныеЗаполнения.ОсновнаяСделка_СД;
  	КонецЕсли; 
	  
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ОсновнойДокументРасчетовСКонтрагентом_СД", МетаданныеИсточник_) 
		и ОбщегоНазначения.ЕстьРеквизитДокумента("ОсновнойДокументРасчетовСКонтрагентом_СД", МетаданныеДанныеЗаполнения_) Тогда 
		  Источник.ОсновнойДокументРасчетовСКонтрагентом_СД = ДанныеЗаполнения.ОсновнойДокументРасчетовСКонтрагентом_СД;
	КонецЕсли;  
	  
	//Если ТипЗначенияИсточник_ = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") и 
	//	 ТипЗначенияИсточник_ = Тип("ДокументСсылка.ЗаказПоставщику") Тогда 
	//	  Источник.ОсновнаяСделка_СД = ДанныеЗаполнения;
	//КонецЕсли;	 

КонецПроцедуры
//С.Д. Сеня 18,12,23 -
