Функция ПолучитьПредзаказПропущенного(Номер,ТекстКомментария) Экспорт   
	Запрос = Новый Запрос;
	ЗАпрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПредЗаказ.Ссылка
	               |ИЗ
	               |	Документ.ПредЗаказ КАК ПредЗаказ
	               |ГДЕ
	               |	ПредЗаказ.Телефон ПОДОБНО &Телефон
	               |	И ПредЗаказ.Комментарий ПОДОБНО ""%"" + &Комментарий + ""%""";
	
	Запрос.УстановитьПараметр("Телефон",Номер); 
	Запрос.УстановитьПараметр("Комментарий",ТекстКомментария);
		
	Результат = Запрос.Выполнить().Выгрузить();	
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0].Ссылка;
	КонецЕсли; 
	
	Возврат Неопределено;
КонецФункции  

Функция ПолучитьПредзаказы(Номер, Контрагент) Экспорт   
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредЗаказ.Номер,
		|	ПредЗаказ.Дата,
		|	ПредЗаказ.Ответственный,
		|	ПредЗаказ.Статус,
		|	ПредЗаказ.Контрагент,
		|	ПредЗаказ.СуммаДокумента,
		|	ПредЗаказ.сви_КомментарийМенеджера,
		|	ПредЗаказ.сви_КомментарийПользователя,
		|	ПредЗаказ.Телефон,
		|	ПредЗаказ.Подразделение
		|ИЗ
		|	Документ.ПредЗаказ КАК ПредЗаказ
		|ГДЕ
		|	(&Телефон = НЕОПРЕДЕЛЕНО
		|		ИЛИ ПредЗаказ.Телефон ПОДОБНО &Телефон)
		|	И (&Контрагент = НЕОПРЕДЕЛЕНО
		|		ИЛИ ПредЗаказ.Контрагент = &Контрагент)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПредЗаказ.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Телефон",Номер); 
	Запрос.УстановитьПараметр("Контрагент",Контрагент);

	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции  

Процедура ОткрытьПредЗаказ(Номер, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПредЗаказ.Ссылка
	|ИЗ
	|	Документ.ПредЗаказ КАК ПредЗаказ
	|ГДЕ
	|	ПредЗаказ.Номер = &Номер
	|	И ПредЗаказ.Дата >= &НачалоДня
	|	И ПредЗаказ.Дата < &КонецДня";
	
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(Дата));
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		ДокументСсылка = Результат.Ссылка;
		ДокументСсылка.ПолучитьФорму().Открыть();		
		Возврат;		
	КонецЕсли;	
КонецПроцедуры




                                                                       