
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			СумД = 0;
			Для каждого СтД из ДополнительныеУслуги Цикл
				если СтД.Использовать Тогда
					//с.д.(
					//СумД = СумД + СтД.СуммаПродажи;
					СумД = СумД + СтД.СуммаПродажи + СтД.СуммаНаценки - СтД.СуммаСкидки - СтД.СуммаДопСкидки;
					//с.д.)
				КонецЕсли;
				КонецЦикла;
	
	СуммаДокумента = Товары.Итог("Сумма") + СумД;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Для Каждого Строка Из Товары Цикл
		Если Строка.СтатусПозиции = Справочники.СтатусыПозицийПредзаказа.Подтверждено Тогда
			Если (ЗначениеЗаполнено(Строка.ДатаПроизводства) или ЗначениеЗаполнено(Строка.Страна)) и (Найти(Строка.ДатаПроизводства,"?")=0 и Найти(Строка.Страна,"?")=0) Тогда
				ДатаПр = РегистрыСведений.ДатыПроизводства.СоздатьМенеджерЗаписи();
				ДатаПр.ДатаПроизводства = Строка.ДатаПроизводства;
				ДатаПр.Документ = Ссылка;
				ДатаПр.Номенклатура = Строка.Номенклатура;
				ДатаПр.Период = ДАта;
				ДатАПр.Поставщик = Строка.Контрагент;
				ДатаПр.Страна = Строка.Страна;
				ДатаПр.Записать();
			КонецЕслИ;
		КонецеслИ;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//FOFA
	Струк = Новый Структура;
	Струк.Вставить("Документ",Ссылка);
	ДатыПроизв = РегистрыСведений.ДатыПроизводства.Выбрать(,,Струк);
	пока ДатыПроизв.Следующий() Цикл
		ДатаПр = ДатыПроизв.ПолучитьМенеджерЗаписи();
		ДатаПр.Удалить();
	КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДатаКабинет = Неопределено;
	НомерКабинет = Неопределено;
	Клиент = Неопределено; 
	MagentoID = "";
КонецПроцедуры


