
// Функция возвращает ставку акцизного налога 
//
Функция ПолучитьСтавкуАкцизногоНалога(СтатьяДекларацииПоАкцизномуНалогу) Экспорт

	Если ЗначениеЗаполнено(СтатьяДекларацииПоАкцизномуНалогу) Тогда
		Возврат 0.05;
	Иначе
		Возврат 0;	
	КонецЕсли; 
	

КонецФункции // ПолучитьСтавкуАкцизногоНалога()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ СО СТАВКАМИ НАЛОГОВ И ВЗНОСОВ

// Рассчитывает сумму акцизного налога исходя из суммы и флагов налогообложения
//
// Параметры: 
//  Сумма            	- число, сумма от которой надо рассчитывать налоги, 
//  СуммаВключаетНалоги - булево, признак учета НДС и акциза в сумме, 
//  СтатьяДекларацииПоАкцизномуНалогу, 
//  ПодакцизныеТоварыДляКоммерческогоИспользования - параметры, влияющие на расчет суммы
//
// Возвращаемое значение:
//  Число, полученная сумма акцизного налога
//
Функция РассчитатьСуммуАкцизногоНалога(Сумма, СуммаВключаетАкциз, СтатьяДекларацииПоАкцизномуНалогу, ПодакцизныеТоварыДляКоммерческогоИспользования) Экспорт

	Если ПодакцизныеТоварыДляКоммерческогоИспользования Тогда
		СуммаАкцизногоНалога = 0;
	Иначе 
		СтавкаАкцизногоНалога = ПолучитьСтавкуАкцизногоНалога(СтатьяДекларацииПоАкцизномуНалогу);
		Если СуммаВключаетАкциз Тогда
			СуммаАкцизногоНалога = Сумма * СтавкаАкцизногоНалога/(1+СтавкаАкцизногоНалога);
		Иначе
			СуммаАкцизногоНалога = Сумма * СтавкаАкцизногоНалога;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат СуммаАкцизногоНалога;

КонецФункции // РассчитатьСуммуАкцизногоНалога()
