Перем Очистить Экспорт;

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Сохраним сформированный файл сведений в регистре сведений
	Запись = Движения["АрхивДанныхРегламентированнойОтчетности"].Добавить();
	Запись.Объект = Ссылка;
	Запись.ОписаниеДанных = НСтр("ru='Групповая выгрузка регл. отчетности';uk='Групове вивантаження регл. звітності'",Локализация.КодЯзыкаИнформационнойБазы());
	
	Для Каждого Стр Из Выгрузки Цикл
		Запись.Данные = Запись.Данные + Стр.Текст;
	КонецЦикла;
		
КонецПроцедуры


