Функция ПолучитьСебестоимостьТовара(ЗаказПокупателя, Номенклатура,ПродажиСДаты ,ПродажиНаДату, Поставщик, ДоговорПоставщика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	СУММА(ПродажиСебестоимость.Стоимость) КАК Стоимость
	              |ИЗ
	              |	РегистрНакопления.ПродажиСебестоимость КАК ПродажиСебестоимость
	              |ГДЕ
	              |	ПродажиСебестоимость.ЗаказПокупателя = &ЗаказПокупателя
	              |	И ПродажиСебестоимость.Номенклатура = &Номенклатура
	              |	И ПродажиСебестоимость.Период >= &НачалоДня
	              |	И ПродажиСебестоимость.Период <= &КонецДня
	              |	И ПродажиСебестоимость.ДокументОприходования.Контрагент = &Контрагент
	              |	И ПродажиСебестоимость.ДокументОприходования.ДоговорКонтрагента = &ДоговорПоставщика";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя",ЗаказПокупателя);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура); 
	
	Запрос.УстановитьПараметр("НачалоДня",НачалоДня(ПродажиСДаты));	
	Запрос.УстановитьПараметр("КонецДня",КонецДня(ПродажиНаДату));
	Запрос.УстановитьПараметр("КонецДня",КонецДня(ПродажиНаДату));
	Запрос.УстановитьПараметр("Контрагент",Поставщик); 
	Запрос.УстановитьПараметр("ДоговорПоставщика",ДоговорПоставщика); 
	
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка.Стоимость;
	КонецЦикла;
	Возврат 0;
КонецФункции                                                