
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
					
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Перем ТекстСообщения;
		
КонецПроцедуры
 
Процедура Э_ЕстьЛиЛидСТакимНомеромТелефона(Ссылка,Отказ)
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	Э_Лиды.Ссылка
	             |ИЗ
	             |	Справочник.Э_Лиды КАК Э_Лиды
	             |ГДЕ
	             |	Э_Лиды.Ссылка <> &Ссылка
	             |	И Э_Лиды.НомерТелефона = &НомерТелефона";
	Запрос.УстановитьПараметр("НомерТелефона",НомерТелефона);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
    Результат=Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
	     Сообщить(НСтр("ru='Обнаружен лид ';uk='Виявлено лід '")+Результат.Ссылка+НСтр("ru=' с номером телефона:';uk=' з номером телефона:'")+НомерТелефона);      
		 //Отказ=Истина; //с.д. 25.10.2022( Закоментував на прохання Тараса
	КонецЕсли;
КонецПроцедуры
	 
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтотОбъект.ЭтоГруппа Тогда
		Э_ЕстьЛиЛидСТакимНомеромТелефона(Ссылка,Отказ);
		
		Если Закрыт и Не ЗначениеЗаполнено(Контрагент) и (Не Статус=Перечисления.Э_СтатусыЛидов.Безперспективный) Тогда
		    ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Лид можно закрыть, если заполнен реквизит ""Контрагент"" или статус лида должен быть ""Безперспективный""';uk='Лід можна закрити, якщо заповнений реквізит ""Контрагент"" або статус ліда повинен бути ""Безперспективний""'"),Отказ);
		иначеЕсли Не Закрыт и ЗначениеЗаполнено(Контрагент) Тогда
			Закрыт=истина;
		КонецЕсли;
		 
		Если (Статус=Перечисления.Э_СтатусыЛидов.Безперспективный или ЭтотОБъект.ПометкаУдаления) и Не ПринадлежитЭлементу(Справочники.Э_Лиды.Безперспективные) Тогда	
		    Родитель=Справочники.Э_Лиды.Безперспективные;
		иначеЕсли Закрыт и Не ПринадлежитЭлементу(Справочники.Э_Лиды.Закрытые) Тогда
		    Родитель=Справочники.Э_Лиды.Закрытые;
		иначеЕсли Не Закрыт и Не ПринадлежитЭлементу(Справочники.Э_Лиды.Активные) Тогда	
		    Родитель=Справочники.Э_Лиды.Активные;
		КонецЕсли;
		 
		Э_УправлениеЛидами.Э_ЛидыОпределитьРеквизитКонтрагентЕслиНеЗаполнен(ЭтотОбъект,ЭтотОбъект.НомерТелефона);
			 
		Э_ОпределитьРеквизитЗакрыт();
		Э_ОпределитьНаименование();
		
		Если Не ЗначениеЗаполнено(Э_ДатаРегистрации) Тогда
		     Э_ДатаРегистрации=ТекущаяДата();
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Э_Регистратор) Тогда
		     Э_Регистратор=глЗначениеПеременной("глТекущийПользователь");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Контрагент) Тогда
			Э_ДатаПереходаВКлиента = ТекущаяДата();
		Иначе
			Э_ДатаПереходаВКлиента = '00010101';
		КонецЕсли;
		
		Э_УстановитьФлагЭ_ВыгружатьВБДВиртуальнойАТС();
		
	КонецЕсли;
КонецПроцедуры

Процедура Э_УстановитьФлагЭ_ВыгружатьВБДВиртуальнойАТС() Экспорт
	Если НЕ Э_ВыгружатьВБДВиртуальнойАТС и НЕ (СокрЛП(НомерТелефона)=СокрЛП(Наименование)) и Не Закрыт тогда
		Э_ВыгружатьВБДВиртуальнойАТС  = Истина;
	ИначеЕсли Э_ВыгружатьВБДВиртуальнойАТС и Закрыт Тогда	
		Э_ВыгружатьВБДВиртуальнойАТС  = Ложь;
	КонецЕсли;
КонецПроцедуры	

Процедура Э_ОпределитьНаименование()
 	Если Не ЗначениеЗаполнено(Наименование) и ЗначениеЗаполнено(Контрагент) Тогда	
		Наименование = СокрЛП(Контрагент);
	КонецЕсли;		
КонецПроцедуры
 
Процедура Э_ОпределитьРеквизитЗакрыт() Экспорт
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если Не Закрыт Тогда
	        Закрыт=Истина;
		КонецЕслИ;	
			 
	иначеЕсли Не ЗначениеЗаполнено(Контрагент) и Закрыт Тогда	 
		 Закрыт=ложь;
	КонецЕсли;
КонецПроцедуры
 
Процедура Э_ПереписатьКодВТелефонииСЛидаНаКонтрагента_ЕслиНеобходимо()
	Если Ссылка.Пустая() Тогда
	     Возврат;
	 КонецЕсли;
	 
	Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
	     Э_ОбъектТелефония=КонтактноеЛицо;
	иначеЕсли ЗначениеЗаполнено(Контрагент) Тогда	
	     Э_ОбъектТелефония=Контрагент;
	иначе
		 Возврат;
	КонецЕсли;
	
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	Э_ТелефонияКодыКлиентов.Контакт,
	             |	Э_ТелефонияКодыКлиентов.ТелефонияКод
	             |ИЗ
	             |	РегистрСведений.Э_ТелефонияКодыКлиентов КАК Э_ТелефонияКодыКлиентов
	             |ГДЕ
	             |	Э_ТелефонияКодыКлиентов.Контакт = &Контакт";
	Запрос.УстановитьПараметр("Контакт",Ссылка);
	Результат=Запрос.Выполнить().Выбрать();
	
	Запись=РегистрыСведений.Э_ТелефонияКодыКлиентов.СоздатьМенеджерЗаписи();	
	
	Если Результат.Количество() > 0 Тогда
	
		Если ЗначениеЗаполнено(Э_ОбъектТелефония) Тогда
			 
			ТекКодКлиентаВТелефонии=Э_ТелефонияBinotel.Э_ПолучитьКодКлиентаВТелефонии(Э_ОбъектТелефония);
			Если ТекКодКлиентаВТелефонии=Неопределено Тогда  
				Запись.Контакт=Ссылка;
				Запись.Прочитать();
				Если Запись.Выбран() Тогда
				    Запись.Контакт=Э_ОбъектТелефония;
				КонецЕсли;	
				Попытка
					Запись.Записать(Истина);
				Исключение
					ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Ошибка при записи регистра сведений ""Телефония: Коды клиентов""';uk='Помилка при запису регістра відомостей ""Телефонія: Коди клієнтів""'")+ОписаниеОшибки());
					Отказ = Истина;
				КонецПопытки;
			КонецЕсли;
		КонецЕслИ;	
	КонецЕсли;	
КонецПроцедуры
 
Процедура Э_ЗарегистрироватьИзмененияВПланеОбмена()
	Перем Э_НастройкиБинотел,Э_BinotelПланОбмена,Запрос,РезультатЗапроса;
	
	Э_НастройкиБинотел=Э_ТелефонияBinotel.Э_ПолучитьНастройкиБинотел();
	Если Э_НастройкиБинотел=Неопределено Тогда
	     Возврат;
	КонецЕсли;
	
	Если Не Э_НастройкиБинотел.Э_BinotelВыполнятьСинхронизациюКонтрагентов Тогда
	    Возврат;
	КонецЕсли;
	
	Э_BinotelПланОбмена	= Э_НастройкиБинотел.Э_BinotelПланОбмена;
	Если ЗначениеЗаполнено(Э_BinotelПланОбмена) Тогда
		
		Если Не ЭтотОбъект.ЭтоГруппа и Э_ВыгружатьВБДВиртуальнойАТС тогда		
		
	     	ПланыОбмена.ЗарегистрироватьИзменения(Э_НастройкиБинотел.Э_BinotelПланОбмена,Ссылка);
		КонецЕсли;
	иначе
		Э_ТелефонияBinotel.СообщитьИнформацию(НСтр("ru='В настройках интеграции с Бинотел не заполнен план обмена с ""Бинотел"". Регистр сведений ""Binotel: Настройки""';uk='В налаштуваннях інтеграції з Бінотел не заповнений план обміну з ""Бінотел"". Регістр відомостей ""Binotel: Налаштування""'"));    
	КонецЕсли;
КонецПроцедуры
 
Процедура ПриЗаписи(Отказ)
     Э_ЗарегистрироватьИзмененияВПланеОбмена();
     Э_ПереписатьКодВТелефонииСЛидаНаКонтрагента_ЕслиНеобходимо();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Э_ДатаПереходаВКлиента = '00010101';
	Э_ДатаРегистрации = '00010101';
		 
КонецПроцедуры
